Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Information for prospective students
ar: معلومات للطلاب المحتملين
ur: ممکنہ طالب علموں کے لئے معلومات
zh_cn: 针对未来学生的信息

source: (skipping {skipped})
ar: (تخطي {تخطي}}
ur: (کھو گیا {کھڑا}}
zh_cn: （跳过{跳过}）

source: Unable to configure git username and password
ar: غير قادر على تكوين اسم المستخدم git وكلمة المرور
ur: Git صارف کا نام اور پاس ورڈ کو ترتیب دینے میں ناکام
zh_cn: 无法配置git用户名和密码

source: A new revision of the article was successfully added.
ar: تمت إضافة مراجعة جديدة للمادة بنجاح.
ur: مضمون کا ایک نیا تجزیہ کامیابی سے شامل کیا گیا تھا.
zh_cn: 该文章的新版本已成功添加。

source: Course Export Status
ar: حالة تصدير الدورة التدريبية
ur: کورس برآمد کی حیثیت
zh_cn: 课程导出状态

source: Handouts
ar: الصدقات
ur: ہینڈ آؤٹس
zh_cn: 讲义

source: Jan
ar: يناير
ur: جنوری
zh_cn: 一月

source: Allowance Section
ar: قسم البدل
ur: الاؤنسشن سیکشن
zh_cn: 津贴科

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
ar: يظهر على صفحة كتالوج الدورة التدريبية عندما يتدحرج الطلاب على اسم الدورة التدريبية. الحد إلى ~ 150 حرفًا
ur: طالب علم کورس کے نام پر چلتے وقت کورس کیٹلوگ صفحہ پر ظاہر ہوتا ہے. ~ 150 حروف تک محدود
zh_cn: 学生翻看课程名时出现在课程目录页面上。限制为约150个字符

source: This component's access settings refer to deleted or invalid groups.
ar: تشير إعدادات الوصول الخاصة بهذا المكون إلى مجموعات محذوفة أو غير صالحة.
ur: یہ اجزاء کی رسائی کی ترتیبات حذف اور غلط گروپوں کا حوالہ دیتے ہیں.
zh_cn: 此组件的访问设置涉及已删除或无效的组。

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
ar: أخبرنا عن أهدافك التعليمية أو المهنية. كيف تساعدك شهادة التحقق في هذه الدورة على تحقيق هذه الأهداف؟
ur: ہمیں اپنے سیکھنے یا پیشہ ورانہ مقاصد کے بارے میں بتائیں. اس کورس میں ایک تصدیق شدہ سرٹیفکیٹ کس طرح آپ کو ان مقاصد کو حاصل کرنے میں مدد ملے گی؟
zh_cn: 告诉我们你的学习或职业目标。本课程中的认证证书如何帮助您实现这些目标？

source: Adding Files for Your Course
ar: إضافة ملفات للدورة الخاصة بك
ur: اپنے کورس کے لئے فائلوں کو شامل کرنا
zh_cn: 为您的课程添加文件

source: Move
ar: نقل
ur: اقدام
zh_cn: 移动

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
ar: نحن آسفون. لم نتمكن من العثور على صفحة {studio_name} التي تبحث عنها. قد ترغب في العودة إلى لوحة المعلومات {studio_name} وإعادة المحاولة. إذا كنت لا تزال تواجه مشكلات في الوصول إلى الأشياء ، فلا تتردد في {link_start} الاتصال بـ {studio_name} الدعم {link_end} للحصول على مزيد من المساعدة.
ur: ہم معذرت خواہ ہیں. ہم {سٹوڈیو_نام} کے صفحے کو تلاش نہیں کرسکتے جنہیں آپ تلاش کر رہے ہیں. آپ {studio_name} ڈیش بورڈ پر واپس آنا چاہتے ہیں اور دوبارہ کوشش کریں گے. اگر آپ ابھی تک چیزوں تک رسائی حاصل کرنے میں دشوار ہیں تو، براہ کرم مزید مدد کیلئے {link_start} رابطہ {سٹوڈیو_ نام} کی حمایت {link_end} پر مفت محسوس کریں.
zh_cn: 我们很抱歉。我们无法找到您要查找的{studio_name}网页。您可能想要返回到{studio_name}仪表板，然后重试。如果您仍然无法访问内容，请随时{link_start}联系{studio_name}支持{link_end}以获取进一步帮助。

source: You have been invited to join {course_name} at {site_name} by a member of the course staff.
ar: لقد تمت دعوتك للانضمام إلى {course_name} في {site_name} بواسطة أحد أعضاء فريق الدورة التدريبية.
ur: آپ کو کورس کے عملے کے ایک رکن کے ذریعہ {course_name} میں {site_name} میں شامل ہونے کے لئے دعوت دی گئی ہے.
zh_cn: 您受邀由课程人员的成员加入{site_name}加入{course_name}。

source: Changing the content learners see
ar: تغيير المتعلمين المحتوى انظر
ur: مواد سیکھنے والے کو تبدیل کرنا پڑتا ہے
zh_cn: 改变学习者看到的内容

source: Thank you for signing up for {studio_name}! To activate your account, please copy and paste this address into your web browser's address bar:
ar: شكرًا لك على الاشتراك في {studio_name}! لتنشيط حسابك ، يرجى نسخ هذا العنوان ولصقه في شريط عناوين متصفح الويب لديك:
ur: {سٹوڈیو_ نام} کیلئے سائن اپ کرنے کے لئے آپ کا شکریہ! اپنے اکاؤنٹ کو چالو کرنے کے لئے، براہ کرم اس پتہ کو اپنے ویب براؤزر کے ایڈریس بار میں چسپاں کریں.
zh_cn: 感谢您注册{studio_name}！要激活您的帐户，请将此地址复制并粘贴到您的网络浏览器的地址栏中：

source: The issuing bank has questions about the request. You do not receive an authorization code programmatically, but you might receive one verbally by calling the processor. Possible action: retry with another form of payment.
ar: لدى المصرف المصدر أسئلة حول الطلب. لا تتلقى رمز تخويل برمجيًا ، ولكن قد تتلقى كلمة شفهية عن طريق الاتصال بالمعالج. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: جاری بینک کے پاس درخواست کے بارے میں سوالات ہیں. آپ کو ایک اجازت نامہ کوڈ پروگرام میں نہیں ملتا ہے، لیکن آپ پروسیسر کو بلا کر ایک زبانی طور پر وصول کرسکتے ہیں. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 开证行对请求有疑问。您没有以编程方式收到授权码，但您可能会通过调用处理器以口头方式收到。可能的行动：以另一种形式的付款重试。

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
ar: توجد بالفعل مكتبة محددة بنفس المنظمة ورمز المكتبة. يرجى تغيير رمز مكتبتك بحيث تكون فريدة داخل مؤسستك.
ur: پہلے ہی اسی تنظیم اور لائبریری کوڈ کے ساتھ ایک لائبریری کی وضاحت کی گئی ہے. برائے مہربانی اپنے لائبریری کوڈ کو تبدیل کریں تاکہ یہ آپ کی تنظیم کے اندر منفرد ہے.
zh_cn: 已经有一个用相同的组织和库代码定义的库。请更改您的图书馆代码，以使其在您的组织中独一无二。

source: Checkboxes With Text Input
ar: مربعات الاختيار مع إدخال النص
ur: چیک باکسز متن ان پٹ کے ساتھ
zh_cn: 带文本输入的复选框

source: An extended due date must be later than the original due date.
ar: يجب أن يكون تاريخ الاستحقاق الموسع متأخرًا عن تاريخ الاستحقاق الأصلي.
ur: ایک توسیع شدہ تاریخ کی تاریخ اصل مجوزہ تاریخ کے بعد بعد میں ہونا ضروری ہے.
zh_cn: 延期到期日期必须晚于原始到期日期。

source: Your {platform_name} account email has been updated
ar: تم تحديث البريد الإلكتروني لحسابك في {platform_name}
ur: آپ {platform_name} اکاؤنٹ ای میل کو اپ ڈیٹ کر دیا گیا ہے
zh_cn: 您的{platform_name}帐户电子邮件已更新

source: One or more fields in the request contains invalid data.
ar: يحتوي حقل واحد أو أكثر في الطلب على بيانات غير صالحة.
ur: درخواست میں ایک یا زیادہ شعبوں میں غلط ڈیٹا شامل ہے.
zh_cn: 请求中的一个或多个字段包含无效数据。

source: Select True to allow third party systems to post grades past the deadline.
ar: حدد True للسماح لأنظمة الجهات الخارجية بنشر التقديرات بعد انتهاء الموعد النهائي.
ur: تیسری پارٹی کے نظام کو آخری وقت گزرنے کے بعد گریڈ پوسٹ کرنے کی اجازت دینے کے لئے سچا منتخب کریں.
zh_cn: 选择True以允许第三方系统在截止日期之前发布成绩。

source: Delete user
ar: مسح المستخدم
ur: صارف کو حذف کریں
zh_cn: 删除用户

source: Update my {platform_name} Account
ar: تحديث حسابي على {platform_name}
ur: میرا {platform_name} اکاؤنٹ اپ ڈیٹ کریں
zh_cn: 更新我的{platform_name}帐户

source: {currency})
ar: {دقة})
ur: {کرنسی})
zh_cn: {货币}）

source: Wikipedia
ar: ويكيبيديا
ur: وکیپیڈیا
zh_cn: 维基百科

source: An account with the Email '{email}' already exists.
ar: يوجد بالفعل حساب بالبريد الإلكتروني &quot;{email}&quot;.
ur: ای میل &#39;{ای میل}&#39; کے ساتھ ایک اکاؤنٹ پہلے ہی موجود ہے.
zh_cn: 电子邮件“{email}”的帐户已存在。

source: Course Progress for Student '{username}' ({email})
ar: تقدم Course for Student &#39;{username}&#39; ({email})
ur: طالب علم &#39;{صارف کا نام}&#39; کے لئے کورس کی ترقی ({ای میل})
zh_cn: 学生“{用户名}”（{电子邮件}）的课程进度

source: Use this to export your course to its git repository.
ar: استخدم هذا لتصدير الدورة التدريبية الخاصة بك إلى مستودع git الخاص بها.
ur: اپنے گٹ ذخیرہ پر اپنے کورس کو برآمد کرنے کیلئے اسے استعمال کریں.
zh_cn: 使用它将您的课程导出到其git存储库。

source: Download {file}
ar: تحميل الملف}
ur: {فائل} ڈاؤن لوڈ کریں
zh_cn: 下载文件}

source: User's Email Address
ar: عنوان البريد الإلكتروني للمستخدم
ur: صارف کا ای میل ایڈریس
zh_cn: 用户的电子邮件地址

source: Share this certificate on Facebook (opens a new tab/window)
ar: مشاركة هذه الشهادة على Facebook (فتح علامة تبويب / نافذة جديدة)
ur: فیس بک پر اس سرٹیفکیٹ کا اشتراک کریں (نیا ٹیب / ونڈو کھولتا ہے)
zh_cn: 在Facebook上分享此证书（打开一个新选项卡/窗口）

source: Upload Video Thumbnail Image
ar: قم بتحميل صورة مصغرة لملف الفيديو
ur: ویڈیو تھمب نیل تصویر اپ لوڈ کریں
zh_cn: 上传视频缩略图

source: Duplicate
ar: مكرر
ur: ڈپلیکیٹ
zh_cn: 重复

source: Repo Branch (optional)
ar: فرع الريبو (اختياري)
ur: ریپو برانچ (اختیاری)
zh_cn: 回购分公司（可选）

source: Good
ar: جيد
ur: اچھی
zh_cn: 好

source: Required Information to Sign Up for {studio_name}
ar: المعلومات المطلوبة للتسجيل في {studio_name}
ur: {سٹوڈیو_ نام} کیلئے سائن اپ کرنے کے لئے ضروری معلومات
zh_cn: 注册{studio_name}所需的信息

source: Learn more about content libraries
ar: تعرف على المزيد حول مكتبات المحتوى
ur: مواد لائبریریوں کے بارے میں مزید جانیں
zh_cn: 详细了解内容库

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines. A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
ar: تشير شهادة {cert_type} إلى أن المتعلم قد وافق على الالتزام بشفرة الشرف المنشأة بواسطة {platform_name} وأنه أكمل جميع المهام المطلوبة لهذه الدورة بموجب إرشاداتها. تشير شهادة {cert_type} أيضًا إلى أن هوية المتعلم قد تم فحصها وأنها صالحة.
ur: A {certificate_type} سرٹیفکیٹ اس بات کی نشاندہی کرتا ہے کہ سیکھنے والے نے {platform_name} کی طرف سے قائم ہونے والے اعزاز کوڈ کے مطابق اس پر اتفاق کیا ہے اور اس کورس کے لئے اس کے ہدایات کے تحت مکمل کاموں کو مکمل کیا ہے. A {certificate_type} سرٹیفکیٹ بھی اشارہ کرتا ہے کہ سیکھنے کی شناخت کی جانچ پڑتال کی گئی ہے اور درست ہے.
zh_cn: {cert_type}证书表示学习者已同意遵守{platform_name}所建立的荣誉代码，并且已根据其指导原则完成了本课程的所有必需任务。 {cert_type}证书还表明学习者的身份已被检查并且有效。

source: View our help section for answers to commonly asked questions.
ar: عرض قسم المساعدة للحصول على إجابات للأسئلة الشائعة.
ur: عام طور پر پوچھے گئے سوالات کے جوابات کے لئے ہماری مدد کے سیکشن دیکھیں.
zh_cn: 查看我们的帮助部分以获取常见问题的答案。

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
ar: حدد True إذا كنت تريد أن ينقر الطلاب على رابط يفتح أداة LTI في نافذة جديدة. حدد False إذا كنت تريد فتح محتوى LTI في IFrame في الصفحة الحالية. يتم استخدام هذا الإعداد فقط عند تعيين Hide External Tool على False.
ur: سچ کا انتخاب کریں اگر آپ چاہتے ہیں کہ طالب علموں کو ایک لنک پر کلک کریں جو LTI آلہ کو نئی ونڈو میں کھولتا ہے. اگر آپ چاہتے ہیں کہ LTI مواد موجودہ صفحہ میں IFrame میں کھولنے کے لئے چاہتے ہیں تو غلط کا انتخاب کریں. یہ ترتیب صرف اس وقت استعمال ہوتا ہے جب بیرونی آلے کو چھپانا غلط ہے.
zh_cn: 如果您希望学生单击在新窗口中打开LTI工具的链接，请选择True。如果您希望在当前页面的IFrame中打开LTI内容，请选择False。该设置仅在隐藏外部工具设置为False时使用。

source: For tips and tricks on printing your certificate, view the {link_start}Web Certificates help documentation{link_end}.
ar: للحصول على نصائح وحيل على طباعة شهادتك ، راجع {link_start} وثائق مساعدة شهادات الويب {link_end}.
ur: اپنے سرٹیفکیٹ کو پرنٹ کرنے کے لئے تجاویز اور چالوں کے لئے، {link_start} ویب سرٹیفکیٹ دستاویزات کی مدد کریں {link_end}.
zh_cn: 有关打印证书的提示和技巧，请查看{link_start} Web证书帮助文档{link_end}。

source: View a specific learner's grades and progress
ar: عرض الدرجات المتعلم محددة والتقدم
ur: ایک مخصوص سیکرٹری کے گریڈ اور ترقی دیکھیں
zh_cn: 查看特定学习者的成绩和进度

source: This email was automatically sent from {site_name} to {full_name}
ar: تم إرسال هذا البريد الإلكتروني تلقائيًا من {site_name} إلى {full_name}
ur: یہ ای میل خود کار طریقے سے {site_name} سے {full_name} پر بھیجا گیا تھا.
zh_cn: 此电子邮件已自动从{site_name}发送至{full_name}

source: WARNING
ar: تحذير
ur: انتباہ
zh_cn: 警告

source: Sign Up
ar: سجل
ur: سائن اپ
zh_cn: 注册

source: Enter the number of components to display to each student.
ar: أدخل عدد المكونات التي سيتم عرضها لكل طالب.
ur: ہر طالب علم کو ظاہر کرنے کے لئے اجزاء کی تعداد درج کریں.
zh_cn: 输入显示给每个学生的组件数量。

source: July
ar: يوليو
ur: جولائی
zh_cn: 七月

source: The Page You Requested Page Cannot be Found
ar: الصفحة التي طلبتها الصفحة لا يمكن العثور عليها
ur: آپ کا مطلوب پیج پایا جا سکتا ہے
zh_cn: 无法找到您请求的页面

source: email
ar: البريد الإلكتروني
ur: ای میل
zh_cn: 电子邮件

source: Invalid amount selected.
ar: تم تحديد مبلغ غير صالح.
ur: منتخب کردہ غلط رقم.
zh_cn: 选择的金额无效。

source: The course {course_id} is already in your cart.
ar: الدورة {course_id} موجودة بالفعل في سلة التسوق الخاصة بك.
ur: کورس {course_id} آپ کی ٹوکری میں پہلے سے ہی ہے.
zh_cn: 课程{course_id}已经在您的购物车中。

source: Are you sure that you want to flag this submission?
ar: هل أنت متأكد من أنك تريد الإبلاغ عن هذا الإرسال؟
ur: کیا آپ واقعی یہ تسلیم کرنا چاہتے ہیں کہ آپ اس پرچم کو پرچم کرنا چاہتے ہیں؟
zh_cn: 你确定要提交此提交吗？

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
ar: إذا تم ترك هذا الخيار {em_start} بدون تحديد {em_end} ، فلن يتم تسجيل المستخدمين الذين لم يسجلوا بعد لـ {platform_name} ، ولكن سيتم السماح لهم بالتسجيل بمجرد إجراء الحساب.
ur: اگر یہ اختیار {em_start} کو نشان زدہ {em_end} چھوڑ دیا جاتا ہے تو، جو صارف ابھی تک {platform_name} کے لئے رجسٹرڈ نہیں ہوئے ہیں انہیں اندراج نہیں کیا جائے گا، لیکن ایک اکاؤنٹ بننے کے بعد انہیں اندراج کرنے کی اجازت ہوگی.
zh_cn: 如果此选项未{em_start}保持未选中状态{em_end}，那么尚未注册{platform_name}的用户将不会注册，但一旦他们创建帐户，将被允许注册。

source: The card type is not accepted by the payment processor. Possible action: retry with another form of payment.
ar: لا يقبل معالج الدفع نوع البطاقة. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: ادائیگی کی پروسیسر کی طرف سے کارڈ کی قسم قبول نہیں کی جاتی ہے. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 付款处理器不接受卡类型。可能的行动：以另一种形式的付款重试。

source: Inputs
ar: المدخلات
ur: ان پٹ
zh_cn: 输入

source: Unable to create library - missing required field '{field}'
ar: يتعذر إنشاء المكتبة - الحقل المطلوب مفقود &quot;{field}&quot;
ur: لائبریری بنانے میں ناکام - مطلوبہ فیلڈ &#39;{فیلڈ}&#39; لاپتہ ہے
zh_cn: 无法创建库 - 缺少必填字段&#39;{field}&#39;

source: A properly formatted e-mail is required
ar: مطلوب بريد إلكتروني منسق بشكل صحيح
ur: مناسب طریقے سے فارمیٹ کردہ ای میل کی ضرورت ہے
zh_cn: 格式正确的电子邮件是必需的

source: Unable to run import command.
ar: غير قادر على تشغيل أمر الاستيراد.
ur: درآمد کمانڈ چلانے میں ناکام.
zh_cn: 无法运行导入命令。

source: You do not have access to this course on a mobile device
ar: ليس لديك حق الوصول إلى هذه الدورة التدريبية على جهاز محمول
ur: آپ کو اس کورس تک موبائل آلات پر رسائی نہیں ہے
zh_cn: 您无法在移动设备上访问此课程

source: Job Title
ar: المسمى الوظيفي
ur: ملازمت کا عنوان
zh_cn: 职称

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
ar: في حالة التعيين ، يتم إخفاء محتوى التسلسل للمستخدمين غير الموظفين بعد مرور تاريخ الاستحقاق.
ur: اگر سیٹ کیا جائے تو، اس تاریخ کے بعد منظور شدہ تاریخ کے بعد غیر عملہ صارفین کے لئے ترتیب مواد پوشیدہ ہے.
zh_cn: 如果设置，则截止日期过后，序列内容将隐藏给非职员用户。

source: Last Change
ar: اخر تغير
ur: آخری تبدیلی
zh_cn: 最后一次变更

source: This is what you will use to login.
ar: هذا ما ستستخدمه لتسجيل الدخول.
ur: یہ آپ لاگ ان کرنے کے لئے استعمال کریں گے.
zh_cn: 这是您将用于登录的内容。

source: External Authentication failed
ar: فشل المصادقة الخارجية
ur: بیرونی توثیق ناکام ہوگئی
zh_cn: 外部验证失败

source: List of course update items
ar: قائمة بنود التحديث بالطبع
ur: کورس اپ ڈیٹ کی اشیاء کی فہرست
zh_cn: 课程更新项目清单

source: Task name
ar: اسم المهمة
ur: ٹاسک کا نام
zh_cn: 任务名称

source: Downloadable Transcript URL
ar: عنوان النص القابل للتنزيل
ur: قابل تدوین URL URL
zh_cn: 可下载的脚本URL

source: Revoke access
ar: إبطال الوصول
ur: رسائی کالعدم
zh_cn: 撤销访问权限

source: by most activity
ar: من قبل معظم النشاط
ur: زیادہ تر سرگرمی سے
zh_cn: 通过大多数活动

source: This re-run processing status:
ar: حالة معالجة إعادة التشغيل هذه:
ur: یہ دوبارہ چلانے والی پروسیسنگ کی حیثیت:
zh_cn: 重新运行处理状态：

source: Subcategory
ar: فرعية
ur: ذیلی زمرہ
zh_cn: 子目录

source: Due date
ar: تاريخ الاستحقاق
ur: اخری تاریخ
zh_cn: 截止日期

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
ar: لقد كنت مؤخرًا في {section_link}. إذا انتهيت من ذلك ، اختر قسمًا آخر على اليسار.
ur: آپ سب سے حال ہی میں {section_link} میں تھے. اگر آپ اس کے ساتھ کئے جاتے ہیں تو، بائیں طرف ایک اور سیکشن کا انتخاب کریں.
zh_cn: 您最近在{section_link}中。如果你完成了，请选择左侧的另一个部分。

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ar: درجة الاحتفاظ بها في Xblock KVS - نسخة من النتيجة المنشورة في django DB
ur: XBL KVS میں اسکور کئے گئے اسکور - ڈیجیٹل ڈی بی ڈی میں شائع شدہ اسکور کا نقل
zh_cn: 得分保留在xblock KVS中 - 在django DB中公布得分的重复

source: Company Contact Email:
ar: البريد الإلكتروني لجهة الاتصال بالشركة:
ur: کمپنی سے رابطہ ای میل:
zh_cn: 公司联系邮箱：

source: Add Team Members to This Course
ar: أضف أعضاء الفريق إلى هذه الدورة
ur: اس کورس میں ٹیم کے ارکان شامل کریں
zh_cn: 将团队成员添加到此课程

source: Collapse All Sections
ar: طي كل الأقسام
ur: تمام حصوں کو ختم کریں
zh_cn: 折叠所有部分

source: Status of this API access request
ar: حالة طلب الوصول إلى واجهة برمجة التطبيقات
ur: اس API کی رسائی کی درخواست کی حیثیت
zh_cn: 此API访问请求的状态

source: Only localhost... muahahaha
ar: فقط localhost ... muahahaha
ur: صرف مقامی ہیسٹ ... مہہہھاہا
zh_cn: 只有本地主机... muhahahaha

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
ar: إذا لم يكن كتابك الدراسي يحتوي على فصول فردية ، فيمكنك تحميل النص بأكمله كفصل واحد وإدخال اسم من اختيارك في حقل اسم الفصل.
ur: اگر آپ کے نصابی کتاب میں انفرادی باب نہیں ہے تو، آپ پورے متن کو ایک باب کے طور پر اپ لوڈ کر سکتے ہیں اور باب نام فیلڈ میں اپنی پسند کا نام درج کرسکتے ہیں.
zh_cn: 如果您的教科书没有单独的章节，则可以将整个文本作为单个章节上传，并在章节名称字段中输入您选择的名称。

source: {span_start}active{span_end}
ar: {SPAN_START} {نشطة SPAN_END}
ur: {span_start} فعال {span_end}
zh_cn: {SPAN_START}活性{SPAN_END}

source: Result
ar: نتيجة
ur: نتیجہ
zh_cn: 结果

source: Hi {full_name},
ar: مرحبًا {full_name} ،
ur: ہیلو {full_name}
zh_cn: Hi {full_name}，您好！

source: The request ID is invalid.
ar: معرف الطلب غير صالح.
ur: درخواست کی شناخت غلط ہے.
zh_cn: 请求ID无效。

source: Create your own {platform_name} account below
ar: قم بإنشاء حساب {platform_name} خاص بك أدناه
ur: ذیل میں اپنے اپنے {platform_name} اکاؤنٹ بنائیں
zh_cn: 在下面创建您自己的{platform_name}帐户

source: Create user
ar: خلق المستخدم
ur: صارف بنائیں
zh_cn: 创建用户

source: comment
ar: تعليق
ur: تبصرہ
zh_cn: 评论

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
ar: قد ترغب في تحديث مكتبة موجودة إلى إصدار جديد ، أو استبدال مكتبة موجودة بالكامل. ربما تكون قد طورت أيضًا مكتبة خارج {studio_name}.
ur: شاید آپ کو ایک موجودہ لائبریری کو ایک نیا ورژن اپ ڈیٹ کرنا چاہتے ہیں، یا موجودہ لائبریری کو مکمل طور پر تبدیل کرنا چاہتے ہیں. شاید آپ نے {سٹوڈیو_ نام} سے باہر ایک لائبریری تیار کی ہے.
zh_cn: 您可能想要将现有的库更新为新版本，或者完全替换现有的库。你也可能在{studio_name}之外开发了一个库。

source: Press to Launch
ar: اضغط على الاطلاق
ur: شروع کرنے کے لئے دبائیں
zh_cn: 按下即可启动

source: Learn more about {platform_name}
ar: معرفة المزيد عن {platform_name}
ur: {platform_name} کے بارے میں مزید جانیں
zh_cn: 详细了解{platform_name}

source: Require students to pass an exam before beginning the course.
ar: اطلب من الطلاب اجتياز الاختبار قبل بدء الدورة التدريبية.
ur: طلباء کو کورس کے آغاز سے پہلے امتحان پاس کرنے کی ضرورت ہے.
zh_cn: 要求学生在开始课程前通过考试。

source: Make payment
ar: قم بالدفع
ur: ادائیگی کرنا
zh_cn: 付款

source: Percent Discount
ar: نسبة الخصم
ur: فی صد ڈسکاؤنٹ
zh_cn: 折扣百分比

source: The items in your order are:
ar: العناصر الموجودة في طلبك هي:
ur: آپ کے آرڈر میں اشیاء ہیں:
zh_cn: 您的订单中的项目是：

source: Label
ar: ضع الكلمة المناسبة
ur: لیبل
zh_cn: 标签

source: Invalid account number. Possible action: retry with another form of payment.
ar: رقم حساب غير صحيح. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: غلط اکاؤنٹ نمبر. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 帐号无效。可能的行动：以另一种形式的付款重试。

source: Enter information about the coupon code below.
ar: أدخل معلومات حول رمز القسيمة أدناه.
ur: ذیل میں کوپن کوڈ کے بارے میں معلومات درج کریں.
zh_cn: 在下面输入关于优惠券代码的信息。

source: {num_hour} hour
ar: {num_hour} ساعة
ur: {num_hour} گھنٹے
zh_cn: {num_hour}小时

source: Location of problem in course
ar: موقع المشكلة في الدورة
ur: کورس کا مسئلہ کورس میں
zh_cn: 问题的位置在课程中

source: Hi {name},
ar: مرحبًا {name} ،
ur: ہیلو {نام}،
zh_cn: 嗨{name}，

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
ar: القيمة &quot;{preference_value}&quot; غير صالحة لتفضيلات المستخدم &quot;{preference_key}&quot;.
ur: ویلیو &#39;{ترجیحی صفول}&#39; صارف کی ترجیح کے لئے درست نہیں ہے {{ترجیح_key} &#39;.
zh_cn: 值&#39;{preference_value}&#39;对用户偏好“{preference_key}”无效。

source: Course content and structure
ar: محتوى الدورة وهيكلها
ur: کورس کے مواد اور ساخت
zh_cn: 课程内容和结构

source: Junior secondary/junior high/middle school
ar: مدرسة ثانوية / مدرسة عليا / متوسطة
ur: جونیئر ثانوی / جونیئر اعلی / مڈل اسکول
zh_cn: 初中/初中/中学

source: Pending
ar: قيد الانتظار
ur: منتقلی
zh_cn: 有待

source: Email Settings for {course_number}
ar: إعدادات البريد الإلكتروني لـ {course_number}
ur: {course_number} کے لئے ای میل کی ترتیبات
zh_cn: {course_number}的电子邮件设置

source: External Grader
ar: الممهدة الخارجية
ur: بیرونی گرڈر
zh_cn: 外部平地机

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
ar: يمكنك إنشاء ما يصل إلى {max_num_bookmarks_per_course} إشارات مرجعية. يجب إزالة بعض الإشارات المرجعية قبل أن تتمكن من إضافة إشارات جديدة.
ur: آپ {max_num_bookmarks_per_course} بک مارک بن سکتے ہیں. آپ کو نئے شامل کرنے سے پہلے آپ کو کچھ بک مارک کو ہٹا دیں.
zh_cn: 您最多可以创建{max_num_bookmarks_per_course}书签。在添加新书签之前，您必须删除一些书签。

source: The following receipt has been emailed to {receipient_emails}
ar: تم إرسال الإيصال التالي عبر البريد الإلكتروني إلى {receipient_emails}
ur: مندرجہ ذیل رسید {وصول کنندہ_ میلوں} کو ای میل کیا گیا ہے.
zh_cn: 以下收据已通过电子邮件发送给{recipient_emails}

source: Jun
ar: يونيو
ur: جون

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
ar: لكي تكون مؤهلاً للحصول على EDX Financial Assistance ، يجب عليك إثبات أن دفع رسوم التحقق من الشهادة قد يسبب لك مشقة اقتصادية. للتقدم بطلب ، سيُطلب منك الإجابة على بعض الأسئلة حول سبب تقديمك للطلب وكيف ستفيدك الشهادة التي تم التحقق منها.
ur: ایڈییکس مالی امداد کے اہل ہونے کے لۓ، آپ کو یہ ظاہر کرنا ہوگا کہ تصدیق شدہ سرٹیفیکیشن فیس کی ادائیگی آپ کو اقتصادی مشکلات کا سبب بنائے گی. درخواست دینے کے لئے، آپ کو درخواست دینے کے بارے میں کچھ سوالات کا جواب دینے کے لئے کہا جائے گا کہ آپ درخواست کیوں دے رہے ہیں اور تصدیق شدہ سرٹیفکیٹ آپ کو کیسے فائدہ ملے گی.
zh_cn: 为了有资格获得edX经济援助，您必须证明支付经验证的证书费用会导致您经济困难。要申请，您需要回答几个关于您为什么申请的问题以及验证证书如何使您受益。

source: Jul
ar: يوليو
ur: جول
zh_cn: 七月

source: Course Maximum Student Enrollment
ar: بالطبع أقصى تسجيل الطلاب
ur: کورس کا زیادہ سے زیادہ طالب علم اندراج
zh_cn: 课程最多学生注册

source: Download a .csv file of all enrollment codes for this course.
ar: قم بتنزيل ملف .csv لجميع رموز التسجيل لهذه الدورة التدريبية.
ur: اس کورس کے لئے تمام داخالی کوڈوں کا ایک .csv فائل ڈاؤن لوڈ کریں.
zh_cn: 下载本课程所有注册码的.csv文件。

source: Copyright {year}. All rights reserved.
ar: حقوق الطبع والنشر {سنة}. كل الحقوق محفوظة.
ur: کاپی رائٹ {سال} جملہ حقوق محفوظ ہیں.
zh_cn: 版权{年份}。版权所有。

source: Course:
ar: دورة:
ur: کورس:
zh_cn: 课程：
