Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: No results found for {original_query}. Showing results for {suggested_query}.
ur: {اصل_query} کے لئے کوئی نتیجہ نہیں ملا. {suggested_query} کیلئے نتائج دکھا رہا ہے.

source: Use my institution/campus credentials
ur: میرے ادارے / کیمپس کی اسناد کا استعمال کریں

source: Toggle Notifications Setting
ur: ٹوگل نوٹیفیکشن کی ترتیب

source: learner is successfully added to the exception list
ur: سیکھنے کو استثنا کی فہرست میں کامیابی سے شامل کیا گیا ہے

source: You haven't added any textbooks to this course yet.
ur: آپ ابھی تک اس کورس میں کسی بھی نصابی کتاب کو شامل نہیں کیا ہے.

source: Strikethrough
ur: ہراساں کرنا

source: Transcript Provider
ur: ٹرانسمیشن فراہم کنندہ

source: This catalog's courses:
ur: یہ کیٹلاگ کورس:

source: Delete column
ur: کالم حذف کریں

source: Redo (Ctrl+Y)
ur: ریڈو (Ctrl + Y)

source: Cancel
ur: منسوخ کریں

source: Thanks for returning to verify your ID in: {courseName}
ur: اپنی ID کی توثیق کرنے میں واپس آنے کے لئے شکریہ: {courseName}

source: Content Group Name
ur: مواد گروپ کا نام

source: Enter Start Date and Time
ur: شروع تاریخ اور وقت درج کریں

source: discussion posted %(time_ago)s by %(author)s
ur: بحث نے٪ (time_ago) کی طرف سے٪ (مصنف) s کی طرف سے پوسٹ کیا

source: There was a problem creating the report. Select "Create Executive Summary" to try again.
ur: رپورٹ تیار کرنے میں ایک مسئلہ تھا. دوبارہ کوشش کرنے کیلئے &quot;ایگزیکٹو خلاصہ بنائیں&quot; منتخب کریں.

source: Muted
ur: خاموش

source: Proctored
ur: پروکار

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
ur: آپ کی تصویر نہیں دیکھی؟ اس بات کو یقینی بنائیں کہ آپ کے براؤزر کو اپنے کیمرے کا استعمال کرنے کی اجازت دی جاسکتی ہے.

source: There was an error while importing the new library to our database.
ur: ہمارے ڈیٹا بیس میں نئی ​​لائبریری درآمد کرتے وقت ایک خرابی تھی.

source: General Proctored Exam Rules
ur: جنرل پروکسیڈ امتحان کے قواعد

source: Inheriting Student Visibility
ur: Student Student Visibility

source: Checkout
ur: اس کو دیکھو

source: Never show assessment results
ur: تشخیص کے نتائج کبھی نہیں دکھائیں

source: You've made some changes, but there are some errors
ur: آپ نے کچھ تبدیلیاں کردی ہیں، لیکن کچھ غلطیاں موجود ہیں

source: Start generating certificates for all students in this course?
ur: اس کورس کے تمام طالب علموں کے لئے سرٹیفکیٹ پیدا کرنا شروع کریں؟

source: Users
ur: صارفین

source: Keywords
ur: مطلوبہ الفاظ

source: You still need to visit the %(display_name)s website to complete the credit process.
ur: آپ کو کریڈٹ کے عمل کو مکمل کرنے کیلئے ابھی بھی٪ (display_name) کی ویب سائٹ ملاحظہ کرنے کی ضرورت ہے.

source: Specify an alternative to the official course title to display on certificates. Leave blank to use the official course title.
ur: سرٹیفکیٹ پر ظاہر کرنے کے لئے سرکاری کورس کے عنوان کے متبادل کا تعین کریں. سرکاری کورس کا عنوان استعمال کرنے کے لئے خالی چھوڑ دیں.

source: Course Title
ur: کورس کا عنوان

source: Admin
ur: ایڈمن

source: You currently have no cohorts configured
ur: آپ کے پاس ابھی تک کوئی ترتیب نہیں ہے

source: List of uploaded files and assets in this course
ur: اس کورس میں اپ لوڈ شدہ فائلوں اور اثاثوں کی فہرست

source: %s from now
ur: ابھی سے٪ s

source: Check the box to remove all flags.
ur: تمام جھنگوں کو ہٹانے کیلئے باکس چیک کریں.

source: Signatory field(s) has invalid data.
ur: سائنسی فیلڈوں میں غلط ڈیٹا ہے.

source: Previous Uploads
ur: پچھلا اپ لوڈ

source: Previously published
ur: پہلے شائع ہوا

source: Show Deprecated Settings
ur: بے ترتیب ترتیبات دکھائیں

source: Cost
ur: لاگت

source: Speed
ur: رفتار

source: Please check your email to confirm the change
ur: تبدیلی کی تصدیق کے لئے براہ کرم اپنا ای میل چیک کریں

source: There were errors reindexing course.
ur: غلطیاں دوبارہ ترمیم کرنے کے کورس میں موجود تھے.

source: Select Session
ur: سیشن کا انتخاب کریں

source: Cell spacing
ur: سیل فاصلے

source: Make Visible to Students
ur: طلباء کو دیکھنے کے لئے بنائیں

source: Upload File
ur: اپ لوڈ فائل

source: subsection
ur: سبسکرائب

source: Generate
ur: پیدا

source: Image must be in PNG format.
ur: تصویر PNG کی شکل میں ہونا ضروری ہے.

source: Thank you! We have received your payment for {courseName}.
ur: آپ کا شکریہ! ہمیں {courseName} کے لئے آپ کی ادائیگی ملی ہے.

source: As you complete courses, you will see them listed here.
ur: جب آپ کورس مکمل کرتے ہیں، تو آپ انہیں یہاں درج کریں گے.

source: Notes
ur: نوٹس

source: Mark Exam As Completed
ur: مکمل طور پر نشان زد کریں

source: Value
ur: قدر

source: REMAINING COURSES
ur: منسوخ کرنے کے کورسز

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam.
ur: کسی بھی قواعد و ضوابط کی استثناء کی وضاحت کریں کہ ویڈیو کا جائزہ لینے کے دوران پروکیکنگ جائزہ لینے والے ٹیم کو نافذ کرنا چاہئے. مثال کے طور پر، آپ وضاحت کر سکتے ہیں کہ کیلکولیٹروں کی اجازت ہے. سیکھنے والے اس امتحان سے قبل ان مخصوص قوانین سیکھنے والوں کو نظر انداز کر رہے ہیں.

source: Discarding Changes
ur: تبدیلیوں کو مسترد کرنا

source: Grade as:
ur: گریڈ کے طور پر:

source: path/to/introductionToCookieBaking-CH{order}.pdf
ur: راستہ / تعارف / تعارف ٹوکاکی بیکنگ-CH {آرڈر}. پی ڈی ایف

source: Activate Your Account
ur: اپنا اکاؤنٹ چالو کریں

source: Verified mode price
ur: تصدیق شدہ موڈ کی قیمت

source: Thank you %(full_name)s! We have received your payment for %(course_name)s.
ur: شکریہ ((full_name) s! ہمیں٪ (course_name) s کے لئے آپ کی ادائیگی موصول ہوئی ہے.

source: Signatory
ur: سائنسی

source: The selected image must be smaller than {maxFileSizeInMB}.
ur: منتخب شدہ تصویر {maxFileSizeInMB} سے چھوٹا ہونا ضروری ہے.

source: bytes
ur: بٹس

source: remove
ur: دور

source: EdX has a timed transcript for this video. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript. If you want to replace this transcript, upload a new .srt transcript file.
ur: اس ویڈیو کے لئے ایڈیکس ایک ٹائم ٹرانزیکشن ہے. اگر آپ اس نقل میں ترمیم کرنا چاہتے ہیں تو، آپ موجودہ ٹرانزیشن کو ڈاؤن لوڈ کرسکتے ہیں، ترمیم کریں اور دوبارہ اپ لوڈ کرسکتے ہیں. اگر آپ اس نقل کو تبدیل کرنا چاہتے ہیں تو، ایک نئی. ایس آر آر ٹرانسپٹ فائل کو اپ لوڈ کریں.

source: %(num_points)s point possible (graded, results hidden)
ur: ٪ (num_points) کے نقطہ ممکن (درجہ بندی، پوشیدہ نتائج)

source: Discussion topics in the course are not divided.
ur: کورس میں بحث موضوعات تقسیم نہیں ہوتے ہیں.

source: Are you sure you want to unenroll from the purchased course %(courseName)s (%(courseNumber)s)?
ur: کیا آپ واقعی خریدا کورس٪ (courseName) s (٪ (کورس نمبر) ے سے انعلاع کرنا چاہتے ہیں؟

source: Regenerate
ur: دوبارہ تخلیق کریں

source: Removing
ur: ہٹانا

source: Create
ur: بنانا

source: Play video
ur: ویڈیو کھیلیں

source: close
ur: بند کریں

source: If the course does not have an end date, learners always see their scores when they submit answers to assessments.
ur: اگر کورس ختم ہونے کی تاریخ نہیں ہے تو، سیکھنے والے اپنے تجربات کو ہمیشہ دیکھتے ہیں جب وہ تشخیص کے جواب میں پیش کرتے ہیں.

source: Success! "{displayName}" has been moved.
ur: کامیابی! &quot;{displayName}&quot; منتقل کردیا گیا ہے.

source: Visible to Staff Only
ur: صرف اسٹاف کو دیکھنے کے لئے

source: Remaining
ur: باقی

source: You must specify a name
ur: آپ کو ایک نام کی وضاحت کرنا ضروری ہے

source: Select all
ur: تمام منتخب کریں

source: This team is full.
ur: یہ ٹیم مکمل ہے.

source: Copy row
ur: قطار کی قطار

source: Pagination
ur: صفحہ بندی

source: e.g. 'google'
ur: مثال کے طور پر &#39;گوگل&#39;

source: Manual
ur: دستی

source: Upload
ur: اپ لوڈ کریں

source: (Staff)
ur: (اسٹاف)

source: send an email message to {email}
ur: {ای میل} کو ای میل پیغام بھیجیں

source: Your post will be discarded.
ur: آپ کا پیغام رد کردیا جائے گا.

source: ORDER NUMBER
ur: نمبر NUMBER

source: Editing: %(title)s
ur: ترمیم کرنا:٪ (عنوان) s

source: Needs verified certificate
ur: تصدیق شدہ سرٹیفکیٹ کی ضرورت ہے

source: Verification Checkpoint
ur: توثیقی چیک پوائنٹ

source: Please select a PDF file to upload.
ur: اپ لوڈ کرنے کیلئے براہ کرم PDF فائل منتخب کریں.

source: Biography
ur: بانی

source: Allow others to copy, distribute, display and perform your work - and derivative works based upon it - but for noncommercial purposes only.
ur: دوسروں کو کاپی کرنے، تقسیم کرنے، ڈسپلے کرنے اور اپنے کام کو انجام دینے کی اجازت دیتے ہیں - اور اس پر مبنی ڈیوٹی کام کرتا ہے - لیکن غیر تجارتی مقاصد کیلئے.

source: Enter team description.
ur: ٹیم کی تفصیل درج کریں.

source: Discussion
ur: بحث

source: We've encountered an error. Refresh your browser and then try again.
ur: ہم نے ایک غلطی کا سامنا کیا ہے. اپنا براؤزر ریفریش کریں اور پھر دوبارہ کوشش کریں.

source: If you make this %(xblockType)s visible to learners, learners will be able to see its content after the release date has passed and you have published the unit. Only units that are explicitly hidden from learners will remain hidden after you clear this option for the %(xblockType)s.
ur: اگر آپ سیکھنے والوں کو یہ٪ (xblockType) نظر آتے ہیں، تو سیکھنے والے تاریخ کو منظور کرنے کے بعد سیکھنے والے اس مواد کو دیکھ سکیں گے اور آپ نے یونٹ شائع کیا ہے. ٪ (xblockType) s کے لئے اس اختیار کو صاف کرنے کے بعد سیکھنے والوں سے واضح طور پر پوشیدہ واحد یونٹس چھپا رہیں گے.

source: Leave Current Session
ur: موجودہ اجلاس چھوڑ دو

source: Play
ur: کھیلیں

source: Could not retrieve payment information
ur: ادائیگی کی معلومات کو دوبارہ حاصل نہیں کیا جا سکا

source: Rescore problem '<%- problem_id %>' for all students?
ur: تمام طالب علموں کے لئے دوبارہ ریسرچ مسئلہ &lt;٪ - problem_id٪&gt; &#39;؟

source: Tags
ur: ٹیگز

source: Studio:
ur: سٹوڈیو:

source: for {courseName}
ur: {courseName} کے لئے

source: Viewing %s course
ur: ٪ s کورس دیکھنے

source: Preview this query
ur: اس سوال کا پیش نظارہ کریں

source: Use a timed exam to limit the time learners can spend on problems in this subsection. Learners must submit answers before the time expires. You can allow additional time for individual learners through the Instructor Dashboard.
ur: وقت کے سیکھنے کو محدود کرنے کیلئے ایک ٹائم ٹیسٹنگ امتحان کا استعمال کریں اس سبسکرائب میں مسائل پر خرچ کر سکتے ہیں. وقت ختم ہونے سے پہلے طلباء کو جوابات جمع کرنی پڑیں. آپ انسٹرکٹر ڈیش بورڈ کے ذریعہ انفرادی سیکھنے والوں کے لئے اضافی وقت کی اجازت دے سکتے ہیں.

source: Image Upload Error
ur: تصویری اپ لوڈ کریں خرابی

source: Remove {role} Access
ur: {کردار} رسائی کو ہٹا دیں

source: Education Completed
ur: تعلیم مکمل

source: Release Time in UTC:
ur: UTC میں رہائشی وقت:

source: e.g. 'http://google.com'
ur: مثال کے طور پر &#39;http://google.com&#39;

source: (Required Field)
ur: (مطلوب خانہ)

source: Supported file types: {supportedVideoTypes}
ur: معاون فائل کی اقسام: {معاون وڈیو ٹائپس}

source: toggle subsection %(displayName)s
ur: ٹگول سبسکرائب٪ (ڈسپلے نام) s

source: Copy Email To Editor
ur: ایڈیٹر کو ای میل کاپی کریں

source: Check Your Email
ur: اپنا ای میل چیک کریں

source: Deleted Group
ur: حذف کردہ گروپ

source: question posted %(time_ago)s by %(author)s
ur: سوال نمبر (٪ time_ago) کی طرف سے٪ (مصنف) s

source: Cols
ur: کالر

source: Final Grade
ur: حتمی گریڈ

source: Very low
ur: بہت کم

source: less than a minute
ur: ایک منٹ سے بھی کم

source: End of transcript. Skip to the start.
ur: نقل کا اختتام شروع پر جائیں.

source: Textbook information
ur: متن کتاب کی معلومات

source: {InstructionsSpanStart}{videoImageResoultion}{lineBreak} {videoImageSupportedFileFormats}{spanEnd}
ur: {ہدایاتسپانٹ اسٹارٹ} {ویڈیو امیج رسوولن} {لائن بیکیک} {ویڈیو امیجز سپورٹفائل فہرست} {spanEnd}

source: %(value)s second
ur: ٪ (قیمت) سیکنڈ

source: Before proceeding, please confirm that your details match
ur: آگے بڑھنے سے پہلے، براہ کرم اس بات کی تصدیق کریں کہ آپ کی تفصیلات مماثلت ہے

source: The refund deadline for this course has passed,so you will not receive a refund.
ur: اس کورس کے لئے رقم کی واپسی کی آخری تاریخ منظور ہوئی ہے، لہذا آپ کو رقم کی واپسی نہیں ملے گی.

source: Name
ur: نام

source: License Type
ur: لائسنس کی قسم

source: New window
ur: نئی کھڑکی

source: Time Allotted (HH:MM):
ur: وقت مختص (ایچ ایچ ایم: ایم ایم):

source: These users were not affiliated with the course so could not be unenrolled:
ur: یہ صارفین اس کورس سے منسلک نہیں تھے لہذا انھوں نے نامزد نہیں کیا جاسکتا:

source: There was an error obtaining email content history for this course.
ur: اس کورس کے لئے ای میل مواد کی تاریخ حاصل کرنے میں ایک غلطی تھی.

source: Lower Alpha
ur: کم الفا

source: Register with Institution/Campus Credentials
ur: ادارے / کیمپس سندھ کے ساتھ رجسٹر کریں

source: Loading data...
ur: ڈیٹا لوڈ کر رہا ہے ...

source: Copy
ur: کاپی کریں

source: Insert
ur: داخل کریں

source: You already belong to another team.
ur: آپ پہلے ہی کسی اور ٹیم سے تعلق رکھتے ہیں.

source: Press Add to language
ur: زبان میں شامل کریں دبائیں

source: Download
ur: ڈاؤن لوڈ کریں

source: Error starting a task to override score for problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the score and the problem and student identifiers are complete and correct.
ur: &lt;٪ - student_id٪&gt; &#39;کے لئے مسئلہ&#39; &lt;٪ - problem_id٪&gt; &#39;کے لئے اسکور کو اوورائڈ کرنے کے لئے کام شروع کرنے میں خرابی. اس بات کو یقینی بنائیں کہ سکور اور مسئلہ اور طالب علم کی شناخت مکمل اور درست ہیں.

source: The raw error message is:
ur: غلط خامی پیغام ہے:

source: All Rights Reserved
ur: جملہ حقوق محفوظ ہیں

source: Please do not use any spaces in this field.
ur: برائے مہربانی اس فیلڈ میں کوئی خالی جگہ استعمال نہ کریں.

source: Checkout with {processor}
ur: {پروسیسر} کے ساتھ چیک آؤٹ

source: Error importing course
ur: کورس درآمد کرنے میں خرابی

source: Provisional
ur: لازمی

source: Can we match the photo you took with the one on your ID?
ur: کیا ہم اس تصویر سے مل سکتے ہیں جسے آپ نے اپنی شناخت پر لے لیا؟

source: Unlinking
ur: غیر منسلک

source: Individual Exceptions
ur: انفرادی استثناء

source: Error generating problem grade report. Please try again.
ur: مسئلہ کی گریڈ کی رپورٹ پیدا کرنے میں خرابی. دوبارہ کوشش کریں.

source: Staff
ur: اسٹاف

source: Tools
ur: اوزار

source: Successfully reset the attempts for user {user}
ur: صارف {صارف} کی کوششوں کو کامیابی سے دوبارہ ترتیب دیں

source: Are you sure you want to remove this transcript?
ur: کیا آپ واقعی یہ نقل ہٹانا چاہتے ہیں؟

source: Insert/edit image
ur: تصویر داخل کریں / ترمیم کریں

source: Discussions are unified; all learners interact with posts from other learners, regardless of the group they are in.
ur: بحثات متحد ہیں؛ تمام سیکھنے والے دوسرے سیکھنے والوں کے خطوط کے ساتھ بات چیت کرتے ہیں، قطع نظر اس گروہ میں ہیں جن میں وہ موجود ہیں.

source: You reserve all rights for your work
ur: آپ اپنے کام کے لئے تمام حقوق محفوظ رکھتے ہیں

source: Your verification status is good until {verificationGoodUntil}.
ur: آپ کی توثیق کی حیثیت {verificationGoodUntil} تک اچھا نہیں ہے.

source: Total Number
ur: کل تعداد

source: More sessions coming soon
ur: مزید سیشن جلد ہی آ رہے ہیں

source: Cancel team updating.
ur: ٹیم کو اپ ڈیٹ کرنا منسوخ کریں.

source: Create a new team if you can't find an existing team to join, or if you would like to learn with friends you know.
ur: اگر ایک موجودہ ٹیم میں شمولیت اختیار نہیں کرسکتا تو نئی ٹیم تشکیل دیں، یا اگر آپ دوستوں کے ساتھ سیکھنا چاہیں تو آپ جانتے ہیں.

source: If you leave, you can no longer post in this team's discussions. Your place will be available to another learner.
ur: اگر آپ چھوڑ دیں تو، آپ اس ٹیم کے مباحثے میں مزید پوسٹ نہیں کرسکتے ہیں. آپ کی جگہ کسی دوسرے سیکھنے کے لئے دستیاب ہو گی.

source: about %d hour
ur: ٪ d گھنٹے کے بارے میں

source: Published (not yet released)
ur: شائع (ابھی تک جاری نہیں)

source: Publish {display_name}
ur: {display_name} شائع کریں

source: Which timed transcript would you like to use?
ur: آپ کونسی ٹرانسمیشن استعمال کرنا چاہتے ہیں؟

source: The selected image must be larger than {minFileSizeInKB}.
ur: منتخب کردہ تصویر {minFileSizeInKB} سے بڑا ہونا ضروری ہے.

source: Upload an image or capture one with your web or phone camera.
ur: ایک تصویر اپ لوڈ کریں یا اپنے ویب یا فون کیمرے کے ساتھ ایک پر قبضہ کریں.

source: Ok
ur: ٹھیک ہے

source: Unknown username: {user}
ur: نامعلوم صارف نام: {صارف}

source: Publish all unpublished changes for this {item}?
ur: اس {آئٹم} کے لئے تمام غیر شائع کردہ تبدیلیاں شائع کریں؟

source: Started task to override the score for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ur: &lt;٪ - problem_id٪&gt; &#39;اور طالب علم&#39;٪ - student_id٪&gt; &#39;کے لئے سکور کو اوورائڈ کرنے کا کام شروع کیا. کام کی حیثیت کو دیکھنے کے لئے &#39;ٹاسک اسٹیٹ دکھائیں&#39; کے بٹن پر کلک کریں.

source: Div
ur: ڈیو

source: Change to a different session or leave the current session.
ur: مختلف سیشن میں تبدیل کریں یا موجودہ سیشن کو چھوڑ دیں.

source: Share your "%(display_name)s" award
ur: اپنے &quot;٪ (display_name) s&quot; کا اعزاز اشتراک کریں

source: OK
ur: ٹھیک ہے

source: Creating missing groups
ur: لاپتہ گروپوں کی تشکیل

source: This is the Name of the Group Configuration
ur: یہ گروپ کی ترتیب کا نام ہے

source: Success! Problem attempts reset for problem '<%- problem_id %>' and student '<%- student_id %>'.
ur: کامیابی! مسئلہ کی کوششیں &#39;&lt;٪ - problem_id٪&gt;&#39; اور طالب علم &#39;٪ - student_id٪&gt;&#39; کے لئے ری سیٹ کریں.

source: The enrollment end date cannot be after the course end date.
ur: اندراج ختم ہونے کی تاریخ کورس کے اختتامی تاریخ کے بعد نہیں ہوسکتی ہے.

source: Share Alike
ur: علی علیہ السلام کا اشتراک کریں

source: Find
ur: مل

source: Open the certificate you earned for the %(title)s program.
ur: آپ٪ (عنوان) کے پروگرام کے لئے حاصل کردہ سرٹیفکیٹ کھولیں.

source: Unpublished changes to live content
ur: لائیو مواد میں غیر شائع شدہ تبدیلییں

source: Confirm
ur: تصدیق کریں

source: Share
ur: بانٹیں

source: Hide Previews
ur: پیش نظارہ چھپائیں

source: Exception Granted
ur: استثنا عطا

source: There was an error obtaining email task history for this course.
ur: اس کورس کے لئے ای میل کام کی تاریخ حاصل کرنے میں ایک غلطی تھی.

source: {paragraphStart}You entered {boldStart}{email}{boldEnd}. If this email address is associated with your {platform_name} account, we will send a message with password reset instructions to this email address.{paragraphEnd}{paragraphStart}If you do not receive a password reset message, verify that you entered the correct email address, or check your spam folder.{paragraphEnd}{paragraphStart}If you need further assistance, {anchorStart}contact technical support{anchorEnd}.{paragraphEnd}
ur: {پیراگراف اسٹارٹ} آپ نے {boldStart} {ای میل} {boldEnd} درج کیا. اگر یہ ای میل ایڈریس آپ کے {platform_name} کے اکاؤنٹ سے منسلک ہے تو، ہم اس ای میل ایڈریس پر پاس ورڈ ری سیٹ کے ہدایات کے ساتھ ایک پیغام بھیجیں گے. {paragraphEnd} {پیراگراف اسٹارٹ} اگر آپ پاسورڈ ری سیٹ پیغام نہیں ملتی ہے تو، اس بات کی تصدیق کریں کہ آپ نے صحیح ای میل درج کیا پتہ، یا اپنے سپیم فولڈر کو چیک کریں. {paragraphEnd} {پیراگراف اسٹارٹ} اگر آپ کو مزید مدد کی ضرورت ہے تو، {anchorStart} تکنیکی معاونت {anchorEnd} سے رابطہ کریں. {paragraphEnd}.

source: Email
ur: ای میل

source: Unit Access
ur: یونٹ تک رسائی

source: Horizontal space
ur: افقی جگہ

source: Insert Hyperlink
ur: ہائپر لنک داخل کریں

source: These users could not be added as beta testers because their accounts are not yet activated:
ur: یہ صارفین بیٹا ٹیسٹرز کے طور پر شامل نہیں کیے جا سکتے ہیں کیونکہ ان کے اکاؤنٹس ابھی تک فعال نہیں ہیں:

source: Choose One
ur: ایک کا انتخاب کریں

source: You don't seem to have a webcam connected.
ur: ایسا لگتا ہے کہ آپ کے ویب کیم سے منسلک نہیں ہے.

source: The assignment type must have a name.
ur: تفویض کی قسم کا نام ہونا ضروری ہے.

source: Timed Transcript Uploaded Successfully
ur: ٹائم کردہ ٹرانسمیشن کامیابی سے اپ لوڈ کیا

source: All Learners and Staff
ur: تمام سیکھنے اور اسٹاف

source: %(memberCount)s / %(maxMemberCount)s Member
ur: ٪ (memberCount) s /٪ (maxMemberCount) s رکن

source: Group Configuration Name
ur: گروپ ترتیب نام

source: You cannot view the course as a student or beta tester before the course release date.
ur: کورس کورس کی رہائی کی تاریخ سے پہلے آپ اس کورس کو طالب علم یا بیٹا ٹیسٹر کے طور پر نہیں دیکھ سکتے.

source: Take me to the main library page
ur: مجھے مرکزی لائبریری پیج پر لے لو

source: Timed
ur: ٹائم

source: Staff and Learners
ur: اسٹاف اور سیکھنے

source: Square
ur: مربع

source: Download available encodings (.csv)
ur: دستیاب انکوڈنگ (.csv) ڈاؤن لوڈ کریں

source: This post could not be flagged for abuse. Refresh the page and try again.
ur: اس اشاعت کے بدعنوان کے لئے پرچم لگایا جا سکتا ہے. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Linking
ur: لنکنگ

source: Please enter a student email address or username.
ur: براہ کرم طالب علم ای میل ایڈریس یا صارف نام درج کریں.

source: Delete the user, {username}
ur: صارف کو حذف کریں {صارف کا نام}

source: No validation is performed on policy keys or value pairs. If you are having difficulties, check your formatting.
ur: پالیسی کی چابیاں یا قدر جوڑوں پر کوئی توثیق نہیں کی جاتی ہے. اگر آپ کو دشواری ہو رہی ہے تو، اپنے فارمیٹنگ کی جانچ پڑتال کریں.

source: Earned %(created)s.
ur: کمایا٪ (پیدا کردہ) s.

source: Row
ur: قطار

source: Use the retake photo button if you are not pleased with your photo
ur: اگر آپ اپنی تصویر سے راضی نہ ہو تو دوبارہ تصویر کا بٹن استعمال کریں

source: No Derivatives
ur: کوئی مشترک نہیں

source: Transcript Turnaround
ur: ٹرانسک ٹرناراؤنڈ

source: Manage Learners
ur: سیکھنے کا انتظام کریں

source: Add Thumbnail
ur: تھمب نیل شامل کریں

source: Make sure your ID is well-lit
ur: یقینی بنائیں کہ آپ کی شناخت اچھی طرح سے روشن ہے

source: follow this post
ur: اس پوسٹ پر عمل کریں

source: %d month
ur: ٪ مہینے

source: learner does not exist in LMS and not added to the exception list
ur: سیکھنے LMS میں موجود نہیں ہے اور استثنا کی فہرست میں شامل نہیں ہے

source: Used
ur: استعمال کیا جاتا ہے

source: Row properties
ur: صف کی خصوصیات

source: Team name cannot have more than 255 characters.
ur: ٹیم کا نام 255 حروف سے زیادہ نہیں ہوسکتا ہے.

source: Previous Uploads table has been updated.
ur: پچھلے اپ لوڈ کی میز کو اپ ڈیٹ کر دیا گیا ہے.

source: We've sent a confirmation message to {new_email_address}. Click the link in the message to update your email address.
ur: ہم نے {new_email_address} کو ایک تصدیقی پیغام بھیجا ہے. اپنے ای میل پتہ کو اپ ڈیٹ کرنے کے لئے پیغام میں لنک پر کلک کریں.

source: User
ur: صارف

source: Show Discussion
ur: بحث دکھائیں

source: Course ID
ur: کورس کی شناخت

source: Failed to rescore problem to improve score for user.
ur: صارف کیلئے سکور کو بہتر بنانے کے لئے مسئلہ کو دوبارہ تبدیل کرنے میں ناکامی

source: learners are already white listed and not added to the exception list
ur: سیکھنے والے پہلے سے ہی سفید فہرست درج ہیں اور استثنا کی فہرست میں شامل نہیں ہیں

source: Certificate Name
ur: سرٹیفکیٹ کا نام

source: We've sent a message to {email}. Click the link in the message to reset your password. Didn't receive the message? Contact {anchorStart}technical support{anchorEnd}.
ur: ہم نے {ای میل} کو ایک پیغام بھیجا ہے. اپنا پاس ورڈ دوبارہ ترتیب دینے کیلئے پیغام میں لنک پر کلک کریں. پیغام موصول نہیں ہوا؟ رابطہ کریں (لنگر شروع) تکنیکی مدد {لنگر اور}.

source: You must be over 13 to share a full profile. If you are over 13, make sure that you have specified a birth year on the {account_settings_page_link}
ur: مکمل پروفائل کا اشتراک کرنے کیلئے آپ کو 13 سے زائد ہونا ضروری ہے. اگر آپ 13 سے زائد ہیں تو، اس بات کو یقینی بنائیں کہ آپ نے {account_settings_page_link} پر ایک پیدائش کا سال مقرر کیا ہے.

source: View Live
ur: لائیو دیکھیں

source: %(comments_count)s %(span_sr_open)scomments %(span_close)s
ur: ٪ (comment_count) s٪ (span_sr_open) scomments٪ (span_close) s

source: Turn on transcripts
ur: ٹرانزیکٹس کو تبدیل کریں

source: Load more
ur: مزید لوڈ کریں

source: You must specify a name for the cohort
ur: آپ کوہور کے لئے ایک نام کی وضاحت کرنا ضروری ہے
