Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions.Unfortunately, because {platform_name} is required to comply with export controls,we cannot allow you to access this course at this time.
ar: يشير نظامنا إلى أنك تحاول الوصول إلى هذه الدورة التدريبية {platform_name} من بلد أو منطقة خاضعة حاليًا لعقوبات اقتصادية وتجارية أمريكية. لسوء الحظ ، نظرًا لأنه مطلوب من {platform_name} الالتزام بعناصر التحكم في التصدير ، لا يمكننا السماح لك بالوصول إلى هذه الدورة التدريبية في هذا الوقت.
ur: ہمارے نظام سے پتہ چلتا ہے کہ آپ اس ملک یا علاقے سے اس وقت {platform_name} کورس تک رسائی حاصل کررہے ہیں جو فی الحال امریکی اقتصادی اور تجارتی پابندیوں کے تابع ہیں. بدقسمتی سے، کیونکہ {platform_name} برآمد کنٹرول کے مطابق عمل کرنے کی ضرورت ہے، ہم آپ کو اس کورس تک رسائی حاصل کرنے کی اجازت نہیں دے سکتے ہیں. اس وقت.
zh_cn: 我们的系统表明您正试图从目前受美国经济和贸易制裁影响的国家或地区访问此{platform_name}课程。不幸的是，由于{platform_name}需要符合出口控制，因此我们不允许您访问此课程此时。

source: Discount does not exist against code '{code}'.
ar: الخصم غير موجود في الشفرة &quot;{code}&quot;.
ur: کوڈ &#39;{کوڈ}&#39; کے خلاف ڈسکاؤنٹ موجود نہیں ہے.
zh_cn: 折扣对于代码“{code}”不存在。

source: Answer received.
ar: الإجابة مستلمة.
ur: جواب موصول ہوا.
zh_cn: 已收到答复。

source: You can restrict access to this unit to learners in specific enrollment tracks or content groups.
ar: يمكنك تقييد الوصول إلى هذه الوحدة للمتعلمين في مسارات تسجيل أو مجموعات محتوى محددة.
ur: آپ اس اندراج کو مخصوص اندراج کے پٹریوں یا مواد کے گروپوں میں سیکھنے والوں تک محدود کر سکتے ہیں.
zh_cn: 您可以在特定的注册轨道或内容组中限制对本单元的访问。

source: Save Grading Policy
ar: حفظ سياسة الدرجات
ur: گرڈنگ پالیسی محفوظ کریں
zh_cn: 保存评分政策

source: You're enrolled as a verified student
ar: أنت مسجل كطالب تم التحقق منه
ur: آپ ایک تصدیق شدہ طالب علم کے طور پر داخلہ کر رہے ہیں
zh_cn: 你被注册为一名经过验证的学生

source: View gradebook for enrolled learners
ar: عرض دفتر التقديرات للمتعلمين المسجلين
ur: داخلا سیکھنے والوں کے لئے گریڈ بک دیکھیں
zh_cn: 查看已注册学员的成绩册

source: Hi,
ar: مرحبا،
ur: ہیلو،
zh_cn: 嗨，

source: CSS Class for Course Reruns
ar: فئة CSS الخاصة بـ Course Reruns
ur: کورس ریورس کے لئے سی ایس ایس کلاس
zh_cn: 课程重演的CSS课程

source: Email address must end in {domain}
ar: يجب أن ينتهي عنوان البريد الإلكتروني في {domain}
ur: ای میل پتہ {ڈومین} میں ختم ہونا ضروری ہے
zh_cn: 电子邮件地址必须以{域}结尾

source: Add grade
ar: إضافة الصف
ur: گریڈ شامل کریں
zh_cn: 添加等级

source: {platform_name} Certificate for {course_name}
ar: {platform_name} شهادة لـ {course_name}
ur: {course_name} کے لئے سرٹیفکیٹ {course_name}
zh_cn: {platform_name} {course_name}的证书

source: New to {studio_name}?
ar: جديد على {studio_name}؟
ur: {سٹوڈیو_ نام} کیلئے نیا؟
zh_cn: {studio_name}的新功能？

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: لقد أرسلت بالفعل معلومات التحقق الخاصة بك. سترى رسالة على لوحة المعلومات عندما تكتمل عملية التحقق (عادةً في غضون يوم أو يومين).
ur: آپ نے پہلے سے ہی آپ کی توثیقی معلومات جمع کردی ہے. جب آپ تصدیق شدہ عمل مکمل ہوجاتا ہے تو آپ اپنے ڈیش بورڈ پر ایک پیغام دیکھیں گے (عام طور پر 1-2 دن کے اندر اندر).
zh_cn: 您已经提交了验证信息。验证过程完成后（通常在1-2天内），您将在仪表板上看到一条消息。

source: Enrollment Code
ar: رمز التسجيل
ur: اندراج کا کوڈ
zh_cn: 注册码

source: View notes by:
ar: عرض الملاحظات حسب:
ur: نوٹوں کو دیکھیں:
zh_cn: 查看笔记：

source: Prerequisite:
ar: المتطلبات المسبقة:
ur: شرط:
zh_cn: 先决条件：

source: {studio_name} Helps You Keep Your Courses Organized
ar: يساعدك {studio_name} على تنظيم دوراتك التدريبية
ur: {سٹوڈیو_ نام} آپ کو اپنے کورسوں کو منظم رکھنے میں مدد ملتی ہے
zh_cn: {studio_name}帮助您保持课程的有序组织

source: Percent
ar: نسبه مئويه
ur: فیصد
zh_cn: 百分

source: Slug that points to the wiki for this course
ar: سبيكة يشير إلى الويكي لهذه الدورة
ur: اس کورس کے لئے ویکی میں اس پوائنٹس کو سلگ کریں
zh_cn: S that指向本课程的维基

source: Enter the reason why the students are to be manually enrolled or unenrolled.
ar: أدخل سبب تسجيل الطلاب يدويًا أو عدم التسجيل.
ur: اس وجہ سے درج کریں کہ طالب علموں کو دستی طور پر اندراج یا غیر نام نہاد ہونے کی ضرورت ہوتی ہے.
zh_cn: 输入学生被手动注册或取消注册的原因。

source: Course Pacing
ar: بالطبع باكينج
ur: کورس Pacing
zh_cn: 课程起搏

source: Reset My Password
ar: إعادة تعيين كلمة المرور الخاصة بي
ur: میرا پاس ورڈ دوبارہ ترتیب دیں
zh_cn: 重置我的密码

source: Discussion Forum External Link
ar: منتدى الحوار External Link
ur: بحث فورم بیرونی لنک
zh_cn: 论坛外部链接

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
ar: هذه شهادة صالحة {platform_name} لـ {user_name} ، شاركت في {partner_short_name} {course_number}
ur: {user_name} کے لئے یہ ایک درست {platform_name} سرٹیفکیٹ ہے، جس نے {partner_short_name} {course_number} میں حصہ لیا
zh_cn: 这是{user_name}的{platform_name}证书，他参与了{partner_short_name} {course_number}

source: The lowest {drop_count} {section_type} scores are dropped.
ar: يتم إسقاط أقل {drop_count} {section_type} نقاط.
ur: سب سے کم {drop_count} {section_type} کے اسکور کو گرا دیا گیا ہے.
zh_cn: 最低的{drop_count} {section_type}分数被删除。

source: Discussion Admins
ar: ادارة المناقشات
ur: بحث ایڈمنز
zh_cn: 讨论管理员

source: Type
ar: اكتب
ur: ٹائپ کریں
zh_cn: 类型

source: Extended Due Date
ar: تاريخ الاستحقاق الموسع
ur: توسیع کی تاریخ کی تاریخ
zh_cn: 延期到期日

source: Email Address
ar: عنوان البريد الإلكتروني
ur: ای میل اڈریس
zh_cn: 电子邮件地址

source: Username
ar: اسم المستخدم
ur: صارف کا نام
zh_cn: 用户名

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
ar: لم يتم العثور على الصفحة التي كنت تبحث عنها. ارجع إلى {link_start} الصفحة الرئيسية {link_end} أو أعلمنا بأي صفحات ربما تم نقلها على {email}.
ur: وہ صفحہ جو آپ تلاش کر رہے تھے وہ نہیں مل سکا. {link_start} ہوم پیج {link_end} پر واپس جائیں یا ہمیں کسی ایسے صفحات کے بارے میں بتائیں جس میں {ای میل} منتقل ہوسکتا ہے.
zh_cn: 没有找到您正在寻找的页面。返回到{link_start}主页{link_end}，或让我们了解可能已在{email}移动过的任何网页。

source: Course
ar: دورة
ur: کورس
zh_cn: 课程

source: No due date extension is set for that student and unit.
ar: لم يتم تحديد أي تاريخ استحقاق محدد لهذا الطالب والوحدة.
ur: اس طالب علم اور یونٹ کے لئے کسی تاریخ کی توسیع کی توسیع نہیں کی جاتی ہے.
zh_cn: 没有为该学生和单位设置截止日期延期。

source: The image must have name, content type, and size information.
ar: يجب أن تحتوي الصورة على اسم ونوع المحتوى ومعلومات الحجم.
ur: تصویر کا نام، مواد کی نوعیت، اور سائز کی معلومات ہونا ضروری ہے.
zh_cn: 图片必须包含名称，内容类型和尺寸信息。

source: *emphasis* or _emphasis_
ar: * التوكيد * أو _المهاجمة_
ur: * زور * یا _ شدت
zh_cn: *重点*或_emphasis_

source: YouTube ID
ar: معرف YouTube
ur: یو ٹیوب ID

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
ar: لقد تحققنا من هويتك بنجاح من أجل تقييم {assessment} في الدورة التدريبية {course_name}.
ur: ہم {course_name} کورس میں {تشخیص} تشخیص کے لئے اپنی شناخت کو کامیابی سے تصدیق کر چکے ہیں.
zh_cn: 我们已成功验证您在{course_name}课程中的{评估}评估的身份。

source: Displayed on the course details page. Limit to 1000 characters.
ar: معروض في صفحة تفاصيل الدورة التدريبية. الحد إلى 1000 حرف.
ur: کورس تفصیلات کے صفحے پر ظاہر 1000 حروف تک محدود
zh_cn: 显示在课程详情页面上。限制为1000个字符。

source: Create Your First Library
ar: إنشاء مكتبة الأولى الخاصة بك
ur: اپنی پہلی لائبریری بنائیں
zh_cn: 创建你的第一个库

source: Course Overview
ar: نظرة عامة على الدورة التدريبية
ur: کورس کا جائزہ
zh_cn: 课程大纲

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
ar: إجمالي الفواتير المستحقة على بطاقة الائتمان / الخصم المباشر: {currency_symbol} {total_cost}
ur: کریڈٹ / ڈیبٹ کارڈ پر کل بل: {currency_symbol} {total_cost}
zh_cn: 以信用卡/借记卡结算的总额：{currency_symbol} {total_cost}

source: Choose File
ar: اختر ملف
ur: فائل منتخب کریں
zh_cn: 选择文件

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
ar: DEPRECATED: استخدم الإعداد COURSE_CATALOG_API_URL.
ur: پیش کردہ: ترتیب COURSE_CATALOG_API_URL استعمال کریں.
zh_cn: DEPRECATED：使用设置COURSE_CATALOG_API_URL。

source: Download Coupon Codes
ar: تحميل رموز القسيمة
ur: کوپن کوڈز ڈاؤن لوڈ کریں
zh_cn: 下载优惠券代码

source: Cache Time To Live
ar: وقت التخزين المؤقت للعيش
ur: کیش وقت رہنے کے لئے
zh_cn: 缓存生存时间

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
ar: أدخل صح أو خطأ. إذا كان صحيحًا ، فسيتم تصنيف فئات المناقشة والفئات الفرعية أبجديًا. إذا كانت خاطئة ، يتم فرزها زمنياً حسب تاريخ ووقت الإنشاء.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، بحث کے زمرے اور مضامین حروف تہجی سے ترتیب دے رہے ہیں. اگر غلط ہو تو، وہ تخلیق کی تاریخ اور وقت کی طرف سے chronologically ترتیب دیا جاتا ہے.
zh_cn: 输入true或false。如果为true，则讨论类别和子类别按字母顺序排序。如果为假，则按创建日期和时间按时间顺序排序。

source: Specify your annual household income in US Dollars.
ar: حدد دخل الأسرة السنوي بالدولار الأمريكي.
ur: امریکی ڈالر میں اپنے سالانہ گھریلو آمدنی کی وضاحت کریں.
zh_cn: 以美元为单位指定您的家庭年收入。

source: Edit {catalog_name}
ar: تحرير {catalog_name}
ur: {catalog_name} میں ترمیم کریں
zh_cn: 编辑{catalog_name}

source: Use Reload Graphs to refresh the graphs.
ar: استخدم إعادة تحميل الرسوم البيانية لتحديث الرسوم البيانية.
ur: گرافس کو تازہ کرنے کے لئے دوبارہ گرافکس کا استعمال کریں.
zh_cn: 使用重新加载图形刷新图形。

source: University
ar: جامعة
ur: جامع درس گاہ
zh_cn: 大学

source: Course Starts
ar: الدورة تبدأ
ur: کورس شروع ہوتا ہے
zh_cn: 课程开始

source: We've sent an email message to {email} with instructions for activating your account.
ar: لقد أرسلنا رسالة بريد إلكتروني إلى {email} تحتوي على تعليمات لتنشيط حسابك.
ur: ہم نے اپنے اکاؤنٹ کو فعال کرنے کیلئے ہدایات کے ساتھ {ای میل} کو ایک ای میل پیغام بھیجا ہے.
zh_cn: 我们已向{email}发送了一封电子邮件，其中包含激活您的帐户的说明。

source: Edit Coupon Code Information
ar: عدل معلومات كود القسيمة
ur: کوپن کوڈ کی معلومات میں ترمیم کریں
zh_cn: 编辑优惠券代码信息

source: Upload file
ar: رفع ملف
ur: اپ لوڈ فائل
zh_cn: 上传文件

source: Enter a password.
ar: أدخل كلمة مرور.
ur: پاس ورڈ درج کریں.
zh_cn: 输入密码。

source: Create a New Library
ar: قم بإنشاء مكتبة جديدة
ur: ایک نئی لائبریری بنائیں
zh_cn: 创建一个新库

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخل معرف LTI لموفر LTI الخارجي. يجب أن تكون هذه القيمة هي نفس معرف LTI الذي أدخلته في إعداد Passiv LTI في صفحة الإعدادات المتقدمة. <br /> راجع {docs_anchor_open} وثائق EDX LTI {anchor_close} لمزيد من التفاصيل حول هذا الإعداد.
ur: بیرونی LTI فراہم کنندہ کے لئے LTI ID درج کریں. یہ قیمت ایک ہی LTI ID ہونا چاہئے جس میں آپ نے اعلی درجے کی ترتیبات کے صفحے پر LTI پاسپورٹ کی ترتیب میں درج کیا. <br /> اس ترتیب پر مزید تفصیلات کیلئے EDX LTI دستاویزات {anchor_close} ملاحظہ کریں {Docs_anchor_open}.
zh_cn: 输入外部LTI提供商的LTI ID。该值必须与您在“高级设置”页面上的LTI护照设置中输入的LTI ID相同。 <br />有关此设置的更多详细信息，请参阅{docs_anchor_open} edX LTI文档{anchor_close}。

source: To finish your registration, please visit {registration_url} and fill out the registration form making sure to use {email_address} in the E-mail field.
ar: لإنهاء التسجيل ، يرجى زيارة {registration_url} وملء نموذج التسجيل مع التأكد من استخدام {email_address} في حقل البريد الإلكتروني.
ur: اپنا رجسٹریشن مکمل کرنے کے لئے براہ کرم {registration_url} پر جائیں اور ای میل فیلڈ میں {email_address} استعمال کرنے کیلئے رجسٹریشن فارم کو بھریں.
zh_cn: 要完成注册，请访问{registration_url}并填写注册表单，确保在电子邮件字段中使用{email_address}。

source: Update My Account
ar: تحديث حسابي
ur: میرا اکاؤنٹ اپ ڈیٹ کریں
zh_cn: 更新我的帐户

source: Bulk and Single Seat Purchases
ar: المشتريات السائبة والمفردة المقعد
ur: بلک اور سنگل سیٹ خریدیں
zh_cn: 散装和单座购买

source: Schedule & Details Settings
ar: إعدادات الجدول الزمني والتفاصيل
ur: شیڈول اور تفصیلات کی ترتیبات
zh_cn: 计划和详细设置

source: Add Component
ar: إضافة مكون
ur: اجزاء شامل کریں
zh_cn: 添加组件

source: Vertical
ar: عمودي
ur: عمودی
zh_cn: 垂直

source: created
ar: خلقت
ur: پیدا ہوا
zh_cn: 创建

source: September
ar: سبتمبر
ur: ستمبر
zh_cn: 九月

source: Course-loading errors
ar: أخطاء تحميل الدورة التدريبية
ur: کورس کی لوڈنگ کی غلطیاں
zh_cn: 课程加载错误

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
ar: مخطط بسيط من مستويين لتنظيم دورتك. اسحبه وأفلته ، وشاهد الدورة التدريبية في لمحة.
ur: اپنے کورس کو منظم کرنے کے لئے سادہ دو درجے کی ترتیبات. ڈریگ اور ڈراپ، اور اپنے کورس کو ایک نظر میں دیکھیں.
zh_cn: 简单的两级大纲来组织你的课程。拖放，并一目了然地查看您的课程。

source: The course {course_key} does not exist
ar: الدورة التدريبية {course_key} غير موجودة
ur: کورس {course_key} موجود نہیں ہے
zh_cn: 课程{course_key}不存在

source: All ok!
ar: كل شيء جيد!
ur: سب ٹھیک!
zh_cn: 一切都好！

source: fixed password
ar: كلمة المرور الثابتة
ur: مقررہ پاس ورڈ
zh_cn: 固定密码

source: View Certificates Issued
ar: عرض الشهادات الصادرة
ur: تصدیق شدہ دستاویزات دیکھیں
zh_cn: 查看已颁发的证书

source: Name of template.
ar: اسم القالب.
ur: ٹیمپلیٹ کا نام
zh_cn: 模板的名称。

source: e.g. CSPROB
ar: على سبيل المثال CSPROB
ur: مثال کے طور پر CSPROB
zh_cn: 如CSPROB

source: This setting is not currently supported.
ar: هذا الإعداد غير معتمد حاليًا.
ur: یہ ترتیب فی الحال تعاون نہیں کی گئی ہے.
zh_cn: 此设置目前不受支持。

source: Course View
ar: عرض الدورة التدريبية
ur: کورس دیکھیں
zh_cn: 课程视图

source: Not Selected
ar: لم يتم اختياره
ur: منتخب نہیں کیا گیا
zh_cn: 未选中的

source: Block with usage_id: {usage_id} not found.
ar: حظر باستخدام usage_id: لم يتم العثور على {usage_id}.
ur: use_id کے ساتھ بلاک کریں: {use_id} نہیں ملا.
zh_cn: 未找到使用usage_id的块：{usage_id}。

source: Adding {codenames} permissions to group "{group}"
ar: إضافة أذونات {codenames} إلى المجموعة &quot;{group}&quot;
ur: گروپ کو {{گروپ}} میں شامل کرنے کے لئے {کوڈڈ نام}} کو شامل کرنے کی اجازت
zh_cn: 将{codenames}权限添加到组“{group}”

source: {platform_name} Support
ar: {platform_name} الدعم
ur: {platform_name} سپورٹ
zh_cn: {platform_name}支持

source: Answer submitted.
ar: الإجابة المقدمة.
ur: جواب پیش
zh_cn: 已提交答案。

source: Cohort
ar: جماعة
ur: کوہٹ
zh_cn: 队列

source: to access your account and courses
ar: للوصول إلى حسابك والدورات
ur: اپنے اکاؤنٹ اور کورس تک رسائی حاصل کرنے کے لئے
zh_cn: 访问您的帐户和课程

source: Enable authoring of Credential Service credentials in Studio.
ar: تمكين تأليف بيانات اعتماد خدمة الاعتماد في Studio.
ur: اسٹوڈیو میں کریڈٹ سروس سروس کی اسناد کو فعال کریں.
zh_cn: 在Studio中启用Credential Service凭据的创作。

source: grade
ar: درجة
ur: گریڈ
zh_cn: 年级

source: The list of group configurations for partitioning students in content experiments.
ar: قائمة تكوينات المجموعة لتقسيم الطلاب في تجارب المحتوى.
ur: مواد کے تجربات میں تقسیم کرنے والے طلبا کے لئے گروپ کی ترتیب کی فہرست.
zh_cn: 用于在内容实验中对学生进行分区的组配置列表。

source: Save your answer
ar: احفظ إجابتك
ur: اپنا جواب محفوظ کرو
zh_cn: 保存你的答案

source: Last day students can enroll.
ar: في اليوم الأخير يمكن للطلاب التسجيل.
ur: آخری دن طالب علموں کو اندراج کر سکتا ہے.
zh_cn: 最后一天学生可以报名。

source: Drag components to new locations within this component.
ar: اسحب المكونات إلى مواقع جديدة داخل هذا المكون.
ur: اس اجزاء کے اندر نئے مقامات پر اجزاء کو گھسیٹیں.
zh_cn: 将组件拖到此组件中的新位置。

source: Settings on the Advanced Settings page
ar: الإعدادات في صفحة الإعدادات المتقدمة
ur: اعلی درجے کی ترتیبات کے صفحے پر ترتیبات
zh_cn: 高级设置页面上的设置

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
ar: نأمل أن تكون قد استمتعت بالدورة التدريبية ، ونأمل أن نراكم في دورات {platform_name} المستقبلية!
ur: ہم امید کرتے ہیں کہ آپ نے کورس کا لطف اٹھایا، اور ہم آپ کو مستقبل {platform_name} کورسوں میں دیکھنا چاہتے ہیں!
zh_cn: 我们希望你喜欢这门课程，我们希望在未来的{platform_name}课程中看到你！

source: Course update not found.
ar: لم يتم العثور على تحديث الدورة التدريبية.
ur: کورس اپ ڈیٹ نہیں ملا.
zh_cn: 未找到课程更新。

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: عنوان url git غير صالح للاستخدام. توقع شيء من هذا القبيل: git@github.com: mitocw / edx4edx_lite.git
ur: غیر قابل استعمال GIT یو آر ایل فراہم کی. جیسے کچھ توقع ہے: git@github.com: mitocw / edx4edx_lite.git
zh_cn: 提供了不可用的git url。期待类似于：git@github.com：mitocw / edx4edx_lite.git

source: Created new group: "{}"
ar: تم إنشاء مجموعة جديدة: &quot;{}&quot;
ur: نیا گروپ بنایا: &quot;{}&quot;
zh_cn: 创建新组：“{}”

source: You must complete {link} before you can access this unit.
ar: يجب عليك إكمال {link} قبل أن تتمكن من الوصول إلى هذه الوحدة.
ur: اس یونٹ تک رسائی حاصل کرنے سے پہلے آپ کو {لنک} مکمل کرنا ضروری ہے.
zh_cn: 您必须完成{link}才能访问此设备。

source: Your final grade:
ar: درجتك النهائية:
ur: آپ کی آخری گریڈ:
zh_cn: 你的最终成绩：

source: Reset Attempts to Zero
ar: إعادة محاولات صفر
ur: صفر کی کوششیں دوبارہ ترتیب دیں
zh_cn: 重置尝试归零

source: must contain {0} or more unique words
ar: يجب أن يحتوي على {0} أو أكثر من الكلمات الفريدة
ur: {0} یا زیادہ منفرد الفاظ پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多的唯一字

source: Learner-specific content, such as learner grades and discussion forum data
ar: محتوى خاص بالمتعلم ، مثل درجات المتعلم وبيانات منتدى المناقشة
ur: سیکھنے والے مخصوص مواد، جیسے سیکرٹری گریڈ اور بحث فورم کے اعداد و شمار
zh_cn: 学习者的具体内容，例如学习成绩和论坛数据

source: Track refunds issued directly through CyberSource.
ar: تتبع المبالغ المستردة مباشرة من خلال CyberSource.
ur: سائبر ایسورس کے ذریعہ براہ راست جاری کردہ رقم کی واپسی کی ٹریک کریں.
zh_cn: 通过Cyber​​Source直接发送跟踪退款。

source: Account creation not allowed.
ar: إنشاء الحساب غير مسموح به.
ur: اکاؤنٹ تخلیق کی اجازت نہیں ہے.
zh_cn: 帐户创建不允许。

source: Load new course from GitHub
ar: تحميل دورة جديدة من جيثب
ur: GitHub سے نیا کورس لوڈ کریں
zh_cn: 从GitHub加载新课程

source: Payment Amount
ar: مبلغ الدفعة
ur: ادائیگی کی رقم
zh_cn: 支付金额

source: Welcome!
ar: أهلا بك!
ur: خوش آمدید!
zh_cn: 欢迎！

source: The country to which this rule applies.
ar: البلد الذي تنطبق عليه هذه القاعدة.
ur: اس ملک کا جس اصول پر لاگو ہوتا ہے.
zh_cn: 适用此规则的国家/地区。

source: Currently Enrolled
ar: المسجلين حاليا
ur: فی الحال داخلا
zh_cn: 目前就读

source: Details for each chapter
ar: التفاصيل لكل فصل
ur: ہر باب کے لئے تفصیلات
zh_cn: 每章的详细信息

source: Course Survey URL
ar: عنوان مسح المقرر
ur: کورس سروے URL
zh_cn: 课程调查网址

source: Gross Revenue Collected
ar: إجمالي الإيرادات المجمعة
ur: مجموعی آمدنی جمع
zh_cn: 收入总收入

source: The amount charged by the processor {charged_amount} {charged_amount_currency} is different than the total cost of the order {total_cost} {total_cost_currency}.
ar: يختلف المبلغ الذي يتقاضاه المعالج {charged_amount} {charged_amount_currency} عن إجمالي تكلفة الطلب {total_cost} {total_cost_currency}.
ur: {charge_amount} {charged_amount_currency} کے پروسیسر کی چارج رقم {total_cost} {total_cost_currency} کی کل قیمت سے مختلف ہے.
zh_cn: 处理器{charge_amount} {charged_amount_currency}收取的金额与订单{total_cost} {total_cost_currency}的总成本不同。

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
ar: معرف فريد لمزود الائتمان هذا. يتم السماح فقط بالأحرف الأبجدية الرقمية والواصلات (-). المعرّف حساس لحالة الأحرف.
ur: اس کریڈٹ فراہم کنندہ کے لئے منفرد شناختی. صرف حروف تہجی حروف اور ہائفینس (-) کی اجازت ہے. شناختی کار کیس حساس ہے.
zh_cn: 此信贷提供者的唯一标识符。只允许使用字母数字字符和连字符（ - ）。标识符区分大小写。

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
ar: عند دمج مراجعة مع التيار ، سيتم الاحتفاظ بجميع البيانات من كلا الإصدارين والدمج في موقعها التقريبي من كل مراجعة.
ur: جب آپ موجودہ کے ساتھ تجزیہ کرتے ہیں تو، تمام اعداد و شمار کو دونوں ورژنوں سے برقرار رکھا جائے گا اور ہر نظر ثانی سے اس کی متوقع مقام پر مل جائے گا.
zh_cn: 将修订与当前合并时，所有数据都将从两个版本中保留，并在每个修订的大致位置合并。

source: Search
ar: بحث
ur: تلاش کریں
zh_cn: 搜索

source: Upgrade to earn a verified certificate in %(first_course_name)s
ar: الترقية للحصول على شهادة تم التحقق منها في٪ (first_course_name) s
ur: ٪ (first_course_name) میں تصدیق شدہ سرٹیفکیٹ حاصل کرنے کے لئے اپ گریڈ کریں
zh_cn: 升级以获得％（first_course_name）s中的已验证证书

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: {msg} Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: آسف! أرسل لنا معالج الدفع لدينا تأكيدًا للدفع كان يتضمن بيانات غير متسقة! نعتذر لعدم تمكننا من التحقق مما إذا كان قد تم تحصيل الرسوم واتخاذ إجراء آخر بشأن طلبك. رسالة الخطأ المحددة هي: {msg} ربما تم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے ہمیں ایک ادائیگی کی توثیق واپس بھیج دی جس میں متضاد ڈیٹا تھا. ہم معذرت کرتے ہیں کہ ہم اس بات کی توثیق نہیں کر سکتے ہیں کہ یہ چارج آپ کے آرڈر پر چلا گیا ہے اور مزید کارروائی لیتا ہے. مخصوص غلطی کا پیغام یہ ہے: {msg} آپ کا کریڈٹ کارڈ ممکنہ طور پر چارج کیا جاسکتا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理员向我们发回了一份支付确认信息，其中包含不一致的数很抱歉，我们无法验证收费是否已完成，并对订单采取进一步行动。具体的错误信息是：{msg}您的信用卡可能已经收费。请通过{email}与我们联系并提供特定付款问题。

source: {platform_name} {studio_name}: Task Status Update
ar: {platform_name} {studio_name}: تحديث حالة المهمة
ur: {platform_name} {سٹوڈیو_ نام}: ٹاسک اسٹیٹ اپ ڈیٹ
zh_cn: {platform_name} {studio_name}：任务状态更新

source: Group Configurations
ar: تكوينات المجموعة
ur: گروپ کی ترتیبات
zh_cn: 组配置

source: Many %(platform_name)s learners in %(course_name)s are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: العديد من المتابعين (platform_name) s في٪ (course_name) s يكملون المزيد من المشاكل كل أسبوع ، ويشتركون في منتديات المناقشة. ماذا تريد أن تفعل للحفاظ على التعلم؟
ur: ٪ (platform_name) میں٪ بہت سے٪ (platform_name) سیکھنے والے ہر ہفتے زیادہ مسائل کو پورا کر رہے ہیں اور بحث کے فورمز میں شرکت کرتے ہیں. سیکھنا رکھنے کے لئے آپ کیا کرنا چاہتے ہیں؟
zh_cn: 很多％（platform_name）的％（course_name）学习者每周都会完成更多问题，并参与讨论论坛。你想做什么来继续学习？

source: You are resetting passwords too frequently. Due to security policies, {num} day must elapse between password resets.
ar: أنت تعيد تعيين كلمات المرور بشكل متكرر للغاية. نظرًا لسياسات الأمان ، يجب انقضاء يوم {num} بين عمليات إعادة تعيين كلمة المرور.
ur: آپ پاس ورڈ بھی ری سیٹ کر رہے ہیں. سیکیورٹی کی پالیسیوں کی وجہ سے، {num} دن پاس ورڈ ری سیٹ کے درمیان گزرنا چاہیے.
zh_cn: 您经常重置密码。由于安全政策，密码重置之间必须经过{num}日。

source: Dashboard
ar: لوحة القيادة
ur: ڈیش بورڈ
zh_cn: 仪表板

source: Coupon (%)
ar: الكوبون (٪)
ur: کوپن (٪)
zh_cn: 优惠券（％）

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
ar: تلتزم EdX بجعلك قادراً على أخذ دورات عالية الجودة من المؤسسات الرائدة بغض النظر عن وضعك المالي ، والحصول على شهادة التحقق ، ومشاركة نجاحك مع الآخرين.
ur: ایڈیکس آپ کو ممکنہ طور پر آپ کے مالیاتی صورتحال سے قطع نظر، تصدیق شدہ سرٹیفکیٹ حاصل کرنے، اور دوسروں کے ساتھ اپنی کامیابی کا حصول کرنے کے بغیر، اعلی اداروں سے اعلی معیار کے کورسز لینے کے لئے یہ ممکن بنانا ہے.
zh_cn: EdX致力于使您无论您的财务状况如何，都能从领先机构接受高质量课程，获得认证证书并与他人分享您的成功。

source: To Use
ar: ليستخدم
ur: استمال کے لیے
zh_cn: 使用

source: (Maximum 128 characters)
ar: (128 حرفًا كحد أقصى)
ur: (زیادہ سے زیادہ 128 حروف)
zh_cn: （最多128个字符）

source: Doctorate
ar: دكتوراه
ur: ڈاکٹر
zh_cn: 博士学位

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
ar: يمكنك الآن البدء في التعلم باستخدام {platform_name} عن طريق تسجيل الدخول باستخدام <a rel="external" href="http://openid.net/">حساب OpenID</a> الخاص بك.
ur: اب آپ اپنے <a rel="external" href="http://openid.net/">OpenID اکاؤنٹ کے</a> ساتھ لاگ ان کرکے {platform_name} کے ساتھ سیکھنے شروع کر سکتے ہیں.
zh_cn: 您现在可以使用<a rel="external" href="http://openid.net/">OpenID帐户</a>登录，然后开始使用{platform_name}进行学习。
