Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Dashboard for:
ar: لوحة القيادة ل:
ur: ڈیش بورڈ کیلئے:
zh_cn: 仪表板：

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
ar: يجب عليك إكمال {link_start} {prc_display} {link_end} بنجاح قبل أن تبدأ هذه الدورة التدريبية.
ur: آپ کو یہ کورس شروع کرنے سے پہلے آپ {link_start} {prc_display} {link_end} کو کامیابی سے مکمل کرنا ضروری ہے.
zh_cn: 在开始本课程之前，您必须成功完成{link_start} {prc_display} {link_end}。

source: Analytics
ar: تحليلات
ur: تجزیات
zh_cn: Analytics（分析）

source: Course Warnings
ar: تحذيرات بالطبع
ur: کورس انتباہ
zh_cn: 课程警告

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
ar: سواء لتضمين أو استبعاد الدورة المحددة. إذا تم تحديد بلدان القائمة البيضاء ، فسيتمكن المستخدمون فقط من البلدان المدرجة في القائمة البيضاء من الوصول إلى الدورة التدريبية. إذا تم تحديد بلدان القائمة السوداء ، فلن يتمكن المستخدمون من البلدان المدرجة في القائمة السوداء من الوصول إلى الدورة التدريبية.
ur: دیئے گئے کورس کو شامل یا خارج کرنا چاہۓ. اگر ویٹسٹسٹ ملکوں کی وضاحت کی جاتی ہے تو، وائٹ لسٹ کردہ ممالک سے صرف صارفین کو کورس تک رسائی حاصل ہو گی. اگر بلیک لسٹ کے ملکوں کو مقرر کیا جاتا ہے تو، سیاہ لسٹ کردہ ممالک کے صارفین کو کورس تک رسائی حاصل نہیں ہو گی.
zh_cn: 是否包含或排除给定的课程。如果指定白名单国家，则只有来自列入白名单的国家/地区的用户才能访问该课程。如果指定了黑名单国家，那么来自黑名单国家的用户将无法访问该课程。

source: Total number of users
ar: العدد الإجمالي للمستخدمين
ur: صارفین کی کل تعداد
zh_cn: 用户总数

source: Upgrade to Verified Certificate
ar: الترقية إلى شهادة التحقق
ur: تصدیق شدہ سرٹیفکیٹ میں اپ گریڈ کریں
zh_cn: 升级到验证证书

source: Send to:
ar: ارسل إلى:
ur: کے لئے بھیج:
zh_cn: 发给：

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
ar: استخدم مفاتيح الأسهم للتنقل بين النصائح أو استخدم مفتاح tab للعودة إلى الحاسبة
ur: تجاویز کو نیویگیشن کے لۓ تیر والے بٹنوں کا استعمال کریں یا کیلکولیٹر پر واپس آنے کیلئے ٹیب کی چابی کا استعمال کریں
zh_cn: 使用箭头键浏览提示或使用Tab键返回计算器

source: Our mailing address is
ar: عنواننا البريدي هو
ur: ہمارا میل ایڈریس ہے
zh_cn: 我们的邮寄地址是

source: Your Platform Description Here
ar: وصف النظام الأساسي الخاص بك هنا
ur: آپ کے پلیٹ فارم کی تفصیل یہاں
zh_cn: 您的平台说明在这里

source: Bookmarked
ar: إشارة مرجعية
ur: بک مارک
zh_cn: 书签

source: {section_format} due {{date}}
ar: {section_format} المستحقة {{date}}
ur: {section_format} کی وجہ {{تاریخ}}
zh_cn: {section_format}截止日期{{date}}

source: Print or share your certificate:
ar: طباعة أو مشاركة شهادتك:
ur: اپنا سرٹیفکیٹ پرنٹ یا اشتراک کریں:
zh_cn: 打印或分享您的证书：

source: Admins are course team members who can add and remove other course team members.
ar: المشرفون هم أعضاء فريق الدورة التدريبية الذين يمكنهم إضافة أعضاء فريق الدورة التدريبية الآخرين وإزالتهم.
ur: اداروں کورس کے ٹیم کے ارکان ہیں جو دوسرے کورس کے ٹیم کے ارکان کو شامل اور ہٹ سکتے ہیں.
zh_cn: 管理员是课程团队成员，可以添加和删除其他课程团队成员。

source: Optional for citing source of any material used. Automatic citation can be done using <a href="http://easybib.com">EasyBib</a>
ar: اختياري لاستشهاد مصدر أي مادة مستخدمة. يمكن إجراء الاستشهاد التلقائي باستخدام برنامج <a href="http://easybib.com">EasyBib</a>
ur: استعمال کیا جاتا کسی بھی مواد کے ذریعہ کا حوالہ دینے کے لئے اختیاری. خودکار حوالہ <a href="http://easybib.com">آسان بب</a> کا استعمال کرتے ہوئے کیا جا سکتا ہے
zh_cn: 可选引用所用材料的来源。自动引用可以使用<a href="http://easybib.com">EasyBib</a>完成

source: Show Calculator
ar: عرض الحاسبة
ur: کیلکولیٹر دکھائیں
zh_cn: 显示计算器

source: Determines how content is drawn from the library
ar: يحدد كيفية رسم المحتوى من المكتبة
ur: لائبریری سے کس طرح مواد تیار کی جاتی ہے کا تعین کرتا ہے
zh_cn: 确定从库中获取内容的方式

source: # enrolled
ar: # المقيدين
ur: # اندراج
zh_cn: ＃已注册

source: Learner's {platform_name} email address or username
ar: عنوان البريد الإلكتروني أو اسم المستخدم الخاص بـ learner {platform_name}
ur: لیڈرر {platform_name} ای میل ایڈریس یا صارف نام
zh_cn: 学习者的{platform_name}电子邮件地址或用户名

source: Download CSV of Certificates Issued
ar: تنزيل CSV من الشهادات الصادرة
ur: تاریخی سرٹیفکیٹ کے سی ڈی وی ڈاؤن لوڈ کریں
zh_cn: 下载颁发的证书CSV

source: This team is already full.
ar: هذا الفريق ممتلئ بالفعل.
ur: یہ ٹیم پہلے سے ہی مکمل ہے.
zh_cn: 这个团队已经满员了。

source: You have not made any notes in this course yet. Other students in this course are using notes to:
ar: لم تقم بإبداء ملاحظات في هذه الدورة حتى الآن. يستخدم الطلاب الآخرون في هذه الدورة التدريبية الملاحظات من أجل:
ur: آپ نے اس کورس میں ابھی تک کوئی نوٹ نہیں بنایا ہے. اس کورس کے دوسرے طالب علموں کو نوٹوں کا استعمال کر رہے ہیں:
zh_cn: 你还没有在这个课程中做任何笔记。本课程中的其他学生正在使用笔记来：

source: Social Media Sharing URL
ar: عنوان URL الخاص بمشاركة الوسائط الاجتماعية
ur: سوشل میڈیا شیئرنگ یو آر ایل
zh_cn: 社交媒体分享网址

source: Unlocked
ar: مفتوحة
ur: کھلا
zh_cn: 解锁

source: Leeway on due dates
ar: فسحة على تواريخ الاستحقاق
ur: لیون کی وجہ سے تاریخوں پر
zh_cn: Leeway到期日

source: New title
ar: العنوان الجديد
ur: نیا عنوان
zh_cn: 新标题

source: There was an error creating this article: %s
ar: حدث خطأ أثناء إنشاء هذه المقالة:٪ s
ur: اس مضمون کو پیدا کرنے میں ایک غلطی تھی:٪ s
zh_cn: 创建此文章时出错：％s

source: There was an error creating this article.
ar: حدث خطأ أثناء إنشاء هذه المقالة.
ur: اس مضمون کی تخلیق میں ایک غلطی تھی.
zh_cn: 创建此文章时发生错误。

source: Please Wait
ar: أرجو الإنتظار
ur: برائے مہربانی انتظار کریں
zh_cn: 请稍候

source: Course has no entrance exam section.
ar: بالطبع لا يوجد لديه قسم امتحان القبول.
ur: کورس میں داخلہ امتحان کا حصہ نہیں ہے.
zh_cn: 课程没有入学考试部分。

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period. You can also specify a category as the default for new posts in the Discussion page by setting its "default" attribute to true. For example, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.
ar: أدخل فئات المناقشة بالتنسيق التالي: &quot;CategoryName&quot;: {&quot;id&quot;: &quot;i4x-InstitutionName-CourseNumber-course-CourseRun&quot;}. على سبيل المثال ، قد تكون إحدى فئات المناقشة هي &quot;Lydian Mode&quot;: {&quot;id&quot;: &quot;i4x-UniversityX-MUS101-course-2015_T1&quot;}. يجب أن تكون قيمة &quot;id&quot; لكل فئة فريدة. في قيم &quot;id&quot; ، تكون الأحرف الخاصة الوحيدة التي يتم دعمها هي الشرطة السفلية والواصلة والفترة. يمكنك أيضًا تحديد فئة كإعداد افتراضي للمشاركات الجديدة في صفحة المناقشة عن طريق تعيين السمة &quot;الافتراضية&quot; إلى true. على سبيل المثال ، &quot;Lydian Mode&quot;: {&quot;id&quot;: &quot;i4x-UniversityX-MUS101-course-2015_T1&quot;، &quot;default&quot;: true}.
ur: مندرجہ ذیل شکل میں بحث کی اقسام درج کریں: &quot;زمرہ نام&quot;: {&quot;id&quot;: &quot;i4x-institutionName-courseNumber-course-course-courses&quot;}. مثال کے طور پر، ایک بحث کی قسم &quot;Lydian موڈ&quot; ہوسکتی ہے: {&quot;id&quot;: &quot;i4x-universityX-MUS101-course-2015_T1&quot;}. ہر قسم کے لئے &quot;id&quot; قیمت منفرد ہونا ضروری ہے. &quot;id&quot; کے اقدار میں، اس کی حمایت کی جانے والی واحد خاص حروف underscore، ہائفن، اور مدت ہیں. آپ اس کے &quot;ڈیفالٹ&quot; خصوصیت کو درست کرنے کی طرف سے بحث کے صفحے میں نئے خطوط کے لئے ڈیفالٹ کے طور پر ایک قسم کی وضاحت بھی کرسکتے ہیں. مثال کے طور پر، &quot;لیڈین موڈ&quot;: {&quot;id&quot;: &quot;i4x-universityx-mUS101-course-2015_T1&quot;، &quot;default&quot;: true}.
zh_cn: 按照以下格式输入讨论类别：“CategoryName”：{“id”：“i4x-InstitutionName-CourseNumber-course-CourseRun”}。例如，一个讨论类别可以是“Lydian模式”：{“id”：“i4x-UniversityX-MUS101-course-2015_T1”}。每个类别的“id”值必须是唯一的。在“id”值中，唯一支持的特殊字符是下划线，连字符和句点。您还可以通过将“默认”属性设置为true来将“类别”指定为“讨论”页面中新帖子的默认类别。例如，“Lydian Mode”：{“id”：“i4x-UniversityX-MUS101-course-2015_T1”，“default”：true}。

source: Thanks, The {platform_name} Team
ar: شكرًا ، فريق {platform_name}
ur: شکریہ، {platform_name} ٹیم
zh_cn: 谢谢，{platform_name}团队

source: It works! This is the default homepage for this Open edX instance.
ar: إنها تعمل! هذه هي الصفحة الرئيسية الافتراضية لمثيل EDX المفتوح هذا.
ur: یہ کام کرتا ہے! یہ اس اوپن ایڈی ایکس مثال کے لئے ڈیفالٹ ہوم پیج ہے.
zh_cn: 有用！这是这个Open edX实例的默认主页。

source: Add diacritic marks to be added to a text using the comma-separated form, i.e. markname;urltomark;baseline,markname2;urltomark2;baseline2
ar: إضافة علامات التشكيل لتتم إضافتها إلى نص باستخدام نموذج مفصولة بفواصل ، مثل ، markname ؛ urltomark ؛ baseline ، markname2 ؛ urltomark2 ؛ baseline2
ur: کما الگ الگ فارم کا استعمال کرتے ہوئے ایک متن میں ڈایا آرٹک نشان شامل کریں، یعنی نشان، urltomark؛ بیس لائن، نشان زد 2؛ urltomark2؛ baseline2
zh_cn: 使用逗号分隔的形式添加要添加到文本的变音符号，例如markname; urltomark; baseline，markname2; urltomark2; baseline2

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
ar: أعضاء فريق الدورة التدريبية مع دور الموظفين هم المؤلفون المشاركون بالطبع. لديهم امتيازات الكتابة والتحرير الكاملة على جميع محتوى الدورة التدريبية.
ur: اسٹاف کردار کے ساتھ کورس کے ٹیم کے ارکان شریک مصنفین ہیں. انہوں نے تمام کورس کے مواد پر مکمل تحریری اور استحقاق میں ترمیم کیا ہے.
zh_cn: 担任教职员的课程团队成员是课程合着者。他们对所有课程内容拥有完整的写作和编辑权限。

source: Batch Beta Tester Addition
ar: الدفعة بيتا اختبار إضافة
ur: بیچ بیٹا ٹیسٹر اضافہ
zh_cn: 批量测试仪添加

source: group read access
ar: مجموعة قراءة الوصول
ur: گروپ تک رسائی حاصل ہے
zh_cn: 组阅读权限

source: Enter a coupon code.
ar: أدخل رمز القسيمة.
ur: کوپن کوڈ درج کریں.
zh_cn: 输入优惠券代码。

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
ar: بدأ طلب استرداد الأموال لـ {اسم المستخدم} ({email}). لمعالجة هذا الطلب ، يرجى زيارة الرابط (الروابط) أدناه.
ur: {صارف نام} ({ای میل}) کے لئے رقم کی واپسی کی درخواست شروع کی گئی ہے. اس درخواست پر عملدرآمد کرنے کے لئے، براہ مہربانی مندرجہ ذیل لنکس ملاحظہ کریں.
zh_cn: 已为{用户名}（{电子邮件}）发起退款请求。要处理此请求，请访问下面的链接。

source: Gross Revenue
ar: العائد الإجمالي
ur: مجموعی آمدنی
zh_cn: 总收入

source: Basic functions
ar: وظائف أساسية
ur: بنیادی افعال
zh_cn: 基本功能

source: Scores must be between 0 and the value of the problem.
ar: يجب أن تكون النقاط بين 0 وقيمة المشكلة.
ur: اسکور 0 اور مسئلہ کی قیمت کے درمیان ہونا ضروری ہے.
zh_cn: 分数必须介于0和问题的值之间。

source: {link_start}edX{link_end} offers interactive online classes and MOOCs from the world's best universities, including MIT, Harvard, Berkeley, University of Texas, and many others. edX is a non-profit online initiative created by founding partners Harvard and MIT.
ar: يقدم {link_start} edX {link_end} دروسًا تفاعلية عبر الإنترنت و MOOCs من أفضل الجامعات في العالم ، بما في ذلك معهد ماساتشوستس للتكنولوجيا وجامعة هارفارد وبيركلي وجامعة تكساس وغيرها الكثير. EDX هي مبادرة غير ربحية على الإنترنت تم إنشاؤها بواسطة الشركاء المؤسسين في هارفارد و MIT.
ur: {link_start} edX {link_end} دنیا کے بہترین یونیورسٹیوں میں انٹرایکٹو آن لائن کلاسز اور MOOCs پیش کرتا ہے، بشمول ایم آئی اے، ہارورڈ، برکلے، ٹیکساس یونیورسٹی، اور بہت سے دیگر سمیت. ایڈی ایکس بانی شراکت داروں کو ہارورڈ اور ایم آئی اے کے ذریعہ بنائے گئے غیر منافع بخش آن لائن پہل ہے.
zh_cn: {link_start} edX {link_end}提供来自世界一流大学的交互式在线课程和MOOC，包括麻省理工学院，哈佛大学，伯克利分校，德克萨斯大学等等。 edX是由创始合作伙伴哈佛和麻省理工学院创建的非营利网络计划。

source: The authorization request was approved by the issuing bank but declined by CyberSource.' Possible fix: retry with a different form of payment.
ar: تمت الموافقة على طلب التفويض من قِبل المصرف المُصدر ولكن تم رفضه بواسطة CyberSource. &#39; إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع مختلفة.
ur: اجازت بینک کی جانب سے منظوری دینے والے بینک کی منظوری دی گئی تھی مگر سائبر ایسسورس نے انکار کردیا. &#39; ممکنہ طے: مختلف ادائیگی کی ادائیگی کے ساتھ دوبارہ کوشش کریں.
zh_cn: 授权请求得到了发行银行的批准，但被Cyber​​Source拒绝。可能的解决方法：以不同的付款方式重试。

source: View Course in Studio
ar: عرض دورة في ستوديو
ur: سٹوڈیو میں کورس دیکھیں
zh_cn: 在Studio中查看课程

source: Cannot find user with email address {email_addr}
ar: لا يمكن العثور على مستخدم له عنوان بريد إلكتروني {email_addr}
ur: ای میل پتہ {email_addr} کے ساتھ صارف کو تلاش نہیں کرسکتا
zh_cn: 使用电子邮件地址{email_addr}找不到用户

source: The public display name for your library.
ar: اسم العرض العام لمكتبتك.
ur: آپ کی لائبریری کے لئے عوامی ڈسپلے کا نام.
zh_cn: 您的图书馆的公开显示名称。

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
ar: أدخل العنوان الذي تريد أن يراه الطلاب فوق نشرات الدورة التدريبية الخاصة بك في الصفحة الرئيسية للدورة التدريبية. تظهر نشرات الدورة التدريبية الخاصة بك في اللوحة اليمنى من الصفحة.
ur: عنوان داخل کریں کہ آپ چاہتے ہیں کہ طالب علم کورس ہوم پیج پر اپنے کورس کے ہاتھوں سے اوپر دیکھیں. آپ کے کورس ہینڈ آؤٹس صفحے کے دائیں پینل میں موجود ہیں.
zh_cn: 输入您希望学生在课程主页上看到课程讲义之上的标题。您的课程讲义出现在页面的右侧面板中。

source: Name
ar: اسم
ur: نام
zh_cn: 名称

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر ، ضع عدد الدورات التدريبية المكتملة لمنح شارة ، وفاصلة ، وسلسلة فئة شارة قمت بإنشائها تحتوي على مكون الإصدار &#39;openx__course&#39;. على سبيل المثال: 3 ، enrolled_3_courses
ur: ہر لائن پر، مکمل کورسوں کی تعداد میں بیز ایوارڈ، ایک کما، اور جس نے آپ نے تخلیق کیا ہے اس کی بناء پر سوراخ کرنے والی &#39;&#39; openx__course &#39;&#39; جاری کرنے کا حصہ ہے. مثال کے طور پر: 3، نامزد شدہ_3_غیر
zh_cn: 在每一行中，将已完成的课程数量授予一个逗号的徽章，以及您创建的拥有发行组件“openedx__course”的徽章类别的徽章。例如：3，enrolled_3_courses

source: Password reset unsuccessful
ar: إعادة ضبط كلمة المرور غير ناجحة
ur: پاس ورڈ دوبارہ ترتیب ناکام ہے
zh_cn: 密码重置不成功

source: Highest Level of Education Completed
ar: اعلى مستويات التعلم قد اكتملت
ur: تعلیم کی سب سے زیادہ سطح مکمل
zh_cn: 最高学历完成

source: Course Team Data
ar: بيانات فريق الدورة التدريبية
ur: کورس ٹیم کے اعداد و شمار
zh_cn: 课程团队数据

source: Duplicate of {0}
ar: تكرار من {0}
ur: {0} کا نقل
zh_cn: 重复的{0}

source: Enrollment Date
ar: تاريخ التسجيل
ur: اندراج کی تاریخ
zh_cn: 开学报道日

source: Beta Testers
ar: اختبار بيتا
ur: بیٹا ٹیسرز
zh_cn: Beta测试者

source: No answer entered!
ar: لا إجابة دخلت!
ur: کوئی جواب درج نہیں
zh_cn: 没有回答！

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ar: المقدمات ، المتطلبات الأساسية ، الأسئلة الشائعة التي يتم استخدامها في {a_link_start} صفحة ملخص الدورة التدريبية الخاصة بك {a_link_end} (تم تنسيقها في HTML)
ur: {a_link_start} پر اپنے کورس خلاصہ صفحے {a_link_end} پر استعمال کی جانے والی تعارف، ضروریات، سوالات، (HTML میں فارمیٹ)
zh_cn: 介绍，先决条件，{a_link_start}课程摘要页面{a_link_end}上使用的常见问题解答（HTML格式）

source: Work in Teams
ar: العمل ضمن فرق
ur: ٹیموں میں کام
zh_cn: 在团队工作

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: دورتك الحالية ليس لديها صورة. يرجى تحميل واحد (بتنسيق JPEG أو PNG ، والحد الأدنى للأبعاد المقترحة هو 375 بكسل × 200 بكسل)
ur: آپ کا کورس فی الحال ایک تصویر نہیں ہے. براہ کرم ایک اپ لوڈ کریں (JPEG یا PNG کی شکل، اور کم از کم تجویز کردہ طول و عرض 375px وسیع 200px کی طرف سے وسیع ہیں)
zh_cn: 你的课程目前没有图像。请上传一张（JPEG或PNG格式，最小建议尺寸为375px宽×200px高）

source: {header_open}{title}{header_close}{body}
ar: {header_open} {عنوان} {} {header_close الجسم}
ur: {header_open} {عنوان} {header_close} {جسم}
zh_cn: {header_open} {标题} {header_close} {体}

source: Username must be between {min} and {max} characters long.
ar: يجب أن يكون اسم المستخدم بين {min} و {max} من الأحرف.
ur: صارف کا نام {منٹ} اور {زیادہ سے زیادہ} حروف طویل ہونا چاہئے.
zh_cn: 用户名必须介于{min}和{max}个字符之间。

source: Course Export
ar: تصدير دورة
ur: کورس ایکسپورٹ
zh_cn: 课程导出

source: {fullname}, you earned a certificate!
ar: {fullname} ، لقد حصلت على شهادة!
ur: {fullname}، آپ نے ایک سرٹیفکیٹ حاصل کی!
zh_cn: {全名}，您获得了证书！

source: The payment processor returned a badly-typed value {value} for parameter {parameter}.
ar: قام معالج الدفع بإرجاع قيمة {@} سيئة القيمة للمعلمة {parameter}.
ur: ادائیگی کے پروسیسر پیرامیٹر {پیرامیٹر} کے لئے خرابی سے ٹائپ کردہ قیمت {قدر} واپس آ گئی.
zh_cn: 支付处理器为参数{parameter}返回了一个错误类型的值{value}。

source: Enter the username of the owner.
ar: أدخل اسم المستخدم الخاص بالمالك.
ur: مالک کا صارف نام درج کریں.
zh_cn: 输入所有者的用户名。

source: Course {course_id} does not exist.
ar: الدورة التدريبية {course_id} غير موجودة.
ur: کورس {course_id} موجود نہیں ہے.
zh_cn: 课程{course_id}不存在。

source: Unable to commit changes. This is usually because there are no changes to be committed
ar: غير قادر على ارتكاب التغييرات. هذا عادة بسبب عدم وجود تغييرات يتم الالتزام بها
ur: تبدیلیاں کرنے میں ناکام یہ عام طور پر ہے کیونکہ ارتکاب کرنے میں کوئی تبدیلی نہیں ہے
zh_cn: 无法提交更改。这通常是因为没有更改要提交

source: Common {studio_name} Questions
ur: عام {سٹوڈیو_نام} سوالات
zh_cn: Common {studio_name}问题

source: No data provided.
ar: لا توجد بيانات المقدمة.
ur: کوئی ڈیٹا مہیا نہیں
zh_cn: 没有提供数据。

source: In order to qualify for a certificate, you must meet all course grading requirements, upgrade before the course deadline, and successfully verify your identity on {platform_name} if you have not done so already.{button_panel}
ar: لكي تكون مؤهلاً للحصول على شهادة ، يجب أن تفي بجميع متطلبات تقدير الدورة التدريبية ، والترقية قبل الموعد النهائي للدورة ، والتحقق بنجاح من هويتك على {platform_name} إذا لم تكن قد قمت بذلك بالفعل. {button_panel}
ur: ایک سرٹیفکیٹ کے لئے کوالیفائیٹ کرنے کے لئے، آپ لازمی کورس کے معیار کی ضروریات کو پورا کرنا چاہتے ہیں، کورس کے آخری وقت سے قبل اپ گریڈ کریں اور {platform_name} پر اپنی شناخت کو کامیابی سے توثیق کریں تو آپ نے ایسا ہی نہیں کیا. {button_panel}
zh_cn: 为了符合获得证书的资格，您必须符合所有课程评分要求，在课程截止日期前升级，并在{platform_name}上成功验证您的身份（如果您尚未这样做）。{button_panel}

source: Asset's unique slug. We can reference the asset in templates using this value.
ar: سبيكة فريدة من نوعها في الأصول. يمكننا الرجوع إلى الأصل في القوالب باستخدام هذه القيمة.
ur: اثاثہ کی منفرد سلگ. ہم اس قیمت کا استعمال کرتے ہوئے ٹیمپلیٹس میں اثاثہ حوالہ دیتے ہیں.
zh_cn: 资产独特的slu。。我们可以使用这个值在模板中引用资产。

source: {refresh_icon} Update now.
ar: {refresh_icon} التحديث الآن.
ur: {تازہ ترین_icon} اب اپ ڈیٹ کریں.
zh_cn: {refresh_icon}立即更新。

source: No file provided for profile image
ar: لم يتم توفير ملف لصورة الملف الشخصي
ur: پروفائل کی تصویر کے لئے کوئی فائل فراہم نہیں کی گئی
zh_cn: 没有文件提供给个人资料图片

source: Updating Library
ar: تحديث المكتبة
ur: لائبریری کو اپ ڈیٹ کرنا
zh_cn: 更新库

source: Correct or Past Due
ar: صحيح أو الماضي المستحق
ur: درست یا ماضی کی وجہ سے
zh_cn: 正确或逾期

source: Because the course has ended, this assignment is hidden from the learner.
ar: لأن الدورة قد انتهت ، يتم إخفاء هذه المهمة من المتعلم.
ur: کیونکہ کورس ختم ہو گیا ہے، اس تفویض سیکھنے سے پوشیدہ ہے.
zh_cn: 因为课程已经结束，这项任务对学习者来说是隐藏的。

source: Wed
ar: تزوج
ur: بدھ
zh_cn: 星期三

source: Organization:
ar: منظمة:
ur: تنظیم:
zh_cn: 组织：

source: coupon with the coupon id ({coupon_id}) updated Successfully
ar: تم تحديث القسيمة التي تحمل رقم القسيمة ({coupon_id}) بنجاح
ur: کوپن ID ({coupon_id}) کے ساتھ کوپن کامیابی سے اپ ڈیٹ کیا
zh_cn: 优惠券ID（{coupon_id}）已成功更新

source: Export My Library Content
ar: تصدير محتوى مكتبتي
ur: میرا لائبریری مواد برآمد کریں
zh_cn: 导出我的图书馆内容

source: Course {course_id} requires {prerequisite_course_id}
ar: تتطلب الدورة التدريبية {course_id} {prerequisite_course_id}
ur: کورس {course_id} کی ضرورت ہے {prerequisite_course_id}
zh_cn: 课程{course_id}需要{prerequisite_course_id}

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
ar: تم بالفعل بطلان شهادة {user}. الرجاء التحقق من التهجئة وإعادة المحاولة.
ur: {صارف} کے سرٹیفکیٹ پہلے ہی باطل کردیا گیا ہے. براہ کرم اپنا ہجے چیک کریں اور دوبارہ کوشش کریں.
zh_cn: {user}的证书已经失效。请检查您的拼写并重试。

source: Comments
ar: تعليقات
ur: تبصرے
zh_cn: 注释

source: Did your e-mail client break the URL into two lines?
ar: هل قام عميل البريد الإلكتروني بكسر عنوان URL في سطرين؟
ur: کیا آپ کے ای میل کلائنٹ نے URL کو دو لائنوں میں توڑ دیا؟
zh_cn: 您的电子邮件客户端是否将URL分成两行？

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
ar: المراجعة التي يتم عرضها لهذه المقالة. إذا كنت بحاجة إلى إجراء التراجع ، فما عليك سوى تغيير قيمة هذا الحقل.
ur: اس آرٹیکل کے لئے نظر ثانی کی گئی. اگر آپ کو رول کے پیچھے کرنے کی ضرورت ہو تو، اس فیلڈ کی قیمت کو آسانی سے تبدیل کریں.
zh_cn: 正在为此文章显示的修订版本。如果您需要回滚，只需更改此字段的值。

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: الوقت الذي تريد فيه توقف الفيديو إذا كنت لا تريد تشغيل الفيديو بالكامل. غير مدعوم في تطبيق الجوال الأصلي: سيتم تشغيل ملف الفيديو بالكامل. منسق كـ HH: MM: SS. القيمة القصوى هي 23:59:59.
ur: جب آپ چاہتے ہیں کہ آپ ویڈیو کو روکنے کے لئے ویڈیو چاہتے ہیں تو آپ پورے ویڈیو کو کھیلنے کے لئے نہیں چاہتے ہیں. مقامی موبائل ایپ میں معاون نہیں ہے: مکمل ویڈیو فائل کھیلے گی. ایچ ایچ کے طور پر تشکیل دی گئی: ایم ایم: ایس ایس. زیادہ سے زیادہ قیمت 23:59:59 ہے.
zh_cn: 如果您不希望整个视频播放，您希望视频停止播放。原生移动应用不支持：完整的视频文件将播放。格式化为HH：MM：SS。最大值是23:59:59。

source: Display Name
ar: اسم العرض
ur: ڈسپلے کا نام
zh_cn: 显示名称

source: If you select this option, only course team members with the Staff or Admin role see this page.
ar: إذا حددت هذا الخيار ، فسيشاهد هذه الصفحة أعضاء فريق الدورة التدريبية فقط ذوي الموظفين أو دور المشرف.
ur: اگر آپ اس اختیار کو منتخب کرتے ہیں تو، صرف ٹیم ٹیم کے اسٹاف یا ایڈمن کردار کے ساتھ ہی اس صفحہ کو دیکھیں.
zh_cn: 如果您选择此选项，则只有具有“职员”或“管理员”角色的课程组成员才能看到此页面。

source: Users with due date extensions for {0}
ar: المستخدمون الذين لديهم إضافات تواريخ مستحقة لـ {0}
ur: {0} کے لئے متوقع تاریخ کے ساتھ صارفین
zh_cn: 截止日期为{0}的用户

source: By default, 48 hours after course end date
ar: بشكل افتراضي ، بعد 48 ساعة من تاريخ انتهاء الدورة التدريبية
ur: ڈیفالٹ کی طرف سے، کورس کے آخری تاریخ کے بعد 48 گھنٹے
zh_cn: 默认情况下，课程结束日期后48小时

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
ar: حدد ما إذا كان يجب على الطلاب إكمال استطلاع الرأي قبل أن يتمكنوا من عرض محتوى الدورة التدريبية الخاصة بك. إذا قمت بتعيين هذه القيمة إلى true ، فيجب إضافة اسم للاستقصاء إلى إعداد Course Survey Name (إعداد مسح الدورة التدريبية) أعلاه.
ur: اس بات کی وضاحت کریں کہ آیا آپکے کورس کے مواد کو دیکھنے سے قبل طالب علموں کو ایک سروے مکمل کرنا ضروری ہے. اگر آپ اس قیمت کو درست کرنے کے لئے مقرر کرتے ہیں، تو آپ کو سروے کے لئے ایک نام شامل کرنا لازمی طور پر کورس سروے نام کی ترتیب میں شامل کرنا ہوگا.
zh_cn: 指定学生是否必须完成调查才能查看课程内容。如果您将此值设置为true，则必须将调查的名称添加到上面的课程调查名称设置中。

source: Mode {mode} does not exist for {course_id}
ar: الوضع {mode} غير موجود لـ {course_id}
ur: {course_id} کیلئے موڈ {موڈ} موجود نہیں ہے
zh_cn: {course_id}不存在{mode}模式

source: Whether to restrict enrollment to invitation by the course staff.
ar: ما إذا كان سيتم تقييد التسجيل للدعوة من قبل موظفي الدورة التدريبية.
ur: چاہے کورس کے عملے کی طرف سے دعوت نامے میں اندراج کو محدود کریں.
zh_cn: 是否限制课程人员的邀请。

source: Download Used Enrollment Codes
ar: تنزيل أكواد التسجيل المستخدمة
ur: استعمال کردہ اندراج کوڈز ڈاؤن لوڈ کریں
zh_cn: 下载使用的注册码

source: Help Center
ar: مركز المساعدة
ur: مدداور تعاون کا مرکز
zh_cn: 帮助中心

source: Attribution
ar: عزو
ur: انتباہ
zh_cn: 归因
