Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Return to the {link_start}home page{link_end}.
ar: ارجع إلى {link_start} الصفحة الرئيسية {link_end}.
ur: {link_start} ہوم پیج {link_end} پر واپس جائیں.
zh_cn: 返回{link_start}主页{link_end}。

source: Professional Ed
ar: إد المهنية
ur: پروفیشنل ایڈ
zh_cn: 专业版

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
ar: يتم عرض النسخة السابقة لهذا المكون الإضافي.إذا كنت بحاجة إلى إجراء التراجع ، ما عليك سوى تغيير قيمة هذا الحقل.
ur: اس پلگ ان کے لئے تجزیہ کیا جا رہا ہے. اگر آپ کو رول کے پیچھے کرنے کی ضرورت ہے، تو صرف اس فیلڈ کی قیمت کو تبدیل کریں.
zh_cn: 显示此插件的修订版本。如果您需要回滚，只需更改此字段的值即可。

source: The article "%s" and its children are now restored.
ar: تتم الآن استعادة المقالة &quot;٪ s&quot; وأطفالها.
ur: آرٹیکل &quot;٪ s&quot; اور اسکے بچوں کو بحال کیا گیا ہے.
zh_cn: 文章“％s”及其子女现在已经恢复。

source: Transcript file format to download by user.
ar: تنسيق ملف النص للتنزيل من قبل المستخدم.
ur: صارف کی طرف سے ڈاؤن لوڈ کرنے کے لئے ٹرانسپٹ فائل کی شکل.
zh_cn: 脚本文件格式由用户下载。

source: Global
ar: عالمي
ur: گلوبل
zh_cn: 全球

source: Invoice number {0} has been invalidated.
ar: تم إلغاء رقم الفاتورة {0}.
ur: انوائس نمبر {0} کو باطل کردیا گیا ہے.
zh_cn: 发票号码{0}已失效。

source: Rank
ar: مرتبة
ur: رینک
zh_cn: 秩

source: API key for accessing Sailthru.
ar: مفتاح API للوصول إلى Sailthru.
ur: Sailthru تک رسائی حاصل کرنے کے لئے API کی کلیدی.
zh_cn: 访问Sailthru的API密钥。

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resume, or post it directly on LinkedIn
ar: {b_start} المشاركة بسهولة: {b_end} إضافة الشهادة إلى سيرتك الذاتية أو السيرة الذاتية ، أو نشرها مباشرة على LinkedIn
ur: {b_start} آسانی سے قابل حصول: {b_end} سرٹیفکیٹ آپ کے CV میں شامل کریں یا دوبارہ شروع کریں، یا اسے براہ راست لنکڈ پر بھیجیں
zh_cn: {b_start}轻松分享：{b_end}将证书添加到您的简历或简历中，或直接在LinkedIn上发布

source: Wiki attachments
ar: مرفقات ويكي
ur: ویکیپیڈیا منسلک
zh_cn: Wiki附件

source: Tag
ar: بطاقة
ur: ٹیگ
zh_cn: 标签

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
ar: عرض حالة مهام الإنقاذ التي قدمتها لهذا الاختبار للمتعلم والدخول.
ur: اس سیکھنے اور داخلے کے امتحان کے لئے آپ کو جمع کردہ دوبارہ کام کرنے والے کاموں کے لئے حیثیت دکھائیں.
zh_cn: 显示您为此学员和入学考试提交的重新分级任务的状态。

source: Please choose an option
ar: الرجاء تحديد خيار
ur: ایک اختیار منتخب کریں
zh_cn: 请选择一个选项

source: Fully Supported
ar: بدعم كامل
ur: مکمل طور پر حمایت کی
zh_cn: 完全支持

source: Download {cert_name_short} (PDF)
ar: تنزيل {cert_name_short} (ملف PDF)
ur: {cert_name_short} (پی ڈی ایف) ڈاؤن لوڈ کریں
zh_cn: 下载{cert_name_short}（PDF）

source: Selected price is not valid number.
ar: السعر المحدد ليس رقمًا صالحًا.
ur: منتخب قیمت درست نمبر نہیں ہے.
zh_cn: 选定的价格是无效的数字。

source: Code Redeemed Count
ar: كود استرد العد
ur: کوڈ کم از کم شمار

source: Are you staff on an existing {studio_name} course?
ar: هل أنت موظف في دورة تدريبية {studio_name} الحالية؟
ur: کیا آپ ایک موجودہ {studio_name} کورس پر عملدرآمد ہیں؟
zh_cn: 您是否在现有的{studio_name}课程上工作？

source: Library Export Status
ar: حالة تصدير المكتبة
ur: لائبریری برآمد کی حیثیت
zh_cn: 图书馆出口状况

source: Weibo
ar: ويبو
ur: ویوبو

source: User profile
ar: ملف تعريفي للمستخدم
ur: صارف پروفائل
zh_cn: 用户资料

source: An error occurred. Try loading the page again.
ar: حدث خطأ. حاول تحميل الصفحة مرة أخرى.
ur: ایک خرابی آگئی. دوبارہ صفحہ لوڈ کرنے کی کوشش کریں.
zh_cn: 发生错误。尝试再次加载页面。

source: {user} does not exist in the LMS. Please check your spelling and retry.
ar: {user} غير موجود في LMS. الرجاء التحقق من التهجئة وإعادة المحاولة.
ur: {صارف} LMS میں موجود نہیں ہے. براہ کرم اپنا ہجے چیک کریں اور دوبارہ کوشش کریں.
zh_cn: {用户}在LMS中不存在。请检查您的拼写并重试。

source: List of Textbook objects with (title, url) for textbooks used in this course
ar: قائمة كائنات الكتاب المدرسي مع (title، url) للكتب المدرسية المستخدمة في هذه الدورة
ur: اس نصاب میں استعمال کردہ درسی کتابوں کے لئے (عنوان، url) کے ساتھ ٹیکسٹ بکس اشیاء کی فہرست
zh_cn: 带有（标题，网址）的课本对象列表

source: Activate Course Enrollment
ar: تفعيل تسجيل الدورة التدريبية
ur: کورس کے اندراج کو چالو کریں
zh_cn: 激活课程注册

source: User Survey
ar: مسح المستخدم
ur: صارف سروے
zh_cn: 用户调查

source: Check here to apply the above permissions recursively to articles under this one.
ar: تحقق هنا لتطبيق الأذونات المذكورة أعلاه بشكل متكرر على المقالات الموجودة تحت هذه المقالة.
ur: مندرجہ بالا مضامین کو دوبارہ مندرجہ ذیل اجازتوں کو لاگو کرنے کیلئے یہاں چیک کریں.
zh_cn: 在这里检查以递归方式将上述权限应用于此项下的文章。

source: Resubmit Invoice
ar: إعادة إرسال الفاتورة
ur: انوائس دوبارہ بھیج دیں
zh_cn: 重新提交发票

source: Annotation Input
ar: إدخال التعليقات التوضيحية
ur: تشریح ان پٹ
zh_cn: 注释输入

source: Failed
ar: فشل
ur: ناکام
zh_cn: 失败

source: Miniature Markdown Guide
ar: دليل تخفيض السعر المصغر
ur: مختصر نشریات گائیڈ
zh_cn: 微缩减价指南

source: Subsection
ar: القسم الفرعي
ur: سبسکرائب
zh_cn: 第

source: See an example
ar: انظر على سبيل المثال
ur: ایک مثال دیکھیں
zh_cn: 看一个例子

source: Handout Navigation
ar: الملاحة الإنتقال
ur: ہینڈ آؤٹ نیویگیشن
zh_cn: 讲义导航

source: This will be used in public discussions with your courses and in our edX101 support forums
ar: سيتم استخدام هذا في المناقشات العامة مع دوراتك وفي منتديات دعم edX101
ur: یہ آپ کے کورسز اور ہمارے edX101 سپورٹ فورمز کے ساتھ عوامی بات چیت میں استعمال کیا جائے گا
zh_cn: 这将用于与您的课程和我们的edX101支持论坛进行公开讨论

source: (Source code line unavailable)
ar: (خط كود المصدر غير متاح)
ur: (ماخذ کوڈ لائن دستیاب نہیں)
zh_cn: （源代码行不可用）

source: Create a re-run of a course
ar: إنشاء إعادة تشغيل دورة تدريبية
ur: ایک کورس کا دوبارہ حصہ بنائیں
zh_cn: 创建课程的重新运行

source: edX Inc.
ur: ایڈی ایکس انکارپوریٹڈ

source: The status of the payment or refund. 'started' means that payment is expected, but money has not yet been transferred. 'completed' means that the payment or refund was received. 'cancelled' means that payment or refund was expected, but was cancelled before money was transferred.
ar: حالة الدفع أو الاسترداد. &quot;بدأ&quot; يعني أن الدفع متوقع ، ولكن لم يتم تحويل الأموال بعد. &quot;مكتمل&quot; يعني أنه تم استلام الدفعة أو رد الأموال. &quot;ملغى&quot; يعني أنه كان من المتوقع الدفع أو الاسترداد ، ولكن تم إلغاؤه قبل تحويل الأموال.
ur: ادائیگی یا واپسی کی حیثیت. &#39;شروع&#39; کا مطلب یہ ہے کہ ادائیگی کی توقع کی جاتی ہے، لیکن رقم ابھی تک منتقلی نہیں ہوئی ہے. &#39;مکمل&#39; کا مطلب ہے کہ ادائیگی یا واپسی موصول ہوئی تھی. &#39;منسوخ&#39; کا مطلب یہ ہے کہ ادائیگی یا رقم کی واپسی کی توقع کی گئی تھی، لیکن پیسہ منتقل کرنے سے قبل منسوخ کردیا گیا تھا.
zh_cn: 付款或退款的状态。 &#39;开始&#39;意味着预期付款，但钱尚未转移。 &#39;已完成&#39;表示已收到付款或退款。 &#39;取消&#39;意味着预期付款或退款，但在转帐前被取消。

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
ar: ارجع إلى {homepage} أو أطلعنا على أي صفحات ربما تم نقلها على {email}.
ur: {ہوم پیج} پر واپس جائیں یا ہمیں کسی ایسے صفحات کے بارے میں بتائیں جو شاید ای میل پر منتقل ہوسکیں.
zh_cn: 返回{homepage}或让我们了解可能已在{email}中移动的任何网页。

source: View Updates in Studio
ar: عرض التحديثات في ستوديو
ur: سٹوڈیو میں اپ ڈیٹس دیکھیں
zh_cn: 在Studio中查看更新

source: Find Courses
ar: البحث عن الدورات
ur: کورسز تلاش کریں
zh_cn: 查找课程

source: Expected a {expected_tag} tag; got {given_tag} instead
ar: توقع علامة {expected_tag} ؛ حصلت على {given_tag} بدلاً من ذلك
ur: {expect_tag} ٹیگ کی توقع؛ بجائے {given_tag} بجائے
zh_cn: 预计有{expected_tag}标签;取而代之的是{given_tag}

source: Article for object
ar: المادة للكائن
ur: اعتراض کے لئے آرٹیکل
zh_cn: 物品

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
ar: يمكن دائمًا إنشاء مجموعات XBlock / القالب الممكّنة بدعم كامل أو مؤقت في Studio. تتطلب مجموعات XBlock / القالب غير المدعومة اشتراك مؤلف الدورة التدريبية.
ur: فعال XBlock / ٹیمپلیٹ مجموعہ مجموعی طور پر یا انوینل سپورٹ کے ساتھ ہمیشہ اسٹوڈیو میں تخلیق کیا جا سکتا ہے. غیر مستحکم XBlock / ٹیمپلیٹ کے مجموعوں کو کورس کے مصنف آپٹ ان کی ضرورت ہوتی ہے.
zh_cn: 已启用支持完整或临时支持的XBlock /模板组合始终可以在Studio中创建。不受支持的XBlock /模板组合需要课程作者选择加入。

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
ar: برنامج EdX Financial Assistance عبارة عن برنامج أنشأناه لمنح المتعلمين في جميع الظروف المالية فرصة الحصول على شهادة التحقق عند إتمام دورة EDX بنجاح.
ur: ایڈیکس مالی معاونت ایک ایسا پروگرام ہے جس نے ہم نے تمام مالی حالتوں میں سیکھنے کو ایک EDX کورس کے کامیاب تکمیل پر ایک تصدیق شدہ سرٹیفکیٹ حاصل کرنے کا موقع دیا.
zh_cn: EdX财务援助是我们创建的一项计划，旨在让学员在所有金融环境中都有机会在成功完成edX课程后获得认证证书。

source: Add a question with checkboxes
ar: أضف سؤالًا مع مربعات الاختيار
ur: چیک باکس کے ساتھ ایک سوال شامل کریں
zh_cn: 用复选框添加一个问题

source: Course starts in {time_remaining_string} at {course_start_time}.
ar: يبدأ المساق في {time_remaining_string} في {course_start_time}.
ur: {course_remaining_string} میں کورس {start_start_time} میں شروع ہوتا ہے.
zh_cn: 课程从{course_start_time}的{time_remaining_string}开始。

source: Optional lms url scheme + host used to construct urls for content library, e.g. https://courses.edx.org.
ar: مخطط lms url اختياري + مضيف يُستخدم لبناء عناوين url لمكتبة المحتوى ، على سبيل المثال https://courses.edx.org.
ur: اختیاری LMS یو آر ایل سکیم + میزبان مواد لائبریری کے لئے یو آر ایل کی تعمیر کے لئے استعمال کیا جاتا ہے، مثلا https://courses.edx.org.
zh_cn: 用于构建内容库的URL的可选lms url scheme +主机，例如https://courses.edx.org。

source: Learner email address or username
ar: عنوان البريد الإلكتروني للمتعلم أو اسم المستخدم
ur: سیکھنے والے ای میل ایڈریس یا صارف نام
zh_cn: 学习者的电子邮件地址或用户名

source: Purchasing Organizational Details
ar: شراء التفاصيل التنظيمية
ur: خریداری سازی کی تفصیلات
zh_cn: 采购组织细节

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
ar: اسم المستخدم الذي تم إنشاؤه لـ Course Catalog Integration ، على سبيل المثال lms_catalog_service_user.
ur: صارف کا نام کورس کیٹلوگ انٹیگریشن کے لئے تیار کیا گیا، مثال کے طور پر lms_catalog_service_user.
zh_cn: 为课程目录集成创建的用户名，例如lms_catalog_service_user。

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
ar: اوشكت على الوصول! لإكمال اشتراكك ، نحتاج منك التحقق من عنوان بريدك الإلكتروني ({email}). يجب أن تنتظر رسالة التنشيط والخطوات التالية لك هناك.
ur: تقریبا وہاں! اپنے سائن اپ مکمل کرنے کے لئے ہمیں آپ کے ای میل پتہ ({ای میل}) کی تصدیق کرنے کی ضرورت ہے. ایک سرگرمی کا پیغام اور اگلے مرحلہ آپ کے لئے انتظار کر رہے ہیں.
zh_cn: 差不多了！为了完成您的注册，我们需要您验证您的电子邮件地址（{email}）。激活消息和下一步应该在那里等你。

source: The course image, textbook chapters, and files that appear on your Course Handouts sidebar also appear in this list.
ar: تظهر أيضًا صورة الدورة التدريبية وفصول الكتاب المدرسي والملفات التي تظهر على الشريط الجانبي لنشرات الدورة التدريبية في هذه القائمة.
ur: کورس کی تصویر، درسی کتاب باب، اور آپ کے کورس ہینڈ آؤٹ سائڈبار پر موجود فائلیں اس فہرست میں بھی موجود ہیں.
zh_cn: 您的“课程讲义”边栏上出现的课程图片，教科书章节和文件也会显示在此列表中。

source: Your certificate will be available on or before {date}
ar: ستكون شهادتك متاحة في أو قبل {date}
ur: آپ کا سرٹیفکیٹ {تاریخ} پر یا اس سے پہلے دستیاب ہوگا
zh_cn: 您的证书将在{date}或之前提供

source: Thank you for enrolling in {course_names}. We hope you enjoy the course.
ar: شكرًا لك على التسجيل في {course_names}. نأمل أن تستمتع بالدورة.
ur: {course_names} میں اندراج کے لئے شکریہ. ہم امید کرتے ہیں کہ آپ کورس سے لطف اندوز کرتے ہیں.
zh_cn: 感谢您注册{course_names}。我们希望你喜欢这门课程。

source: Job Outlook
ar: المستقبل الوظيفي
ur: ملازمت آؤٹ لک
zh_cn: 工作展望

source: Course Staff
ar: طاقم الدورة
ur: کورس اسٹاف
zh_cn: 课程人员

source: Select a currency.
ar: اختر عملة.
ur: ایک کرنسی منتخب کریں.
zh_cn: 选择一种货币。

source: Course Assets
ar: أصول الدورة
ur: کورس اثاثہ
zh_cn: 课程资产

source: Create a New Course
ar: إنشاء دورة جديدة
ur: ایک نیا کورس بنائیں
zh_cn: 创建一个新课程

source: The file name extension for this file does not match the file data. The file may be corrupted.
ar: ملحق اسم الملف لهذا الملف لا يتطابق مع بيانات الملف. قد يكون الملف تالفًا.
ur: اس فائل کے لئے فائل کا نام توسیع فائل ڈیٹا سے متفق نہیں ہے. فائل خراب ہوسکتی ہے.
zh_cn: 该文件的文件扩展名与文件数据不匹配。该文件可能已损坏。

source: The supplied course id {course_id} is not valid.
ar: معرف الدورة التدريبية المُتاح {course_id} غير صالح.
ur: فراہم شدہ کورس id {course_id} درست نہیں ہے.
zh_cn: 提供的课程ID {course_id}无效。

source: Add a User to Your Course's Team
ar: إضافة مستخدم إلى فريق الدورة التدريبية الخاص بك
ur: اپنے کورس کی ٹیم کے لئے صارف شامل کریں
zh_cn: 添加一个用户到你的课程团队

source: How are these settings used?
ar: كيف يتم استخدام هذه الإعدادات؟
ur: یہ ترتیبات کیسے استعمال کی جاتی ہیں؟
zh_cn: 这些设置如何使用？

source: View Credit
ar: عرض الائتمان
ur: کریڈٹ دیکھیں
zh_cn: 查看信用

source: Article without content (%(id)d)
ar: المادة دون محتوى (٪ (معرف) د)
ur: مواد کے بغیر آرٹیکل (٪ (id) d)
zh_cn: 没有内容的文章（％（id）d）

source: Purchase the Program (
ar: شراء البرنامج (
ur: پروگرام خریدیں (
zh_cn: 购买本程序（

source: Changes
ar: التغييرات
ur: تبدیلیاں
zh_cn: 变化

source: In-Course Reverification {number}
ur: کورس کورس میں ترمیم {نمبر}
zh_cn: 课程重新验证{number}

source: Download All Credit Card Purchases
ar: تحميل جميع مشتريات بطاقة الائتمان
ur: تمام کریڈٹ کارڈ خریدیں ڈاؤن لوڈ کریں
zh_cn: 下载所有信用卡购买

source: Optional notes about this user (for example, why course creation access was denied)
ar: ملاحظات اختيارية حول هذا المستخدم (على سبيل المثال ، سبب رفض الوصول إلى الدورة التدريبية)
ur: اس صارف کے بارے میں اختیاری نوٹ (مثلا، کیوں کورس تخلیقی رسائی سے انکار کر دیا گیا تھا)
zh_cn: 有关此用户的可选注释（例如，为什么课程创建访问被拒绝）

source: enroll
ar: يتسجل، يلتحق
ur: اندراج کریں
zh_cn: 注册

source: Course Certificates
ar: شهادات الدورة
ur: کورس سرٹیفکیٹس
zh_cn: 课程证书

source: Requires instructor access.
ar: يتطلب وصول المعلم.
ur: انسٹرکٹر تک رسائی کی ضرورت ہوتی ہے.
zh_cn: 需要教师访问。

source: Course Registration Period
ar: فترة التسجيل
ur: کورس رجسٹریشن مدت
zh_cn: 课程注册期

source: Activate your account!
ar: فعل حسابك!
ur: اپنا اکاؤنٹ چالو کریں!
zh_cn: 激活你的帐号！

source: Sign up for {platform_name} today!
ar: اشترك في {platform_name} اليوم!
ur: آج {platform_name} کے لئے سائن اپ کریں!
zh_cn: 立即注册{platform_name}！

source: Thank you for sharing your reasons for unenrolling.
ar: نشكرك على مشاركة الأسباب وراء عدم التسجيل.
ur: غیر اندراج کرنے کے اپنے وجوہات کا اشتراک کرنے کے لئے آپ کا شکریہ.
zh_cn: 感谢您分享您的取消注册理由。

source: Start time when this module is visible
ar: وقت البدء عندما تكون هذه الوحدة مرئية
ur: یہ ماڈیول نظر آتا ہے جب شروع وقت
zh_cn: 当这个模块可见时开始时间

source: Downloads and transcripts
ar: التنزيلات والنصوص
ur: ڈاؤن لوڈ اور ٹرانزیکٹس
zh_cn: 下载和成绩单

source: The discount percentage must be less than or equal to 100.
ar: يجب أن تكون نسبة الخصم أقل من أو تساوي 100.
ur: ڈسکاؤنٹ فی صد 100 سے کم یا برابر ہونا ضروری ہے.
zh_cn: 折扣百分比必须小于或等于100。

source: suggestion
ar: اقتراح
ur: مشورہ
zh_cn: 建议

source: You requested a capture, but there is no corresponding, unused authorization record. Occurs if there was not a previously successful authorization request or if the previously successful authorization has already been used by another capture request.
ar: لقد طلبت التقاط ، ولكن لا يوجد سجل تخويل غير مستخدم. يحدث إذا لم يكن هناك طلب تفويض ناجح سابقًا أو إذا سبق استخدام تفويض ناجح سابقًا بواسطة طلب التقاط آخر.
ur: آپ نے ایک گرفتاری کا مطالبہ کیا، لیکن کوئی مطابقت پذیری، غیر قابل اجازت اجازت نامہ نہیں ہے. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. اس ویڈیو پر غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے. براہ مہربانی دوبارہ کوشش کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے.
zh_cn: 您请求捕获，但没有相应的未使用的授权记录。在没有先前成功的授权请求或先前成功的授权已被其他捕获请求使用的情况下发生。

source: Sailthru send template to use on enrolling for audit.
ar: إرسال Sailthru قالب لاستخدامه عند التسجيل للتدقيق.
ur: سیلیلیو آڈٹ کے لئے اندراج پر استعمال کرنے کے لئے ٹیمپلیٹ بھیجتا ہے.
zh_cn: Sailthru发送模板用于注册审计。

source: Missing required parameter face_image
ar: يفتقد المعلمة المطلوبة face_image
ur: مطلوبہ پیرامیٹر face_image کو لاپتہ ہے
zh_cn: 缺少必需的参数face_image

source: Confirmation and Registration Codes for the following courses: {course_name_list}
ar: رموز التأكيد والتسجيل للدورات التدريبية التالية: {course_name_list}
ur: درج ذیل کورسز کے لئے تصدیق اور رجسٹریشن کوڈز: {course_name_list}
zh_cn: 以下课程的确认和注册码：{course_name_list}

source: Available Reports
ar: التقارير المتاحة
ur: دستیاب رپورٹ
zh_cn: 可用报告

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
ar: يستخدم موقع الويب هذا ملفات تعريف الارتباط لضمان حصولك على أفضل تجربة على موقعنا. إذا استمر تصفح هذا الموقع ، فنحن ندرك أنك تقبل استخدام ملفات تعريف الارتباط.
ur: یہ ویب سائٹ کو ہماری ویب سائٹ پر بہترین تجربہ حاصل کرنے کے لئے کوکیز کا استعمال کرتا ہے. اگر آپ اس ویب سائٹ کو براؤز کرتے رہے تو، ہم سمجھتے ہیں کہ آپ کوکیز کا استعمال قبول کرنا ہے.
zh_cn: 本网站使用cookies来确保您在我们网站上获得最佳体验。如果您继续浏览本网站，我们明白您接受使用Cookie。

source: There has been an error on the {platform_name} servers
ar: حدث خطأ في خوادم {platform_name}
ur: {platform_name} سرورز میں ایک غلطی ہوئی ہے
zh_cn: {platform_name}服务器出现错误

source: Date that enrollment for this class is closed
ar: التاريخ الذي يتم فيه إغلاق التسجيل لهذه الفئة
ur: اس کلاس کے لئے اندراج کی تاریخ بند ہے
zh_cn: 此课程的注册日期已关闭

source: Open edX Portal
ar: افتح بوابة edX
ur: edX پورٹل کھولیں
zh_cn: 打开edX Portal

source: Useful examples:
ar: أمثلة مفيدة:
ur: مفید مثالیں:
zh_cn: 有用的例子：

source: Could not find the {0} file in the package.
ar: تعذر العثور على الملف {0} في الحزمة.
ur: پیکیج میں {0} فائل نہیں مل سکی.
zh_cn: 找不到包中的{0}文件。

source: Prohibited Uses and Activities
ar: الاستخدامات المحظورة والأنشطة
ur: ممنوعہ استعمال اور سرگرمیاں
zh_cn: 禁止使用和活动

source: For payment questions, contact {contact_email}
ar: بالنسبة إلى أسئلة الدفع ، اتصل بـ {contact_email}
ur: ادائیگی کے سوالات کے لئے، {contact_email} سے رابطہ کریں
zh_cn: 有关付款问题，请联系{contact_email}

source: Course Team Settings
ar: إعدادات فريق المقرر
ur: کورس ٹیم کی ترتیبات
zh_cn: 课程团队设置

source: Successfully removed invalid due date extension (unit has no due date).
ar: تم بنجاح إزالة ملحق تاريخ الاستحقاق غير صالح (لا يوجد لدى الوحدة تاريخ مستحق).
ur: غلط تاریخ کی توسیع کامیابی سے ہٹا دیا (یونٹ کی کوئی تاریخ نہیں ہے).
zh_cn: 成功删除无效的到期日延期（单位没有到期日）。

source: error getting student answer from {student_answers}
ar: خطأ في الحصول على إجابة الطالب من {student_answers}
ur: {student_answers} سے طالب علم کا جواب حاصل کرنے میں غلطی
zh_cn: 从{student_answers}获取学生答案时出错

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
ar: تم إعادة تعيين كلمة المرور الخاصة بك. {start_link} سجّل الدخول إلى حسابك. {end_link}
ur: آپ کا پاس ورڈ دوبارہ ترتیب دیا گیا ہے. {start_link} اپنے اکاؤنٹ میں سائن ان کریں. {end_link}
zh_cn: 您的密码已重置。 {start_link}登录您的帐户。{end_link}

source: Discussion Sorting Alphabetical
ar: فرز فرز الحروف الأبجدية
ur: بحث ترتیب ترتیب دیں
zh_cn: 讨论按字母排序

source: Provide the email address of the user you want to add
ar: أدخل عنوان البريد الإلكتروني للمستخدم الذي تريد إضافته
ur: اس صارف کا ای میل پتہ فراہم کریں جسے آپ شامل کرنا چاہتے ہیں
zh_cn: 提供您想要添加的用户的电子邮件地址

source: Import
ar: استيراد
ur: درآمد کریں
zh_cn: 进口

source: Donate
ar: تبرع
ur: عطیہ
zh_cn: 捐

source: {platform_name} Professional Certificate for {course_name}
ar: {platform_name} شهادة مهنية لـ {course_name}
ur: {course_name} پیشہ ورانہ سرٹیفکیٹ {course_name} کے لئے
zh_cn: {platform_name} {course_name}的专业证书

source: Theme {site_theme} does not exist
ar: الموضوع {site_theme} غير موجود
ur: تھیم {site_theme} موجود نہیں ہے
zh_cn: 主题{site_theme}不存在

source: Company Name:
ar: اسم الشركة:
ur: کمپنی کا نام:
zh_cn: 公司名：

source: Password reset on %(platform_name)s
ar: إعادة تعيين كلمة المرور على٪ (platform_name) s
ur: ٪ (platform_name) کے پاس پاس ورڈ دوبارہ ترتیب دیں
zh_cn: 在％（platform_name）上重置密码

source: CAUTION!
ar: الحذر!
ur: احتیاط!
zh_cn: 警告！

source: August
ar: أغسطس
ur: اگست
zh_cn: 八月

source: working
ar: عامل
ur: کام کر رہے ہیں
zh_cn: 加工

source: Certificate generation started for white listed students.
ar: بدأ إنشاء الشهادة للطلاب المدرجين في القائمة البيضاء.
ur: سرٹیفکیٹ نسل سفید فہرست والے طلباء کے لئے شروع ہوگئی.
zh_cn: 白名单上的学生开始获得证书。

source: Attempted
ar: حاول
ur: کوشش کی
zh_cn: 尝试

source: A .csv file that lists your enrollment codes is attached. You can use the email template below to distribute enrollment codes to your students. Each student must use a separate enrollment code.
ar: يتم إرفاق ملف .csv يسرد رموز التسجيل الخاصة بك. يمكنك استخدام قالب البريد الإلكتروني أدناه لتوزيع أكواد التسجيل على طلابك. يجب على كل طالب استخدام رمز تسجيل منفصل.
ur: ایک. سی ایس وی فائل جسے آپ کے اندراج کوڈ درج کرتا ہے منسلک ہے. آپ ذیل میں ای میل سانچے استعمال کرسکتے ہیں تاکہ آپ اپنے طالب علموں میں اندراج کوڈ کو تقسیم کریں. ہر طالب علم کو الگ الگ داخلہ کوڈ استعمال کرنا ہوگا.
zh_cn: 列出您的注册码的.csv文件已附加。您可以使用下面的电子邮件模板将注册码分发给您的学生。每个学生必须使用单独的注册码。

source: Photos are mismatched
ar: الصور غير متطابقة
ur: تصاویر بے بنیاد ہیں
zh_cn: 照片不匹配

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
ar: يستخدم هذا الويكي <strong>Markdown</strong> للتصميم. هناك العديد من الأدلة المفيدة على الإنترنت. انظر أي من الروابط أدناه للحصول على التفاصيل التفصيلية:
ur: یہ ویک اسٹائلنگ کے لئے <strong>Markdown کا</strong> استعمال کرتا ہے. آن لائن بہت مفید ہدایات ہیں. گہری تفصیلات کے لئے ذیل میں سے کسی کو ملاحظہ کریں:
zh_cn: 这个wiki使用<strong>Markdown</strong>进行造型。有几个有用的指南在线。有关详细信息，请参阅以下任何链接：

source: For the specified problem, override the learner's score.
ar: للمشكلة المحددة ، تجاوز درجة المتعلم.
ur: مخصوص مسئلہ کے لئے سیکھنے کے سکور کو ہٹانا.
zh_cn: 对于指定的问题，覆盖学习者的分数。

source: {platform_name} Verified Certificate for {course_name}
ar: {platform_name} شهادة التحقق من {course_name}
ur: {course_name} {course_name} کے لئے تصدیق شدہ سرٹیفکیٹ
zh_cn: {platform_name} {course_name}的已验证证书

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
ar: {p_tag} ليس لديك حاليًا أي تقييم من الأقران للقيام به. حتى يتسنى لك إجراء تصنيفات أقران: {ul_tag} {li_tag} يلزمك إرسال رد إلى مشكلة تقدير الزملاء. {end_li_tag} {li_tag} يحتاج فريق الدورة التدريبية إلى تسجيل المقالات التي يتم استخدامها لمساعدتك على فهم أفضل معايير التقدير. {end_li_tag} {li_tag} يجب أن تكون هناك عمليات إرسال تنتظر التصنيف. {end_li_tag} {end_ul_tag} {end_p_tag}
ur: {p_tag} آپ کے پاس ابھی تک کسی بھی ہم منصب کی گریڈنگ نہیں ہے. ہم سے رابطہ کرنے کے لئے ہم مرتبہ گریڈنگ کرنے کے لئے: {ul_tag} {li_tag} آپ کو ہم مرتبہ گریڈنگ کے مسئلے پر جواب جمع کرنے کی ضرورت ہے. {end_li_tag} {li_tag} کورس کی ٹیم آپ کو بہتر سمجھنے میں مدد کرنے کے لئے مضامین کو سکور کرنے کی ضرورت ہے. درجہ بندی کے معیار. {end_li_tag} {li_tag} وہاں پیشکشیں لازمی ہیں جو گریڈنگ کے منتظر ہیں. {end_li_tag} {end_ul_tag} {end_p_tag}
zh_cn: {p_tag}你目前没有任何同伴评分。为了让同行分级：{ul_tag} {li_tag}您需要提交对同级评分问题的回复。{end_li_tag} {li_tag}课程团队需要评分用于帮助您更好理解的论文评分标准{end_li_tag} {li_tag}必须提交等级评分。{end_li_tag} {end_ul_tag} {end_p_tag}

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: غير قابل للكتابة رابط url المقدمة. توقع شيء من هذا القبيل: git@github.com: mitocw / edx4edx_lite.git
ur: غیر قابل تحریر GIT یو آر ایل فراہم کی. جیسے کچھ توقع ہے: git@github.com: mitocw / edx4edx_lite.git
zh_cn: 提供了不可写的git url。期待类似于：git@github.com：mitocw / edx4edx_lite.git

source: API access request
ar: طلب الوصول إلى واجهة برمجة التطبيقات
ur: API رسائی کی درخواست
zh_cn: API访问请求
