Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Enrollment mode not supported
ar: وضع التسجيل غير مدعوم
ur: اندراج موڈ کی حمایت نہیں کی
zh_cn: 注册模式不受支持

source: Download the {platform_name} mobile app from the Apple App Store
ar: يمكنك تنزيل تطبيق الجوال {platform_name} من Apple App Store
ur: Apple App اپلی کیشن سے {platform_name} موبائل اپلی کیشن ڈاؤن لوڈ کریں
zh_cn: 从Apple App Store下载{platform_name}移动应用程序

source: The article %(title)s is now set to display revision #%(revision_number)d
ar: يتم الآن تعيين المقالة٪ (title) s لعرض المراجعة #٪ (revision_number) d
ur: آرٹیکل٪ (عنوان) اب نظر ثانی # # (revision_number) ڈسپلے کے لئے مقرر کیا جاتا ہے
zh_cn: 文章％（title）s现在设置为显示修订版本＃％（revision_number）d

source: LTI Passports
ar: جوازات سفر LTI
ur: LTI پاسپورٹ
zh_cn: LTI护照

source: The experiment does not contain all of the groups in the configuration.
ar: لا تحتوي التجربة على جميع المجموعات في التهيئة.
ur: استعمال میں ترتیب کے تمام گروہوں پر مشتمل نہیں ہے.
zh_cn: 该实验不包含配置中的所有组。

source: Generate Proctored Exam Results Report
ar: توليد تقرير نتائج الامتحانات
ur: تیار شدہ امتحان کے نتائج کی رپورٹ تیار کریں
zh_cn: 生成检测结果报告

source: Checkboxes
ar: مربعات
ur: چیک باکس
zh_cn: 复选框

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
ar: أدخل الحد الأقصى لعدد المرات التي يمكن للطالب محاولة فيها الإجابة عن المشاكل. بشكل افتراضي ، يتم تعيين &quot;الحد الأقصى من المحاولات&quot; على &quot;خالية&quot; ، مما يعني أن الطلاب لديهم عدد غير محدود من محاولات حدوث مشكلات. يمكنك تجاوز هذا الإعداد على مستوى الدورة التدريبية للمشكلات الفردية. ومع ذلك ، إذا كان الإعداد على مستوى الدورة التدريبية هو رقم محدد ، فلا يمكنك تعيين &quot;الحد الأقصى من محاولات&quot; المشكلات الفردية إلى غير محدود.
ur: طالب علموں کو مسائل کا جواب دینے کی کوشش کر سکتا ہے زیادہ سے زیادہ وقت درج کریں. پہلے سے طے شدہ طور پر، زیادہ سے زیادہ کوششیں سست ہوسکتی ہیں، مطلب یہ ہے کہ طالب علموں کو مسائل کے لۓ لامحدود تعداد میں کوششیں ہیں. آپ انفرادی مسائل کے لئے اس کورس کی ترتیب کو اوور کرسکتے ہیں. تاہم، اگر کورس وسیع ترتیب ایک مخصوص نمبر ہے تو، آپ انفرادی مسائل کے لئے زیادہ سے زیادہ اقدامات نہیں کرسکتے ہیں لامحدود.
zh_cn: 输入学生可以尝试回答问题的最大次数。默认情况下，“最大尝试次数”设置为空，这意味着学生可以无限次尝试解决问题。您可以覆盖此课程范围内针对个别问题的设置。但是，如果课程范围设置是特定数字，则无法将单个问题的最大尝试设置为无限制。

source: {section_or_subsection} "{display_name}"
ar: {section_or_subsection} &quot;{display_name}&quot;
ur: {section_or_subsection} &quot;{display_name}&quot;

source: Ready to grade!
ar: على استعداد للصف!
ur: گریڈ کے لئے تیار!
zh_cn: 准备好等级！

source: You can no longer access this course because payment has not yet been received. You can contact the account holder to request payment, or you can unenroll from this course
ar: لم يعد بإمكانك الوصول إلى هذه الدورة لأن الدفع لم يتم استلامه بعد. يمكنك الاتصال بصاحب الحساب لطلب الدفع ، أو يمكنك إلغاء التسجيل من هذه الدورة التدريبية
ur: آپ اس کورس تک رسائی حاصل نہیں کر سکتے ہیں کیونکہ ادائیگی ابھی تک موصول نہیں ہوئی ہے. آپ ادائیگی کی درخواست کرنے کے لئے اکاؤنٹ ہولڈر سے رابطہ کرسکتے ہیں، یا آپ اس کورس سے انعقاد کرسکتے ہیں
zh_cn: 由于尚未收到付款，您将无法再访问此课程。您可以联系账户持有人申请付款，或者您可以取消注册本课程

source: Yes I am sure...
ar: نعم أنا متأكد...
ur: ہاں مجھے یقین ہے...
zh_cn: 是的，我敢肯定...

source: Add beta testers
ar: إضافة اختبار بيتا
ur: بیٹا ٹیسٹر شامل کریں
zh_cn: 添加beta测试人员

source: Your account for {studio_name}
ar: حسابك الخاص بـ {studio_name}
ur: {سٹوڈیو_ نام} کیلئے آپ کا اکاؤنٹ
zh_cn: 您的帐户{studio_name}

source: Email is incorrect.
ar: البريد الإلكتروني غير صحيح.
ur: ای میل غلط ہے.
zh_cn: 电子邮件不正确。

source: Effort
ar: مجهود
ur: کوشش
zh_cn: 功夫

source: Dollars Refunded
ar: الدولارات مرتدة
ur: ڈالر کی واپسی
zh_cn: 美元退还

source: Kosovo
ar: كوسوفو
ur: کوسوو
zh_cn: 科索沃

source: The Staff answer could not be interpreted as a number.
ar: لا يمكن تفسير جواب الموظفين على أنه رقم.
ur: اسٹاف کا جواب نمبر کے طور پر نہیں کیا جا سکتا.
zh_cn: 工作人员的答案不能被解释为一个数字。

source: Lost and found
ar: فقدت ووجدت
ur: کھویااور پایا
zh_cn: 失物处

source: Upgrade ({upgrade_price})
ar: ترقية ({upgrade_price})
ur: اپ گریڈ کریں ({upgrade_price})
zh_cn: 升级（{upgrade_price}）

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
ar: يظهر مقدمو الخدمات الثانويون بشكل أقل في قائمة منفصلة لموفري تسجيل الدخول &quot;المؤسسة&quot;.
ur: &quot;ادارے&quot; لاگ ان فراہم کرنے والے کی ایک علیحدہ فہرست میں سیکنڈری فراہم کرنے والے کم از کم ظاہر کئے جاتے ہیں.
zh_cn: 辅助提供者在“机构”登录提供者的单独列表中显示得较不显着。

source: This component's access settings contradict its parent's access settings.
ar: تتعارض إعدادات الوصول الخاصة بهذا المكون مع إعدادات الوصول الخاصة به.
ur: اس اجزاء کی رسائی کی ترتیبات اس کے والدین کی رسائی کی ترتیبات کے خلاف متفق ہیں.
zh_cn: 此组件的访问设置与其父级的访问设置相矛盾。

source: Active Groups
ar: المجموعات النشطة
ur: فعال گروپ
zh_cn: 活动组

source: Dictionary with the current student responses
ar: القاموس مع استجابات الطلاب الحالية
ur: موجودہ طالب علم کے جوابات کے ساتھ ڈکشنری
zh_cn: 带有当前学生回复的词典

source: Enroll in {course_display_name}
ar: التسجيل في {course_display_name}
ur: {course_display_name} میں اندراج کریں
zh_cn: 注册{course_display_name}

source: Course is already in published state.
ar: بالطبع بالفعل في حالة المنشورة.
ur: کورس پہلے سے شائع ریاست میں ہے.
zh_cn: 课程已经处于发布状态。

source: The supplied course_id {course_id} is not valid.
ar: الدورة التدريبية المقدمة course_id {course_id} غير صالحة.
ur: فراہم کردہ کورس_ڈ {کورس_ڈ} درست نہیں ہے.
zh_cn: 提供的course_id {course_id}无效。

source: User Access
ar: وصول المستخدم
ur: صارف تک رسائی
zh_cn: 用户访问

source: More about {fullname}'s accomplishment
ar: المزيد عن إنجاز {fullname}
ur: {fullname} کی کامیابی کے بارے میں مزید
zh_cn: 更多关于{fullname}的成就

source: Please wait
ar: أرجو الإنتظار
ur: برائے مہربانی انتظار کریں
zh_cn: 请稍候

source: modified
ar: تم التعديل
ur: نظر ثانی شدہ
zh_cn: 改性

source: Number of seats purchased with invoices
ar: عدد المقاعد التي تم شراؤها بالفواتير
ur: انوائس کے ساتھ خریدا سیٹوں کی تعداد
zh_cn: 通过发票购买的座位数量

source: List of dictionaries containing pdf_textbook configuration
ar: قائمة القواميس التي تحتوي على تكوين pdf_textbook
ur: pdf_textbook ترتیب پر مشتمل لغات کی فہرست
zh_cn: 包含pdf_textbook配置的字典列表

source: %(platform_name)s on Google Plus
ar: ٪ (platform_name) s على Google Plus
ur: ٪ (پلیٹ فارم_ نام) گوگل پلس پر
zh_cn: Google Plus上的％（platform_name）

source: Date: {date}
ar: التاريخ: {date}
ur: تاریخ: {تاریخ}
zh_cn: 日期：{date}

source: Transcripts are supported only for "video" modules.
ar: يتم دعم النصوص فقط لوحدات &quot;الفيديو&quot;.
ur: ٹرانپٹپٹ صرف &quot;ویڈیو&quot; کے ماڈیولز کے لئے حمایت کر رہے ہیں.
zh_cn: 成绩单仅支持“视频”模块。

source: Message: {message}
ar: الرسالة: {رسالة}
ur: پیغام: {پیغام}
zh_cn: 消息：{消息}

source: Student Support: Certificates
ar: دعم الطلاب: الشهادات
ur: طالب علم کی معاونت: سرٹیفکیٹس
zh_cn: 学生支持：证书

source: Cohorts
ar: الأفواج
ur: کوہٹس
zh_cn: 同伙

source: The institution that is linked to the course.
ar: المؤسسة المرتبطة بالدورة.
ur: یہ ادارہ کورس سے منسلک ہے.
zh_cn: 与课程相关的机构。

source: Account Status Info
ar: معلومات حالة الحساب
ur: اکاؤنٹ کی حیثیت کی معلومات
zh_cn: 帐户状态信息

source: Your certificate has been invalidated
ar: تم إبطال الشهادة الخاصة بك
ur: آپ کا سرٹیفکیٹ باطل ہوگیا ہے
zh_cn: 您的证书已失效

source: Tags: {tags}
ar: العلامات: {العلامات}
ur: ٹیگز: {ٹیگز}
zh_cn: 标签：{tags}

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
ar: تأكد من أنك تريد استيراد دورة تدريبية قبل المتابعة. ستحل محتويات الدورة التدريبية المستوردة محل محتويات الدورة الحالية. {em_start} لا يمكنك التراجع عن استيراد دورة تدريبية {em_end}. قبل المتابعة ، نوصي بتصدير الدورة التدريبية الحالية ، حتى يكون لديك نسخة احتياطية منها.
ur: یقینی بنائیں کہ آپ آگے بڑھنے سے قبل ایک کورس درآمد کرنا چاہتے ہیں. درآمد شدہ کورس کی مواد موجودہ کورس کے مواد کی جگہ لے لے گی. {em_start} آپ کسی کورس درآمد {em_end} کو واپس نہیں کر سکتے ہیں. آگے بڑھنے سے پہلے، ہم تجویز کرتے ہیں کہ آپ موجودہ کورس کو برآمد کریں، تاکہ آپ کے پاس ایک بیک اپ کاپی ہے.
zh_cn: 在继续之前，确保您想要导入课程。导入课程的内容将取代现有课程的内容。 {em_start}您无法撤消课程导入{em_end}。在继续之前，我们建议您导出当前课程，以便备份它的备份。

source: Reorganizing your course
ar: إعادة تنظيم دورتك
ur: اپنے کورس کو دوبارہ منظم کرنا
zh_cn: 重新组织你的课程

source: HTML
ur: ایچ ٹی ایم ایل

source: Link
ar: حلقة الوصل
ur: لنک
zh_cn: 链接

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
ar: حدد لغة الدورة هنا. يستخدم هذا لمساعدة المستخدمين في العثور على الدورات التي يتم تدريسها بلغة معينة. كما يُستخدم أيضًا لترجمة الحقل &quot;من:&quot; في رسائل البريد الإلكتروني السائبة.
ur: یہاں کورس کی زبان کی شناخت کریں. یہ صارفین کو اس کورس میں تلاش کرنے کے لئے استعمال کیا جاتا ہے جو مخصوص زبان میں پڑھا جاتا ہے. یہ بڑے پیمانے پر ای میلز میں &#39;سے:&#39; فیلڈ کو مقامی بنانے کیلئے بھی استعمال کیا جاتا ہے.
zh_cn: 在这里确定课程语言。这用于帮助用户查找以特定语言授课的课程。它也用于本地化批量电子邮件中的“发件人：”字段。

source: Upload new file
ar: تحميل ملف جديد
ur: نئی فائل اپ لوڈ کریں
zh_cn: 上传新文件

source: {min_hours_effort_per_week}-{max_hours_effort_per_week} hours per week, per course
ar: {min_hours_effort_per_week} - {max_hours_effort_per_week} ساعة أسبوعيًا ، لكل دورة تدريبية
ur: {min_hours_ffort_per_week} - {max_hours_effort_per_week} گھنٹے فی ہفتہ، فی کورس
zh_cn: 每周每小时{min_hours_effort_per_week} - {max_hours_effort_per_week}小时

source: Numbers
ar: أعداد
ur: نمبر
zh_cn: 数字

source: Verify Now
ar: تحقق الآن
ur: اب تصدیق کریں
zh_cn: 立即验证

source: Course Updates
ar: تحديثات الدورة
ur: کورس کی تازہ ترین معلومات
zh_cn: 课程更新

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
ar: عنوان URL لتطبيق CCX Connector لإدارة إنشاء CCX. (اختياري). تم تجاهلها ما لم يتم ضبط &quot;تمكين CCX&quot; على &quot;true&quot;.
ur: CCXs کی تخلیق کے انتظام کے لئے سی سی ایکس کنیکٹر کی درخواست کے لئے یو آر ایل. (اختیاری). جب تک &#39;سی سی ایکس کو فعال کریں&#39; تک نظر انداز نہیں کیا جائے گا &#39;سچ&#39;.
zh_cn: 用于管理CCX创建的CCX Connector应用程序的URL。 （可选的）。忽略，除非&#39;启用CCX&#39;设置为&#39;true&#39;。

source: Configuring as re-run
ar: التكوين كإعادة التشغيل
ur: دوبارہ چلانے کے طور پر ترتیب
zh_cn: 配置为重新运行

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
ar: لا يمكنك إنشاء CCX من دورة تدريبية باستخدام معرف تم إيقافه. الرجاء إنشاء إعادة تشغيل لهذه الدورة التدريبية في الاستوديو للسماح بهذا الإجراء.
ur: آپ ڈی سی ڈی کا استعمال کرتے ہوئے کورس سے ایک CCX نہیں بنا سکتے ہیں. اس کارروائی کی اجازت دینے کیلئے سٹوڈیو میں اس کورس کا ایک رونون بنائیں.
zh_cn: 您无法使用已弃用的ID从课程中创建CCX。请在工作室重新制作此课程，以便执行此操作。

source: An account with this e-mail already exists.
ar: يوجد حساب بهذا البريد الإلكتروني بالفعل.
ur: اس ای میل کے ساتھ ایک اکاؤنٹ پہلے ہی موجود ہے.
zh_cn: 此电子邮件帐户已存在。

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
ar: المسار المستخدم لإنشاء عناوين URL لصفحات التسويق للبرامج (على سبيل المثال ، &quot;/ foo&quot;).
ur: مارکیٹنگ صفحات (مثلا، &quot;/ foo&quot;) پروگراموں میں یو آر ایل کی تعمیر کرنے کے لئے استعمال کیا جاتا راستہ.
zh_cn: 用于构建用于营销页面的URL的路径（例如，“/ foo”）。

source: Who is {studio_name} for?
ar: من هو {studio_name}؟
ur: {studio_name} کون ہے؟
zh_cn: {studio_name}是谁？

source: You have been enrolled in {course_name} at {site_name} by a member of the course staff. The course should now appear on your {site_name} dashboard.
ar: لقد تم تسجيلك في {course_name} في {site_name} بواسطة أحد أعضاء فريق الدورة التدريبية. يجب أن تظهر الدورة التدريبية الآن في لوحة تحكم {site_name}.
ur: آپ کورسز کے عملے کے ایک رکن کے ذریعہ {course_name} میں {site_name} پر اندراج کیا گیا ہے. کورس آپ کے {site_name} ڈیش بورڈ پر اب ظاہر ہونا چاہئے.
zh_cn: 您已被课程人员的成员注册到{site_name}的{course_name}。课程现在应该显示在您的{site_name}信息中心上。

source: Must be greater than or equal to the course passing grade
ar: يجب أن يكون أكبر من أو يساوي درجة اجتياز الدورة التدريبية
ur: کورس گزر گریڈ سے زیادہ یا برابر ہونا ضروری ہے
zh_cn: 必须大于或等于课程成绩

source: unrequested
ar: غير مطلوبة
ur: ناقابل یقین
zh_cn: 未经请求

source: File Chosen:
ar: الملف المختار:
ur: فائل کا انتخاب:
zh_cn: 文件选择：

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
ar: لجعل قسم أو قسم فرعي أو وحدة غير متوفرة للمتعلمين ، حدد رمز التهيئة لهذا المستوى ، ثم حدد الخيار {em_start} إخفاء {em_end} المناسب. لا يتم تضمين درجات الأقسام والأقسام الفرعية والوحدات المخفية في حسابات الدرجة.
ur: سیکشنرز کے لئے دستیاب ایک سیکشن، سبسکرائب یا یونٹ بنانے کے لئے، اس سطح کے لئے ترتیب آئکن کو منتخب کریں، پھر مناسب {em_start} چھپائیں {em_end} اختیار کو منتخب کریں. پوشیدہ حصوں، سبسڈیوں اور یونٹس کے لئے گریڈیں گریڈ کی حساب میں شامل نہیں ہیں.
zh_cn: 要创建对学习者不可用的部分，子部分或单元，请选择该级别的配置图标，然后选择适当的{em_start}隐藏{em_end}选项。成绩计算中不包括隐藏部分，小节和单位的成绩。

source: Merge Revision
ar: دمج المراجعة
ur: ضم نظر
zh_cn: 合并版本

source: article title
ar: عنوان المقال
ur: آرٹیکل عنوان
zh_cn: 文章标题

source: Use between 250 and 500 words or so in your response.
ar: استخدم ما بين 250 و 500 كلمة أو ما شابه في ردك.
ur: آپ کے جواب میں 250 سے 500 الفاظ یا اس کے درمیان استعمال کریں.
zh_cn: 在您的回复中使用250到500个字左右。

source: Choose an action:
ar: اختيار إجراء:
ur: کارروائی کا انتخاب کریں:
zh_cn: 选择一个动作：

source: Students see the default and custom pages at the top of your course and use these links to navigate.
ar: يرى الطلاب الصفحات الافتراضية والمخصصة في الجزء العلوي من الدورة التدريبية ويستخدمون هذه الروابط للتنقل.
ur: طالب علم اپنے کورس کے سب سے اوپر پر ڈیفالٹ اور اپنی مرضی کے مطابق صفحات دیکھتے ہیں اور ان لنکس کو نیویگیشن کرنے کے لئے استعمال کرتے ہیں.
zh_cn: 学生将看到课程顶部的默认和自定义页面，并使用这些链接进行导航。

source: It looks like {username} belongs to an existing account. Try again with a different username.
ar: يبدو أن {username} ينتمي إلى حساب حالي. حاول مرة أخرى باستخدام اسم مستخدم مختلف.
ur: ایسا لگتا ہے کہ {صارف کا نام} موجودہ اکاؤنٹ سے متعلق ہے. ایک مختلف صارف نام کے ساتھ دوبارہ کوشش کریں.
zh_cn: 它看起来像{用户名}属于一个现有的帐户。用另一个用户名再试一次。

source: Your mailing address is required
ar: عنوانك البريدي مطلوب
ur: آپ کا میل ایڈریس لازمی ہے
zh_cn: 您的邮寄地址是必需的

source: Was this key already used? Check whether the e-mail change has already happened.
ar: هل تم استخدام هذا المفتاح بالفعل؟ تحقق مما إذا كان تغيير البريد الإلكتروني قد حدث بالفعل.
ur: کیا یہ کلیدی پہلے ہی استعمال کیا گیا تھا؟ چیک کریں کہ ای میل تبدیل پہلے ہی ہوا ہے.
zh_cn: 这个密钥已经被使用了吗？检查电子邮件更改是否已经发生。

source: Using the system
ar: باستخدام النظام
ur: نظام کا استعمال کرتے ہوئے
zh_cn: 使用该系统

source: This is the e-mail address you used to register with {platform}
ar: هذا هو عنوان البريد الإلكتروني الذي استخدمته للتسجيل في {platform}
ur: یہ ای میل ایڈریس ہے جسے آپ {پلیٹ فارم} کے ساتھ رجسٹر کرنے کے لئے استعمال کیا جاتا تھا.
zh_cn: 这是您用来向{platform}注册的电子邮件地址

source: Name on ID does not match name on account
ar: الاسم على الرقم لا يطابق الاسم على الحساب
ur: ID پر نام کا اکاؤنٹ اکاؤنٹ پر نہیں ملتا ہے
zh_cn: 帐户名称与帐户名称不符

source: ID is invalid
ar: المعرف غير صالح
ur: ID غلط ہے
zh_cn: ID无效

source: Maximum number of records in paginated response of a single request to catalog service.
ar: الحد الأقصى لعدد السجلات في استجابة paginated لطلب واحد لخدمة النشرة المصورة.
ur: کیٹلاگ کی خدمت کے لئے ایک واحد درخواست کے paginated جواب میں ریکارڈ کی زیادہ سے زیادہ تعداد.
zh_cn: 对单个请求编目服务的分页响应中的最大记录数。

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: أدخل مفتاح واجهة برمجة التطبيقات الذي توفره MathWorks للوصول إلى خدمة MATLAB المستضافة. يتم منح هذا المفتاح للاستخدام الحصري بواسطة هذه الدورة التدريبية لمدة محددة. يرجى عدم مشاركة مفتاح واجهة برمجة التطبيقات مع الدورات التدريبية الأخرى وإخبار MathWorks على الفور إذا كنت تعتقد أن المفتاح مكشوف أو معرض للخطر. للحصول على مفتاح للدورة التدريبية الخاصة بك ، أو للإبلاغ عن مشكلة ، الرجاء الاتصال moocsupport@mathworks.com
ur: MATLAB ہوسٹڈ سروس تک رسائی حاصل کرنے کے لئے MathWorks کی طرف سے فراہم API کی کلید درج کریں. یہ کلیدی مخصوص مدت کے لئے اس کورس کی طرف سے مخصوص مدت کے لئے دی گئی ہے. براہ مہربانی API کورس کو دوسرے کورسوں کے ساتھ اشتراک نہ کریں اور میتھورکس کو فوری طور پر مطلع کریں تو آپ کو یقین ہے کہ کلید بے نقاب یا سمجھوتہ ہے. اپنے کورس کے لئے ایک کلید حاصل کرنے کے لئے، یا ایک مسئلہ کی رپورٹ کرنے کے لئے، براہ کرم moocsupport@mathworks.com سے رابطہ کریں
zh_cn: 输入MathWorks提供的用于访问MATLAB Hosted Service的API密钥。此密钥授予该课程专用于指定的时间。请不要将API密钥与其他课程共享，并且如果您认为密钥被泄露或泄露，请立即通知MathWorks。要获得课程的关键信息或报告问题，请联系moocsupport@mathworks.com

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
ar: لم تستلم شهادة لأنك لا تملك هوية تم التحقق منها {platform_name}.
ur: آپ نے ایک سرٹیفکیٹ نہیں مل سکا کیونکہ آپ کو موجودہ {platform_name} کی تصدیق شدہ شناخت نہیں ہے.
zh_cn: 您尚未收到证书，因为您没有经过验证的当前{platform_name}身份。

source: Date Added
ar: تم إضافة التاريخ
ur: تاریخ شامل
zh_cn: 添加日期

source: Preview Language Administration
ar: معاينة لغة الإدارة
ur: پیش نظارہ زبان انتظامیہ
zh_cn: 预览语言管理

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
ar: حدد Visual لإدخال المحتوى وجعل المحرر ينشئ HTML تلقائيًا. حدد Raw لتحرير HTML مباشرة. إذا قمت بتغيير هذا الإعداد ، يجب عليك حفظ المكون ثم إعادة فتحه للتحرير.
ur: مواد داخل کرنے کیلئے بصری منتخب کریں اور ایڈیٹر کو خود بخود ایچ ٹی ایم ایل بنائیں. براہ راست ایچ ٹی ایم ایل میں ترمیم کرنے کیلئے راؤ کو منتخب کریں اگر آپ اس ترتیب کو تبدیل کرتے ہیں، تو آپ کو جزو کو بچانا ضروری ہے اور پھر ترمیم کے لئے دوبارہ دوبارہ کھولیں.
zh_cn: 选择Visual来输入内容并让编辑器自动创建HTML。选择Raw直接编辑HTML。如果更改此设置，则必须保存该组件，然后重新打开它进行编辑。

source: Circuit Schematic Builder
ar: حلبة التخطيطي باني
ur: سرکٹ سکیمیٹک بلڈر
zh_cn: 电路示意图生成器

source: Staff
ar: العاملين
ur: اسٹاف
zh_cn: 员工

source: Category
ar: الفئة
ur: قسم
zh_cn: 类别

source: More options
ar: مزيد من الخيارات
ur: مزید زرائے
zh_cn: 更多的选择

source: Invalid Certificate
ar: شهادة غير صالحة
ur: غلط سرٹیفکیٹ
zh_cn: 无效的证书

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
ar: خطأ - لا يمكن الحصول على دورة تدريبية برقم التعريف {0} <br/><pre style=";text-align:right;direction:rtl"> {1} </pre>
ur: خرابی - ID {0} کے ساتھ کورس نہیں مل سکا <br/><pre style=";text-align:right;direction:rtl"> {1} </pre>
zh_cn: 错误 - 无法获取ID为{0}的课程<br/><pre> {1} </pre>

source: File history
ar: ملف التاريخ
ur: فائل کی تاریخ
zh_cn: 文件历史

source: The maximum number of words displayed in the generated word cloud.
ar: الحد الأقصى لعدد الكلمات المعروضة في سحابة الكلمة التي تم إنشاؤها.
ur: پیدا شدہ لفظ کلاؤڈ میں ظاہر کردہ الفاظ کی زیادہ سے زیادہ تعداد.
zh_cn: 生成的文字云中显示的单词的最大数量。

source: Site theme changed to {site_theme}
ar: تم تغيير موضوع الموقع إلى {site_theme}
ur: سائٹ مرکزی خیال، موضوع {site_theme} میں تبدیل
zh_cn: 网站主题更改为{site_theme}

source: Enter a Public Display Name:
ar: أدخل اسم العرض العام:
ur: عوامی ڈسپلے نام درج کریں:
zh_cn: 输入公开显示名称：

source: Maximum Words
ar: الحد الأقصى للكلمات
ur: زیادہ سے زیادہ الفاظ
zh_cn: 最大字数

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ar: نظرًا لانتهاء الدورة التدريبية ، لم يعد هذا الواجب متاحًا. {line_break} إذا كنت قد أكملت هذا الواجب ، فستكون درجةك متاحة على {link_start} صفحة التقدم {link_end}.
ur: کیونکہ کورس ختم ہوگیا ہے، کیونکہ یہ تفویض ابھی دستیاب نہیں ہے. {line_break} اگر آپ نے اس تفویض کو مکمل کر لیا ہے تو، آپ کے گریڈ {link_start} ترقی کے صفحے {link_end} پر دستیاب ہے.
zh_cn: 由于课程已结束，因此此作业不再可用。{line_break}如果您已完成此作业，则可在{link_start}进度页{link_end}上查看您的成绩。

source: Answer
ar: إجابة
ur: جواب
zh_cn: 回答

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH MATERIAL OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
ar: استخدام APIS ومحتوى واجهة برمجة التطبيقات وأي خدمات تم الحصول عليها من أو من خلال APIS ، على مسؤوليتك الخاصة. الوصول إلى أو تنزيل معلومات أو مواد أو بيانات من خلال APIS على مسؤوليتك الخاصة والمخاطر ، وسوف تكون أنت وحدك مسؤولاً عن أي ضرر يلحق بالممتلكات الخاصة بك (بما في ذلك نظام الكمبيوتر الخاص بك) أو فقدان للبيانات التي تنجم عن التحميل أو استخدام هذه المواد أو البيانات ، ما لم ينص على خلاف ذلك صراحة في سياسة {platform_name} الخصوصية.
ur: اے پی آئی کا استعمال، اور اے پی پی کے مواد اور اے پی آئی کے ذریعے یا کسی بھی سروسز سے متعلق خدمات، آپ کے خطرے میں ہے. آپ کی تشویش اور خطرے کے بارے میں معلومات، مواد یا ڈیٹا کے ذریعہ آپ کو رسائی حاصل ہے یا آپ کی تشخیص اور خطرے سے متعلق ہے، اور آپ کو کسی بھی قسم کے لئے مکمل طور پر قبول کرنا پڑے گا (آپ کے کمپیوٹر سسٹم کے تحت) یا ڈیٹا کی کمی ہے کہ ڈاؤن لوڈ کردہ یا مواد یا ڈیٹا کا استعمال، {platform_name} پرائیویسی پالیسی میں واضح طور پر پیش کردہ دوسری ویب سائٹ کا استعمال.
zh_cn: 使用API​​S以及从API或通过APIS获得的API内容和任何服务，由您自担风险。您通过AP访问或下载信息，资料或数据属于您自己的判断和风险，并且您将独自承担由于下载或结果导致的对您的财产（包括计算机系统）或数据丢失的任何损害使用此类材料或数据，除非在{平台名称}隐私政策中另有明确规定。

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
ar: قد ترغب في تعديل XML في مكتبتك مباشرة ، خارج {studio_name}. قد ترغب في إنشاء نسخة احتياطية من مكتبتك. أو قد ترغب في إنشاء نسخة من مكتبتك التي يمكنك استيرادها لاحقًا إلى مثيل مكتبة أخرى وتخصيصها.
ur: آپ {Studio_name} کے باہر، براہ راست اپنی لائبریری میں XML میں ترمیم کرنا چاہتے ہیں. آپ اپنی لائبریری کا ایک بیک اپ کاپی بنانا چاہتے ہیں. یا، آپ اپنی لائبریری کا ایک نقل بنانا چاہتے ہیں جو آپ بعد میں کسی اور لائبریری مثال میں درآمد کرسکتے ہیں اور اپنی مرضی کے مطابق کرسکتے ہیں.
zh_cn: 您可能想直接在{studio_name}之外编辑库中的XML。您可能想要创建库的备份副本。或者，您可能希望创建一个库的副本，以便以后可以将其导入另一个库实例并进行自定义。

source: Ed. Completed
ar: إد. منجز
ur: ایڈ. مکمل
zh_cn: 埃德。已完成

source: Some error occured during password change. Please try again
ar: حدث خطأ ما أثناء تغيير كلمة المرور. حاول مرة اخرى
ur: پاس ورڈ کی تبدیلی کے دوران کچھ خرابی ہوئی. دوبارہ کوشش کریں
zh_cn: 密码更改期间发生某些错误。请再试一次

source: Status
ar: الحالة
ur: حالت
zh_cn: 状态

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible action: retry with another form of payment.
ar: بطاقة منتهية الصلاحية. قد تتلقى أيضًا هذا إذا كان تاريخ انتهاء الصلاحية الذي قدمته لا يتطابق مع تاريخ وجود المصرف المُصدر في الملف. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: متوقع کارڈ. آپ یہ بھی وصول کرسکتے ہیں اگر آپ کی مدت ختم ہونے والی تاریخ آپ جاری کردہ بینک سے فائل سے متفق نہیں ہے تو فائل پر ہے. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 过期的卡。如果您提供的到期日与开证银行存档的日期不符，您也可能会收到此信息。可能的行动：以另一种形式的付款重试。
