Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: الوقت الذي تريد أن يبدأ فيه الفيديو إذا كنت لا تريد تشغيل الفيديو بالكامل. غير مدعوم في تطبيق الجوال الأصلي: سيتم تشغيل ملف الفيديو بالكامل. منسق كـ HH: MM: SS. القيمة القصوى هي 23:59:59.
ur: جب آپ چاہتے ہیں کہ آپ ویڈیو چاہتے ہیں تو آپ پورے ویڈیو کو کھیلنے کے لئے نہیں چاہتے ہیں. مقامی موبائل ایپ میں معاون نہیں ہے: مکمل ویڈیو فائل کھیلے گی. ایچ ایچ کے طور پر تشکیل دی گئی: ایم ایم: ایس ایس. زیادہ سے زیادہ قیمت 23:59:59 ہے.
zh_cn: 如果您不希望整个视频播放，您希望视频开始播放的时间。原生移动应用不支持：完整的视频文件将播放。格式化为HH：MM：SS。最大值是23:59:59。

source: Coupon Code List
ar: قائمة كود القسيمة
ur: کوپن کوڈ کی فہرست
zh_cn: 优惠券代码清单

source: Coupon Codes
ar: رموز القسيمة
ur: کوپن کوڈز
zh_cn: 优惠券代码

source: You are no longer logged in. Bye bye!
ar: لم تعد مسجلاً للدخول.
ur: آپ اب لاگ ان نہیں ہیں. الوداع!
zh_cn: 您不再登录。再见！

source: Description and/or admin notes.
ar: الوصف و / أو ملاحظات المسؤول.
ur: تفصیل اور / یا منتظم نوٹ.
zh_cn: 说明和/或管理说明。

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
ar: أدخل مفاتيح السياسة والقيم لتمكين ميزة المجموعة النموذجية ، أو تحديد الواجب الدراسي التلقائي للمجموعات ، أو تحديد أي مواضيع مناقشة على مستوى الدورة التدريبية كخاصة لأعضاء المجموعات.
ur: کوورٹ کی خصوصیت کو فعال کرنے کے لئے پالیسی کی چابیاں اور اقدار درج کریں، گروپوں کو خودکار طالب علم تفویض کی وضاحت کریں، یا اراکین کو کوٹ کرنے کے لئے نجی طور پر کسی بھی کورس کے وسیع بحث کے موضوعات کی شناخت کریں.
zh_cn: 输入策略键和值以启用队列功能，将自动学生分配定义为组，或将任何课程范围内的讨论主题标识为队列成员专用的。

source: Course End Time
ar: وقت نهاية الدورة التدريبية
ur: کورس کے اختتام کا وقت
zh_cn: 课程结束时间

source: Studio
ar: ستوديو
ur: سٹوڈیو
zh_cn: 工作室

source: You only have {days} day left to verify for this course.
ar: أمامك {days} يوم واحد فقط للتحقق من هذه الدورة التدريبية.
ur: آپ کے پاس صرف اس دن کے لئے {دن} دن باقی ہے.
zh_cn: 您只剩下{天}天来验证此课程。

source: Will be shown in any discussions or forums you participate in
ar: سيتم عرضه في أي مناقشات أو منتديات تشارك فيها
ur: کسی بھی مباحثے یا فورم میں شامل ہوں گے جن میں آپ شرکت کرتے ہیں
zh_cn: 将在您参与的任何讨论或论坛中展示

source: Tweet that you've enrolled in this course
ar: سقسقة قمت بتسجيلها في هذه الدورة التدريبية
ur: اس ٹویٹ میں آپ کو اندراج کیا گیا ہے کہ ٹویٹ
zh_cn: 鸣叫你已经参加了这门课程

source: Program Details
ar: تفاصيل البرنامج
ur: پروگرام کی تفصیلات
zh_cn: 计划详情

source: Cancel, restore, or mark an enrollment code as unused.
ar: قم بإلغاء أو استعادة أو وضع علامة على رمز التسجيل على أنه غير مستخدم.
ur: غیر استعمال شدہ طور پر داخلہ کوڈ کو منسوخ، بحال یا نشان زد کریں.
zh_cn: 取消，恢复或将注册码标记为未使用。

source: All Learners
ar: كل المتعلمين
ur: تمام محققین
zh_cn: 所有学习者

source: Your current verification is effective until {date}.
ar: يسري التحقق الحالي الخاص بك حتى {date}.
ur: آپ کی موجودہ تصدیق {تاریخ} تک مؤثر ہے.
zh_cn: 您目前的验证在{date}之前有效。

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
ar: الطالب {student} ليس لديه شهادة للدورة التدريبية {course}. يرجى التحقق من اسم المستخدم / البريد الإلكتروني الخاص بالطلاب والدورة التدريبية المحددة صحيحة وإعادة المحاولة.
ur: طالب علم {طالب علم} کورس کورس کے لئے نہیں ہے {کورس}. برائے مہربانی طالب علم کا صارف نام / ای میل کی توثیق کریں اور منتخب شدہ کورس درست ہیں اور دوبارہ کوشش کریں.
zh_cn: 学生{学生}没有课程{课程}的证书。请确认学生用户名/电子邮件和所选课程是否正确，然后重试。

source: example: A123DS
ar: مثال: A123DS
ur: مثال: A123DS
zh_cn: 例如：A123DS

source: Starts - {date}
ar: يبدأ - {date}
ur: شروع ہوتا ہے - {تاریخ}
zh_cn: 开始 - {date}

source: Prerequisite Course
ar: دورة المتطلبات المسبقة
ur: لازمی کورس
zh_cn: 先决条件课程

source: Data {em_start}exported with{em_end} your course:
ar: تم تصدير البيانات {em_start} مع {em_end} دورتك التدريبية:
ur: ڈیٹا {em_start} اپنے کورس {em_end} کے ذریعہ برآمد کیا:
zh_cn: 使用{em_end}导出的数据{em_start}您的课程：

source: CCX student list management response message
ar: رسالة استجابة إدارة قائمة الطلاب CCX
ur: CCX طالب علم کی فہرست مینجمنٹ جوابی پیغام
zh_cn: CCX学生列表管理响应消息

source: New Section
ar: قسم جديد
ur: نیا سیکشن
zh_cn: 新的部分

source: You can no longer change sessions.
ar: لم يعد بإمكانك تغيير الجلسات.
ur: آپ مزید سیشن تبدیل نہیں کر سکتے ہیں.
zh_cn: 您无法再更改会话。

source: Additional Receipt Recipient
ar: مستلم إيصال إضافي
ur: اضافی رسید وصول کنندہ
zh_cn: 额外的收据收件人

source: Using library content in courses
ar: استخدام محتوى المكتبة في الدورات
ur: کورسز میں لائبریری کے مواد کا استعمال کرتے ہوئے
zh_cn: 在课程中使用图书馆内容

source: Reviews
ar: التعليقات
ur: جائزے
zh_cn: 评测

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تم إرسال إجابتك. بمجرد أن يتم تقييم التقديم الخاص بك ، سيتم استبدال هذه الرسالة بملاحظات الممهد.
ur: آپ کا جواب جمع کردیا گیا ہے. جیسے ہی آپ کی جمع کردہ درجہ بندی کی گئی ہے، یہ پیغام گرڈر کی رائے کے ساتھ تبدیل کردیا جائے گا.
zh_cn: 你的答案已经提交。一旦您的提交评分，此消息将被评分者的反馈所取代。

source: Dictionary for maintaining the state of inputtypes
ar: قاموس للحفاظ على حالة من أنواع inputtypes
ur: ان پٹ ٹائپ کی حالت کو برقرار رکھنے کے لئے لغت
zh_cn: 用于维护输入类型状态的字典

source: Diacritic Marks
ar: علامات التشكيل
ur: ڈائاسٹرک مارکس
zh_cn: 变音符号

source: Share with friends and family!
ar: مشاركتها مع الأصدقاء والعائلة!
ur: دوستوں اور خاندان کے ساتھ اشتراک کریں!
zh_cn: 与朋友和家人分享！

source: Tabs Exception
ar: استثناءات علامات التبويب
ur: ٹیبز استثنا
zh_cn: 选项卡例外

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
ar: على استعداد لبدء إنشاء دورات عبر الإنترنت؟ اشترك أدناه وابدأ في إنشاء أول {platform_name} دورة اليوم.
ur: آن لائن کورسز بنانے کے لئے تیار ہیں؟ ذیل میں سائن اپ کریں اور اپنے پہلے {platform_name} کورس کو آج شروع کریں.
zh_cn: 准备开始创建在线课程？立即注册并立即开始创建您的第一个{platform_name}课程。

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
ar: أدخل صح أو خطأ. إذا كانت هذه القيمة صحيحة ، يتم تمكين الاختبارات المحددة في الدورة التدريبية الخاصة بك. بغض النظر عن هذا الإعداد ، يتم تمكين الاختبارات المحددة في الوقت المحدد في حالة تمكين Exams Proctorsed Exams على true.
ur: صحیح یا غلط درج کریں. اگر یہ قیمت سچ ہے تو، آپ کے کورس میں ٹائم شدہ امتحان فعال ہیں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. اس ویڈیو پر غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے. براہ مہربانی دوبارہ کوشش کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں.
zh_cn: 输入true或false。如果此值为true，则在您的课程中启用定时考试。无论如何设置，如果启用Proctored Exams设置为true，则启用定时考试。

source: Discount Applied:
ar: الخصم قد تم:
ur: ڈسکاؤنٹ لاگو:
zh_cn: 适用的折扣：

source: Expand All Sections
ar: توسيع كل الأقسام
ur: تمام حصوں کو کھولیں
zh_cn: 展开所有部分

source: Sign up with {provider_name}
ar: اشترك مع {provider_name}
ur: {provider_name} کے ساتھ سائن اپ کریں
zh_cn: 使用{provider_name}注册

source: Invalid math syntax: '{student_answer}'
ar: بنية الرياضيات غير الصالحة: &#39;{student_answer}&#39;
ur: غلط ریاضی مطابقت: &#39;{student_answer}&#39;
zh_cn: 无效的数学语法：&#39;{student_answer}&#39;

source: Problem Scores:
ar: درجات المشكلة:
ur: مسئلہ اسکور:
zh_cn: 问题得分：

source: You worked hard to earn your certificate from {accomplishment_copy_course_org} {dash} share it with colleagues, friends, and family to get the word out about what you mastered in {accomplishment_course_title}.
ar: لقد عملت جاهداً للحصول على شهادتك من {accomplishment_copy_course_org} {dash} قم بمشاركتها مع الزملاء والأصدقاء والعائلة للحصول على الخبر حول ما أتقنته في {accomplishment_course_title}.
ur: {accomplishment_copy_course_org} {dash} سے اپنے سرٹیفکیٹ حاصل کرنے کے لئے آپ نے محنت کی اور اپنے ساتھیوں، دوستوں اور خاندان کے ساتھ اس کا اشتراک کیا تاکہ آپ {accomplishment_course_title} میں مہارت حاصل کرلیں.
zh_cn: 您努力工作以获得{achievementment_copy_course_org} {破折号}与同事，朋友和家人分享的证书，以了解您在{achievementment_course_title}中掌握的内容。

source: Total Amount of Refunds
ar: المبلغ الإجمالي للمبالغ المستردة
ur: رقم کی کل رقم
zh_cn: 总退款金额

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
ar: {b_start} دعم مهمتنا: {b_end} تعتمد EdX ، وهي منظمة غير ربحية ، على شهادات تم التحقق منها للمساعدة في تمويل التعليم المجاني للجميع على مستوى العالم
ur: {b_start} ہمارے مشن کو سپورٹ کریں: {b_end} ایڈی ایکس، غیر منافع بخش، تصدیق شدہ سرٹیفکیٹ پر انحصار کرتا ہے تاکہ دنیا بھر میں مفت تعلیم کے فنڈ میں مدد کی جائے
zh_cn: {b_start}支持我们的使命：{b_end} EdX是一家非营利性机构，依靠经过验证的证书来资助全球所有人免费教育

source: Organization Contact
ar: منظمة الاتصال
ur: تنظیم رابطہ
zh_cn: 组织联系

source: E-Commerce
ar: التجارة الإلكترونية
ur: ای کامرس
zh_cn: 电子商务

source: Your account activation is invalid
ar: تنشيط حسابك غير صالح
ur: آپ کے اکاؤنٹ کی سرگرمی غلط ہے
zh_cn: 您的帐户激活无效

source: E-mail change failed
ar: فشل تغيير البريد الإلكتروني
ur: ای میل تبدیل ناکام ہوگیا
zh_cn: 电子邮件更改失败

source: Updates to Discussion Posts You Follow
ar: تحديثات لمناقشات الوظائف التي تتبعها
ur: آپ کی پیروی کریں بحث کے مراسلات کے بارے میں اپ ڈیٹ
zh_cn: 您关注的讨论帖子更新

source: What are pages?
ar: ما هي الصفحات؟
ur: صفحات کیا ہیں؟
zh_cn: 什么是页面？

source: group write access
ar: وصول مجموعة الكتابة
ur: گروپ تک رسائی حاصل ہے
zh_cn: 组写入权限

source: There is no transcript file associated with the {lang} language.
ar: لا يوجد ملف نصوص مرتبط بلغة {lang}.
ur: {lang} زبان کے ساتھ کوئی ٹرانسپٹ فائل نہیں ہے.
zh_cn: 没有与{lang}语言相关联的脚本文件。

source: Students whose accounts have been disabled
ar: الطلاب الذين تم تعطيل حساباتهم
ur: طلباء جن کے اکاؤنٹس غیر فعال ہیں
zh_cn: 账户被禁用的学生

source: Library Import
ar: استيراد المكتبة
ur: لائبریری درآمد
zh_cn: 图书馆导入

source: The experiment is not associated with a group configuration.
ar: لا ترتبط التجربة بتكوين المجموعة.
ur: استعمال گروپ گروپ کی ترتیب سے منسلک نہیں ہے.
zh_cn: 该实验与组配置无关。

source: Follow {platform_name} on Google+
ar: اتبع {platform_name} على Google+
ur: Google+ پر {platform_name} کو فالو کریں
zh_cn: 关注Google+上的{platform_name}

source: Reorganizing components
ar: إعادة تنظيم المكونات
ur: اجزاء کو دوبارہ ترتیب دینا
zh_cn: 重组组件

source: API access request from {company}
ar: طلب الوصول إلى واجهة برمجة التطبيقات من {company}
ur: {کمپنی} سے API تک رسائی کی درخواست
zh_cn: 来自{company}的API访问请求

source: Learn more
ar: أعرف أكثر
ur: اورجانیے
zh_cn: 学到更多

source: Location
ar: موقعك
ur: مقام
zh_cn: 位置

source: Create My Account
ar: إنشيء حسابي
ur: میرا کھاتہ کھولیں
zh_cn: 创建我的账户

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {error_message}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
ar: آسف! نظرًا لحدوث خطأ ، تم تحصيل رسوم الشراء الخاصة بك بمبلغ مختلف عن إجمالي الطلب! رسالة الخطأ المحددة هي: {error_message}. من المحتمل أن يتم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ایک غلطی کی وجہ سے آپ کی خریداری کا حکم کل سے مختلف رقم کے لئے چارج کیا گیا تھا! مخصوص خامی پیغام ہے: {error_message}. آپ کا کریڈٹ کارڈ شاید چارج کیا گیا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!由于出现错误，您的购买金额与订单总额不同！具体的错误消息是：{error_message}。您的信用卡可能已被收费。请通过{email}与我们联系并提供特定付款问题。

source: Failed Duplicate
ar: فشل تكرار
ur: ناکام ہوگیا
zh_cn: 失败重复

source: There was a problem with this transaction. You have not been charged.
ar: كانت هناك مشكلة في هذه المعاملة. لم يتم تحصيل رسوم منك.
ur: اس ٹرانزیکشن کے ساتھ ایک مسئلہ تھا. آپ کو چارج نہیں کیا گیا ہے.
zh_cn: 这笔交易存在问题。你没有被指控。

source: Consent to share your data
ar: الموافقة على مشاركة بياناتك
ur: آپ کے ڈیٹا کا اشتراک کرنے کی رضامندی
zh_cn: 同意分享您的数据

source: Enrollment Source
ar: مصدر التسجيل
ur: اندراج کا ذریعہ
zh_cn: 注册来源

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
ar: لن تكون صفحة ملخص الدورة الخاصة بك قابلة للعرض حتى يتم الإعلان عن الدورة التدريبية الخاصة بك. لتوفير محتوى للصفحة ومعاينته ، اتبع الإرشادات المقدمة من مدير البرنامج.
ur: جب تک آپ کا کورس اعلان نہیں کیا گیا ہے، اس وقت تک آپ کا کورس کا خلاصہ صفحہ ملاحظہ نہیں کیا جائے گا. صفحہ کے لئے مواد فراہم کرنے اور اس کا پیش نظارہ کرنے کے لئے، اپنے پروگرام مینیجر کے ذریعہ فراہم شدہ ہدایات پر عمل کریں.
zh_cn: 直到你的课程被宣布之后，你的课程摘要页面才会被浏览。要为页面提供内容并进行预览，请按照程序管理器提供的说明进行操作。

source: No matching course found.
ar: لم يتم العثور على دورة مطابقة.
ur: کوئی مماثلت نہیں ملا.
zh_cn: 未找到匹配的课程。

source: Partially Correct
ar: صحيح جزئيا
ur: جزوی طور پر درست
zh_cn: 部分正确

source: The payment processor did not return a required parameter: {0}
ar: لم يُرجع معالج الدفع معلمة مطلوبة: {0}
ur: ادائیگی کے پروسیسر نے مطلوبہ پیرامیٹر واپس نہیں کیا: {0}
zh_cn: 付款处理器未返回所需的参数：{0}

source: Drag sections, subsections, and units to new locations in the outline.
ar: اسحب المقاطع والأقسام الفرعية والوحدات إلى مواقع جديدة في المخطط.
ur: لائن میں نئے مقامات پر حصوں، حصوں، اور یونٹس کو گھسیٹیں.
zh_cn: 将章节，小节和单位拖到大纲中的新位置。

source: First day students can enroll
ar: يمكن للطلاب اليوم الأول التسجيل
ur: پہلا دن طلبا اندراج کرسکتے ہیں
zh_cn: 第一天学生可以报名

source: A transcript with the "{language_code}" language code already exists.
ar: يوجد بالفعل نص مع رمز اللغة &quot;{language_code}&quot;.
ur: &quot;{language_code}&quot; زبان کا کوڈ پہلے سے موجود ہے کے ساتھ ایک نقل.
zh_cn: 带有“{language_code}”语言代码的成绩单已经存在。

source: Required data to force publish course.
ar: البيانات المطلوبة لفرض نشر الدورة.
ur: کورس شائع کرنے کے لئے ضروری اعداد و شمار.
zh_cn: 强制发布课程所需的数据。

source: Started - {date}
ar: بدأت - {date}
ur: شروع ہوا - {تاریخ}
zh_cn: 开始 - {date}

source: Instructor
ar: مدرب
ur: انسٹرکٹر
zh_cn: 讲师

source: e.g. CS101
ar: على سبيل المثال CS101
ur: مثال کے طور پر CS101
zh_cn: 例如CS101

source: Expiration Date
ar: تاريخ إنتهاء الصلاحية
ur: ختم ہونے کی تاریخ
zh_cn: 截止日期

source: The file must end with the extension '{file_types}'.
ar: يجب أن ينتهي الملف بالملحق &#39;{file_types}&#39;.
ur: فائل &#39;توسیع&#39; {file_types} کے ساتھ ختم ہونا ضروری ہے.
zh_cn: 该文件必须以扩展名“{file_types}”结尾。

source: The template file to use when generating the certificate.
ar: ملف القالب الذي سيتم استخدامه عند تكوين الشهادة.
ur: سرٹیفکیٹ پیدا کرنے کے لئے سانچے فائل استعمال کرنے کے لئے.
zh_cn: 生成证书时使用的模板文件。

source: Select your profession.
ar: اختر مهنتك.
ur: اپنا پیشہ منتخب کریں.
zh_cn: 选择你的职业。

source: Youtube
ar: موقع YouTube
ur: یو ٹیوب
zh_cn: 的Youtube

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
ar: التكلفة المعروضة للطلاب للتسجيل في الدورة التدريبية. إذا تم تعيين سعر تسجيل مدفوع للدورة التدريبية بواسطة مسؤول في قاعدة البيانات ، فسيتم عرض هذا السعر بدلاً من هذا السعر.
ur: کورس میں داخلہ لینے کے لئے طالب علموں کو دکھایا گیا ہے. اگر ایک ادا کردہ ڈومین رجسٹریشن قیمت ڈیٹا بیس میں منتظم کے ذریعہ مقرر ہوتا ہے، تو اس قیمت کے بجائے اس قیمت کو دکھایا جائے گا.
zh_cn: 显示给学生注册课程的费用。如果管理员在数据库中设置了付费课程注册价格，则将显示该价格而不是此价格。

source: You are missing one or more required fields
ar: أنت في عداد واحد أو أكثر من الحقول المطلوبة
ur: آپ ایک یا زیادہ مطلوبہ شعبوں کو غائب کر رہے ہیں
zh_cn: 您缺少一个或多个必填字段

source: You may not use variables ({bad_variables}) in numerical problems.
ar: لا يجوز لك استخدام المتغيرات ({bad_variables}) في المشاكل العددية.
ur: آپ متغیر ({bad_variables}) استعمال نہیں کر سکتے ہیں عددی مسائل میں.
zh_cn: 数值问题中不能使用变量（{bad_variables}）。

source: Email Addresses/Usernames
ar: عناوين البريد الإلكتروني / أسماء المستخدمين
ur: ای میل ایڈریس / صارف نام
zh_cn: 电子邮件地址/用户名

source: Learn more about textbooks
ar: معرفة المزيد حول الكتب المدرسية
ur: درسی کتابوں کے بارے میں مزید جانیں
zh_cn: 详细了解教科书

source: Working with content experiments
ar: العمل مع تجارب المحتوى
ur: مواد کے استعمال کے ساتھ کام کرنا
zh_cn: 处理内容实验

source: {assignment_type} = {weighted_percent:.2%} of a possible {weight:.2%}
ar: {assignment_type} = {weighted_percent: .2٪} من {weight: .2٪} محتمل
ur: ممکنہ {وزن: .2٪} کے {assignment_type} = {weighted_percent: .2٪}
zh_cn: {weight：.2％}的{assignment_type} = {weighted_percent：.2％}

source: Course Start Date:
ar: تاريخ بدء الدورة:
ur: کورس کی شروعات کی تاریخ:
zh_cn: 课程开课日期：

source: * Required Information
ar: * معلومات مطلوبة
ur: * ضروری معلومات
zh_cn: * 要求（提供）的信息

source: Articles that will be deleted
ar: المواد التي سيتم حذفها
ur: مضامین حذف ہو جائیں گے
zh_cn: 将被删除的文章

source: Team
ar: الفريق
ur: ٹیم
zh_cn: 球队

source: {relative} ago - {absolute}
ar: {نسبيًا} - {مطلقًا}
ur: {رشتہ دار} پہلے - {مطلق}
zh_cn: {相对}之前 - {绝对}

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
ar: الدرجة الدنيا التي يجب أن يكسبها المتعلم للحصول على ائتمان في الدورة ، كقيمة عشرية بين 0.0 و 1.0. على سبيل المثال ، بالنسبة إلى 75٪ ، أدخل 0.75.
ur: 0.0 اور 1.0 کے درمیان ایک ڈیسر کے طور پر، سیکھنے والے کم از کم گریڈ کورس میں کریڈٹ حاصل کرنے کے لئے کمانا ہوگا. مثال کے طور پر، 75٪ کے لئے، 0.75 درج کریں.
zh_cn: 学习者在课程中必须获得学分的最低等级，小数位在0.0到1.0之间。例如，对于75％，输入0.75。

source: Check and repair external authentication map
ar: تحقق من خريطة المصادقة الخارجية وقم بإصلاحها
ur: بیرونی تصدیق کے نقشے کو چیک کریں اور مرمت کریں
zh_cn: 检查并修复外部认证地图

source: Preferred language for transcript.
ar: اللغة المفضلة للنسخة.
ur: ٹرانسپٹ کے لئے پسندیدہ زبان.
zh_cn: 成绩单的首选语言。

source: Account Settings
ar: إعدادت الحساب
ur: اکاؤنٹ کی ترتیبات
zh_cn: 帐号设定

source: To access the course visit {course_url} and login.
ar: للوصول إلى الدورة التدريبية ، تفضل بزيارة {course_url} وتسجيل الدخول.
ur: کورس ملاحظہ کریں {کورس_ورسل} اور لاگ ان.
zh_cn: 要访问课程，请访问{course_url}并登录。

source: When this article is edited
ar: عندما يتم تحرير هذه المقالة
ur: جب یہ مضمون تدوین کیا جاتا ہے
zh_cn: 当这篇文章被编辑

source: % Discount
ar: ٪ خصم
ur: ڈسکاؤنٹ
zh_cn: ％折扣

source: Practice scores are hidden until the due date.
ar: يتم إخفاء درجات الممارسة حتى تاريخ الاستحقاق.
ur: متوقع اسکور اس تاریخ تک چھپے ہوئے ہیں.
zh_cn: 练习成绩隐藏到截止日期。

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
ar: لقد أرسلنا إليك تعليمات عبر البريد الإلكتروني لتعيين كلمة المرور الخاصة بك على عنوان البريد الإلكتروني الذي أرسلته. يجب أن تستلمها بعد قليل.
ur: ہم نے آپ کو جمع کردہ ای میل ایڈریس پر اپنا پاس ورڈ مقرر کرنے کے لئے آپ کو ہدایات بھیج دی ہے. تمہیں اسے جلد ہی ملنا چاہئے.
zh_cn: 我们通过电子邮件向您发送了将您的密码设置为您提交的电子邮件地址的说明。你应该很快收到。

source: Change Your Mind Anytime
ar: تغيير عقلك في أي وقت
ur: اپنے دماغ میں کسی بھی وقت تبدیل کریں
zh_cn: 随时改变你的想法

source: Poster Image URL
ar: عنوان صورة الملصق
ur: پوسٹر تصویری یو آر ایل
zh_cn: 海报图片网址

source: Error occured. Please try again later.
ar: حدث خطأ. الرجاء معاودة المحاولة في وقت لاحق.
ur: خرابی ہوئی. براہ کرم کچھ دیر بعد کوشش کریں.
zh_cn: 发生了错误。请稍后再试。

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rightrs notices incorporated in or accompanying the API Content. If any third party revokes access to API Content owned or controlled by that third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that third party is deleted from your app, networks, systems and servers as soon as reasonably possible. If you stop using the APIs altogether or if your API access is revoked, you must delete all API Content in the same way.
ar: جميع الأسماء والشعارات والأختام (&quot;العلامات التجارية&quot;) التي تظهر في واجهات برمجة التطبيقات ، أو محتوى واجهة برمجة التطبيقات ، أو في أو من خلال الخدمات المتوفرة في أو من خلال واجهات برمجة التطبيقات ، إن وجدت ، هي ملك لأصحابها المعنيين. لا يجوز لك إزالة أو تغيير أو حجب أي حقوق طبع ونشر أو علامة تجارية أو غيرها من إشعارات حقوق الملكية الخاصة المدرجة في أو ترافق محتوى واجهة برمجة التطبيقات. إذا ألغى أي طرف ثالث الدخول إلى محتوى واجهة برمجة التطبيقات المملوكة أو التي يتحكم فيها هذا الطرف الثالث ، بما في ذلك على سبيل المثال لا الحصر أي علامات تجارية ، يجب عليك التأكد من حذف جميع محتوى واجهة برمجة التطبيقات المتعلقة بهذه الجهة الخارجية من التطبيق والشبكات والأنظمة والخوادم في أقرب وقت ممكن ممكن. إذا توقفت عن استخدام واجهات برمجة التطبيقات تمامًا أو تم إبطال الوصول إلى واجهة برمجة التطبيقات ، فيجب حذف جميع محتوى واجهة برمجة التطبيقات بنفس الطريقة.
ur: تمام ناموں، علامات اور سیل (&quot;ٹریڈ مارک&quot;) جو APIs، API کے مواد، یا APIs پر یا اس کے ذریعہ دستیاب کردہ خدمات پر یا اس کے ذریعہ موجود ہوتے ہیں، ان کے متعلقہ مالکان کی جائیداد ہیں. آپ کسی بھی کاپی رائٹ، ٹریڈ مارک، یا دیگر مواد کے حقائق کے نوٹس کو ہٹا دیں یا تبدیل نہیں کرسکتے ہیں، جو آپ کو API کے مواد میں شامل یا شامل کردیے گئے ہیں. اگر کوئی تیسری پارٹی کسی تیسری پارٹی کی ملکیت API یا ملکیت پر قابو پاتا ہے، بشمول کسی بھی ٹریڈ مارک کی حد تک محدود نہیں ہے، تو آپ کو یہ یقینی بنانا چاہیے کہ آپ کے ایپ، نیٹ ورکس، سسٹم اور سرورز سے جلد ہی مناسب طریقے سے اس تیسری پارٹی سے متعلق تمام API کے مواد کو خارج کر دیا جائے. ممکن. اگر آپ API کے ساتھ مکمل طور پر استعمال کرتے ہیں یا آپ کے API تک رسائی کو منسوخ کر دیا جاتا ہے تو، آپ کو اسی طرح میں تمام API مواد کو حذف کرنا لازمی ہے.
zh_cn: 出现在API，API内容中，或通过或通过API提供的服务（如有）的所有名称，徽标和印章（“商标”）均为其各自所有者的财产。您不得删除，更改或隐藏任何版权，商标或其他专有权利人声明，并将其纳入或随同API内容。如果任何第三方撤销对该第三方拥有或控制的API内容的访问权限（包括但不限于任何商标），则必须确保与该第三方有关的所有API内容尽快从您的应用程序，网络，系统和服务器中删除可能。如果您完全停止使用这些API，或者您的API访问已被撤销，则必须以相同的方式删除所有API内容。

source: Your banner image URL
ar: عنوان URL لصورة الشعار الخاص بك
ur: آپ بینر تصویر URL
zh_cn: 您的横幅图片网址

source: Location in Course Outline
ar: الموقع في مخطط بالطبع
ur: کورس آؤٹ لائن میں مقام
zh_cn: 课程大纲中的位​​置

source: Student Response
ar: استجابة الطالب
ur: طالب علم کا جواب
zh_cn: 学生回应

source: Your words were:
ar: كلماتك كانت:
ur: آپ کے الفاظ تھے:
zh_cn: 你的话是：

source: A slug named "%s" already exists.
ar: يوجد بالفعل عنصر ثابت يسمى &quot;٪ s&quot;.
ur: &quot;٪ s&quot; نامی ایک سلگ پہلے ہی موجود ہے.
zh_cn: 名为“％s”的slu already已经存在。

source: Editing components
ar: تحرير المكونات
ur: اجزاء میں ترمیم کریں
zh_cn: 编辑组件

source: Current Verification Status: Expired
ar: حالة التحقق الحالية: منتهية الصلاحية
ur: موجودہ توثیق کی حیثیت: ختم ہو گئی
zh_cn: 当前验证状态：已过期

source: This article together with all its contents are now completely gone! Thanks!
ar: هذه المادة مع جميع محتوياتها هي الآن ذهبت تماما! شكر!
ur: اس آرٹیکل کے ساتھ ساتھ اس مضمون کو مکمل طور پر چلا گیا ہے! شکریہ!
zh_cn: 这篇文章连同它的所有内容现在完全消失了！谢谢！

source: The owner of the article, usually the creator. The owner always has both read and write access.
ar: مالك المقال ، عادةً المنشئ. يمتلك المالك دائمًا حق الوصول للقراءة والكتابة.
ur: مضمون کا مالک، عام طور پر خالق. مالک ہمیشہ پڑھ اور لکھنے دونوں تک رسائی حاصل کرتا ہے.
zh_cn: 文章的所有者，通常是创作者。拥有者总是拥有读写权限。

source: Course Registration Close Date
ar: التسجيل في الدورة تاريخ الإغلاق
ur: کورس رجسٹریشن بند تاریخ
zh_cn: 课程注册关闭日期

source: Click the link to see my certificate.
ar: انقر فوق الرابط لرؤية شهادتي.
ur: میرے سرٹیفکیٹ کو دیکھنے کے لئے لنک پر کلک کریں.
zh_cn: 点击链接查看我的证书。

source: List date extensions for student
ar: إدراج إضافات التاريخ للطلاب
ur: طالب علم کے لئے تاریخ کی توسیع کی فہرست
zh_cn: 列出学生的日期延长

source: Purchasing organization
ar: منظمة شرائية
ur: خریداری کی تنظیم
zh_cn: 采购组织
