Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: We're sorry, but this payment was declined. The items in your shopping cart have been saved. If you have any questions about this transaction, please contact us at {email}.
ar: عذرًا ، ولكن تم رفض هذه الدفعة. تم حفظ العناصر الموجودة في سلة التسوق الخاصة بك. إذا كانت لديك أية أسئلة حول هذه المعاملة ، فيرجى الاتصال بنا على {email}.
ur: ہمیں افسوس ہے، لیکن یہ ادائیگی کم ہوگئی تھی. آپ کی خریداری کی ٹوکری میں اشیاء محفوظ کردیے گئے ہیں. اگر آپ کے پاس اس ٹرانزیکشن کے بارے میں کوئی سوال ہے تو، براہ کرم {ای میل} پر ہم سے رابطہ کریں.
zh_cn: 很抱歉，这笔付款已被拒绝。购物车中的商品已保存。如果您对此交易有任何疑问，请通过{email}与我们联系。

source: Hints
ar: إشارة
ur: اشارے
zh_cn: 提示

source: The reports listed below are available for download. A link to every report remains available on this page, identified by the UTC date and time of generation. Reports are not deleted, so you will always be able to access previously generated reports from this page.
ar: التقارير المذكورة أدناه متاحة للتنزيل. يبقى رابط إلى كل تقرير متاحًا في هذه الصفحة ، والذي تم تحديده من قبل تاريخ ووقت إنشاء UTC. لا يتم حذف التقارير ، لذلك ستتمكن دائمًا من الوصول إلى التقارير التي تم إنشاؤها سابقًا من هذه الصفحة.
ur: ذیل میں درج کردہ رپورٹ ڈاؤن لوڈ کے لئے دستیاب ہیں. ہر رپورٹ کا لنک اس صفحے پر دستیاب ہے، جس کی شناخت UTC تاریخ اور نسل کی طرف سے کی گئی ہے. رپورٹیں حذف نہیں ہوئیں، لہذا آپ ہمیشہ اس صفحے سے پہلے سے تیار کردہ رپورٹ تک رسائی حاصل کرنے کے قابل ہوں گے.
zh_cn: 下面列出的报告可供下载。每个报告的链接在该页面上保留，由UTC日期和时间标识。报告不会被删除，因此您将始终能够从此页面访问以前生成的报告。

source: Many %(platform_name)s learners in <strong>%(course_name)s</strong> are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: العديد من <strong>المتابعين</strong> (platform_name) s في <strong>٪ (course_name) s</strong> يكملون المزيد من المشاكل كل أسبوع ، <strong>ويشتركون</strong> في منتديات المناقشة. ماذا تريد أن تفعل للحفاظ على التعلم؟
ur: <strong>٪</strong> میں کئی٪ (platform_name) کے متعلمین <strong>(course_name) کے</strong> زیادہ مسائل ہر ہفتے کو مکمل کریں، اور مباحثے فورمس میں حصہ لے رہے ہیں. سیکھنا رکھنے کے لئے آپ کیا کرنا چاہتے ہیں؟
zh_cn: 很多％（platform_name）的<strong>％（course_name）</strong>学习者每周都会完成更多问题，并参与讨论论坛。你想做什么来继续学习？

source: Textbooks
ar: الكتب المدرسية
ur: درسی کتابیں
zh_cn: 教科书

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
ar: يرجى ملاحظة أن: فريق دعم {platform_name} يتحدث الإنجليزية. بينما سنبذل قصارى جهدنا لمعالجة استفسارك بأي لغة ، فإن ردودنا ستكون باللغة الإنجليزية.
ur: برائے مہربانی نوٹ کریں: {platform_name} سپورٹ ٹیم انگریزی بولی ہے. جب ہم کسی بھی زبان میں آپ کی انکوائری کو حل کرنے کے لئے اپنی پوری کوشش کریں گے، تو ہمارا جواب انگریزی میں ہوگا.
zh_cn: 请注意：{platform_name}支持团队讲英语。尽管我们会尽最大努力解决您的任何语言问题，但我们的答复将以英文提供。

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
ar: إنه أكثر من مجرد خيار متعدد. يدعم {studio_name} أكثر من اثني عشر نوعًا من المشكلات لتحدي المتعلمين.
ur: یہ ایک سے زیادہ انتخاب سے زیادہ ہے. {سٹوڈیو_ نام} اپنے سیکھنے والوں کو چیلنج کرنے کے لۓ ایک درجن سے زائد قسم کے مسائل کی حمایت کرتا ہے.
zh_cn: 这不仅仅是多种选择。 {studio_name}支持十多种类型的问题来挑战你的学习者。

source: Problem Name
ar: اسم المشكلة
ur: مسئلہ کا نام
zh_cn: 问题名称

source: Optional language the team uses as ISO 639-1 code.
ar: لغة اختيارية يستخدمها الفريق كرمز ISO 639-1.
ur: اختیاری زبان ٹیم ٹیم ISO 639-1 کوڈ کے طور پر استعمال کرتا ہے.
zh_cn: 团队使用的可选语言为ISO 639-1代码。

source: Value of this user attribute.
ar: قيمة سمة المستخدم هذه.
ur: اس صارف کے خاصیت کا قدر.
zh_cn: 此用户属性的值。

source: Audit Enrollment
ar: تسجيل المراجعة
ur: آڈٹ اندراج
zh_cn: 审计注册

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
ar: اختياري: بعد هذا التاريخ / الوقت ، لن يتمكن المستخدمون بعد الآن من إرسال الصور للتحقق منهم. هذا appies فقط إلى وسائط التي تتطلب التحقق.
ur: اختیاری: اس تاریخ / وقت کے بعد، صارفین کو مزید تصاویر کی توثیق کے لئے جمع نہیں کر سکیں گے. یہ صرف ان طریقوں کو اپیل کرتا ہے جو توثیق کی ضرورت ہوتی ہے.
zh_cn: 可选：在此日期/时间之后，用户将无法再提交照片进行验证。这仅适用于需要验证的模式。

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider.
ar: تمت مراجعة محاولة امتحان proctored {exam_name} في {course_name} باسم المستخدم: {student_username} على أنه {review_status} من قِبل موفر مراجعة الاختبارات الموقَّر.
ur: {امتحان} کے نام سے ایک امتحان کی امتحان کی کوشش ہوتی ہے {کورس_ نام} میں صارف کا نام: {student_username} پر نظر ثانی کیا گیا تھا {review_status} کے طور پر پروکت شدہ امتحان کے جائزے کے ذریعہ.
zh_cn: 由{{course_name}}通过用户名{{student_username}}对{exam_name}进行监视式考试尝试已被监考考试评估提供商评为{review_status}。

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
ar: إذا تم تحديد هذا الخيار ، فلن يُطلب من المستخدمين تأكيد بريدهم الإلكتروني ، وسيتم تفعيل حسابهم فورًا عند التسجيل.
ur: اگر یہ اختیار منتخب کیا جاتا ہے تو، صارفین کو ان کے ای میل کی توثیق کرنے کی ضرورت نہیں ہوگی، اور ان کا اکاؤنٹ رجسٹریشن پر فوری طور پر چالو کیا جائے گا.
zh_cn: 如果选择此选项，用户将不需要确认他们的电子邮件，并且他们的账户将在注册后立即激活。

source: Sincerely, [[Your Signature]]
ar: مع خالص التقدير ، [[توقيعك]]
ur: مخلص، [[آپ کا دستخط]]
zh_cn: 此致[[您的签名]]

source: Course Wiki
ar: بالطبع ويكي
ur: کورس وکیپیڈیا
zh_cn: 课程维基

source: Enter a numeric value for the discount amount. Do not include the percent sign.
ar: أدخل قيمة رقمية لمبلغ الخصم. لا تتضمن علامة النسبة المئوية.
ur: رعایت کی رقم کے لئے عددی قدر درج کریں. فیصد نشان شامل نہ کریں.
zh_cn: 输入折扣金额的数字值。不要包含百分号。

source: Invoice number '{num}' does not exist.
ar: رقم الفاتورة &#39;{num}&#39; غير موجود.
ur: انوائس نمبر &#39;{num}&#39; موجود نہیں ہے.
zh_cn: 发票号码“{num}”不存在。

source: Enter the name of the course as it should appear in the edX.org course list.
ar: أدخل اسم الدورة التدريبية كما يجب أن تظهر في قائمة الدورات التدريبية في edX.org.
ur: کورس کے نام درج کریں کیونکہ یہ edX.org کورس کی فہرست میں شامل ہونا چاہئے.
zh_cn: 输入该课程的名称，因为它应该出现在edX.org课程列表中。

source: Ordered
ar: أمر
ur: حکم دیا
zh_cn: 有序

source: Attachments
ar: مرفقات
ur: منسلکات
zh_cn: 附件

source: Student-Generated Certificates
ar: شهادات الطالب
ur: طالب علم کی پیدا کردہ سرٹیفکیٹ
zh_cn: 学生生成的证书

source: enrollment
ar: تسجيل
ur: اندراج
zh_cn: 注册

source: There is already a root node on %s
ar: توجد بالفعل عقدة جذر في٪ s
ur: ٪ s پر جڑ نوڈ پہلے ہی موجود ہے
zh_cn: ％s上已经有一个根节点

source: Annotation
ar: حاشية
ur: تشریح
zh_cn: 注解

source: Checkout Cancelled
ar: الخروج ملغاة
ur: چیک آؤٹ منسوخ کر دیا گیا
zh_cn: 结帐已取消

source: Export My Course Content
ar: تصدير محتوى الدورة التدريبية الخاصة بي
ur: میرا کورس مواد برآمد کریں
zh_cn: 导出我的课程内容

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
ar: إذا كنت مهتمًا بالعمل نحو الحصول على شهادة تم التحقق منها ، لكن لا يمكنك تحمل دفع الرسوم ، فالرجاء تقديم طلب الآن. يرجى ملاحظة أن المساعدة المالية محدودة ولا يجوز منحها لجميع المرشحين المؤهلين.
ur: اگر آپ تصدیق شدہ سرٹیفکیٹ پر کام کرنے میں دلچسپی رکھتے ہیں، لیکن فیس ادا کرنے کے قابل نہیں ہوسکتے ہیں، تو براہ کرم اب درخواست کریں. براہ کرم نوٹ کریں کہ مالی امداد محدود ہے اور تمام مستعفی امیدواروں کو نہیں دیا جاسکتا ہے.
zh_cn: 如果您有兴趣通过认证，但无力支付费用，请立即申请。请注意，财务援助是有限的，可能不会授予所有合格的候选人。

source: error
ar: خطأ
ur: غلطی
zh_cn: 错误

source: Unable to export course to xml.
ar: غير قادر على تصدير الدورة التدريبية إلى xml.
ur: xml پر کورس برآمد کرنے میں قاصر.
zh_cn: 无法将课程导出到xml。

source: There was an error receiving your login information. Please email us.
ar: حدث خطأ في تلقي معلومات تسجيل الدخول الخاصة بك. يرجى مراسلتنا عبر البريد الإلكتروني.
ur: آپ کی لاگ ان کی معلومات حاصل کرنے میں ایک خرابی تھی. براہ مہربانی ہمیں ای میل کریں.
zh_cn: 收到您的登录信息时发生错误。请发邮件给我们。

source: There are no matching problem types in the specified libraries.
ar: لا توجد أنواع مشكلات مطابقة في المكتبات المحددة.
ur: مخصوص لائبریریوں میں کوئی مماثل مسئلہ نہیں ہے.
zh_cn: 在指定的库中没有匹配的问题类型。

source: Please send each professional one of these unique registration codes to enroll into the course. The confirmation/receipt email you will receive has an example email template with directions for the individuals enrolling.
ar: يرجى إرسال رمز واحد من رموز التسجيل الفريدة هذه لتسجيلها في الدورة التدريبية. تحتوي رسالة البريد الإلكتروني للتأكيد / الاستلام التي ستتلقاها على نموذج بريد إلكتروني على سبيل المثال مع توجيهات للأفراد المسجلين.
ur: براہ کرم اس کورس میں داخل ہونے کے لئے ان منفرد رجسٹریشن کوڈ میں سے ایک پیشہ ور بھیجیں. توثیق / رسید ای میل آپ کو مل جائے گا انفرادی افراد کے لئے ہدایات کے ساتھ ای میل سانچے کا ایک مثال ہے.
zh_cn: 请发送这些独特的注册代码中的每一个专业注册课程。您将收到的确认/收据电子邮件有一个示例电子邮件模板，其中包含针对注册个人的指示。

source: Data Integrity Error
ar: خطأ في تكامل البيانات
ur: ڈیٹا انٹیگریشن خرابی
zh_cn: 数据完整性错误

source: Incorrect
ar: غير صحيح
ur: غلط
zh_cn: 不正确

source: City
ar: مدينة
ur: شہر
zh_cn: 市

source: Re-Verification
ar: إعادة التأكيد
ur: دوبارہ تصدیق
zh_cn: 重新验证

source: Disable Progress Graph
ar: تعطيل الرسم البياني التقدم
ur: پیش رفت گراف کو غیر فعال کریں
zh_cn: 禁用进度图

source: Tweet this certificate (opens a new tab/window)
ar: سقسقة هذه الشهادة (يفتح علامة تبويب / نافذة جديدة)
ur: اس سرٹیفکیٹ کو ٹویٹ کریں (نیا ٹیب / ونڈو کھولتا ہے)
zh_cn: 鸣叫此证书（打开一个新标签页/窗口）

source: Hours of Effort per Week
ar: ساعات من الجهد في الأسبوع
ur: فی گھنٹہ فی گھنٹہ کوشش
zh_cn: 每周工作时间

source: Welcome to the new learner profile page. Your full profile now displays more information to other learners. You can instead choose to display a limited profile. {learn_more_link_start}Learn more{learn_more_link_end}
ar: مرحبًا بك في صفحة الملف الشخصي للمتعلم الجديد. يعرض ملفك الكامل الآن المزيد من المعلومات للمتعلمين الآخرين. يمكنك بدلاً من ذلك اختيار عرض ملف تعريف محدود. {learn_more_link_start} مزيد من المعلومات {learn_more_link_end}
ur: نیا سیکرٹری پروفائل کا صفحہ میں خوش آمدید. آپ کی مکمل پروفائل اب دیگر سیکھنے والوں کو مزید معلومات دکھاتی ہے. آپ اس کی بجائے ایک محدود پروفائل ظاہر کرنے کا انتخاب کر سکتے ہیں. {learn_more_link_start} مزید جانیں {learn_more_link_end}
zh_cn: 欢迎来到新的学员资料页面。您的完整个人资料现在向其他学员显示更多信息。您可以选择显示有限的配置文件。 {learn_more_link_start}了解详情{learn_more_link_end}

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
ar: الرقم الفريد الذي يحدد الدورة التدريبية الجديدة داخل المؤسسة. (سيكون هذا الرقم هو نفس رقم الدورة التدريبية الأصلي ولا يمكن تغييره.)
ur: منفرد نمبر جو تنظیم کے اندر نئے کورس کی شناخت کرتا ہے. (یہ نمبر اصل کورس نمبر کے طور پر ہی ہو گا اور تبدیل نہیں کیا جاسکتا.)
zh_cn: 识别组织内新课程的唯一编号。 （这个号码与原始号码相同，不能改变。）

source: Required Information to Create a re-run of a course
ar: المعلومات المطلوبة لإنشاء إعادة تشغيل الدورة التدريبية
ur: ایک کورس کے دوبارہ چلانے کے لئے ضروری معلومات
zh_cn: 创建课程重新运行所需的信息

source: Delete course from site
ar: حذف الدورة من الموقع
ur: سائٹ سے کورس حذف کریں
zh_cn: 从网站删除课程

source: Type in number corresponding to following modes: 'instructor' or 'everyone'
ar: اكتب الرقم المقابل للأوضاع التالية: &quot;مدرب&quot; أو &quot;الجميع&quot;
ur: درج ذیل طریقوں سے متعلق نمبر میں ٹائپ کریں: &#39;انسٹرکٹر&#39; یا &#39;سب&#39;
zh_cn: 输入与以下模式对应的编号：&#39;教师&#39;或&#39;所有人&#39;

source: True/False Choice
ar: اختيار صحيح / خطأ
ur: سچ / غلط انتخاب
zh_cn: 真/假选择

source: E-mail
ar: البريد الإلكتروني E-
ur: ای میل
zh_cn: 电子邮件

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
ar: يمكنك البدء في دراستك بمجرد إكمال النموذج التالي. الحقول الإلزامية مشار إليها بعلامة النجمة (*). هذه المعلومات هي لاستخدام {platform_name} فقط. لن يتم ربطه بملفك الشخصي العام بأي طريقة.
ur: جیسے ہی آپ کو مندرجہ ذیل شکل مکمل کرنا آپ اپنا کورس شروع کر سکتے ہیں. لازمی شعبوں کو ایک ستارے (*) سے نشانہ بنایا جاتا ہے. یہ معلومات صرف {platform_name} کے استعمال کے لئے ہے. یہ آپ کے عوامی پروفائل سے کسی بھی طرح سے منسلک نہیں کیا جائے گا.
zh_cn: 完成以下表单后，您就可以开始学习课程了。必填字段标有星号（*）。这些信息仅供{platform_name}使用。它不会以任何方式链接到您的公开个人资料。

source: Too many failed login attempts. Try again later.
ar: هناك عدد كبير جدًا من محاولات تسجيل الدخول الفاشلة. حاول مرة أخرى في وقت لاحق.
ur: بہت سے ناکام لاگ ان کی کوششیں ناکام ہوگئیں. بعد میں دوبارہ کوشش کریں.
zh_cn: 失败的登录尝试次数过多。稍后再试。

source: Create article
ar: خلق المادة
ur: مضمون بنائیں
zh_cn: 创建文章

source: Enrollment Start Time
ar: وقت بدء التسجيل
ur: اندراج کا آغاز وقت
zh_cn: 注册开始时间

source: See all children
ar: شاهد كل الأطفال
ur: تمام بچوں کو دیکھو
zh_cn: 看到所有的孩子

source: Factorial function evaluated outside its domain:'{student_answer}'
ar: تم تقييم الدالة العشرية خارج نطاقها: &quot;{student_answer}&quot;
ur: فیکٹریل فنکشن نے اپنے ڈومین سے باہر کا اندازہ کیا: &#39;{student_answer}&#39;
zh_cn: 在其领域之外评估的因子函数：“{student_answer}”

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
ar: أدخل مؤسسة الدورة التدريبية التي تريد أن تظهر في الدورة التدريبية. يتجاوز هذا الإعداد المؤسسة التي قمت بإدخالها عند إنشاء الدورة التدريبية. لاستخدام المؤسسة التي قمت بإدخالها عند إنشاء الدورة التدريبية ، أدخل null.
ur: کورس کے ادارے درج کریں جو آپ کورس میں حاضر ہونا چاہتے ہیں. یہ ترتیب جس تنظیم نے آپ کو کورس بنایا تھا وہ تنظیم جس پر آپ درج کی گئی تھی. اس تنظیم کو استعمال کرنے کے لئے جس نے آپ کو کورس کی تخلیق کرتے وقت داخل کیا، نوک درج کریں.
zh_cn: 输入你想在课程中出现的课程组织。此设置将覆盖您在创建课程时输入的组织。要使用创建课程时输入的组织，请输入null。

source: Password
ar: كلمه السر
ur: پاس ورڈ
zh_cn: 密码

source: Number of Seats
ar: عدد المقاعد
ur: نشستوں کی تعداد
zh_cn: 座位数量

source: The request was received but there was a server timeout. This error does not include timeouts between the client and the server.
ar: تم تلقي الطلب ولكن كان هناك مهلة للخادم. لا يتضمن هذا الخطأ المهلات بين العميل والخادم.
ur: درخواست موصول ہوئی تھی لیکن سرور ٹائم آؤٹ تھا. یہ غلطی کلائنٹ اور سرور کے درمیان ٹائم آؤٹ نہیں ہے.
zh_cn: 该请求已收到，但服务器超时。此错误不包括客户端和服务器之间的超时。

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
ar: لم تقم بتسجيل الدخول. لعرض محتوى المناقشة ، {sign_in_link} أو {register_link} ، والتسجيل في هذه الدورة التدريبية.
ur: آپ سائن ان نہیں ہیں. بحث کے مواد، {sign_in_link} یا {register_link} کو دیکھنے کے لئے، اور اس کورس میں اندراج کریں.
zh_cn: 您尚未登录。要查看讨论内容{sign_in_link}或{register_link}，并注册本课程。

source: The transaction has already been settled or reversed.
ar: تم تسوية الصفقة بالفعل أو عكسها.
ur: ٹرانزیکشن پہلے سے ہی آباد یا چلے گئے ہیں.
zh_cn: 该交易已经结清或撤销。

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
ar: إذا كانت لديك أسئلة حول الفوترة ، فيرجى قراءة الأسئلة الشائعة ({faq_url}) أو الاتصال بـ {billing_email}.
ur: اگر آپ کے پاس بلنگ کے سوالات ہیں تو، براہ کرم سوالات ({faq_url}) پڑھائیں یا {بلنگ میل} سے رابطہ کریں.
zh_cn: 如果您有帐单问题，请阅读常见问题解答（{faq_url}）或联系{billing_email}。

source: View detailed Git import logs for this course {link_start}by clicking here{link_end}.
ar: عرض سجلات استيراد Git التفصيلية لهذه الدورة {link_start} بالنقر هنا {link_end}.
ur: {course_start} کے اس کورس کیلئے یہاں کلک کریں {link_end} پر کلک کرکے تفصیلی GIT درآمد لاگ ان کریں.
zh_cn: 点击此处查看此课程{link_start}的详细Git导入日志{link_end}。

source: Certificate Web/HTML View Enabled
ar: شهادة الويب / HTML عرض ممكن
ur: سرٹیفکیٹ ویب / ایچ ٹی ایم ایل دیکھیں فعال
zh_cn: 证书Web / HTML视图已启用

source: example: JaneDoe
ar: مثال: JaneDoe
ur: مثال: جین ڈو
zh_cn: 例如：JaneDoe

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
ar: باستخدام واجهات برمجة التطبيقات لأي غرض قد يثقل أو يضعف أو يعطل النظام الأساسي أو الخادم أو الشبكات {platform_name}.
ur: {platform_name} پلیٹ فارم، سرورز یا نیٹ ورکس کو کسی بھی مقصد کے لئے API استعمال کرتے ہوئے جس کی وجہ سے یا زیادہ ممکنہ ہوسکتا ہے، اس کو نقصان پہنچا یا خراب ہو.
zh_cn: 将API用于任何目的或可能导致负担过重，损害或破坏{platform_name}平台，服务器或网络的任何目的。

source: Hide
ar: إخفاء
ur: چھپائیں
zh_cn: 隐藏

source: survey
ar: الدراسة الاستقصائية
ur: سروے
zh_cn: 调查

source: Find Enrollment Code
ar: العثور على رمز التسجيل
ur: اندراج کوڈ تلاش کریں
zh_cn: 查找注册码

source: Name:
ar: اسم:
ur: نام:
zh_cn: 名称：

source: Confirm your enrollment for: {span_start}course dates{span_end}
ar: تأكيد تسجيلك في: {span_start} تواريخ الدورة التدريبية {span_end}
ur: {span_start} کورس کی تاریخوں {span_end} کے لئے اپنے اندراج کی تصدیق کریں
zh_cn: 确认您的注册资格：{span_start}课程日期{span_end}

source: Cohort Configuration
ar: تكوين الفوج
ur: کوورٹ ترتیب
zh_cn: 队列配置

source: About
ar: حول
ur: کے بارے میں
zh_cn: 关于

source: Donation Actions
ar: إجراءات التبرع
ur: عطیہ کی کارروائی
zh_cn: 捐赠行动

source: ORA data
ar: تاريخ ORA
ur: ORA کی تاریخ
zh_cn: ORA日期

source: Here is a list of problems that need to be peer graded for this course.
ar: فيما يلي قائمة بالمشكلات التي يجب أن تكون متدرجة من الزملاء لهذه الدورة التدريبية.
ur: یہاں اس مسئلے کی ایک فہرست ہے جو اس کورس کے لئے ہم آہنگی کی ضرورت ہے.
zh_cn: 以下是需要在本课程中进行同伴评分的问题列表。

source: Please choose your preferred language
ar: الرجاء اختيار لغتك المفضلة
ur: برائے مہربانی اپنی پسندیدہ زبان کا انتخاب کریں
zh_cn: 请选择您的首选语言

source: Learner Profile
ar: ملف المتعلم
ur: سیکرٹری پروفائل
zh_cn: 学习者档案

source: Your request to access the {platform_name} Course Catalog API has been approved.
ar: تمت الموافقة على طلبك للوصول إلى {platform_name} واجهة برمجة تطبيقات Course Catalog.
ur: {platform_name} کورس کیٹلوگ API تک رسائی حاصل کرنے کی درخواست منظور کی گئی ہے.
zh_cn: 您访问{platform_name}课程目录API的请求已获批准。

source: Enter a public username:
ar: أدخل اسم مستخدم عام:
ur: عوامی صارف نام درج کریں:
zh_cn: 输入一个公共用户名：

source: Data Download
ar: تحميل البيانات
ur: ڈیٹا ڈاؤن لوڈ
zh_cn: 数据下载

source: Your file has been deleted.
ar: تم حذف ملفك.
ur: آپ کی فائل حذف کردی گئی ہے.
zh_cn: 您的文件已被删除。

source: All Rights Reserved
ar: كل الحقوق محفوظة
ur: جملہ حقوق محفوظ ہیں
zh_cn: 版权所有

source: Successfully reenabled {}'s account
ar: نجح في إعادة تمكين حساب {}
ur: {} کے اکاؤنٹ کو کامیابی سے دوبارہ دوبارہ مرتب کیا گیا
zh_cn: 成功重新启用了{}的帐户

source: Could not find user by email address '{email}'.
ar: تعذر العثور على المستخدم عن طريق عنوان البريد الإلكتروني &quot;{email}&quot;.
ur: ای میل پتہ &#39;{ای میل}&#39; کے ذریعہ صارف کو نہیں مل سکا.
zh_cn: 无法通过电子邮件地址“{email}”找到用户。

source: Master's or professional degree
ar: درجة الماجستير أو درجة مهنية
ur: ماسٹر یا پیشہ ورانہ ڈگری
zh_cn: 硕士或专业学位

source: Problem location
ar: موقع المشكلة
ur: مسئلہ کی جگہ
zh_cn: 问题的位置

source: Have questions?
ar: لديك أسئلة؟
ur: سوالات ہیں؟
zh_cn: 有问题吗？

source: Specify whether the transcripts appear with the video by default.
ar: حدد ما إذا كانت النصوص تظهر مع الفيديو بشكل افتراضي.
ur: اس بات کی وضاحت کریں کہ کیا ڈیفالٹ کی طرف سے ویڈیو کے ساتھ ٹرانسمیشن ظاہر ہوتا ہے.
zh_cn: 指定成绩单默认情况下是否与视频一起显示。

source: General decline of the card. No other information provided by the issuing bank. Possible action: retry with another form of payment.
ar: الانخفاض العام للبطاقة. لا توجد معلومات أخرى مقدمة من البنك المصدر. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: کارڈ کی عمومی کمی. جاری بینک کے ذریعہ کوئی دوسری معلومات نہیں. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 卡的普遍下降。没有其他信息由开证行提供。可能的行动：以另一种形式的付款重试。

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
ar: إذا كنت بحاجة إلى خطوط أكبر أو أصغر ، فاستخدم إعدادات المستعرضات الخاصة بك لتوسيعها إلى الأعلى أو الأسفل. ضمن Google Chrome ، يتم ذلك عن طريق الضغط على ctrl-plus أو ctrl-minus في نفس الوقت.
ur: اگر آپ کو بڑے یا چھوٹے فونٹ کی ضرورت ہوتی ہے، تو ان کے اوپر یا نیچے پیمانے پر اپنے براؤزر کی ترتیبات کا استعمال کریں. Google Chrome کے تحت، یہ ایک ہی وقت میں ctrl-plus، یا ctrl-minus پر دباؤ کرکے کیا جاتا ہے.
zh_cn: 如果您需要更大或更小的字体，请使用浏览器设置将它们向上或向下缩放。在谷歌浏览器下，通过同时按下ctrl-plus或ctrl-minus来完成此操作。

source: Failed - email {email_addr} already exists as {external_id}
ar: أخفق - هناك بالفعل بريد إلكتروني {email_addr} موجودًا كـ {external_id}
ur: ناکامی - ای میل {email_addr} پہلے ہی {external_id} کے طور پر موجود ہے
zh_cn: 失败 - 电子邮件{email_addr}已经作为{external_id}存在

source: Why import a library?
ar: لماذا استيراد مكتبة؟
ur: لائبریری کیوں درآمد
zh_cn: 为什么要导入一个库？

source: Thank you,
ar: شكرا لكم،
ur: شکریہ،
zh_cn: 谢谢，

source: Note: items with strikethough like <del>this</del> have been refunded.
ar: ملاحظة: العناصر مع strikethough مثل <del> هذه </del> وقد تم ردها.
ur: نوٹ: اس طرح کی ہڑتال کے ساتھ اشیاء <del> یہ </del> واپسی کی گئی ہے.
zh_cn: 注：与strikethough喜欢的项目<del>这个</del>已退还。

source: For verified certificates, specify between one and four signatories and upload the associated images.
ar: للحصول على شهادات تم التحقق منها ، حدد ما بين موقع واحد وأربعة من الموقعين وقم بتحميل الصور المرتبطة.
ur: تصدیق شدہ سرٹیفکیٹس کے لئے، ایک اور چار دستخطوں کے درمیان وضاحت کریں اور منسلک تصاویر اپ لوڈ کریں.
zh_cn: 对于已验证的证书，请指定一到四个签名并上传相关图像。

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
ar: لتعديل شهادة أو حذفها قبل تنشيطها ، مرِّر مؤشر الماوس فوق الزاوية اليمنى العليا من النموذج وحدد {em_start} تعديل {em_end} أو رمز الحذف.
ur: کسی بھی سرٹیفکیٹ سے پہلے کسی سرٹیفکیٹ کو ترمیم یا حذف کرنے کے لئے، فارم کے اوپر دائیں کنارے پر ہورائیں اور {em_start} کو ترمیم کریں {em_end} یا خارج ہونے والے آئکن کو منتخب کریں.
zh_cn: 要在激活之前编辑或删除证书，请将鼠标悬停在表格的右上角，然后选择{em_start}编辑{em_end}或删除图标。

source: Secret string for annotation storage
ar: سلسلة سرية لتخزين التعليقات التوضيحية
ur: تشریح سٹوریج کے لئے خفیہ سٹرنگ
zh_cn: 注解存储的秘密字符串

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
ar: لا يمكن ترك هذا فارغًا وسيتم تسجيله وتقديمه في تقارير التسجيل.
ur: یہ خالی نہیں جا سکتا اور اندراج کی رپورٹوں میں ریکارڈ کیا جائے گا اور پیش کیا جائے گا.
zh_cn: 这不能留空，并将记录在录入报告中。

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
ar: الرجاء النقر فوق الزر &quot;السماح&quot; لمنح هذه الأذونات للتطبيق أعلاه. خلاف ذلك ، لحجب هذه الأذونات ، يرجى النقر فوق الزر &quot;إلغاء&quot;.
ur: مندرجہ ذیل ایپلی کیشنز کو ان اجازتوں کو دینے کیلئے &#39;اجازت دیں&#39; کے بٹن پر کلک کریں. دوسری صورت میں، ان اجازتوں کو روکنے کے لئے، براہ کرم &#39;منسوخ&#39; بٹن پر کلک کریں.
zh_cn: 请点击&#39;允许&#39;按钮将这些权限授予上述申请。否则，要隐藏这些权限，请点击“取消”按钮。

source: Error Resetting Password
ar: خطأ إعادة ضبط كلمة المرور
ur: غلطی دوبارہ ترتیب پاس ورڈ
zh_cn: 重置密码时出错

source: Terms of Service & Honor Code
ar: شروط الخدمة و قانون الشرف
ur: سروس کی شرائط اور اعزاز کوڈ
zh_cn: 服务条款和荣誉代码

source: Tools
ar: أدوات
ur: اوزار
zh_cn: 工具

source: The number of seconds to delay/timeout wait to get cookie values from sailthru.
ar: عدد الثواني تأخير / انتهاء المهلة للحصول على قيم ملفات تعريف الارتباط من sailthru.
ur: تاخیر / ٹائم آؤٹ کرنے کے لئے سیکنڈ کی تعداد سیلوتھ سے کوکی اقدار حاصل کرنے کا انتظار.
zh_cn: 延迟/超时秒数等待从sailthru获取cookie值。

source: Restoring to this revision will mark the article as deleted.
ar: ستقوم عملية الاستعادة إلى هذه المراجعة بوضع علامة على المقالة كمحذوفة.
ur: اس ترمیم میں بحال ہونے والے آرٹیکل کو خارج کردیا جائے گا.
zh_cn: 恢复到此修订版会将该文章标记为已删除。
