Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Error starting a task to rescore problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ur: مسئلہ دوبارہ تبدیل کرنے کیلئے کام شروع کرنے میں خرابی &#39;&lt;٪ - problem_id٪&gt;&#39;. اس بات کو یقینی بنائیں کہ مسئلہ کی شناخت مکمل اور درست ہے.

source: Do you want to replace the edX transcript with the YouTube transcript?
ur: کیا آپ YouTube ٹرانزیشن کے ساتھ EDX ٹرانسمیشن کو تبدیل کرنا چاہتے ہیں؟

source: Link your {accountName} account
ur: اپنا {اکاؤنٹ نام} اکاؤنٹ لنک کریں

source: Check the highlighted fields below and try again.
ur: ذیل میں نمایاں فیلڈز چیک کریں اور دوبارہ کوشش کریں.

source: %(value)s minute
ur: ٪ (قیمت) کے منٹ

source: Update post
ur: پوسٹ اپ ڈیٹ کریں

source: Volume
ur: حجم

source: Press update settings to update course video settings
ur: کورس کی ویڈیو کی ترتیبات کو اپ ڈیٹ کرنے کیلئے اپ ڈیٹ کی ترتیبات پریس کریں

source: Teams Pagination
ur: ٹیموں صفحہ بندی

source: Instructor Name
ur: انسٹرکٹر کا نام

source: Once in position, use the camera button {icon} to capture your photo
ur: ایک بار پوزیشن میں، اپنی تصویر پر قبضہ کرنے کیلئے کیمرے کے بٹن {icon} کا استعمال کریں

source: (Caption will be displayed when you start playing the video.)
ur: (جب آپ ویڈیو کھیلنے شروع کرتے ہیں تو کیپشن ظاہر کی جائے گی.)

source: Error: Choosing failed.
ur: غلطی: انتخاب ناکام ہوگیا.

source: Adding the selected course to your cart
ur: آپ کی ٹوکری میں منتخب کردہ کورس کو شامل کرنا

source: Remove
ur: دور

source: Internal Server Error.
ur: اندرونی سرور کی خرابی.

source: Set up your certificate
ur: اپنا سرٹیفکیٹ قائم کریں

source: Sorry, no results were found.
ur: معذرت، کوئی نتیجہ نہیں مل سکا.

source: Starts: %(start_date)s
ur: شروع ہوتا ہے:٪ (start_date) s

source: Use a practice proctored exam to introduce learners to the proctoring tools and processes. Results of a practice exam do not affect a learner's grade.
ur: ایک پریکٹس پروکیکڈ امتحان کا استعمال کریں کہ سیکھنے والے آلات اور عملوں کو سیکھنے والوں کو متعارف کرایا جائے. ایک مشق امتحان کے نتائج سیکھنے والے کی گریڈ کو متاثر نہیں کرتے.

source: Subsections
ur: سبسکرائب

source: Regenerate the user's certificate
ur: صارف کا سرٹیفکیٹ دوبارہ بنائیں

source: Add learners to this cohort
ur: سیکھیں اس سکوٹر میں

source: Could not override problem score for {user}.
ur: {صارف} کے لئے مسئلہ سکور کو اوورائز نہیں کر سکا.

source: Select one or more groups:
ur: ایک یا زیادہ گروپ منتخب کریں:

source: Underline
ur: زیر التواء
