Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: You are now logged in! Have fun!
ar: قمت بتسجيل الدخول الآن في! إستمتع!
ur: آپ ابھی لاگ ان ہیں! مزے کرو!
zh_cn: 您现在已登录！玩的开心！

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
ar: القيمة &quot;{preference_value}&quot; غير صالحة للتفضيل &quot;{preference_key}&quot;: ليست في المنطقة الزمنية المحددة.
ur: ویلیو &#39;{ترجیحی صفول}&#39; ترجیحات کے لئے درست نہیں &#39;{ترجیح_key}&#39;: ٹائمز سیٹ میں نہیں.
zh_cn: 值&#39;{preference_value}&#39;对于偏好“{preference_key}”无效：不在时区设置中。

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
ar: حدد عنوان دورة تدريبية لاستخدامه في الشهادة إذا كان العنوان الرسمي للدورة أطول من أن يتم عرضه جيدًا.
ur: سرٹیفکیٹ استعمال کرنے کے لئے ایک کورس کے عنوان کی وضاحت کریں اگر کورس کے سرکاری عنوان اچھی طرح سے ظاہر کرنے کے لئے بہت طویل ہے.
zh_cn: 如果课程的官方标题太长而无法正确显示，请在证书上指定课程标题。

source: To enroll, you must follow the honor code.
ar: للتسجيل ، يجب أن تتبع رمز الشرف.
ur: اندراج کرنے کے لئے، آپ کو اعزاز کے کوڈ کی پیروی کرنا ضروری ہے.
zh_cn: 要注册，您必须遵守荣誉代码。

source: Top num_top_words words for word cloud.
ar: أعلى الكلمات num_top_words لكلمة سحابة.
ur: لفظ بادل کے لئے اوپر num_top_words الفاظ.
zh_cn: 顶级num_top_words字云词。

source: Experiment Group Configurations
ar: تكوينات المجموعة التجريبية
ur: تجربہ گروپ ترتیبات
zh_cn: 实验组配置

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
ar: انقر فوق {em_start} مجموعة محتوى جديدة {em_end} لإضافة مجموعة محتوى جديدة. لتعديل اسم مجموعة المحتوى ، مرّر مؤشر الماوس فوق المربع وانقر على {em_start} تعديل {em_end}. يمكنك حذف مجموعة المحتوى فقط إذا لم تكن قيد الاستخدام من قبل الوحدة. لحذف مجموعة محتوى ، مرّر مؤشر الماوس فوق المربع وانقر على رمز الحذف.
ur: نیا مواد گروپ شامل کرنے کیلئے {em_start} نیا مواد گروپ {em_end} پر کلک کریں. مواد کے گروپ کے نام میں ترمیم کرنے کے لئے، اس باکس پر ہور اور {em_start} میں ترمیم کریں {em_end}. آپ واحد مواد کو حذف کرسکتے ہیں اگر یہ یونٹ کے ذریعہ استعمال میں نہیں ہے. ایک مواد گروپ کو حذف کرنے کے لئے، اس کے باکس پر ہور اور خارج ہونے والے آئکن پر کلک کریں.
zh_cn: 点击{em_start}新内容组{em_end}添加新的内容组。要编辑内容组的名称，请将鼠标悬停在其框上，然后点击{em_start}修改{em_end}。只有当单位没有使用内容组时，才可以删除该内容组。要删除内容组，请将鼠标悬停在其框上，然后点击删除图标。

source: Lower-case ISO currency codes
ar: رموز عملة ISO ذات حالة الأحرف الصغيرة
ur: کم کیس ISO کرنسی کوڈ
zh_cn: 小写的ISO货币代码

source: Billed To Details
ar: فاتورة التفاصيل
ur: تفصیلات پر بل
zh_cn: 收费详情

source: Certificate Available
ar: الشهادة متاحة
ur: سرٹیفکیٹ دستیاب ہے
zh_cn: 证书可用

source: Video Available on Web Only
ar: فيديو متاح على الويب فقط
ur: صرف ویب پر دستیاب ویڈیو
zh_cn: 视频仅在Web上可用

source: Prerequisites
ar: المتطلبات الأساسية
ur: ضروریات
zh_cn: 先决条件

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
ar: في هذا القسم ، لديك القدرة على منح امتدادات على وحدات محددة للطلاب الفرديين. يرجى ملاحظة أن آخر موعد يؤخذ دائما ؛ لا يمكنك استخدام هذه الأداة لإجراء مهمة مستحقة في وقت سابق لطالب معين.
ur: اس سیکشن میں، آپ کو مخصوص یونٹس پر انفرادی طالب علموں کو توسیع دینے کی صلاحیت ہے. براہ کرم نوٹ کریں کہ تازہ ترین تاریخ ہمیشہ لے جاتا ہے؛ آپ کسی مخصوص طالب علم کے لۓ اس تفویض کو پہلے ہی اس آلہ کا استعمال نہیں کر سکتے ہیں.
zh_cn: 在本节中，您可以将特定单元的扩展名授予个别学生。请注意，最近的日期总是被采用;您不能使用此工具在早些时候为特定学生作出任务。

source: Staff and Administrators
ar: الموظفين والمسؤولين
ur: اسٹاف اور منتظمین
zh_cn: 工作人员和管理员

source: Start Course
ar: بدء دورة
ur: شروع کورس
zh_cn: 启动课程

source: due {date}
ar: تاريخ الاستحقاق}
ur: اخری تاریخ}
zh_cn: 截止日期}

source: You have not yet finished learning to grade this problem.
ar: لم تنته بعد من تعلم كيفية تقييم هذه المشكلة.
ur: آپ نے اس مسئلے کو گریڈ کرنے کے لئے ابھی تک سیکھنے کو تیار نہیں کیا ہے.
zh_cn: 您尚未完成学习以评估此问题。

source: Warm regards,
ar: تحياتي حارة،
ur: بے حد شکر گزار،
zh_cn: 温暖的问候，

source: Advanced Editor
ar: محرر متقدم
ur: اعلی درجے کی ایڈیٹر
zh_cn: 高级编辑器

source: Entrance exam successfully {action} for student '{student}'
ar: امتحان القبول بنجاح {action} للطالب &#39;{student}&#39;
ur: داخلہ امتحان کے طالب علم کے {طالب علم} کے لئے {کارروائی} کامیابی سے
zh_cn: 入学考试成功{动作}为学生&#39;{学生}&#39;

source: Video Download Allowed
ar: تنزيل الفيديو مسموح به
ur: ویڈیو ڈاؤن لوڈ کردہ اجازت
zh_cn: 视频下载允许

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the Address Verification System (AVS).
ar: تمت الموافقة على طلب التفويض من قِبل المصرف المُصدر ولكن تم رفضه بواسطة CyberSource لأنه لم يمر نظام التحقق من العناوين (AVS).
ur: اجازت دینے کی درخواست جاری بینک کی جانب سے منظوری دی گئی تھی لیکن سائبرسورس نے انکار کردیا کیونکہ اس نے ایڈریس کی توثیق کا نظام (AVS) پاس نہیں کیا تھا.
zh_cn: 授权请求得到了发行银行的批准，但被Cyber​​Source拒绝，因为它没有通过地址验证系统（AVS）。

source: Your edX ID verification is pending. Your verification information has been submitted and will be reviewed shortly.
ar: التحقق من هوية edX الخاص بك معلق. تم إرسال معلومات التحقق الخاصة بك وسيتم مراجعتها قريبا.
ur: آپ کے EDX ID کی توثیق زیر التواء ہے. آپ کی توثیق کی معلومات جمع کردی گئی ہے اور جلد ہی جائزہ لیا جائے گا.
zh_cn: 您的edX ID验证正在处理中。您的验证信息已提交，并将很快进行审核。

source: Date that certificates become available to learners
ar: التاريخ الذي تصبح فيه الشهادات متاحة للمتعلمين
ur: تاریخ جو سرٹیفکیٹ سیکھنے والوں کے لئے دستیاب ہو
zh_cn: 证书可供学习者使用的日期

source: edx-video-pipeline API URL.
ur: edx-video-pipeline API یو آر ایل.

source: Course certificate generation requires an activated web certificate configuration.
ar: يتطلب إنشاء شهادة الدورة تكوين شهادة ويب نشطة.
ur: کورس سرٹیفکیٹ نسل کو ایک فعال ویب سرٹیفکیٹ کی ترتیب کی ضرورت ہوتی ہے.
zh_cn: 课程证书生成需要激活的Web证书配置。

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
ar: عنوان URL من مزود الائتمان حيث يمكن للمستخدم التحقق من حالة طلبه للحصول على الرصيد. يتم عرض ذلك للطلاب * بعد * طلبوا الائتمان.
ur: کریڈٹ فراہم کنندہ سے یو آر ایل جہاں صارف کریڈٹ کے لئے اپنی درخواست کی حیثیت کو چیک کرسکتا ہے. یہ طالب علموں کو * کے بعد دکھایا جاتا ہے * انہوں نے کریڈٹ کی درخواست کی ہے.
zh_cn: 来自信贷提供者的URL，用户可以检查他或她的信用请求的状态。这是显示给学生*后*他们已经要求信用。

source: I completed a course at {platform_name}. Take a look at my certificate.
ar: أكملت دورة تدريبية في {platform_name}. ألقِ نظرة على شهادتي.
ur: میں نے {platform_name} میں ایک کورس مکمل کیا. میرے سرٹیفکیٹ پر نظر ڈالیں.
zh_cn: 我在{platform_name}完成了一门课程。看看我的证书。

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
ar: CourseMode مع سبيكة الوضع ({mode_slug}) DoesNotExist
ur: موڈ سلگ کے ساتھ کورس موڈ ({mode_slug}) DoesNotExist
zh_cn: 使用模式slug（{mode_slug}）DoesNotExist的CourseMode

source: Download the {platform_name} mobile app from Google Play
ar: يمكنك تنزيل تطبيق الجوال {platform_name} من Google Play
ur: Google Play سے {platform_name} موبائل اپلی کیشن ڈاؤن لوڈ کریں
zh_cn: 从Google Play下载{platform_name}移动应用

source: Timer Between Attempts
ar: توقيت بين المحاولات
ur: کوششوں کے درمیان ٹائمر
zh_cn: 计时器之间的尝试

source: Any Type
ar: أي نوع
ur: کوئی بھی قسم
zh_cn: 任何类型

source: Contact
ar: اتصل
ur: رابطہ کریں
zh_cn: 联系

source: Maximum Attempts
ar: أقصى المحاولات
ur: زیادہ سے زیادہ کوششیں
zh_cn: 最大尝试次数

source: To try to verify your identity again, select the following link:
ar: لمحاولة التحقق من هويتك مرة أخرى ، حدد الرابط التالي:
ur: دوبارہ آپ کی شناخت کی توثیق کرنے کی کوشش کریں، مندرجہ ذیل لنک منتخب کریں:
zh_cn: 要尝试再次验证您的身份，请选择以下链接：

source: coupon with the coupon code ({code}) added successfully
ar: تمت إضافة القسيمة باستخدام رمز القسيمة ({code}) بنجاح
ur: کوپن کوڈ ({کوڈ}) کے ساتھ کوپن کامیابی سے شامل کیا
zh_cn: 优惠券代码（{code}）优惠券已成功添加

source: Setting unusable password for user "{}"
ar: تعيين كلمة مرور غير صالحة للمستخدم &quot;{}&quot;
ur: صارف کے لئے ناقابل قابل پاس ورڈ کی ترتیب &quot;{}&quot;
zh_cn: 为用户“{}”设置不可用的密码

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the CVN check. Possible action: retry with another form of payment.
ar: تمت الموافقة على طلب التفويض من قِبل المصرف المُصدر ولكن تم رفضه بواسطة CyberSource لأنه لم يجتاز التحقق من CVN. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: اجازت دینے کی درخواست جاری بینک کی طرف سے منظوری دی گئی تھی لیکن سائبر ایسورس کی طرف سے کمی کی وجہ سے اس نے سی وی این چیک منظور نہیں کیا. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 授权请求得到了发卡银行的批准，但被Cyber​​Source拒绝，因为它没有通过CVN支票。可能的行动：以另一种形式的付款重试。

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
ar: بالنسبة للمشكلة المحددة ، قم بتدوين استجابات المتعلم. يقوم خيار &quot;Rescore Only If Score Improves&quot; بتحديث درجة المتعلم فقط إذا كان يحسن في صالح المتعلم.
ur: مخصوص مسئلہ کے لئے، سیکھنے کے جوابات کو دوبارہ تبدیل کریں. &#39;ریسرٹر صرف اگر اسکور بہتر ہوجاتا ہے&#39; تو آپ سیکھنے والے کے سکور کو اپ ڈیٹر کے سکور کو اپ ڈیٹ کرتا ہے.
zh_cn: 针对具体问题，重新设置学习者的回答。只有改善学习者的分数才能更新学习者的分数。

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
ar: ستنتهي صلاحية التحقق الحالي في غضون {الأيام} يومًا. {start_link} أعد إثبات هويتك الآن {end_link} باستخدام كاميرا ويب ومُعرِّف هوية صادر عن جهة حكومية.
ur: {موجودہ} دنوں میں آپ کی موجودہ تصدیق ختم ہو گی. ویب کیم کا استعمال کرتے ہوئے اور سرکاری طور پر جاری کردہ تصویر کی شناخت {{start_link} کو اپنی شناخت کی دوبارہ تصدیق کریں {end_link}.
zh_cn: 您当前的验证将在{天}天后过期。 {start_link}使用网络摄像头和政府颁发的照片ID，现在重新验证您的身份{end_link}。

source: ${full_program_price} for entire program
ar: $ {full_program_price} للبرنامج بأكمله
ur: پورے پروگرام کے لئے $ {full_program_price}
zh_cn: 整个计划的$ {full_program_price}

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
ar: النص الافتراضي للفيديو ، من حقل النص المحدد في البداية الافتراضي في علامة التبويب &quot;أساسي&quot;. يجب أن يكون هذا النص باللغة الإنجليزية. ليس عليك تغيير هذا الإعداد.
ur: ویڈیو کے لئے ڈیفالٹ ٹرانزیشن، بنیادی ٹیب پر ڈیفالٹ ٹائم شدہ ٹرانسکرپٹ فیلڈ سے. یہ نقل انگریزی میں ہونا چاہئے. آپ کو اس ترتیب کو تبدیل کرنے کی ضرورت نہیں ہے.
zh_cn: 基本选项卡上默认定时录制字段中视频的默认录制文件。这个成绩单应该是英文的。您不必更改此设置。

source: Receive course emails
ar: تلقي رسائل البريد الإلكتروني بالطبع
ur: کورس ای میلز حاصل کریں
zh_cn: 接收课程电子邮件

source: Calculator Input Field
ar: حقل إدخال الحاسبة
ur: کیلکولیٹر ان پٹ فیلڈ
zh_cn: 计算器输入字段

source: Username {user} already exists.
ar: اسم المستخدم {user} موجود بالفعل.
ur: صارف نام {صارف} پہلے ہی موجود ہے.
zh_cn: 用户名{user}已存在。

source: Cannot find user with username {username} - {error}
ar: لا يمكن العثور على المستخدم باسم المستخدم {username} - {error}
ur: صارف نام {صارف کا نام} کے ساتھ صارف کو تلاش نہیں کر سکتا - {غلط}
zh_cn: 找不到使用者名称{使用者名称} - {error}

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
ar: غير قادر على تسليم التقديم الخاص بك إلى grader (السبب: {error_msg}). الرجاء معاودة المحاولة في وقت لاحق.
ur: گرڈر (آپ کی وجہ سے: {error_msg}) کو جمع کرانے کے قابل نہیں. براہ کرم کچھ دیر بعد کوشش کریں.
zh_cn: 无法将您的提交提交给评分者（原因：{error_msg}）。请稍后再试。

source: Learning to grade
ar: تعلم الصف
ur: گریڈ سیکھنا
zh_cn: 学会分级

source: Reset Your Password
ar: اعد ضبط كلمه السر
ur: آپ کا پاس ورڈ دوبارہ ترتیب دیں
zh_cn: 重置你的密码

source: All rights reserved except where noted. edX, Open edX and the edX and Open edX logos are registered trademarks or trademarks of edX Inc.
ar: جميع الحقوق محفوظة باستثناء ما هو مذكور. تعد edX و Open edX وشعار edX و Open EDX علامتين تجاريتين مسجلتين أو علامتين تجاريتين لشركة EDX Inc.
ur: جہاں بھی ذکر کیا جاتا ہے اس کے علاوہ تمام حقوق محفوظ ہیں. edX، اوپن edX اور edX اور اوپن edX علامات EDX انکارپوریٹڈ کے رجسٹرڈ ٹریڈ مارک یا ٹریڈ مارک ہیں.
zh_cn: 保留所有权利，除非另有说明。 edX，Open edX以及edX和Open edX徽标是edX Inc.的注册商标或商标。

source: Add details about the instructors for this course
ar: إضافة تفاصيل حول المدربين لهذه الدورة
ur: اس کورس کے لئے اساتذہ کے بارے میں تفصیلات شامل کریں
zh_cn: 添加有关此课程导师的详细信息

source: Optional: provide additional information for this transaction
ar: اختياري: قدم معلومات إضافية لهذه المعاملة
ur: اختیاری: اس ٹرانزیکشن کے لئے اضافی معلومات فراہم کریں
zh_cn: 可选：为此交易提供附加信息

source: Configuration Error
ar: خطأ في تكوين
ur: ترتیب کی خرابی
zh_cn: 配置错误

source: Unable to push changes. This is usually because the remote repository cannot be contacted
ar: غير قادر على دفع التغييرات. هذا عادة لأنه لا يمكن الاتصال بمستودع التخزين عن بعد
ur: تبدیلیوں کو دھکا کرنے میں ناکام یہ عام طور پر ہے کیونکہ ریموٹ ذخیرہ سے رابطہ نہیں کیا جاسکتا ہے
zh_cn: 无法推送更改。这通常是因为无法联系到远程存储库

source: e.g. en for English
ar: أنا واحد للغة الإنجليزية
ur: میں انگریزی کے لئے ہوں
zh_cn: 我是英语的一员

source: More than Just Lectures
ar: أكثر من مجرد محاضرات
ur: بس لیکچر سے زیادہ
zh_cn: 不只是讲座

source: Information about course credit requirements
ar: معلومات حول متطلبات الائتمان بالطبع
ur: کورس کریڈٹ کی ضروریات کے بارے میں معلومات
zh_cn: 有关课程学分要求的信息

source: System defined milestone
ar: معلمة نظام محددة
ur: سسٹم کا سنگ میل
zh_cn: 系统定义的里程碑

source: Invalid input: Could not parse '{bad_input}' as a formula.
ar: إدخال غير صالح: تعذّر تحليل &quot;{bad_input}&quot; كصيغة.
ur: غلط اندراج: &#39;bad_input}&#39; کو ایک فارمولہ کے طور پر پار نہیں کر سکا.
zh_cn: 输入无效：无法将“{bad_input}”解析为公式。

source: {first_providers}, and {last_provider}
ar: {first_providers} و {last_provider}
ur: {first_providers}، اور {last_provider}
zh_cn: {first_providers}和{last_provider}

source: Mark a passage or concept so that it's easy to find later.
ar: ضع علامة على مقطع أو مفهوم بحيث يسهل العثور عليه لاحقًا.
ur: ایک منظوری یا تصور کو نشان زد کریں تاکہ بعد میں تلاش کرنا آسان ہو.
zh_cn: 标记一段文字或概念，以便稍后查找。

source: A slug may not begin with an underscore.
ar: قد لا تبدأ سبيكة مع شرطة سفلية.
ur: ممکن نہیں ہوسکتا ہے کہ ایک سلگ کسی اور کے ساتھ شروع نہ ہو.
zh_cn: 一个slu may不得以下划线开头。

source: Course ID or dir
ar: معرف الدورة التدريبية أو dir
ur: کورس ID یا dir
zh_cn: 课程编号或目录

source: This answer is correct.
ar: هذه الإجابة صحيحة.
ur: یہ جواب درست ہے.
zh_cn: 这个答案是正确的。

source: Aug
ar: أغسطس
ur: اگست
zh_cn: 八月

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
ar: تم إرفاق ملف CSV لعناوين URL الخاصة بتسجيلك. يرجى توزيع عناوين URL للتسجيل لكل طالب يخطط للتسجيل باستخدام نموذج البريد الإلكتروني أدناه.
ur: آپ کے رجسٹریشن یو آر ایل کی ایک CSV فائل منسلک ہے. برائے مہربانی ذیل میں ای میل ٹیمپلیٹ کا استعمال کرتے ہوئے ہر طالب علم کی منصوبہ بندی میں رجسٹریشن یو آر ایل کو تقسیم کریں.
zh_cn: 附上您注册网址的CSV文件。请使用下面的电子邮件模板向每个计划注册的学生分发注册URL。

source: {studio_name} Account Activation
ar: {studio_name} تنشيط الحساب
ur: {studio_name} اکاؤنٹ کی سرگرمی
zh_cn: {studio_name}帐户激活

source: The file must contain a 'username' column, an 'email' column, or both.
ar: يجب أن يحتوي الملف على عمود &quot;اسم المستخدم&quot; أو عمود &quot;البريد الإلكتروني&quot; أو كلاهما.
ur: فائل میں &#39;صارف کا نام&#39; کالم، ایک &#39;ای میل&#39; کالم، یا دونوں میں ہونا ضروری ہے.
zh_cn: 该文件必须包含“用户名”列，“电子邮件”列或两者。

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
ar: إنشاء تذاكر Zendesk لمحاولات الامتحانات المشبوهة بروكتريب
ur: مشکوک پراسیسڈ امتحان کے اقدامات کے لئے زینڈسکی ٹکٹ بنائیں
zh_cn: 创建可疑漫游检查尝试的Zendesk门票

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {error_message}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: آسف! أرسل لنا معالج الدفع التابع لنا رسالة تالفة بشأن نفقاتك ، لذلك يتعذر علينا التحقق من صحة الرسالة التي وردت من معالج الدفع. رسالة الخطأ المحددة هي: {error_message}. نعتذر لعدم تمكننا من التحقق مما إذا كان قد تم تحصيل الرسوم واتخاذ إجراء آخر بشأن طلبك. ربما تم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے ہمیں آپ کے چارج کے بارے میں ایک خراب پیغام بھیجا، لہذا ہم اس بات کی تصدیق نہیں کر سکے کہ اصل میں ادائیگی ادائیگی پروسیسر سے آیا ہے. مخصوص خامی پیغام ہے: {error_message}. ہم معذرت کرتے ہیں کہ ہم اس بات کی توثیق نہیں کر سکتے ہیں کہ یہ چارج آپ کے آرڈر پر چلا گیا ہے اور مزید کارروائی لیتا ہے. ممکنہ طور پر آپ کا کریڈٹ کارڈ چارج کیا جاسکتا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理器向我们发回了关于您的收费的损坏消息，因此我们无法验证消息是否实际来自付款处理器。具体的错误消息是：{error_message}。很抱歉，我们无法验证收费是否已完成，并对订单采取进一步行动。您的信用卡可能已经收费。请通过{email}与我们联系并提供特定付款问题。

source: This account has already been activated.
ar: لقد تم تفعيل هذا الحساب بالفعل.
ur: یہ اکاؤنٹ پہلے ہی چالو کر دیا گیا ہے.
zh_cn: 该帐户已被激活。

source: Meetup
ar: نلتقي
ur: ملتے
zh_cn: 聚会

source: For {strong_start}questions on course lectures, homework, tools, or materials for this course{strong_end}, post in the {link_start}course discussion forum{link_end}.
ar: بالنسبة إلى {strong_start} الأسئلة حول محاضرات الدورة التدريبية أو الواجب المنزلي أو الأدوات أو المواد الخاصة بهذه الدورة التدريبية {strong_end} ، انشر في {link_start} منتدى مناقشة الدورة التدريبية {link_end}.
ur: {link_start} کورس بحث فورم {link_end} میں پوسٹ {strong_end} کے کورس کے لئے کورس کے لیکچرز، ہوم ورک، اوزار، یا مواد پر {strong_start} کے سوالات کے لئے.
zh_cn: 有关课程讲义，作业，工具或本课程材料{strong_end}的{strong_start}问题，请在{link_start}课程讨论论坛{link_end}中发帖。

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
ar: استخدم هذا الإعداد فقط عند إنشاء شهادات PDF. بين علامات الاقتباس ، أدخل الاسم المختصر لنوع الشهادة التي يتلقاها الطلاب عند إكمال الدورة التدريبية. على سبيل المثال ، &quot;الشهادة&quot;.
ur: پی ڈی ایف سرٹیفکیٹ پیدا کرنے پر صرف اس ترتیب کا استعمال کریں. کوٹیشن کے نشانوں کے درمیان، سرٹیفکیٹ کی نوعیت کا مختصر نام درج کریں جس میں طلباء کو کورس مکمل کرنے کے بعد موصول ہوتا ہے. مثال کے طور پر، &quot;سرٹیفکیٹ&quot;.
zh_cn: 仅在生成PDF证书时使用此设置。在引号之间，输入学生在完成课程时收到的证书类型的短名称。例如，“证书”。

source: Currently signed in as:
ar: تم تسجيل الدخول حاليًا كـ:
ur: فی الحال سائن ان کے طور پر:
zh_cn: 目前以下列身份登录：

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
ar: قائمة النطاقات المسموح بها لإنشاء طلبات عبر النطاقات إلى هذا الموقع. يرجى ذكر كل مجال على خطها الخاص.
ur: ڈومینز کی فہرست جس کو اس سائٹ پر کراس ڈومین کی درخواستوں کی اجازت دی جاتی ہے. ہر ڈومین کو اپنی اپنی لائن پر درج کریں.
zh_cn: 允许向该站点发出跨域请求的域列表。请自行列出每个域名。

source: Show/hide page
ar: إظهار / إخفاء الصفحة
ur: صفحہ دکھائیں / چھپائیں
zh_cn: 显示/隐藏页面

source: edX Home Page
ar: edX الصفحة الرئيسية
ur: edX ہوم پیج
zh_cn: edX主页

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
ar: اختياري ، للمتصفحات القديمة: معرف YouTube لمقاطع الفيديو ذات السرعة 1.5x.
ur: اختلاط، پرانے براؤزرز کیلئے: 1.5x رفتار ویڈیو کیلئے یو ٹیوب ID.
zh_cn: 可选，适用于旧版浏览器：1.5倍速度视频的YouTube ID。

source: Please wait while we retrieve your order details.
ar: يرجى الانتظار حتى نسترجع تفاصيل طلبك.
ur: براہ مہربانی انتظار کریں جب ہم آپ کے آرڈر کی تفصیلات حاصل کریں.
zh_cn: 请等待我们检索您的订单详情。

source: Add to Mozilla Backpack
ar: أضف إلى موزيلا حقيبة الظهر
ur: موزیلا بیگ میں شامل کریں
zh_cn: 添加到Mozilla背包

source: Name your CCX
ar: اسم CCX الخاص بك
ur: اپنے CCX کا نام
zh_cn: 命名您的CCX

source: What transfers from the original course?
ar: ما التحويلات من الدورة الأصلية؟
ur: اصل کورس سے کیا منتقلی
zh_cn: 什么从原始课程转移？

source: (root)
ar: (جذر)
ur: (جڑ)
zh_cn: （根）

source: {platform_name} is a nonprofit bringing high-quality education to everyone, everywhere. Your help allows us to continuously improve the learning experience for millions and make a better future one learner at a time.
ar: {platform_name} منظمة غير ربحية تقدم التعليم العالي الجودة للجميع في كل مكان. تسمح لك مساعدتنا باستمرار بتحسين تجربة التعلم للملايين وجعل مستقبل واحد أفضل في وقت واحد.
ur: {platform_name} ایک غیر منافع بخش ذریعہ ہے، ہر جگہ، ہر جگہ اعلی معیار کی تعلیم لاتا ہے. آپ کی مدد ہمیں لاکھوں کے لئے سیکھنے کے تجربے کو بہتر بنانے اور ایک وقت میں ایک بہتر مستقبل کے سیکھنے کو مسلسل بنانے کی اجازت دیتا ہے.
zh_cn: {platform_name}是一个非营利组织，为所有人带来高质量的教育。您的帮助使我们能够不断改善数百万人的学习体验，并且一次创造一个更好的未来学习者。

source: Honor Code Enrollment
ar: تسجيل قانون الشرف
ur: اعزاز کوڈ اندراج
zh_cn: 荣誉代码注册

source: Confirm Enrollment
ar: تأكيد التسجيل
ur: اندراج کی توثیق کریں
zh_cn: 确认注册

source: My certificate has helped me showcase my knowledge on my resume - I feel like this certificate could really help me land my dream job!
ar: ساعدتني شهادتي في عرض معلوماتي حول سيرتي الذاتية - أشعر أن هذه الشهادة يمكن أن تساعدني بالفعل في الحصول على وظيفة أحلامي!
ur: میرا سرٹیفکیٹ نے مجھے دوبارہ شروع کرنے کے بارے میں اپنے علم کو ظاہر کرنے میں مدد کی ہے - مجھے لگتا ہے کہ یہ سرٹیفکیٹ واقعی میں اپنے خواب کا کام زمین میں مدد کر سکتا ہے!
zh_cn: 我的证书帮助我在自己的简历中展示自己的知识 - 我觉得这份证书能够真正帮助我实现我的理想工作！

source: Access the Open edX Portal
ar: قم بالوصول إلى مدخل edX Portal
ur: کھولیں edX پورٹل تک رسائی حاصل کریں
zh_cn: 访问Open edX Portal

source: The sale associated with this invoice has already been invalidated.
ar: تم بالفعل إبطال البيع المرتبط بهذه الفاتورة.
ur: اس انوائس سے منسلک فروخت پہلے ہی باطل ہوگئی ہے.
zh_cn: 与此发票相关的销售已失效。

source: Adjust a learner's grade for a specific problem
ar: ضبط درجة المتعلم لمشكلة معينة
ur: ایک مخصوص مسئلہ کے لئے سیکھنے والے کی گریڈ کو ایڈجسٹ کریں
zh_cn: 针对特定问题调整学习者的评分

source: Delete
ar: حذف
ur: حذف کریں
zh_cn: 删除

source: This course is ending in {time_remaining_string} on {course_end_date}.
ar: تنتهي هذه الدورة التدريبية في {time_remaining_string} في {course_end_date}.
ur: یہ کورس {time_remaining_string} پر {course_end_date} پر ختم ہو رہا ہے.
zh_cn: 本课程以{course_end_date}的{time_remaining_string}结尾。

source: I'm taking {course_name} online with {twitter_brand}. Check it out!
ar: أتلقى {course_name} عبر الإنترنت مع {twitter_brand}. تحقق من ذلك!
ur: میں {course_name} آن لائن {twitter_brand} کے ساتھ آن لائن لے رہا ہوں. اس کی جانچ پڑتال کر!
zh_cn: 我正在使用{twitter_brand}在线{course_name}。一探究竟！

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
ar: للحصول على معلومات تفصيلية ، راجع {math_link_start} إدخال التعبيرات الرياضية والعلمية {math_link_end} في الدليل EDX {guide_link_start} للطلاب {guide_link_end}.
ur: تفصیلی معلومات کے لئے، {math_link_start} طلباء {guide_link_end} کے لئے {guide_link_start} edX گائیڈ میں ریاضی اور سائنسی اظہار {math_link_end} درج کریں.
zh_cn: 有关详细信息，请参阅{guide_link_start} edX学生指南{guide_link_end}中的{math_link_start}输入数学和科学表达式{math_link_end}。

source: Post on Facebook
ar: الرد في الفيسبوك
ur: فیس بک پر پوسٹ کریں
zh_cn: 在Facebook上发布

source: Reports
ar: تقارير
ur: رپورٹیں
zh_cn: 报告

source: View {cert_name_short}
ar: عرض {cert_name_short}
ur: دیکھیں {cert_name_short}
zh_cn: 查看{cert_name_short}
