Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Learners in the {track_name} Track
ar: المتعلمين في مسار {track_name}
ur: {track_name} ٹریک میں سیکھنے والے
zh_cn: 学习者在{track_name} Track中

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
ar: شكرا لتسديدك. لتلقي رصيد المقرر الدراسي ، يجب عليك الآن طلب رصيد على الموقع {link_to_provider_site}. حدد <b>طلب الائتمان</b> للبدء.
ur: آپ کی ادائیگی کے لئے آپ کا شکریہ. کورس کریڈٹ حاصل کرنے کے لئے، آپ کو اب {link_to_provider_site} ویب سائٹ پر کریڈٹ کی درخواست کرنا ضروری ہے. شروع کرنے کے لئے <b>درخواست کریڈٹ</b> منتخب کریں.
zh_cn: 谢谢您的付款。要获得课程学分，您现在必须在{link_to_provider_site}网站上申请学分。选择<b>请求信用</b>开始。

source: View and update learner enrollments.
ar: عرض وتحديث تسجيل المتعلم.
ur: سیکھنے والے اندراجات دیکھیں اور اپ ڈیٹ کریں.
zh_cn: 查看和更新​​学习者注册。

source: Help
ar: مساعدة
ur: مدد
zh_cn: 帮帮我

source: Generate Grade Report
ar: توليد تقرير الصف
ur: گریڈ رپورٹ بنائیں
zh_cn: 生成成绩报告

source: There are no attachments for this article.
ar: لا يوجد أي مرفقات لهذا المقال.
ur: اس مضمون کے لئے کوئی منسلک نہیں ہے.
zh_cn: 这篇文章没有附件。

source: %s comment
ar: تعليق٪ s
ur: ٪ s تبصرہ
zh_cn: ％s评论

source: Set Access
ar: تعيين الوصول
ur: رسائی سیٹ کریں
zh_cn: 设置访问

source: Conditional
ar: الشرط
ur: مشروط
zh_cn: 条件

source: %(platform_name)s on Facebook
ar: ٪ (platform_name) s على Facebook
ur: ٪ (پلیٹ فارم_ نام) فیس بک پر ہے
zh_cn: ％（platform_name）在Facebook上

source: Edit Library List.
ar: تحرير قائمة المكتبة.
ur: لائبریری کی فہرست میں ترمیم کریں.
zh_cn: 编辑库列表。

source: Percentage of seats purchased individually
ar: النسبة المئوية للمقاعد التي يتم شراؤها بشكل فردي
ur: انفرادی طور پر فروخت کردہ نشستوں کا فیصد
zh_cn: 单独购买座位的百分比

source: The underlying module store does not support import.
ar: مخزن الوحدة النمطية الأساسي لا يعتمد الاستيراد.
ur: بنیادی ماڈیول اسٹور درآمد کی حمایت نہیں کرتا.
zh_cn: 底层模块存储不支持导入。

source: Enter end, early_with_info, or early_no_info. After certificate generation, students who passed see a link to their certificates on the dashboard and students who did not pass see information about the grading configuration. The default is end, which displays this certificate information to all students after the course end date. To display this certificate information to all students as soon as certificates are generated, enter early_with_info. To display only the links to passing students as soon as certificates are generated, enter early_no_info.
ar: أدخل النهاية ، أو early_with_info ، أو early_no_info. بعد إنشاء الشهادة ، يرى الطلاب الذين اجتازوا رابطًا لشهاداتهم في لوحة التحكم والطلاّب الذين لم يمرروا راجع معلومات حول تهيئة التقدير. الافتراضي هو نهاية ، والذي يعرض معلومات الشهادة هذه لكافة الطلاب بعد تاريخ انتهاء الدورة التدريبية. لعرض معلومات الشهادة هذه لجميع الطلاب بمجرد إنشاء الشهادات ، أدخل early_with_info. لعرض الروابط التي تنقل الطلاب فقط بمجرد إنشاء الشهادات ، أدخل early_no_info.
ur: اختتام درج کریں، ابتدائی_with_info، یا ابتدائی_no_info. سرٹیفیکیشن کی نسل کے بعد، جو طالب علم نے اپنے سرٹیفکیٹ کے ڈیش بورڈ اور طالب علموں کو جو لنک منظور کیا وہ گریڈنگ ترتیب کے بارے میں معلومات نہیں دیکھتے تھے. ڈیفالٹ اختتام ہے، جو کورس کے اختتامی تاریخ کے بعد اس طالب علم کو تمام سرٹیفکیٹ کی معلومات کو ظاہر کرتا ہے. سرٹیفیکیٹ پیدا ہونے والے تمام طالب علموں کو اس سرٹیفکیٹ کی معلومات کو ظاہر کرنے کے لئے، ابتدائی_with_info درج کریں. جیسے ہی سرٹیفیکیٹ پیدا ہونے والے طلباء کو منتقل کرنے کے لئے صرف لنکس ظاہر کرنے کے لئے، ابتدائی_no_info درج کریں.
zh_cn: 输入end，early_with_info或early_no_info。在生成证书后，通过仪表板的学生看到了他们的证书链接，未通过的学生查看有关分级配置的信息。缺省为结束，在课程结束日期之后，该证书信息会显示给所有学生。要在生成证书后立即向所有学生显示此证书信息，请输入early_with_info。要在生成证书后立即显示传递给学生的​​链接，请输入early_no_info。

source: Female
ar: إناثا
ur: عورت
zh_cn: 女

source: The '{field_name}' field cannot be edited.
ar: لا يمكن تحرير حقل &quot;{field_name}&quot;.
ur: &#39;{field_name}&#39; فیلڈ میں ترمیم نہیں کیا جا سکتا.
zh_cn: “{field_name}”字段无法编辑。

source: Library Import Status
ar: حالة استيراد المكتبة
ur: لائبریری درآمد کی حیثیت
zh_cn: 图书馆导入状态

source: User Disabled Successfully
ar: تم تعطيل المستخدم بنجاح
ur: صارف کامیابی سے معذور ہے
zh_cn: 用户已成功禁用

source: Sign in or Register
ar: تسجيل الدخول أو التسجيل
ur: سائن ان کریں یا رجسٹر کریں
zh_cn: 登录或注册

source: Opening the downloaded file
ar: فتح الملف الذي تم تنزيله
ur: ڈاؤن لوڈ شدہ فائل کھولنے
zh_cn: 打开下载的文件

source: Tell us why you're interested in {platform_name}
ar: أخبرنا عن سبب اهتمامك بـ {platform_name}
ur: ہمیں بتائیں کہ آپ {platform_name} میں دلچسپی رکھتے ہیں
zh_cn: 告诉我们您对{platform_name}感兴趣的原因

source: You can click on any of the bars to list the students that opened the subsection.
ar: يمكنك النقر على أي من الأشرطة لسرد الطلاب الذين فتحوا القسم الفرعي.
ur: آپ سبھی سلاخوں پر کلک کر سکتے ہیں جو طالب علموں نے سبسکرائب کیا.
zh_cn: 您可以单击任何栏以列出打开该小节的学生。

source: Apply for Financial Assistance
ar: التقدم بطلب للحصول على المساعدة المالية
ur: مالی امداد کے لئے درخواست کریں
zh_cn: 申请财务援助

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
ar: بالنسبة لاختبار القبول بأكمله ، احذف إجابات الدارس وعشراته من قاعدة البيانات بشكل دائم وكامل.
ur: پورے داخلے کے امتحان کے لئے، مستقل طور پر اور مکمل طور پر سیکھنے والے کے جوابات اور ڈیٹا بیس سے اسکور کو خارج کر دیں.
zh_cn: 对于整个入学考试，永久和完全删除数据库中学习者的答案和分数。

source: The authorization has already been captured.
ar: تم التقاط الترخيص بالفعل.
ur: اجازت نامہ پہلے ہی قبضہ کر لیا گیا ہے.
zh_cn: 授权已被捕获。

source: We are working on generating course certificates.
ar: نحن نعمل على توليد شهادات الدورة.
ur: ہم کورس کے سرٹیفکیٹ پیدا کرنے پر کام کر رہے ہیں.
zh_cn: 我们正在制作课程证书。

source: Number of Transactions
ar: عدد المعاملات
ur: ٹرانزیکشنز کی تعداد
zh_cn: 交易数量

source: Content Locked
ar: محتوى مغلق
ur: مواد بند
zh_cn: 内容锁定

source: Pursue Academic Credit with a Verified Certificate
ar: متابعة الائتمان الأكاديمي مع شهادة التحقق
ur: تصدیق شدہ سرٹیفکیٹ کے ساتھ تعلیمی کریڈٹ پر عمل کریں
zh_cn: 用学历证书追求学分

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
ar: أنشئ مقاطع فيديو بسرعة ، ومقتطفات نصية ، ومناقشات مضمنة ، ومجموعة متنوعة من أنواع المشكلات.
ur: جلدی سے ویڈیوز، متن کے ٹکڑوں، ان لائن بات چیت، اور مختلف اقسام کی دشواری پیدا کریں.
zh_cn: 快速创建视频，文本片段，内嵌讨论以及各种问题类型。

source: Registration Help
ar: مساعدة التسجيل
ur: رجسٹریشن کی مدد
zh_cn: 注册帮助

source: Auto log:
ar: سجل السيارات:
ur: آٹو لاگ ان
zh_cn: 自动记录：

source: Export Course to Git:
ar: دورة التصدير إلى Git:
ur: گٹ کو برآمد کورس:
zh_cn: 将课程导出为Git：

source: Specify whether to advance automatically to the next unit when the video ends.
ar: حدد ما إذا كنت تريد التقدم تلقائيًا إلى الوحدة التالية عند انتهاء الفيديو.
ur: ویڈیو ختم ہونے پر اگلے یونٹ پر خود کار طریقے سے آگے بڑھانا چاہے تو بتائیں.
zh_cn: 指定视频结束时是否自动前进到下一个单位。

source: Preview of Pages in your course
ar: معاينة الصفحات في الدورة التدريبية الخاصة بك
ur: اپنے کورس میں صفحات کا پیش نظارہ
zh_cn: 在课程中预览页面

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
ar: {begin_strong} تحذير: {end_strong} متصفحك غير مدعوم بشكل كامل. نوصي بشدة باستخدام {chrome_link} أو {ff_link}.
ur: {start_strong} انتباہ: {end_strong} آپ کا براؤزر مکمل طور پر معاون نہیں ہے. ہم {chrome_link} یا {ff_link} کا استعمال کرتے ہوئے مشورہ دیتے ہیں.
zh_cn: {begin_strong}警告：{end_strong}您的浏览器不完全受支持。我们强烈建议您使用{chrome_link}或{ff_link}。

source: Error: General system failure. Possible fix: retry the payment after a few minutes.
ar: خطأ: فشل النظام العام. إصلاح محتمل: أعد محاولة الدفع بعد بضع دقائق.
ur: خرابی: جنرل نظام کی ناکامی. ممکنہ طے: چند منٹ کے بعد ادائیگی دوبارہ کریں.
zh_cn: 错误：常规系统故障。可能的解决方法：几分钟后重试付款。

source: This link will open the certificate web view
ar: سيفتح هذا الرابط عرض الويب الشهادة
ur: یہ لنک سرٹیفکیٹ ویب نقطہ نظر کھولے گا
zh_cn: 该链接将打开证书Web视图

source: Page not found
ar: الصفحة غير موجودة
ur: صفحہ نہیں ملا
zh_cn: 找不到网页

source: Learner in {content_group}
ar: المتعلم في {content_group}
ur: {content_group} میں سیکھنے والا
zh_cn: 学习者在{content_group}

source: To access the course visit {course_about_url} and register for the course.
ar: للوصول إلى الدورة التدريبية ، تفضل بزيارة {course_about_url} والتسجيل في الدورة التدريبية.
ur: کورس ملاحظہ کریں {course_about_url} اور کورس کے لئے رجسٹر.
zh_cn: 要访问课程，请访问{course_about_url}并注册课程。

source: Certificates Downloadable Before End
ar: الشهادات القابلة للتحميل قبل النهاية
ur: سرٹیفکیٹ اختتام سے پہلے ڈاؤن لوڈ ہونے والی
zh_cn: 在结束之前可以下载证书

source: View all Courses
ar: عرض جميع الدورات
ur: تمام کورسز دیکھیں
zh_cn: 查看所有课程

source: Add Discussion Admin
ar: أضف مسؤول المناقشة
ur: گفتگو ایڈمن شامل کریں
zh_cn: 添加讨论管理员

source: Incoming video data is empty.
ar: بيانات الفيديو الواردة فارغة.
ur: آنے والے ویڈیو ڈیٹا خالی ہے.
zh_cn: 传入视频数据为空。

source: Current Verification Status: Denied
ar: حالة التحقق الحالية: مرفوض
ur: موجودہ توثیق کی حیثیت: منظور
zh_cn: 当前验证状态：拒绝

source: {platform_name} Honor Code Certificate for {course_name}
ar: {platform_name} شهادة قانون الشرف لـ {course_name}
ur: {course_name} کے لئے {platform_name} اعزاز کوڈ سرٹیفکیٹ {course_name}
zh_cn: {platform_name} {course_name}的荣誉代码证书

source: Go back
ar: عُد
ur: واپس جاو
zh_cn: 回去

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
ar: قدم {order_placed_by} طلبًا وذكر اسمك كجهة اتصال المنظمة.
ur: {order_placed_by} نے حکم دیا اور آپ کا نام تنظیم رابطہ کے طور پر ذکر کیا.
zh_cn: {order_placed_by}下了订单并提及您的姓名作为组织联系人。

source: Enter the URL for the course data GIT repository.
ar: أدخل عنوان URL الخاص بمستودع GIT لبيانات الدورة التدريبية.
ur: کورس ڈیٹا GIT ذخیرہ کے لئے یو آر ایل درج کریں.
zh_cn: 输入课程数据GIT存储库的URL。

source: Add a New User
ar: إضافة مستخدم جديد
ur: نیا صارف شامل کریں
zh_cn: 添加新用户

source: Creating your course organization
ar: إنشاء تنظيم الدورة التدريبية الخاصة بك
ur: اپنا کورس تنظیم بنانا
zh_cn: 创建您的课程组织

source: Video Annotation
ar: شرح الفيديو
ur: ویڈیو تشریح
zh_cn: 视频注释

source: Courses Being Processed
ar: الدورات التي يجري معالجتها
ur: کورسز پر عملدرآمد کیا جا رہا ہے
zh_cn: 正在处理的课程

source: You have been invited to be a beta tester for {course_name} at {site_name} by a member of the course staff.
ar: لقد تمت دعوتك لتكون أحد مختبري النسخة التجريبية لـ {course_name} في {site_name} بواسطة أحد أعضاء فريق الدورة التدريبية.
ur: آپ کو کورس کے عملے کے ایک رکن کے ذریعہ {site_name} پر {site_name} کے لئے بیٹا ٹیسٹر بننے کی دعوت دی گئی ہے.
zh_cn: 您已被邀请成为课程人员的{site_name} {course_name}的测试人员。

source: Course page automatically created.
ar: صفحة الدورة التدريبية تم إنشائها تلقائيًا.
ur: کورس کا صفحہ خود کار طریقے سے تیار کیا.
zh_cn: 课程页面自动创建。

source: Choose learner types for regeneration
ar: اختيار أنواع المتعلم للتجديد
ur: دوبارہ پیدا کرنے کے لئے سیکھنے کی قسم منتخب کریں
zh_cn: 选择学习者类型进行再生

source: Currently the {platform_name} servers are overloaded
ar: حاليًا ، يتم تحميل أجهزة الخادم {platform_name}
ur: فی الحال {platform_name} سرور زیادہ اوور لوڈ کر رہے ہیں
zh_cn: 目前{platform_name}服务器已超载

source: Checkout Error
ar: خطأ في الدفع
ur: چیک آؤٹ کی خرابی
zh_cn: 结帐错误

source: Highlight important information to review later in the course or in future courses.
ar: قم بتمييز المعلومات الهامة للمراجعة لاحقًا في الدورة التدريبية أو في الدورات التدريبية المستقبلية.
ur: بعد میں کورس یا مستقبل کے نصاب میں جائزہ لینے کے لئے اہم معلومات کو نمایاں کریں.
zh_cn: 突出显示重要信息，以便稍后在课程或将来的课程中查看。

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
ar: لإنشاء دورات تدريبية في {studio_name} ، يجب أن يكون لديك امتيازات منشئي الدورة التدريبية لإنشاء الدورة التدريبية الخاصة بك.
ur: {سٹوڈیو_ نام} میں کورس تخلیق کرنے کے لئے، آپ کے اپنے کورس کو تخلیق کرنے کے لئے آپ کے پاس تخلیقی امتیازات ہونا لازمی ہے.
zh_cn: 要在{studio_name}中创建课程，您必须拥有课程创建者权限才能创建自己的课程。

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
ar: لنشر محتوى المسودة ، حدد رمز النشر لقسم أو قسم فرعي أو وحدة.
ur: مسودہ کے مواد شائع کرنے کے لئے، ایک سیکشن، سبسکرائب، یا یونٹ کے لئے شائع آئکن منتخب کریں.
zh_cn: 要发布草稿内容，请选择部分，子部分或单元的发布图标。

source: user is not given.
ar: لم يعط المستخدم.
ur: صارف نہیں دیا گیا ہے.
zh_cn: 用户没有给出。

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
ar: يمكنك إدارة هذه الصورة جنبًا إلى جنب مع جميع ملفات {a_link_start} وتحميلاتك الأخرى {a_link_end}
ur: آپ اس تصویر کو اپنے تمام دوسرے {a_link_start} فائلوں اور اپلوڈوں {a_link_end} کے ساتھ ساتھ منظم کرسکتے ہیں.
zh_cn: 您可以管理此图片以及您的所有其他{a_link_start}文件并上传{a_link_end}

source: Sorry, there was an error when trying to enroll you
ar: عذرًا ، حدث خطأ أثناء محاولة تسجيلك
ur: معذرت، آپ کو اندراج کرنے کی کوشش کرتے وقت ایک غلطی تھی
zh_cn: 抱歉，试图注册您时发生错误

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: أضف زوج المفتاح / القيمة لأي معلمات مخصصة ، مثل الصفحة التي يجب أن يفتحها كتابك الإلكتروني أو لون الخلفية لهذا المكون. <br /> راجع {docs_anchor_open} وثائق EDX LTI {anchor_close} لمزيد من التفاصيل حول هذا الإعداد.
ur: کسی بھی اپنی مرضی کے پیرامیٹرز کے لئے اہم / قدر جوڑی شامل کریں، جیسے جیسے آپ کے ای بک کو اس اجزاء کے لئے یا اس کے پس منظر کا رنگ ہونا چاہئے. <br /> اس ترتیب پر مزید تفصیلات کیلئے EDX LTI دستاویزات {anchor_close} ملاحظہ کریں {Docs_anchor_open}.
zh_cn: 为任何自定义参数添加键/值对，例如电子书应打开的页面或此组件的背景颜色。 <br />有关此设置的更多详细信息，请参阅{docs_anchor_open} edX LTI文档{anchor_close}。

source: File is not attached.
ar: الملف غير مرفق.
ur: فائل منسلک نہیں ہے.
zh_cn: 文件未附加。

source: Grade Distribution per Problem
ar: توزيع الصف لكل مشكلة
ur: فی فی گریڈ تقسیم
zh_cn: 每个问题的等级分布

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
ar: قدّم {order_placed_by} طلبًا وذكر اسمك كمستلم إيصال إضافي.
ur: {order_placed_by} ایک حکم دیا اور آپ کا نام اضافی رسید وصول کنندہ کے طور پر ذکر کیا.
zh_cn: {order_placed_by}下了订单，并提及您的姓名作为附加收件收件人。

source: Something was broken
ar: شيء ما تم كسره
ur: کچھ ٹوٹا ہوا تھا
zh_cn: 东西坏了

source: Student Notes
ar: ملاحظات الطالب
ur: طالب علم کے نوٹس
zh_cn: 学生笔记

source: Honor
ar: شرف
ur: عزت
zh_cn: 荣誉

source: Enter a numeric value for the number of enrollment codes.
ar: أدخل قيمة رقمية لعدد رموز التسجيل.
ur: داخلہ کوڈوں کی تعداد کے لئے عددی قدر درج کریں.
zh_cn: 输入注册码数量的数字值。

source: A Broad Library of Problem Types
ar: مكتبة واسعة لأنواع المشاكل
ur: مسئلہ کی اقسام کی وسیع لائبریری
zh_cn: 广泛的问题类型库

source: Tell us the details
ar: أخبرنا بالتفاصيل
ur: ہمیں تفصیلات بتائیں
zh_cn: 告诉我们细节

source: No changes made. Nothing to save.
ar: لم يتم إجراء أي تغييرات. لا شيء لإنقاذ.
ur: کوئی تبدیلی نہیں کی گئی. بچانے کے لئے کچھ نہیں.
zh_cn: 未做任何更改。没什么好保存的。

source: Course: {course_name}
ar: الدورة التدريبية: {course_name}
ur: کورس: {course_name}
zh_cn: 课程：{course_name}

source: Add User
ar: أضف المستخدم
ur: یوزر شامل کریں
zh_cn: 添加用户

source: Incorrect:
ar: غير صحيح:
ur: غلط:
zh_cn: 不正确：

source: You may not use complex numbers in range tolerance problems
ar: لا يجوز لك استخدام الأرقام المعقدة في مشكلات نطاق التسامح
ur: آپ رینج رواداری کے مسائل میں پیچیدہ نمبر استعمال نہیں کر سکتے ہیں
zh_cn: 您不能在范围容差问题中使用复数

source: Export Library Content
ar: تصدير محتوى المكتبة
ur: برآمد لائبریری مواد
zh_cn: 导出库内容

source: There are no problems in this section.
ar: لا توجد مشاكل في هذا القسم.
ur: اس سیکشن میں کوئی مسئلہ نہیں ہے.
zh_cn: 这部分没有问题。

source: Remove Profile Image
ar: إزالة صورة الملف الشخصي
ur: پروفائل کی تصویر کو ہٹا دیں
zh_cn: 删除个人资料图片

source: Course that students must complete before beginning this course
ar: الدورة التدريبية التي يجب على الطلاب إكمالها قبل بدء هذه الدورة التدريبية
ur: کورس اس بات کو شروع کرنے سے قبل طلباء کو مکمل کرنا ضروری ہے
zh_cn: 开始本课程之前，学生必须完成的课程

source: For exceptions
ar: للاستثناءات
ur: استثناء کے لئے
zh_cn: 例外

source: Verification Declined
ar: تم رفض التحقق
ur: توثیق کا اعلان
zh_cn: 验证已拒绝

source: {platform_name} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
ar: تحتفظ {platform_name} بالحق في تعديل الشروط في أي وقت دون إشعار مسبق. سوف تسري أي تغييرات تطرأ على الشروط فور نشرها على هذه الصفحة ، مع تاريخ سريان محدث. عن طريق الوصول إلى أو استخدام واجهات برمجة التطبيقات بعد إجراء أي تغييرات ، فإنك تشير إلى موافقتك على أساس مستقبلي على الشروط المعدلة وجميع التغييرات. تأكد من العودة إلى هذه الصفحة بشكل دوري لضمان الإلمام بالإصدار الأحدث من الشروط.
ur: {platform_name} کسی بھی وقت پیشگی معلومات کے بغیر کسی بھی وقت شرائط کو تبدیل کرنے کا حق محفوظ رکھتا ہے. تازہ کاری مؤثر تاریخ کے ساتھ، اس صفحے پر پوسٹ کرنے پر فوری طور پر شرائط پر کوئی تبدیلی ہو گی. کسی بھی تبدیلی کے بعد API تک رسائی حاصل کرنے یا استعمال کرتے ہوئے، آپ کو ترمیم شدہ شرائط اور تمام تبدیلیوں کے مطابق ممکنہ طور پر اپنے معاہدے پر دستخط کرتے ہیں. شرائط کے سب سے زیادہ موجودہ ورژن کے ساتھ واقفیت یقینی بنانے کے لئے اس صفحہ پر وقت واپس آنا یقینی بنائیں.
zh_cn: {platform_name}保留随时修改条款的权利，恕不另行通知。对本条款的任何更改将在本页发布后立即生效，更新生效日期。通过在做出任何更改之后访问或使用API​​，您将以修改后的条款和所有更改的前瞻性基准表示您的同意。请务必定期返回本页，以确保熟悉最新版本的条款。

source: Study hard and pass the course
ar: ادرس بجد واجتاز الدورة
ur: مشکل کا مطالعہ کریں اور کورس کو منتقل کریں
zh_cn: 努力学习并通过课程

source: Deadline by which the learner must upgrade to a verified seat
ar: الموعد النهائي الذي يجب على المتعلم من خلاله الترقية إلى مقعد تم التحقق منه
ur: آخری حد تک سیکھنے کو ایک تصدیق شدہ نشست میں اپ گریڈ کرنا ضروری ہے
zh_cn: 学习者必须升级到经过验证的座位的截止日期

source: Yes
ar: نعم فعلا
ur: جی ہاں
zh_cn: 是

source: Why should I break my textbook into chapters?
ar: لماذا يجب أن أقوم بتحطيم كتابي إلى فصول؟
ur: میں اپنی نصری کتاب کو بابوں میں کیوں برباد کروں؟
zh_cn: 我为什么要把我的教科书分成几章？

source: {html_start}Success{html_end} You have activated your account.
ar: {html_start} Success {html_end} لقد قمت بتنشيط حسابك.
ur: {HTML_start} کامیابی {HTML_end} نے آپ کا اکاؤنٹ چالو کیا ہے.
zh_cn: {html_start}成功{html_end}你已经激活了你的账户。

source: Create Enrollment Codes
ar: إنشاء رموز التسجيل
ur: اندراج کوڈز بنائیں
zh_cn: 创建注册码

source: enrolled learner profile
ar: ملف المتعلم المسجلين
ur: داخلہ سیکرٹری پروفائل
zh_cn: 登记学习者档案

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
ar: يجب أن يمنحك منشئ الدورة التدريبية إمكانية الوصول إلى الدورة التدريبية. اتصل بمنشئ الدورة التدريبية أو المسؤول عن الدورة التدريبية التي تساعد في تأليفها.
ur: کورس کے خالق کو آپ کو کورس تک رسائی حاصل ہوگی. اس کورس کے لئے کورس تخلیق یا منتظم سے رابطہ کریں جو آپ مصنف سے مدد کر رہے ہیں.
zh_cn: 课程创建者必须让你访问课程。请联系课程创建者或管理员以了解您正在撰写的课程。

source: Invalid location.
ar: موقع غير صالح.
ur: غلط مقام.
zh_cn: 位置无效。

source: || (parallel resistors)
ar: || (المقاومات المتوازية)
ur: || (متوازی مقاصد)
zh_cn: || （并联电阻）

source: Learn more about managing files
ar: تعرف على المزيد حول إدارة الملفات
ur: فائلوں کے انتظام کے بارے میں مزید جانیں
zh_cn: 详细了解如何管理文件

source: {group_name} (inactive)
ar: {group_name} (غير نشط)
ur: {group_name} (غیر فعال)
zh_cn: {group_name}（不活动）

source: What does not transfer from the original course?
ar: ما لا ينقل من الدورة الأصلية؟
ur: اصل کورس سے کیا فرق نہیں ہے؟
zh_cn: 什么不能从原来的课程中转移？

source: List Price
ar: قائمة الأسعار
ur: فہرست قیمت
zh_cn: 价格表

source: Specific learner
ar: متعلم محدد
ur: مخصوص سیکھنے والا
zh_cn: 具体的学习者

source: A cohort with the same name already exists.
ar: توجد بالفعل مجموعة نموذجية بالاسم نفسه.
ur: اسی نام کے ساتھ ایک کاہور پہلے ہی موجود ہے.
zh_cn: 一个同名的队列已经存在。

source: Denied
ar: رفض
ur: رد کر دیا
zh_cn: 被拒绝

source: Next Steps
ar: الخطوات التالية
ur: اگلے مراحل
zh_cn: 下一步

source: Preview
ar: معاينة
ur: پیش نظارہ
zh_cn: 预习

source: After you enroll, you can see the course on your student dashboard. You can see course materials after the course start date.
ar: بعد التسجيل ، يمكنك مشاهدة الدورة التدريبية على لوحة معلومات الطلاب الخاصة بك. يمكنك الاطلاع على مواد الدورة التدريبية بعد تاريخ بدء الدورة التدريبية.
ur: آپ اندراج کے بعد، آپ اپنے طالب علم ڈیش بورڈ پر کورس دیکھ سکتے ہیں. آپ کورس کے آغاز کے بعد کورس مواد دیکھ سکتے ہیں.
zh_cn: 注册后，您可以在学生仪表板上看到该课程。课程开始日期之后您可以看到课程资料。

source: Transferring your file to our servers
ar: نقل الملف الخاص بك إلى خوادمنا
ur: آپ کے فائل کو اپنے سرورز میں منتقل کرنے کی
zh_cn: 将您的文件传输到我们的服务器

source: Generating example {name} certificate
ar: إنشاء مثال على شهادة {name}
ur: جناب مثال {نام} سرٹیفیکیشن
zh_cn: 生成示例{name}证书

source: Play
ar: لعب
ur: کھیلیں
zh_cn: 玩

source: Simple Organization For Content
ar: منظمة بسيطة للمحتوى
ur: مواد کے لئے سادہ تنظیم
zh_cn: 简单的内容组织

source: The number of minutes available to students for viewing or interacting with this courseware component.
ar: عدد الدقائق المتوفرة للطلاب لعرض أو التفاعل مع مكون البرنامج التعليمي هذا.
ur: اس مجسمے کے اجزاء کے ساتھ دیکھنے یا ان سے رابطہ کرنے کے لئے طالب علموں کو دستیاب منٹوں کی تعداد.
zh_cn: 学生可用于查看或与此课件组件交互的分钟数。

source: Students
ar: الطلاب
ur: طلباء
zh_cn: 学生们

source: Open Responses
ar: الردود المفتوحة
ur: کھولیں جوابیں
zh_cn: 打开回复

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
ar: {b_start} رسمي: {b_end} تلقي شهادة موقعة من المدرب مع شعار المؤسسة
ur: {b_start} سرکاری: {b_end} ادارے کے علامت (لوگو) کے ساتھ ایک انسٹرکٹر- دستخط سرٹیفکیٹ حاصل کریں
zh_cn: {b_start}官方：{b_end}接收教师签署的带有该机构徽标的证书

source: Group Moderator
ar: مشرف المجموعة
ur: گروپ مینیجر
zh_cn: 组主持人

source: User {user} created successfully!
ar: المستخدم {user} تم إنشاؤه بنجاح!
ur: صارف {صارف} کامیابی سے پیدا ہوا!
zh_cn: 用户{user}创建成功！

source: Your enrollment: Audit track
ar: تسجيلك: مسار التدقيق
ur: آپ کا اندراج: آڈٹ ٹریک
zh_cn: 您的注册：审计跟踪

source: Course dates
ar: مواعيد الدورة
ur: کورس کی تاریخ
zh_cn: 课程日期

source: Updates
ar: التحديثات
ur: تازہ ترین معلومات
zh_cn: 更新

source: Payment Failed
ar: عملية الدفع فشلت
ur: ادائیگی ناکام ہوگئی
zh_cn: 支付失败

source: Meet the Instructors
ar: تلبية المدربين
ur: ہدایات سے ملیں
zh_cn: 认识导师

source: You should see your new email in your {link_start}dashboard{link_end}.
ar: من المفترض أن ترى بريدك الإلكتروني الجديد في {link_start} لوحة المعلومات {link_end}.
ur: آپ کو اپنا نیا ای میل اپنے {link_start} ڈیش بورڈ {link_end} میں دیکھنا چاہئے.
zh_cn: 您应该在{link_start}信息中心{link_end}中看到您的新电子邮件。

source: If you have earned a certificate, you will be able to access it {time_remaining_string} from now. You will also be able to view your certificates on your {learner_profile_link}.
ar: إذا كنت قد حصلت على شهادة ، فستتمكن من الوصول إليها {time_remaining_string} من الآن. ستتمكن أيضًا من عرض شهاداتك على {learner_profile_link}.
ur: اگر آپ نے ایک سرٹیفکیٹ حاصل کیا ہے، تو آپ ابھی سے {time_remaining_string} تک رسائی حاصل کر سکیں گے. آپ اپنے {learner_profile_link} پر اپنے سرٹیفکیٹ بھی دیکھ سکیں گے.
zh_cn: 如果您已获得证书，您将可以从现在开始访问{time_remaining_string}。您还可以在{learner_profile_link}上查看您的证书。

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
ar: {b_start} مؤهل للحصول على الرصيد: {b_end} احصل على رصيد أكاديمي بعد إكمال الدورة التدريبية بنجاح
ur: {b_start} کریڈٹ کے لۓ مستحق: {b_end} کورس مکمل طور پر مکمل کرنے کے بعد تعلیمی کریڈٹ حاصل کریں
zh_cn: {b_start}有资格获得学分：{b_end}成功完成课程后获得学分
