Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
ar: تؤدي إضافة أعضاء الفريق إلى جعل تأليف الدورة التدريبية أمرًا تعاونيًا. يجب أن يسجل المستخدمون في {studio_name} وأن يكون لديهم حساب نشط.
ur: ٹیم کے ارکان کو شامل کرنے کے کورس کو باہمی تعاون کے ساتھ تعاون فراہم کرتا ہے. صارف {studio_name} کے لئے دستخط کرنا ضروری ہے اور ایک فعال اکاؤنٹ ہے.
zh_cn: 增加团队成员使课程创作合作。用户必须注册{studio_name}并拥有有效的帐户。

source: Not yet answered.
ar: لم تجب بعد.
ur: ابھی تک جواب نہیں دیا
zh_cn: 尚未回答。

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخل عنوان URL للأداة الخارجية التي يطلقها هذا المكون. يتم استخدام هذا الإعداد فقط عند تعيين Hide External Tool على False. <br /> راجع {docs_anchor_open} وثائق EDX LTI {anchor_close} لمزيد من التفاصيل حول هذا الإعداد.
ur: بیرونی آلے کے یو آر ایل درج کریں کہ یہ جزو شروع ہوتا ہے. یہ ترتیب صرف اس وقت استعمال ہوتا ہے جب بیرونی آلے کو چھپانا غلط ہے. <br /> اس ترتیب پر مزید تفصیلات کیلئے EDX LTI دستاویزات {anchor_close} ملاحظہ کریں {Docs_anchor_open}.
zh_cn: 输入此组件启动的外部工具的URL。该设置仅在隐藏外部工具设置为False时使用。 <br />有关此设置的更多详细信息，请参阅{docs_anchor_open} edX LTI文档{anchor_close}。

source: Displayed on the course details page. Limit to 50 characters.
ar: معروض في صفحة تفاصيل الدورة التدريبية. الحد إلى 50 حرفًا.
ur: کورس تفصیلات کے صفحے پر ظاہر 50 حروف تک محدود
zh_cn: 显示在课程详情页面上。限制为50个字符。

source: Loading video player
ar: تحميل مشغل الفيديو
ur: ویڈیو پلیئر لوڈ کر رہا ہے
zh_cn: 加载视频播放器

source: Body can't be empty
ar: لا يمكن أن يكون الجسم فارغًا
ur: جسم خالی نہیں ہوسکتی ہے
zh_cn: 身体不能是空的

source: Please enter Course Mode detail below
ar: الرجاء إدخال تفاصيل وضع الدورة التدريبية أدناه
ur: ذیل میں کورس کے موڈ تفصیل درج کریں
zh_cn: 请在下面输入课程模式详情

source: Save failed for user preference '{key}' with value '{value}'.
ar: أخفق الحفظ في تفضيلات المستخدم &quot;{key}&quot; بالقيمة &quot;{value}&quot;.
ur: محفوظ کریں &#39;صارف کی ترجیحات&#39; {کلید} کے ساتھ &#39;قدر&#39; {قدر} کے ساتھ.
zh_cn: 用户偏好设置&#39;{key}&#39;保存失败，值为“{value}”。

source: Minimum Grade
ar: الحد الأدنى للصف
ur: کم از کم گریڈ
zh_cn: 最低等级

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
ar: انقر لعرض تكوين درجات الدورة التدريبية. توصيف التقدير هو تقسيم الأقسام الفرعية المتدرجة في الدورة التدريبية (مثل الاختبارات ومجموعات المشكلات) ، ويمكن تغييرها في صفحة &quot;التقدير&quot; (ضمن &quot;الإعدادات&quot;) في Studio.
ur: کورس کے لئے گریڈنگ ترتیب کو ظاہر کرنے کے لئے کلک کریں. گریڈنگ کی ترتیبات کورس (جیسے امتحانات اور دشواری سیٹوں کے طور پر) کی درجہ بندی سبسکرائب کی خرابی ہے، اور سٹوڈیو میں &#39;گریڈنگ&#39; کے صفحے (&#39;ترتیبات&#39; کے تحت) میں تبدیل کیا جاسکتا ہے.
zh_cn: 点击以显示课程的评分配置。分级配置是课程分级部分的细分（例如考试和问题集），可以在Studio中的“分级”页面（“设置”下）进行更改。

source: Don't have a {studio_name} Account? Sign up!
ar: ليس لديك حساب {studio_name}؟ سجل!
ur: {studio_name} اکاؤنٹ نہیں ہے؟ سائن اپ!
zh_cn: 没有{studio_name}帐户？注册！

source: New article created: %s
ar: تم إنشاء مقالة جديدة:٪ s
ur: نیا مضمون بنایا گیا:٪ s
zh_cn: 新文章已创建：％s

source: Upgrade to Verified
ar: الترقية إلى التحقق
ur: تصدیق شدہ پر اپ گریڈ کریں
zh_cn: 升级到验证

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
ar: الدورة &quot;{course_display_name}&quot; ، المقدمة من {platform_name} ، مفتوحة للتسجيل. يرجى الانتقال إلى هذه الدورة التدريبية على {link_for_about_page} للتسجيل.
ur: کورس &quot;{course_display_name}&quot;، {platform_name} کی طرف سے فراہم کردہ اندراج کے لئے کھلا ہے. درج ذیل میں {link_for_about_page} پر اس کورس پر تشریف لے جائیں.
zh_cn: 由{platform_name}提供的课程“{course_display_name}”已开放供注册。请转到{link_for_about_page}的此课程进行注册。

source: Browse Courses
ar: تصفح المقررات
ur: کورسز براؤز کریں
zh_cn: 浏览课程

source: We have provided a course enrollment code for you in {course_name}. To enroll in the course, click the following link:
ar: لقد قدمنا ​​شفرة تسجيل الدورة التدريبية في {course_name}. للتسجيل في الدورة التدريبية ، انقر فوق الرابط التالي:
ur: ہم نے {course_name} میں آپ کے لئے کورس کے داخلہ کوڈ فراہم کیا ہے. کورس میں اندراج کرنے کے لئے، مندرجہ ذیل لنک پر کلک کریں:
zh_cn: 我们已在{course_name}为您提供课程注册码。要注册课程，请点击以下链接：

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
ar: أدخل صح أو خطأ. إذا كانت هذه القيمة صحيحة ، يتم تمكين الاختبارات المقتطعة في الدورة التدريبية الخاصة بك. لاحظ أن تمكين الاختبارات المقتطعة سيمكن أيضًا من إجراء الاختبارات المحددة زمنياً.
ur: صحیح یا غلط درج کریں. اگر یہ قیمت سچ ہے تو، آپ کے کورس میں پیش کردہ امتحان فعال ہیں. یاد رکھیں کہ پروکیکڈ امتحان کو فعال کرنے کے لئے ٹائم ٹائمز بھی چالو کر سکیں گے.
zh_cn: 输入true或false。如果此值为真，则在您的课程中启用监考考试。请注意，启用监考考试也将启用定时考试。

source: This student (%s) will skip the entrance exam.
ar: سيخترق هذا الطالب (٪ s) اختبار القبول.
ur: اس طالب علم (٪ s) داخلہ امتحان چھوڑ دیں گے.
zh_cn: 这名学生（％s）将跳过入学考试。

source: Your Password Reset is Complete
ar: اكتمل إعادة تعيين كلمة المرور الخاصة بك
ur: آپ کا پاسورڈ ری سیٹ مکمل ہے
zh_cn: 您的密码重设已完成

source: Close
ar: قريب
ur: بند کریں
zh_cn: 关

source: Enter the number of days before the start date that beta users can access the course.
ar: أدخل عدد الأيام قبل تاريخ البدء الذي يستطيع مستخدمو الإصدار التجريبي الوصول إلى الدورة التدريبية.
ur: آغاز کی تاریخ سے قبل دن کی تعداد درج کریں کہ بیٹا صارف کورس تک رسائی حاصل کرسکتے ہیں.
zh_cn: 输入Beta版用户可以访问课程的开始日期之前的天数。

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
ar: بالنسبة إلى كتب HTML التي تظهر كعلامات تبويب منفصلة في الدورة التدريبية ، أدخل اسم علامة التبويب (عادةً عنوان الكتاب) بالإضافة إلى عناوين URL وألقاب كل فصل في الكتاب.
ur: کورس میں علیحدہ ٹیبز کے طور پر ظاہر ہونے والے HTML نصاب کے لئے، ٹیب کا نام درج کریں (عام طور پر کتاب کا لقب) اور اس کتاب میں ہر باب کے URLs اور عنوانات.
zh_cn: 对于在课程中显示为单独标签的HTML教科书，请输入标签的名称（通常是书的标题）以及书中每章的URL和标题。

source: View Gradebook
ar: عرض دفتر التقديرات
ur: گریڈ بک دیکھیں
zh_cn: 查看成绩簿

source: Student Special Exam Attempts
ar: محاولات الامتحانات الخاصة بالطلاب
ur: طالب علم کی خصوصی امتحان کی کوششیں
zh_cn: 学生特别考试尝试

source: Grading Configuration
ar: تكوين الدرجات
ur: گریڈنگ ترتیب
zh_cn: 评分配置

source: This is a success message
ar: هذه رسالة نجاح
ur: یہ ایک کامیابی کا پیغام ہے
zh_cn: 这是一个成功的消息

source: Identity Verification
ar: التحقق من الهوية
ur: شناخت کی توثیق
zh_cn: 身份验证

source: Hint
ar: ملحوظة
ur: اشارہ
zh_cn: 暗示

source: Access to this unit is not restricted, but visibility might be affected by inherited settings.
ar: لا يتم تقييد الوصول إلى هذه الوحدة ، ولكن قد تتأثر الرؤية بالإعدادات الموروثة.
ur: اس یونٹ تک رسائی محدود نہیں ہے، لیکن وراثت کی ترتیبات کی طرف سے متاثر کی جا سکتی ہے.
zh_cn: 对本机的访问不受限制，但可见性可能会受到继承设置的影响。

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
ar: أكملت الدورة التدريبية &quot;{course_name}&quot; ({course_mode} ، {start_date} - {end_date})
ur: کورس &quot;{course_name}&quot; ({course_mode}، {start_date} - {end_date} مکمل کیا
zh_cn: 完成了“{course_name}”（{course_mode}，{start_date} - {end_date}）课程

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
ar: عنوان URL لموفر الائتمان. إذا تم تمكين الدمج التلقائي ، فستكون هذه هي النقطة النهائية التي نتبعها لإخطار مقدم الخدمة بطلب الائتمان. وإلا ، فسيظهر للمستخدم رابطًا إلى عنوان URL هذا ، بحيث يمكن للمستخدم طلب ائتمان من الموفر مباشرةً.
ur: کریڈٹ فراہم کنندہ کا URL. اگر خود کار طریقے سے انضمام فعال ہوجاتا ہے تو، یہ اختتامی نقطہ ہے جسے ہم پوسٹ کرنے کے لۓ کریڈٹ کی درخواست فراہم کرتے ہیں. دوسری صورت میں، صارف اس URL کو ایک لنک دکھایا جائے گا، لہذا صارف براہ راست فراہم کنندہ سے کریڈٹ کی درخواست کرسکتا ہے.
zh_cn: 信用提供者的URL。如果启用了自动集成功能，则这将是我们发布的通知提供商信用请求的端点。否则，用户将会看到这个URL的链接，所以用户可以直接向提供者请求信用。

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
ar: يؤدي كسر كتابك الدراسي إلى فصول متعددة إلى تقليل أوقات تحميل الطلاب ، خاصةً أولئك الذين لديهم اتصالات بطيئة بالإنترنت. كما يمكن أن يساعد تفكيك الكتب المدرسية في الفصول على مساعدة الطلاب في العثور على المعلومات القائمة على الموضوعات بسهولة أكبر.
ur: اپنی نصابی کتاب کو متعدد باب میں توڑنے والے طالب علموں کے لئے لوڈنگ کا وقت کم کر دیتا ہے، خاص طور پر ان لوگوں کو سست انٹرنیٹ کنکشن کے ساتھ. نصاب میں نصاب کتابیں توڑ سکتے ہیں طالب علموں کو مزید آسانی سے مرکزی خیال، موضوع پر مبنی معلومات مل سکتی ہے.
zh_cn: 将课本分成多个章节可以减少学生的加载时间，特别是那些网络连接速度较慢的学生。将课本分成章节也可以帮助学生更容易地找到基于主题的信息。

source: Thursday
ar: الخميس
ur: جمعرات
zh_cn: 星期四

source: Refresh Status
ar: تحديث الحالة
ur: حیثیت تازہ کریں
zh_cn: 刷新状态

source: Blog
ar: مدونة
ur: بلاگ
zh_cn: 博客

source: Brief description of the problem
ar: وصف موجز للمشكلة
ur: مسئلہ کا مختصر بیان
zh_cn: 简要说明问题

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
ar: بمجرد الموافقة على هذا الطلب ، انتقل إلى {catalog_admin_url} لإعداد كتالوج لهذا المستخدم.
ur: ایک بار جب آپ نے اس درخواست کی توثیق کی ہے، اس صارف کیلئے ایک کیٹلاگ قائم کرنے کیلئے {catalog_admin_url} پر جائیں.
zh_cn: 批准此请求后，请转至{catalog_admin_url}为此用户设置一个目录。

source: file
ar: ملف
ur: فائل
zh_cn: 文件

source: Share on Facebook
ar: أنشرها على الفيسبوك
ur: فیس بک پر شیئر کریں
zh_cn: 在脸书上分享

source: Unfortunately you missed this course's deadline for a successful verification.
ar: للأسف ، فاتك الموعد النهائي للدورة لإجراء التحقق بنجاح.
ur: بدقسمتی سے آپ نے یہ کورس کی آخری تاریخ کو ایک کامیاب تصدیق کے لئے مسترد کیا.
zh_cn: 不幸的是，您错过了本课程成功验证的最后期限。

source: Learner photo not provided
ar: صورة المتعلم لم تقدم
ur: لیڈرر تصویر فراہم نہیں کی گئی
zh_cn: 不提供学习者照片

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
ar: سيؤدي هذا بعد ذلك إلى إجراء تحديث تلقائي لموقع LMS الرئيسي وتحديث محتويات الدورة التدريبية المرئية هناك للطلاب إذا تم تكوين استيراد بوابة التلقائي.
ur: اس کے بعد، مرکزی LMS سائٹ کا ایک خود کار طریقے سے اپ ڈیٹ کو متحرک کرے گا اور اگر آپ خود کار طریقے سے گیٹ کی درآمد کو ترتیب دی جاتی ہے تو وہاں طالب علموں کو اپنے کورس کی موجودگی کو اپ ڈیٹ کریں گے.
zh_cn: 然后，这将触发主LMS站点的自动更新，并在配置自动git导入时将学员的课程内容更新为学生。

source: This is the wiki for **{organization}**'s _{course_name}_.
ar: هذا هو الويكي لـ ** {organization} ** &#39;s _ {course_name} _.
ur: یہ ** {تنظیم} ** کے _ {course_name} _ کے لئے ویکی ہے.
zh_cn: 这是** {organization} **的_ {course_name} _的wiki。

source: An error occurred while deleting the score.
ar: حدث خطأ أثناء حذف النتيجة.
ur: سکور کو حذف کرنے میں ایک خرابی واقع ہوئی.
zh_cn: 删除分数时发生错误。

source: incorrect
ar: غير صحيح
ur: غلط
zh_cn: 不正确

source: next page
ar: الصفحة التالية
ur: اگلا صفحہ
zh_cn: 下一页

source: Sorry but you cannot have a root article with a slug.
ar: عذرًا ، ولكن لا يمكنك الحصول على مقالة جذرية تحتوي على سبيكة.
ur: معذرت، لیکن آپ کو سلگ کے ساتھ جڑ آرٹیکل نہیں ہے.
zh_cn: 对不起，但你不能有一个根源文章与slu。。

source: View resource in a new window
ar: عرض الموارد في نافذة جديدة
ur: نئی ونڈو میں وسائل دیکھیں
zh_cn: 在新窗口中查看资源

source: How it works
ar: كيف تعمل
ur: یہ کیسے کام کرتا ہے
zh_cn: 怎么运行的

source: The page that you were looking for was not found.
ar: لم يتم العثور على الصفحة التي كنت تبحث عنها.
ur: وہ صفحہ جو آپ تلاش کر رہے تھے وہ نہیں مل سکا.
zh_cn: 没有找到您正在寻找的页面。

source: Open edX
ar: افتح edX
ur: کھولیں edX
zh_cn: 打开edX

source: Explanation
ar: تفسير
ur: وضاحت
zh_cn: 说明

source: Please try again later.
ar: الرجاء معاودة المحاولة في وقت لاحق.
ur: براہ کرم کچھ دیر بعد کوشش کریں.
zh_cn: 请稍后再试。

source: Message failed to be {action} for any of {attempted} recipients
ar: أخفقت الرسالة في {action} لأي من {recipients} المستلمين
ur: کسی بھی {کوشش شدہ} وصول کنندگان کے لئے پیغام {کارروائی} ہونے میں ناکام رہا
zh_cn: 对于任何{尝试}收件人，邮件未能成为{操作}

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر ، ضع عدد الدورات المسجلة للحصول على شارة ، وفاصلة ، وسلسلة فئة شارة قمت بإنشائها تحتوي على مكون الإصدار &quot;openx__course&quot;. على سبيل المثال: 3 ، enrolled_3_courses
ur: ہر لائن پر، اندراج شدہ کورسوں کی تعداد میں ایک بیج، ایک کما، اور آپ نے بنائے جانے والے بیج کلاس کے سلیگ کو اکٹھا کرنے کے لئے ڈال دیا ہے جس میں &#39;openx__course&#39; جاری حصہ ہے. مثال کے طور پر: 3، نامزد شدہ_3_غیر
zh_cn: 在每一行上，将注册课程的数量设置为授予逗号的徽章，以及您创建的拥有发行组件“opensx__course”的徽章类的slu子。例如：3，enrolled_3_courses

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
ar: قم بمراجعة هذه الدورة مجانًا والحصول على إمكانية الوصول الكامل إلى جميع مواد الدورة التدريبية والأنشطة والاختبارات والمنتديات. {b_start} يرجى ملاحظة أن هذا المسار لا يقدم شهادة للمتعلمين الذين حصلوا على تقدير النجاح. {b_end}
ur: آڈٹ اس کورس کو مفت کے لئے اور تمام کورس کے مواد، سرگرمیوں، ٹیسٹ اور فورموں تک مکمل رسائی حاصل ہے. {b_start} براہ کرم نوٹ کریں کہ اس ٹریک کو گزرنے والی گریڈ حاصل کرنے والے سیکھنے والوں کے لئے سرٹیفکیٹ پیش نہیں کرتا. {b_end}
zh_cn: 免费审核本课程，并可完全访问所有课程材料，活动，测试和论坛。 {b_start}请注意，此曲目不会为获得及格分数的学员提供证书。{b_end}

source: Remember when you enrolled in %(course_name)s on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: أتذكر عندما قمت بالتسجيل في٪ (course_name) s على٪ (platform_name) s؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ٪ (course_name) s٪ (platform_name) پر درج ہوں گے؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 还记得你在％（platform_name）s上注册％（course_name）吗？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: Requirements for Course Credit
ar: متطلبات للحصول على الائتمان بالطبع
ur: کورس کریڈٹ کے لئے ضروریات
zh_cn: 课程学分要求

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
ar: يشير هذا الإعداد إلى ما إذا كان هذا الاختبار مخصصًا لأغراض الاختبار فقط. امتحانات الممارسة لا يتم التحقق منها.
ur: یہ ترتیب یہ بتاتی ہے کہ یہ امتحان صرف جانچ مقاصد کیلئے ہے. پریکٹس امتحان کی تصدیق نہیں کی جاتی ہے.
zh_cn: 此设置表明此考试是否仅用于测试目的。练习考试未通过验证。

source: Processing your account information
ar: معالجة معلومات حسابك
ur: آپ کے اکاؤنٹ کی معلومات پر عملدرآمد
zh_cn: 处理您的帐户信息

source: Already have an account?
ar: هل لديك حساب؟
ur: پہلے سے ہی ایک اکاؤنٹ ہے؟
zh_cn: 已经有一个帐户？

source: revisions
ar: التنقيحات
ur: تجزیہ
zh_cn: 修订

source: We're sorry to see you go! Please share your main reason for unenrolling.
ar: نحن آسفون أن نراك تذهب! يرجى مشاركة سببك الرئيسي لإلغاء التسجيل.
ur: ہم آپ کو جانے کے لۓ افسوس ہے! براہ کرم ناکام ہونے کی اپنی بنیادی وجہ کا اشتراک کریں.
zh_cn: 我们很抱歉看到你走了！请分享您取消注册的主要原因。

source: user "{username}" in row# {row}
ar: المستخدم &quot;{username}&quot; في الصف # {row}
ur: صارف &quot;{صارف کا نام}&quot; قطار # {قطار} میں
zh_cn: 第{row}行中的用户“{用户名}”

source: Order Number
ar: رقم الأمر
ur: آرڈر نمبر
zh_cn: 订单号

source: Problem successfully {action} for student '{student}'
ar: مشكلة بنجاح {action} للطالب &#39;{student}&#39;
ur: طالب علم &#39;{طالب علم}&#39; کے لئے مسئلہ {action} کامیابی سے
zh_cn: 问题成功{action}给学生&#39;{student}&#39;

source: Used
ar: مستخدم
ur: استعمال کیا جاتا ہے
zh_cn: 用过的

source: Course Price
ar: سعر الدورة
ur: کورس کی قیمت
zh_cn: 课程价格

source: (5) Course materials will not be available until the course start date.
ar: (5) لن تكون مواد الدورة التدريبية متاحة حتى تاريخ بدء الدورة.
ur: (5) کورس کے شروع ہونے کی تاریخ تک کورس کے سامان دستیاب نہیں ہوں گے.
zh_cn: （5）课程材料将在课程开始日期之前不可用。

source: Country
ar: بلد
ur: ملک
zh_cn: 国家

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
ar: تحتوي المكتبات على مجموعة من المكونات التي يمكن إعادة استخدامها عبر دورات متعددة. إنشاء مكتبة الأولى الخاصة بك بنقرة زر واحدة!
ur: لائبریریوں کے اجزاء کی تلاوت ہوتی ہے جو کئی کورسوں میں دوبارہ استعمال کیا جا سکتا ہے. ایک بٹن پر کلک کریں اپنی پہلی لائبریری بنائیں!
zh_cn: 图书馆拥有一系列可以在多个课程中重复使用的组件。点击按钮创建您的第一个图书馆！

source: The state of this problem has changed since you loaded this page. Please refresh your page.
ar: لقد تغيرت حالة هذه المشكلة منذ أن قمت بتحميل هذه الصفحة. يرجى تحديث صفحتك.
ur: چونکہ آپ نے اس صفحہ کو لوڈ کیا اس مسئلے کی حالت تبدیل ہوگئی ہے. براہ مہربانی اپنے صفحے کو تازہ کریں.
zh_cn: 自您加载此页面以来，此问题的状态已发生变化。请刷新您的页面。

source: To see course content, {sign_in_link} or {register_link}.
ar: لمشاهدة محتوى الدورة التدريبية ، {sign_in_link} أو {register_link}.
ur: کورس کے مواد، {sign_in_link} یا {register_link} کو دیکھنے کے لئے.
zh_cn: 查看课程内容{sign_in_link}或{register_link}。

source: Invalid Token
ar: رمز غير صالح
ur: غلط ٹوکن
zh_cn: 令牌无效

source: Created new profile for user: "{}"
ar: إنشاء ملف تعريف جديد للمستخدم: &quot;{}&quot;
ur: صارف کیلئے نئی پروفائل بنائیں: &quot;{}&quot;
zh_cn: 为用户创建了新的个人资料：“{}”

source: Enter your city.
ar: أدخل مدينتك.
ur: اپنا شہر درج کریں
zh_cn: 进入你的城市。

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
ar: عنوان URL أو عناوين URL التي نشرت فيها نسخًا غير تابعة للفيديو من YouTube. يجب أن ينتهي كل عنوان URL بـ .mpeg أو .mp4 أو .ogg أو .webm ولا يمكن أن يكون عنوان URL على YouTube. (للتوافق مع المستعرض ، نوصي بشدة بتنسيق mp4 و .webm.) سيتمكن الطلاب من عرض أول فيديو مدرج متوافق مع جهاز الكمبيوتر الخاص بالطالب. للسماح للطلاب بتنزيل مقاطع الفيديو هذه ، عيّن تنزيل الفيديو مسموح به إلى True.
ur: یو آر ایل یا یو آر ایل جہاں آپ نے ویڈیو کے غیر YouTube ورژن پوسٹ کیے ہیں. ہر URL میں .mpeg، .mp4، .ogg، یا .webm میں ختم ہونا لازمی ہے اور YouTube یو آر ایل نہیں ہوسکتا ہے. (براؤزر مطابقت کے لئے، ہم مضبوطی سے .mp4 اور .webm کی شکل میں مشورہ دیتے ہیں.) طالب علموں کو پہلے فہرست شدہ ویڈیو دیکھنے کے قابل ہو گا جو طالب علم کے کمپیوٹر کے ساتھ مطابقت رکھتا ہے. طالب علموں کو ان ویڈیووں کو ڈاؤن لوڈ کرنے کی اجازت دینے کے لئے، ویڈیو کو درست کرنے کیلئے ڈاؤن لوڈ کردہ ڈاؤن لوڈ کریں.
zh_cn: 您发布视频的非YouTube版本的网址或网址。每个网址必须以.mpeg，.mp4，.ogg或.webm结尾，并且不能是YouTube网址。 （对于浏览器兼容性，我们强烈建议使用.mp4和.webm格式。）学生将能够查看与学生计算机兼容的第一个列出的视频。要允许学生下载这些视频，请将允许视频下载设置为True。

source: Organization Billing Address
ar: عنوان الفواتير المنظمة
ur: تنظیم بلنگ ایڈریس
zh_cn: 组织帐单地址

source: The following parameters are required: {missing}.
ar: المعلمات التالية مطلوبة: {missing}.
ur: مندرجہ ذیل پیرامیٹرز کی ضرورت ہے: {لاپتہ}.
zh_cn: 以下参数是必需的：{missing}。

source: Payment Instructions
ar: تعليمات الدفع
ur: ادائیگی ہدایات
zh_cn: 付款说明

source: The revision of this attachment currently in use (on all articles using the attachment)
ar: مراجعة هذا المرفق قيد الاستخدام (على جميع المقالات باستخدام المرفق)
ur: اس منسلک کا تجزیہ فی الحال استعمال میں ہے (منسلک کا استعمال کرتے ہوئے تمام مضامین پر)
zh_cn: 目前正在使用的这个附件的修订（在所有使用附件的文章上）

source: All rights reserved
ar: كل الحقوق محفوظة
ur: جملہ حقوق محفوظ ہیں
zh_cn: 版权所有

source: Go to Prerequisite Section
ar: اذهب إلى قسم المتطلبات المسبقة
ur: لازمی سیکشن پر جائیں
zh_cn: 转到先决条件部分

source: Password reset successful
ar: تمت إعادة ضبط كلمة المرور بنجاح
ur: پاس ورڈ دوبارہ ترتیب کامیاب
zh_cn: 密码重置成功

source: Thanks for signing up, {name}!
ar: شكرًا على التسجيل ، {name}!
ur: سائن اپ کرنے کے لئے شکریہ، {نام}!
zh_cn: 感谢您注册{name}！

source: Checking this box has no effect if 'Remove beta testers' is selected.
ar: لا يؤثر تحديد هذا المربع في حالة تحديد &quot;إزالة مختبري النسخة التجريبية&quot;.
ur: اگر بیٹا ٹیسرز کو ہٹا دیں تو اس باکس کی جانچ پڑتال کا کوئی اثر نہیں ہے.
zh_cn: 如果选择“删除测试版测试人员”，则选中此框无效。

source: List enrolled students' profile information
ar: القائمة سجلت معلومات الملف الشخصي للطلاب
ur: اندراج شدہ طلباء کی پروفائل کی معلومات درج کریں
zh_cn: 列出已注册学生的个人资料信息

source: e.g. yourname@domain.com
ar: على سبيل المثال yourname@domain.com
ur: مثلا yourname@domain.com
zh_cn: 例如yourname@domain.com

source: Video Stop Time
ar: وقت توقف الفيديو
ur: ویڈیو سٹاپ وقت
zh_cn: 视频停止时间

source: Register below to create your {platform_name} account
ar: سجل أدناه لإنشاء حساب {platform_name} الخاص بك
ur: اپنے {platform_name} اکاؤنٹ کو بنانے کے لئے ذیل میں درج کریں
zh_cn: 在下面注册以创建您的{platform_name}帐户

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
ar: نظرًا لأننا لم نمتلك مجموعة صحيحة من صور التحقق منك عندما تم إنشاء {cert_name_long} ، لم نتمكن من منحك إثباتًا {cert_name_short}. تم منح رمز شرف {cert_name_short} بدلاً من ذلك.
ur: چونکہ ہمارے پاس {cert_name_long} پیدا ہوا تھا جب ہم نے آپ سے تصدیق شدہ تصاویر کی درست سیٹ نہیں کی تھی، ہم آپ کو ایک تصدیق شدہ {certificate_name_short} فراہم نہیں کر سکے. اس کے بدلے ایک اعزاز کوڈ {cert_name_short} دیا گیا ہے.
zh_cn: 由于我们在生成{cert_name_long}时没有一组有效的验证照片，因此我们无法向您授予验证的{cert_name_short}。荣誉代码{cert_name_short}已被授予。

source: Loading Order Data...
ar: جارٍ تحميل بيانات الطلب ...
ur: آرڈر ڈیٹا لوڈ کر رہا ہے ...
zh_cn: 加载订单数据...

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
ar: غيّر حياتك وابدأ التعلم اليوم من خلال تنشيط حسابك على {platform_name}. انقر على الرابط أدناه أو انسخه والصقه في شريط عناوين المتصفح.
ur: اپنے {platform_name} اکاؤنٹ کو فعال کرکے اپنی زندگی کو تبدیل کریں اور آج سیکھنا شروع کریں. نیچے دیئے گئے لنک پر کلک کریں یا اسے اپنے براؤزر کے ایڈریس بار میں کاپی کریں اور پیسٹ کریں.
zh_cn: 通过激活您的{platform_name}帐户，改变你的生活，并开始学习。点击下面的链接或将其复制并粘贴到浏览器的地址栏中。

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
ar: يمكن لمُختبري النسخة التجريبية مشاهدة محتوى الدورة التدريبية قبل المتعلمين الآخرين. يمكنهم التأكد من أن المحتوى يعمل ، ولكن ليس لديهم امتيازات إضافية. يمكنك فقط إعطاء أدوار فريق المقرر للمستخدمين المسجلين.
ur: بیٹا ٹیسرز دوسرے سیکھنے والوں سے پہلے کورس کے مواد دیکھ سکتے ہیں. وہ اس بات کا یقین کر سکتے ہیں کہ مواد کام کرتا ہے، لیکن کوئی اضافی استحکام نہیں ہے. آپ کورسز ٹیم کے رول کو صارفین کو اندراج کرنے کے لئے صرف دے سکتے ہیں.
zh_cn: Beta测试人员可以在其他学习者之前看到课程内容。他们可以确保内容有效，但没有额外的权限。您只能将课程团队角色授予注册用户。

source: Moderator
ar: وسيط
ur: ماڈیٹر
zh_cn: 主席

source: This is a test error
ar: هذا خطأ اختبار
ur: یہ ایک ٹیسٹ کی غلطی ہے
zh_cn: 这是一个测试错误

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
ar: الملفات التالية متوفرة لهذه المقالة. انسخ علامة تحديد السعر للإشارة مباشرة إلى ملف من نص المقالة.
ur: مندرجہ ذیل فائلیں اس آرٹیکل کے لئے دستیاب ہیں. مضمون ٹیکسٹ سے ایک فائل کو براہ راست حوالہ کرنے کے لئے نشان زد ٹیگ کاپی کریں.
zh_cn: 以下文件适用于本文。复制降价标签以直接引用文章文字中的文件。
