Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: {subsection_format} due {{date}}
ar: {subsection_format} المستحقة {{date}}
ur: {subsection_format} کی وجہ {{تاریخ}}
zh_cn: {subsection_format}截止日期{{date}}

source: The course you requested does not exist.
ar: الدورة التي طلبتها غير موجودة.
ur: آپ نے درخواست کردہ کورس موجود نہیں ہے.
zh_cn: 您请求的课程不存在。

source: Special characters not allowed in organization, course number, and course run.
ar: لا يُسمح بالحروف الخاصة في المؤسسة ورقم الدورة التدريبية والمسار الدراسي.
ur: تنظیم، کورس نمبر، اور کورس چلانے میں اجازت نہیں دی گئی مخصوص حروف.
zh_cn: 组织，课程编号和课程不允许使用特殊字符。

source: Error generating example {name} certificate: {error}
ar: خطأ في إنشاء مثال على شهادة {name}: {error}
ur: مثال کے طور پر پیدا کرنے میں غلطی {نام} سرٹیفکیٹ: {غلطی}
zh_cn: 生成示例{name}证书时出错：{error}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
ar: تم الاحتفاظ بـ {cert_name_long} في انتظار التأكيد على أن إصدار {cert_name_short} يتوافق مع الحظر الأمريكي الصارم على إيران وكوبا وسوريا والسودان. إذا كنت تعتقد أن نظامنا قد عرّفك عن طريق الخطأ على أنك متصل بأحد هذه البلدان ، فيرجى إخبارنا عن طريق الاتصال بـ {email}.
ur: آپ {cert_name_long} کی زیر التواء تصدیق کی جا رہی ہے کہ آپ {cert_name_short} جاری کرتے ہیں، ایران، کیوبا، شام اور سوڈان پر سخت امریکی پابندیوں کے مطابق ہے. اگر آپ سوچتے ہیں کہ ہمارے سسٹم نے غلطی سے آپ کو ان ممالک میں سے کسی کے ساتھ منسلک ہونے کی شناخت کی ہے، تو براہ مہربانی {ای میل} سے رابطہ کرکے ہمیں بتائیں.
zh_cn: 您的{cert_name_long}正在等待确认发布您的{cert_name_short}符合严格的美国对伊朗，古巴，叙利亚和苏丹的禁运。如果您认为我们的系统错误地将您标识为与其中一个国家/地区有关联，请通过联系{email}告知我们。

source: Merge with current
ar: دمج مع التيار
ur: موجودہ کے ساتھ ضم کریں
zh_cn: 与当前合并

source: Settings for course credit eligibility
ar: إعدادات لأهلية الائتمان بالطبع
ur: کورس کریڈٹ اہلیت کے لئے ترتیبات
zh_cn: 课程学分资格的设置

source: We hope you are enjoying learning with us so far in <strong>%(first_course_name)s</strong>! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable.
ar: نأمل أن تستمتع بالتعلم معنا حتى الآن في <strong>٪ (first_course_name) s</strong> ! تتيح لك الشهادة التي تم التحقق منها إبراز معرفتك ومهاراتك الجديدة. شهادة٪ (platform_name) s رسمية ويمكن مشاركتها بسهولة.
ur: ہم امید کرتے ہیں کہ آپ ابھی تک ہمارے ساتھ سیکھنے سے لطف اندوز کر رہے ہیں <strong>٪ (first_course_name) s</strong> ! ایک تصدیق شدہ سرٹیفکیٹ آپ کو اپنے نئے علم اور مہارت کو اجاگر کرنے کی اجازت دیتا ہے. ایک٪ (پلیٹ فارم_ نام) سرٹیفکیٹ سرکاری اور آسانی سے مستحکم ہے.
zh_cn: 我们希望你在享受<strong>％（first_course_name）s的学习</strong> ！经过验证的证书可让您突出显示您的新知识和技能。 ％（platform_name）的证书是官方的，并且可以轻松共享。

source: Reports Available for Download
ar: التقارير المتاحة للتحميل
ur: ڈاؤن لوڈ، اتارنا کے لئے دستیاب رپورٹ
zh_cn: 报告可供下载

source: Verification Failed
ar: فشل التحقق
ur: توثیق ناکام ہوگئی
zh_cn: 验证失败

source: article
ar: مقالة - سلعة
ur: مضمون
zh_cn: 文章

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
ar: دورة دراسية تقدمها {partner_short_name} ، وهي مبادرة تعليمية عبر الإنترنت من {partner_long_name}.
ur: {partner_short_name} کی طرف سے پیش کردہ ایک کورس کا مطالعہ، {partner_long_name} کا ایک آن لائن سیکھنے کا پہلو.
zh_cn: {partner_short_name}提供的一门课程，这是{partner_long_name}的在线学习计划。

source: Button Text
ar: زر كتابة
ur: بٹن متن
zh_cn: 按钮文本

source: Code '{registration_code}' is not valid for any course in the shopping cart.
ar: الرمز &quot;{registration_code}&quot; غير صالح لأي دورة تدريبية في عربة التسوق.
ur: خریداری کی ٹوکری میں کسی بھی کورس کے لئے کوڈ &#39;{registration_code}&#39; درست نہیں ہے.
zh_cn: 代码“{registration_code}”对于购物车中的任何课程无效。

source: Previewing a merge between two revisions:
ar: معاينة الدمج بين مراجعتين:
ur: دو نظر ثانیوں کے درمیان ضم کا پیش نظارہ:
zh_cn: 预览两个修订版之间的合并：

source: Mar
ar: بحر
ur: سمندر
zh_cn: 海

source: Code Input
ar: إدخال رمز
ur: کوڈ ان پٹ
zh_cn: 代码输入

source: May
ar: قد
ur: مئی
zh_cn: 可能

source: coupon with the coupon id ({coupon_id}) updated successfully
ar: تم تحديث القسيمة التي تحمل رقم القسيمة ({coupon_id}) بنجاح
ur: کوپن ID ({coupon_id}) کے ساتھ کوپن کامیابی سے اپ ڈیٹ کیا
zh_cn: 优惠券ID（{coupon_id}）已成功更新

source: Select True to request the user's email address.
ar: حدد True لطلب عنوان البريد الإلكتروني للمستخدم.
ur: صارف کا ای میل ایڈریس کی درخواست کرنے کے لئے سچ منتخب کریں.
zh_cn: 选择True以请求用户的电子邮件地址。

source: Remember when you enrolled in <strong>%(course_name)s</strong> on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: أتذكر عندما قمت بالتسجيل في <strong>٪ (course_name) s</strong> على٪ (platform_name) s؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ <strong>٪ (course_name) s</strong> ٪ (platform_name) پر درج ہوں گے؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 还记得你在<strong>％（platform_name）s</strong>上注册<strong>％（course_name）</strong>吗？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: Course Structure
ar: هيكل الدورة
ur: کورس کی ساخت
zh_cn: 课程结构

source: {html_start}Success! You have activated your account.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
ar: {} html_start النجاح! لقد قمت بتنشيط حسابك. {html_end} ستتلقى الآن تحديثات وتنبيهات البريد الإلكتروني منا ذات الصلة بالدورات التي قمت بالتسجيل فيها. تسجيل الدخول للمتابعة.
ur: {HTML_start} کامیابی! آپ نے اپنے اکاؤنٹ کو فعال کیا ہے. {html_end} آپ اب ہم ان کورسوں سے متعلق ای میل کی تازہ کاری اور انتباہات وصول کریں گے جن میں آپ داخل ہو گئے ہیں. سائن ان کریں.
zh_cn: {} html_start成功！您已经激活了您的账户。{html_end}您现在将收到我们与您注册的课程有关的电子邮件更新和提醒。登录以继续。

source: Name must be at least {min_length} characters long.
ar: يجب ألا يقل الاسم عن {min_length} من الأحرف.
ur: نام سے کم از کم {min_length} حروف طویل ہونا لازمی ہے.
zh_cn: 名称的长度至少应为{min_length}个字符。

source: The registration codes for invoice {0} have been re-activated.
ar: تم إعادة تنشيط أكواد التسجيل للفاتورة {0}.
ur: رسید {0} کے لئے رجسٹریشن کوڈ دوبارہ چالو کر دیا گیا ہے.
zh_cn: 发票{0}的注册码已被重新​​激活。

source: Student
ar: طالب علم
ur: طالب علم
zh_cn: 学生

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
ar: يمتلك مشرفو المكتبة امتيازات التحرير الكاملة ويمكنهم أيضًا إضافة أعضاء الفريق الآخرين وإزالتهم. يجب أن يكون هناك مستخدم واحد على الأقل لديه دور المشرف في المكتبة.
ur: لائبریری ایڈمنز کو مکمل ترمیم کے امتیاز حاصل ہیں اور دیگر ٹیم کے ارکان کو بھی شامل اور ہٹانے میں مدد مل سکتی ہے. لائبریری میں ایڈمن کردار کے ساتھ کم از کم ایک صارف ہونا لازمی ہے.
zh_cn: 图书馆管理员拥有完整的编辑权限，还可以添加和删除其他团队成员。库中必须至少有一名具有管理员角色的用户。

source: Enter the billing address.
ar: أدخل عنوان الفواتير.
ur: بلنگ کا پتہ درج کریں.
zh_cn: 输入帐单地址。

source: Contact {platform_name} Support
ar: اتصل بـ {platform_name} الدعم
ur: رابطہ {platform_name} سپورٹ
zh_cn: 联系{platform_name}支持

source: The name of your company.
ar: اسم شركتك.
ur: آپ کی کمپنی کا نام
zh_cn: 你公司的名字。

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
ar: إصدار شارات &quot;الشارات المفتوحة&quot; لهذه الدورة التدريبية. يتم إنشاء الشارات عند إنشاء الشهادات.
ur: اس کورس کے لئے کھولیں بیج بیج کا مسئلہ. بیج پیدا ہوتے ہیں جب سرٹیفکیٹ تخلیق ہوتے ہیں.
zh_cn: 为此课程颁发开放徽章徽章。徽章是在创建证书时生成的。

source: Audit
ar: تدقيق
ur: آڈٹ
zh_cn: 审计

source: No Expiration Date
ar: لا تاريخ انتهاء الصلاحية
ur: کوئی ختم ہونے والی تاریخ نہیں
zh_cn: 没有到期日期

source: The last speed that the user specified for the video.
ar: السرعة الأخيرة التي حددها المستخدم للفيديو.
ur: ویڈیو کے لئے مخصوص صارف جس کی آخری رفتار.
zh_cn: 用户为视频指定的最后一个速度。

source: The card has reached the credit limit. Possible action: retry with another form of payment.
ar: وصلت البطاقة إلى حد الائتمان. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: کارڈ کریڈٹ کی حد تک پہنچ گئی ہے. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 该卡已达到信用额度。可能的行动：以另一种形式的付款重试。

source: Course is not valid
ar: الدورة غير صالحة
ur: کورس درست نہیں ہے
zh_cn: 课程无效

source: {total_points} points possible
ar: {total_points} نقطة ممكنة
ur: {total_points} پوائنٹس ممکن ہے
zh_cn: {total_points}分可能

source: Gender
ar: جنس
ur: صنف
zh_cn: 性别

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
ar: أدخل عنوان URL للاستبيان في نهاية الدورة التدريبية. إذا لم يكن لدراستك دراسة استقصائية ، أدخل null.
ur: اختتام کورس کے سروے کے لئے یو آر ایل درج کریں. اگر آپ کے کورس میں ایک سروے نہیں ہے تو، نوک درج کریں.
zh_cn: 输入课程结束调查的网址。如果您的课程没有调查，请输入null。

source: problems
ar: مشاكل
ur: مسائل
zh_cn: 问题

source: If true, can be seen only by course staff, regardless of start date.
ar: إذا كان هذا صحيحًا ، فلا يمكن رؤيته إلا من قِبل طاقم الدورة التدريبية ، بصرف النظر عن تاريخ البدء.
ur: اگر سچ ہے تو، صرف کورس کے عملے کی طرف سے دیکھا جا سکتا ہے، شروع کی تاریخ کے بغیر.
zh_cn: 如果属实，只能由课程人员看到，不管开始日期。

source: YouTube ID for .75x speed
ar: معرف YouTube لسرعة 75x
ur: .75x کی رفتار کیلئے یو ٹیوب ID
zh_cn: YouTube ID为.75x速度

source: Enter the company contact name.
ar: أدخل اسم جهة الاتصال للشركة.
ur: کمپنی کا رابطہ نام درج کریں.
zh_cn: 输入公司联系人姓名。

source: Coming Soon
ar: قريبا
ur: جلد آ رہا ہے
zh_cn: 快来了

source: generated
ar: ولدت
ur: پیدا ہوا
zh_cn: 产生

source: Pre-Requisite Courses
ar: دورات ما قبل المتطلب
ur: قبل از کم کورسز
zh_cn: 先决课程

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
ar: يجب أن يمنحك منشئ المكتبة إمكانية الوصول إلى المكتبة. اتصل بمنشئ المكتبة أو المسؤول عن المكتبة التي تساعد في تأليفها.
ur: لائبریری تخلیق کار آپ کو لائبریری تک رسائی فراہم کرنا ضروری ہے. لائبریری کے لئے لائبریری تخلیق یا منتظم سے رابطہ کریں جو آپ لائبریری میں مدد کر رہے ہیں.
zh_cn: 图书馆的创建者必须让你访问图书馆。联系您正在帮助创作的图书馆的图书馆创建者或管理员。

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
ar: عيّن استثناءات لإنشاء شهادات للمتعلمين الذين لم يكونوا مؤهلين للحصول على شهادة ولكن تم منحهم استثناءً من قبل فريق الدورة التدريبية. بعد إضافة المتعلمين إلى قائمة الاستثناءات ، انقر فوق إنشاء شهادات استثناء أدناه.
ur: سیکھنے والوں کے لئے سرٹیفکیٹ پیدا کرنے کے لئے استثناء مقرر کریں جو ایک سرٹیفکیٹ کے لئے اہل نہیں تھے لیکن کورس کی ٹیم کی طرف سے ایک رعایت دی گئی ہے. سیکھنے والے استثنا کی فہرست میں شامل ہونے کے بعد، ذیل میں استثنا سرٹیفکیٹ پیدا کریں پر کلک کریں.
zh_cn: 设置例外，为没有资格获得证书但被课程团队给予例外的学习者生成证书。将学习者添加到例外列表后，单击下面的生成例外证书。

source: You requested a credit for a capture that was previously voided.
ar: لقد طلبت رصيدًا لعملية التقاط تم إلغاءها سابقًا.
ur: آپ نے اس گرفتاری کے لۓ ایک کریڈٹ کی درخواست کی ہے جو پہلے سے وابستہ تھی.
zh_cn: 您要求获得以前无效的拍摄金额。

source: Skeleton Page
ar: هيكل عظمي صفحة
ur: کنکال صفحہ
zh_cn: 骨架页面

source: {course_number} {course_name} Home Page
ar: {course_number} {course_name} الصفحة الرئيسية
ur: {course_number} {course_name} ہوم پیج
zh_cn: {course_number} {course_name}主页

source: Your changes were saved.
ar: تم حفظ التغييرات الخاصة بك.
ur: آپ کی تبدیلیاں محفوظ ہوگئیں.
zh_cn: 您的更改已保存。

source: CVN did not match.
ar: CVN لم تتطابق.
ur: CVN نہیں ملا.
zh_cn: CVN不匹配。

source: Gross Revenue Pending
ar: إجمالي الإيرادات معلق
ur: مجموعی آمدنی پر پابندی
zh_cn: 总收入待定

source: Email Task History
ar: البريد الإلكتروني مهمة التاريخ
ur: ای میل ٹاسک تاریخ
zh_cn: 电子邮件任务历史

source: Total Discounted Amount
ar: مجموع المبلغ المخفض
ur: کل ڈسکاؤنٹ مال
zh_cn: 总折扣金额

source: This article is no longer related to the file %s.
ar: لم تعد هذه المقالة مرتبطة بالملف٪ s.
ur: یہ مضمون اب فائل٪ سے متعلق نہیں ہے.
zh_cn: 本文不再与文件％s相关。

source: Upcoming
ar: القادمة
ur: آنے والے
zh_cn: 即将到来

source: Sequence
ar: تسلسل
ur: باطنی
zh_cn: 序列

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
ar: انقر على مساعدة في الزاوية العلوية اليسرى للحصول على مزيد من المعلومات حول صفحة {studio_name} التي تشاهدها. يمكنك أيضًا استخدام الروابط في أسفل الصفحة للوصول إلى الوثائق التي يتم تحديثها باستمرار وموارد {studio_name} الأخرى.
ur: {سٹوڈیو_ نام} کے صفحے کے بارے میں مزید معلومات حاصل کرنے کے لئے جو آپ دیکھ رہے ہیں، اوپر دائیں کونے میں مدد پر کلک کریں. آپ صفحے کے نچلے حصے میں ہمارے مستقل طور پر تازہ ترین دستاویزات اور دیگر {سٹوڈیو_ نام} وسائل تک رسائی حاصل کرنے کے لئے لنکس بھی استعمال کرسکتے ہیں.
zh_cn: 点击右上角的帮助以获取有关您正在查看的{studio_name}页面的更多信息。您还可以使用页面底部的链接访问我们不断更新的文档和其他{studio_name}资源。

source: Credit Card - Individual
ar: بطاقة الائتمان - فرد
ur: کریڈٹ کارڈ - انفرادی
zh_cn: 信用卡 - 个人

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
ar: دورتك الحالية ليس لديها صورة. يرجى تحميل واحد (بتنسيق JPEG أو PNG ، والحد الأدنى للأبعاد المقترحة 1440 بكسل × 400 بكسل)
ur: آپ کا کورس فی الحال ایک تصویر نہیں ہے. براہ کرم ایک اپ لوڈ کریں (JPEG یا PNG کی شکل، اور کم از کم تجویز کردہ طول و عرض 1440px وسیع 400px کی طرف سے وسیع ہیں)
zh_cn: 你的课程目前没有图像。请上传一张（JPEG或PNG格式，最小建议尺寸为1440像素宽×400像素高）

source: New students added:
ar: الطلاب الجدد أضافوا:
ur: نئے طلبا نے مزید کہا:
zh_cn: 新学员补充道：

source: Internal reference information for the sale
ar: معلومات مرجعية داخلية للبيع
ur: فروخت کے لئے اندرونی حوالہ کی معلومات
zh_cn: 内部参考销售信息

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
ar: لإنشاء دورات تدريبية في {studio_name} ، يجب {link_start} الاتصال بـ {platform_name} من الموظفين لمساعدتك في إنشاء دورة تدريبية {link_end}.
ur: {سٹوڈیو_ نام} میں کورس تخلیق کرنے کے لئے، آپ {link_end} کورس بنانے میں مدد کرنے کیلئے {link_start} رابطہ {platform_name} کے عملے کو ضرور کرنا ہوگا.
zh_cn: 要在{studio_name}中创建课程，您必须{link_start}联系{platform_name}工作人员以帮助您创建课程{link_end}。

source: The card type sent is invalid or does not correlate with the credit card number. Possible fix: retry with the same card or another form of payment
ar: نوع البطاقة المرسلة غير صالح أو لا يرتبط برقم بطاقة الائتمان. إصلاح محتمل: أعد المحاولة باستخدام نفس البطاقة أو طريقة أخرى للدفع
ur: بھیجنے والے کارڈ کی قسم غلط ہے یا کریڈٹ کارڈ نمبر کے ساتھ نہیں ملتی ہے. ممکنہ طے: ایک ہی کارڈ یا ادائیگی کے دوسرے فارم کے ساتھ دوبارہ کوشش کریں
zh_cn: 发送的卡片类型无效或与信用卡号码无关。可能的解决方法：使用相同的卡或其他付款方式重试

source: Dear {full_name}
ar: عزيزي {full_name}
ur: عزیز {full_name}
zh_cn: 亲爱的{full_name}

source: enrolled
ar: المقيدين
ur: اندراج
zh_cn: 就读

source: Allow Opting Out of Proctored Exams
ar: السماح بالاختيار من الامتحانات بروكتيد
ur: پراجیکٹ امتحان سے باہر نکلنے کی اجازت دیں
zh_cn: 允许停用监考考试

source: This course is in your <a href="{cart_link}">cart</a>.
ar: هذه الدورة هي في <a href="{cart_link}">سلة التسوق</a> الخاصة بك.
ur: یہ کورس آپ کی <a href="{cart_link}">ٹوکری میں ہے</a> .
zh_cn: 这门课程在你的<a href="{cart_link}">购物车中</a> 。

source: Enter true or false. If true, edX users can view the course wiki even if they're not enrolled in the course.
ar: أدخل صح أو خطأ. إذا كان صحيحًا ، يمكن لمستخدمي edX عرض الدورة التدريبية الخاصة بـ wiki حتى إذا لم يكونوا مسجلين في الدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال رپورٹ نہیں کیا جا سکا. ایک یا زیادہ ایرر آ گئے ہیں. براہ مہربانی ایرر پیغام سے نشان زدہ فیلڈز کو ٹھیک کریں.
zh_cn: 输入true或false。如果真的，edX用户可以查看课程wiki，即使他们没有参加课程。

source: e.g. yourname (shown on forums)
ar: على سبيل المثال اسمك (يظهر في المنتديات)
ur: مثلا آپ کا نام (فورم پر دکھایا گیا ہے)
zh_cn: 例如yourname（显示在论坛上）

source: Oops, failed to create user {user}, {error}
ar: عفوًا ، أخفق إنشاء المستخدم {user} ، {error}
ur: افسوس، صارف {صارف}، {غلطی} بنانے میں ناکامی
zh_cn: 糟糕，未能创建用户{user}，{error}

source: Apply
ar: تطبيق
ur: درخواست دیں
zh_cn: 应用

source: Issue Open Badges
ar: اصدار فتح الشارات
ur: کھولیں بیج کا مسئلہ
zh_cn: 发行开放徽章

source: You are eligible for credit from {providers_string}
ar: أنت مؤهل للحصول على رصيد من {providers_string}
ur: آپ {providers_string} سے کریڈٹ کے اہل ہیں
zh_cn: 您有资格从{providers_string}获得信用

source: Override Score
ar: تجاوز النتيجة
ur: اضافی اسکور
zh_cn: 覆盖分数

source: Creative Commons licensed content, with terms as follow:
ar: ترخيص Creative Commons للمحتوى المرخص ، مع استخدام العبارات التالية:
ur: تخلیقی العام لائسنس یافتہ مواد، پیروی کے طور پر شرائط کے ساتھ:
zh_cn: 知识共享许可内容，其条款如下：

source: Time
ar: زمن
ur: وقت
zh_cn: 时间

source: Enable LaTeX templates?
ar: تمكين قوالب LaTeX؟
ur: لاٹیکس ٹیمپلیٹس کو فعال کریں؟
zh_cn: 启用LaTeX模板？

source: Seconds a student must wait between submissions for a problem with multiple attempts.
ar: الثواني يجب على الطالب الانتظار بين عمليات الإرسال لمشكلة مع محاولات متعددة.
ur: سیکنڈ ایک طالب علم کو متعدد کوششوں کے ساتھ ایک مسئلہ کے لئے پیشکشوں کے درمیان انتظار کرنا ہوگا.
zh_cn: 秒钟学生必须等待多次提交的问题。

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
ar: حدد نوع مكون ضمن {strong_start} إضافة مكون جديد {strong_end}. ثم حدد القالب.
ur: {strong_start} کے تحت ایک اجزاء کی قسم کا انتخاب کریں نیا اجزاء {strong_end} شامل کریں. پھر ایک ٹیمپلیٹ منتخب کریں.
zh_cn: 在{strong_start}添加新组件{strong_end}下选择一个组件类型。然后选择一个模板。

source: State/Province
ar: الدولة / مقاطعة
ur: ریاست / صوبہ
zh_cn: 州/省

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
ar: توسيع وإعداد بنية المجلد / الملف (يمكنك الآن ترك هذه الصفحة بأمان ، ولكن تجنب إجراء تغييرات جذرية على المحتوى حتى يكتمل هذا الاستيراد)
ur: فولڈر / فائل ڈھانچہ کی توسیع اور تیاری (آپ اب اس صفحہ کو محفوظ طریقے سے چھوڑ سکتے ہیں، لیکن اس درآمد تک مکمل ہونے تک مواد میں سخت تبدیلیوں سے بچنے سے بچنے کے لۓ)
zh_cn: 扩展和准备文件夹/文件结构（您现在可以安全地离开此页面，但是在导入完成之前避免对内容进行剧烈更改）

source: This image file must be smaller than {image_max_size}.
ar: يجب أن يكون ملف الصورة أصغر من {image_max_size}.
ur: یہ تصویر فائل {image_max_size} سے چھوٹا ہونا ضروری ہے.
zh_cn: 该图片文件必须小于{image_max_size}。

source: Override Learner's Score
ar: تجاوز درجة المتعلم
ur: سیکرٹری کا اسکور ختم
zh_cn: 覆盖学习者的分数

source: Edit Coupon Code
ar: عدل كود القسيمة
ur: کوپن کوڈ میں ترمیم کریں
zh_cn: 编辑优惠券代码

source: Contact {platform_name}
ar: الاتصال بـ {platform_name}
ur: رابطہ {platform_name}
zh_cn: 联系{platform_name}

source: I'm taking {course_name} online with {facebook_brand}. Check it out!
ar: أتلقى {course_name} عبر الإنترنت مع {facebook_brand}. تحقق من ذلك!
ur: میں {course_name} آن لائن {facebook_brand} کے ساتھ آن لائن ہوں. اس کی جانچ پڑتال کر!
zh_cn: 我正在使用{facebook_brand}在线{course_name}。一探究竟！

source: Progress
ar: تقدم
ur: پیش رفت
zh_cn: 进展

source: Percentage of seats purchased with invoices
ar: النسبة المئوية للمقاعد التي تم شراؤها باستخدام الفواتير
ur: انوائس کے ساتھ خریدا فی صد کی فیصد
zh_cn: 通过发票购买的座位的百分比

source: Upload a CSV for bulk enrollment
ar: تحميل ملف CSV للتسجيل المجمع
ur: بلک اندراج کیلئے ایک CSV اپ لوڈ کریں
zh_cn: 上传CSV进行批量注册

source: Add Unsupported Problems and Tools
ar: إضافة مشاكل غير مدعومة وأدوات
ur: غیر معاون مسائل اور اوزار شامل کریں
zh_cn: 添加不支持的问题和工具

source: Problem failed to be {action} for student '{student}'
ar: أخفقت المشكلة في {action} للطالب &#39;{student}&#39;
ur: طالب علم &#39;{طالب علم}&#39; کیلئے مسئلہ {کارروائی} ہونے میں ناکام ہوگیا
zh_cn: 问题未能成为{action}给学生&#39;{student}&#39;

source: Invalid course key.
ar: مفتاح دورة غير صالح.
ur: غلط کورس کی چابی.
zh_cn: 无效的课程密钥。

source: Order ID
ar: رقم التعريف الخاص بالطلب
ur: آرڈر کی شناخت
zh_cn: 订单ID

source: Insufficient permissions
ar: أذونات غير كافية
ur: ناکافی اجازت
zh_cn: 权限不足

source: Advanced Module List
ar: قائمة الوحدة النمطية المتقدمة
ur: اعلی درجے کی ماڈیول کی فہرست
zh_cn: 高级模块列表

source: To see the status for all email tasks submitted for this course, click this button:
ar: للاطلاع على حالة جميع مهام البريد الإلكتروني المقدمة لهذه الدورة التدريبية ، انقر فوق هذا الزر:
ur: اس کورس کے لئے جمع کردہ تمام ای میل کے کاموں کی حیثیت سے، اس بٹن پر کلک کریں:
zh_cn: 要查看为此课程提交的所有电子邮件任务的状态，请单击此按钮：

source: There was a problem with the staff answer to this problem.
ar: كانت هناك مشكلة في إجابة الموظفين لهذه المشكلة.
ur: اسٹاف کے اس مسئلے کے جواب میں ایک مسئلہ تھا.
zh_cn: 员工对这个问题的回答存在问题。

source: Delete failed for user preference '{preference_key}'.
ar: أخفق الحذف في تفضيل المستخدم &quot;{preference_key}&quot;.
ur: حذف کریں صارف کی ترجیحات &#39;{ترجیح_key}&#39; کیلئے.
zh_cn: 删除用户首选项&#39;{preference_key}&#39;失败。

source: State/Province/Region
ar: الدولة / المقاطعة / المنطقة
ur: ریاست / صوبہ / علاقہ
zh_cn: 州/省/地区

source: I agree to the {a_start} Terms of Service {a_end}
ar: أوافق على بنود خدمة {a_start} {a_end}
ur: میں {a_start} سروس کی شرائط {a_end} سے متفق ہوں
zh_cn: 我同意{a_start}服务条款{a_end}

source: For affixes, type the number and affix without a space (example: 5c).
ar: بالنسبة إلى المقاطع ، اكتب الرقم واللاصقة بدون مسافة (مثال: 5 ج).
ur: اشخاص کے لئے، نمبر کے بغیر نمبر اور ٹائپ کریں بغیر کسی جگہ (مثال: 5c).
zh_cn: 对于词缀，输入数字并粘贴不带空格（例如：5c）。

source: Please enter the date in this format i-e month/day/year
ar: الرجاء إدخال التاريخ بهذا التنسيق ، مثل الشهر / اليوم / السنة
ur: براہ مہربانی اس شکل میں مہینہ / دن / سال درج کریں
zh_cn: 请以这种格式输入日期，即月/日/年

source: Name of the UTM cookie
ar: اسم ملف تعريف الارتباط UTM
ur: UTM کوکی کا نام
zh_cn: UTM cookie的名称

source: No task_output information found for instructor_task {0}
ar: لم يتم العثور على معلومات task_output لـ instructor_task {0}
ur: انسٹرکٹر_ٹاسک {0} کے لئے کوئی کام_ آؤٹ پٹ کی معلومات نہیں ملی
zh_cn: 没有为instructor_task {0}找到task_output信息

source: You have been invited to register for {course_name}
ar: لقد تمت دعوتك للتسجيل في {course_name}
ur: آپ {course_name} کے لئے رجسٹر کرنے کے لئے مدعو کیا گیا ہے
zh_cn: 您已被邀请注册{course_name}

source: Schedules
ar: جداول
ur: شیڈولز
zh_cn: 时间表

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
ar: اختياري: هذه هي وحدة الاحتفاظ بالمخزون (SKU) في هذا الوضع في خدمة التجارة الإلكترونية الخارجية. اترك هذا الحقل فارغًا إذا لم يتم ترحيل الدورة التدريبية بعد إلى خدمة التجارة الإلكترونية.
ur: اختیاری: خارجہ ای کامرس سروس میں اس موڈ کے اس SKU (اسٹاک رکھنے والی یونٹ) ہے. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. اس ویڈیو پر غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے.
zh_cn: 可选：这是外部电子商务服务中此模式的SKU（库存单位）。如果课程尚未迁移到电子商务服务，请将其留空。

source: Nov
ar: نوفمبر
ur: نومبر
zh_cn: 十一月

source: Enter your profession.
ar: أدخل مهنتك.
ur: اپنا پیشہ درج کریں
zh_cn: 输入你的职业。

source: {discount}
ar: {خصم}
ur: {رعایت}
zh_cn: {折扣}

source: Discussion Blackout Dates
ar: مناقشة انقطاع التيار الكهربائي
ur: بحث بلیک آؤٹ تاریخ
zh_cn: 讨论停电日期

source: This course is ending in {time_remaining_string} at {course_end_time}.
ar: تنتهي هذه الدورة التدريبية في {time_remaining_string} في {course_end_time}.
ur: یہ کورس {time_remaining_string} میں {course_end_time} پر ختم ہو رہا ہے.
zh_cn: 本课程以{course_end_time}的{time_remaining_string}结尾。

source: For constants, indicate multiplication explicitly (example: 5*c).
ar: للثوابت ، وضّح الضرب صراحة (مثال: 5 * c).
ur: رکاوٹوں کے لئے، ضرب واضح طور پر (مثال کے طور پر: 5 * ج) کی طرف اشارہ کرتے ہیں.
zh_cn: 对于常量，显式指示乘法（例如：5 * c）。

source: Keep learning on %(platform_name)s
ar: استمر في التعلم على٪ (platform_name) s
ur: ٪ (platform_name) کے بارے میں سیکھنا جاری رکھیں
zh_cn: 继续学习％（platform_name）
