Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: We hope you are enjoying learning with us so far on %(platform_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: نأمل أن تستمتع بالتعلم معنا حتى الآن على٪ (platform_name) s! تتيح لك الشهادة التي تم التحقق منها إبراز معرفتك ومهاراتك الجديدة. شهادة٪ (platform_name) s رسمية ويمكن مشاركتها بسهولة. الترقية بواسطة٪ (user_schedule_upgrade_deadline_time) s.
ur: ہمیں امید ہے کہ آپ ابھی تک ہمارے ساتھ سیکھنے سے لطف اندوز کر رہے ہیں٪ (platform_name) s! ایک تصدیق شدہ سرٹیفکیٹ آپ کو اپنے نئے علم اور مہارت کو اجاگر کرنے کی اجازت دیتا ہے. ایک٪ (پلیٹ فارم_ نام) سرٹیفکیٹ سرکاری اور آسانی سے مستحکم ہے. ٪ (user_schedule_upgrade_deadline_time) کی طرف سے اپ گریڈ کریں.
zh_cn: 我们希望您在享受％（platform_name）的帮助的同时享受我们的学习！经过验证的证书可让您突出显示您的新知识和技能。 ％（platform_name）的证书是官方的，并且可以轻松共享。通过％（user_schedule_upgrade_deadline_time）进行升级。

source: Mon
ar: لي
ur: میرے
zh_cn: 我的

source: Enter the format for due dates. The default is Mon DD, YYYY. Enter "%m-%d-%Y" for MM-DD-YYYY, "%d-%m-%Y" for DD-MM-YYYY, "%Y-%m-%d" for YYYY-MM-DD, or "%Y-%d-%m" for YYYY-DD-MM.
ar: أدخل التنسيق لتواريخ الاستحقاق. الافتراضي هو Mon DD ، YYYY. أدخل &quot;٪ m-٪ d-٪ Y&quot; لـ MM-DD-YYYY ، &quot;٪ d-٪ m-٪ Y&quot; لـ DD-MM-YYYY ، &quot;٪ Y-٪ m-٪ d&quot; لـ YYYY-MM- DD ، أو &quot;٪ Y-٪ d-٪ m&quot; لـ YYYY-DD-MM.
ur: متوقع تاریخوں کے لئے فارم درج کریں. ڈیفالٹ ڈی ڈی ڈی، YYYY ہے. ایم ڈی ڈی ڈی YYYY کے لئے &quot;٪ m-٪ d-٪ Y&quot; درج کریں، &quot;D- MM-YYYY&quot; کے لئے &quot;٪ d-٪ m-٪ Y&quot;، YYYY-MM- کے لئے &quot;٪ Y-٪ m-٪ d&quot; YYYY-DD-MM کے لئے ڈی ڈی، یا &quot;٪ Y-٪ d-٪ m&quot;.
zh_cn: 输入截止日期的格式。默认值是Mon DD，YYYY。为MM-DD-YYYY输入“％m-％d-％Y”，为DD-MM-YYYY输入“％d-％m-％Y”，为YYYY-MM- DD或YYYY-DD-MM的“％Y-％d-％m”。

source: Default Tab
ar: التبويب الافتراضي
ur: پہلے سے طے شدہ ٹیب
zh_cn: 默认标签页

source: October
ar: شهر اكتوبر
ur: اکتوبر
zh_cn: 十月

source: Duration
ar: المدة الزمنية
ur: دورانیہ
zh_cn: 持续时间

source: Default Group
ar: المجموعة الافتراضية
ur: ڈیفالٹ گروپ
zh_cn: 默认组

source: You've successfully signed in with {selected_provider}.
ar: لقد سجلت الدخول بنجاح مع {selected_provider}.
ur: آپ نے {selected_provider} کے ساتھ کامیابی سے سائن ان کیا ہے.
zh_cn: 您已成功使用{selected_provider}登录。

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ar: أدخل عدد النقاط الممكنة لهذا المكون. القيمة الافتراضية هي 1.0. يتم استخدام هذا الإعداد فقط عند ضبط Scored على True.
ur: اس اجزاء کے لئے ممکنہ پوائنٹس کی تعداد درج کریں. پہلے سے طے شدہ قیمت 1.0 ہے. اس ترتیب کو صرف اس وقت استعمال کیا جاتا ہے جب گولڈ کو سچ میں مقرر کیا جاتا ہے.
zh_cn: 输入该组件可能的点数。默认值是1.0。此设置仅在Scored设置为True时使用。

source: Required
ar: مطلوب
ur: ضرورت ہے
zh_cn: 需要

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
ar: يتم إلغاء قفل هذا القسم الفرعي للمتعلمين عند استيفائهم لمتطلبات المتطلبات المسبقة.
ur: جب یہ ضروری شرطوں کو پورا کرتے ہیں تو یہ سبسیکشن سیکھنے والوں کے لئے کھلا ہے.
zh_cn: 这一小节在学习者满足先决条件要求时解锁。

source: Summary
ar: ملخص
ur: خلاصہ
zh_cn: 概要

source: Feedback Form
ar: نموذج الملاحظات
ur: فیڈریشن فارم
zh_cn: 反馈表

source: Complete our course feedback survey
ar: أكمل استطلاع الرأي الخاص بالدورة التدريبية
ur: ہمارے کورس کی رائے سروے کو مکمل کریں
zh_cn: 完成我们的课程反馈调查

source: This value must be all lowercase.
ar: يجب أن تكون هذه القيمة كلها صغيرة.
ur: یہ قیمت تمام کم کراس ہونا لازمی ہے.
zh_cn: 该值必须全部小写。

source: The user account associated with this e-mail address cannot reset the password.
ar: لا يمكن لحساب المستخدم المرتبط بعنوان البريد الإلكتروني هذا إعادة تعيين كلمة المرور.
ur: اس ای میل ایڈریس کے ساتھ منسلک صارف کا اکاؤنٹ پاس ورڈ دوبارہ ترتیب نہیں دے سکتا.
zh_cn: 与此电子邮件地址关联的用户帐户无法重置密码。

source: Quantity - Description - Price
ar: الكمية - الوصف - السعر
ur: مقدار - تفصیل - قیمت
zh_cn: 数量 - 描述 - 价格

source: Preview Theme
ar: معاينة الموضوع
ur: تھیم پیش نظارہ
zh_cn: 预览主题

source: An error occurred while trying to save your tabs
ar: حدث خطأ أثناء محاولة حفظ علامات التبويب
ur: آپ کے ٹیب کو بچانے کی کوشش کرتے ہوئے ایک خرابی واقع ہوئی
zh_cn: 尝试保存标签时发生错误

source: This module is not enabled.
ar: هذه الوحدة غير ممكنة.
ur: یہ ماڈیول فعال نہیں ہے.
zh_cn: 该模块未启用。

source: Amount Refunded
ar: المبلغ المردود
ur: رقم رقم کی واپسی
zh_cn: 退款金额

source: filter topics
ar: تصفية الموضوعات
ur: فلٹر موضوعات
zh_cn: 过滤主题

source: Hide Progress Tab
ar: إخفاء علامة التبويب التقدم
ur: پیش رفت ٹیب چھپائیں
zh_cn: 隐藏进度选项卡

source: Put your Terms of Service here!
ar: ضع شروط الخدمة هنا!
ur: اپنی سروس کی شرائط یہاں رکھیں!
zh_cn: 把你的服务条款放在这里！

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ar: لا يحتوي عنوان البريد الإلكتروني هذا على حساب مستخدم مقترن. هل أنت متأكد من أنك قمت بالتسجيل؟
ur: وہ ای میل ایڈریس سے منسلک صارف اکاؤنٹ نہیں ہے. کیا آپ واقعی رجسٹرڈ ہیں؟
zh_cn: 该电子邮件地址没有关联的用户帐户。你确定你已经注册？

source: Hide Question
ar: إخفاء السؤال
ur: سوال چھپائیں
zh_cn: 隐藏问题

source: There has been a 500 error on the {platform_name} servers
ar: حدث خطأ 500 على خوادم {platform_name}
ur: {platform_name} سرورز پر 500 غلطی ہوئی ہے
zh_cn: {platform_name}服务器出现500错误

source: Manage User
ar: إدارة المستخدم
ur: صارف کا نظم کریں
zh_cn: 管理用户

source: We greatly appreciate this generous contribution and your support of the {platform_name} mission. This receipt was prepared to support charitable contributions for tax purposes. We confirm that neither goods nor services were provided in exchange for this gift.
ar: نحن نقدر هذه المساهمة الكريمة ودعمك لبعثة {platform_name}. تم إعداد هذا الإيصال لدعم المساهمات الخيرية للأغراض الضريبية. نؤكد عدم تقديم أي سلع أو خدمات مقابل هذه الهدية.
ur: ہم {platform_name} کے مشن کے اس ادارانہ شراکت اور آپ کی حمایت کی بہت تعریف کرتے ہیں. ٹیکس کے مقاصد کے لئے خیراتی اداروں کی حمایت کرنے کے لئے یہ رسید تیار کی گئی تھی. ہم اس بات کی تصدیق کرتے ہیں کہ اس تحفہ کے بدلے میں نہ ہی مال اور خدمات فراہم کی جاتی تھیں.
zh_cn: 我们非常感谢这一慷慨的贡献以及您对{platform_name}任务的支持。此收据准备支持用于税收目的的慈善捐款。我们确认商品和服务均未提供以换取此礼物。

source: You must be enrolled in the course to see course content. {enroll_link_start}Enroll now{enroll_link_end}.
ar: يجب أن تكون مسجلاً في الدورة التدريبية لمشاهدة محتوى الدورة التدريبية. {enroll_link_start} التسجيل الآن {enroll_link_end}.
ur: کورس کے مواد کو دیکھنے کے لئے آپ کو کورس میں داخل کیا جانا چاہئے. {enroll_link_start} اب {enroll_link_end} اندراج کریں.
zh_cn: 你必须参加课程才能看到课程内容。 {enroll_link_start}立即注册{enroll_link_end}。

source: No action is needed on your part.
ar: لا يلزم اتخاذ أي إجراء من جانبك.
ur: آپ کے حصے پر کوئی کارروائی کی ضرورت نہیں ہے.
zh_cn: 您不需要采取任何行动。

source: Force Off
ar: إجبار
ur: بند کرو
zh_cn: 强制关闭

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تم إرسال ملفاتك. بمجرد أن يتم تقييم التقديم الخاص بك ، سيتم استبدال هذه الرسالة بملاحظات الممهد.
ur: آپ کی فائلیں جمع کردی گئی ہیں. جیسے ہی آپ کی جمع کردہ درجہ بندی کی گئی ہے، یہ پیغام گرڈر کی رائے کے ساتھ تبدیل کردیا جائے گا.
zh_cn: 您的文件已提交。一旦您的提交评分，此消息将被评分者的反馈所取代。

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
ar: تسليط الضوء على المعرفة والمهارات الجديدة الخاصة بك مع شهادة التحقق. استخدم هذه الشهادة القيمة لتحسين فرص العمل الخاصة بك وتقدم حياتك المهنية ، أو إبراز شهادتك في تطبيقات المدرسة.
ur: تصدیق شدہ سرٹیفکیٹ کے ساتھ اپنے نئے علم اور مہارت کو نمایاں کریں. اپنے کام کی امکانات کو بہتر بنانے اور اپنے کیریئر کو بڑھانے کے لئے، یا اسکول کے ایپلی کیشن میں اپنے سرٹیفکیٹ کو اجاگر کرنے کے لئے اس قیمتی اعتبار سے استفادہ کریں.
zh_cn: 使用经过验证的证书突出显示您的新知识和技能。使用这个有价值的证书来改善你的工作前景，推动你的职业生涯，或在学校申请中突出你的证书。

source: Thanks for activating your account.
ar: شكرا لتفعيل حسابك.
ur: اپنے اکاؤنٹ کو فعال کرنے کے لئے شکریہ.
zh_cn: 感谢您激活您的帐户。

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision_text}, and the reason was {reason_text}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
ar: آسف! لم يقبل معالج الدفع لدينا دفعتك. القرار الذي أعادوه كان {decision_text} ، والسبب كان {reason_text}. لم تكن مشحونة. يرجى تجربة طريقة دفع مختلفة. اتصل بنا لطرح الأسئلة المتعلقة بالدفع على {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے آپ کی ادائیگی قبول نہیں کی. وہ واپس آنے کا فیصلہ {فیصلہ_ ٹیکسٹ} تھا، اور وجہ {reason_text} تھا. آپ کو چارج نہیں کیا گیا تھا. براہ کرم ادائیگی کی ایک مختلف قسم کی کوشش کریں. {ای میل} پر ادائیگی سے متعلق سوالات کے ساتھ ہم سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理器不接受您的付款。他们返回的决定是{decision_text}，原因是{reason_text}。你没有被指控。请尝试不同的付款方式。通过{email}与我们联系并提供与付款相关的问题。

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
ar: أثناء تشغيل الفيديو ، استخدم الترجمات وشريط التمرير للتنقل. يعد النقر على الترجمات المصاحبة طريقة سريعة للتخطي للأمام والخلف بكميات صغيرة.
ur: ویڈیو پلے بیک کے دوران، عنوانات اور سکر بار بار نیویگیشن کا استعمال کریں. ذیلی ذیلی ذیلی مقدار کے ذریعہ فارورڈز اور بیکورڈز کو چھوڑنے کا ایک تیز طریقہ ہے.
zh_cn: 在视频播放过程中，使用字幕和滚动条进行导航。点击字幕是一种快速向前和向后跳过少量的方式。

source: Invoice Number
ar: رقم الفاتورة
ur: انوائس تعداد
zh_cn: 发票号码

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
ar: جمع أو تخزين الأسماء أو كلمات المرور أو بيانات اعتماد أخرى لمستخدمي {platform_name} ؛
ur: نام، پاس ورڈ، یا {platform_name} صارفین کے دیگر اسناد جمع یا ذخیرہ کرنے؛
zh_cn: 收集或存储{platform_name}用户的名称，密码或其他凭证;

source: Frequently Asked Questions
ar: أسئلة مكررة
ur: اکثر پوچھے گئے سوالات
zh_cn: 经常问的问题

source: Only a partial amount was approved.
ar: تمت الموافقة على مبلغ جزئي فقط.
ur: صرف ایک جزوی رقم منظور کی گئی تھی.
zh_cn: 只有部分数额获得批准。

source: You can specify whether your course offers students a grace period for late assignments.
ar: يمكنك تحديد ما إذا كانت الدورة التدريبية الخاصة بك توفر للطلاب فترة سماح للتخصيصات المتأخرة.
ur: آپ اس بات کی وضاحت کر سکتے ہیں کہ آیا آپ کا کورس طالب علموں کو دیر سے تفویض کے لئے فضل کی مدت پیش کرتا ہے.
zh_cn: 你可以指定你的课程是否为学生提供延迟分配的宽限期。

source: No formula specified.
ar: لا صيغة محددة.
ur: کوئی فارمولہ متعین نہیں
zh_cn: 没有指定公式。

source: e notation
ar: التدوين
ur: ای اطلاع
zh_cn: e符号

source: Invalid account number. Possible fix: retry with another form of payment
ar: رقم حساب غير صحيح. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: غلط اکاؤنٹ نمبر. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 帐号无效。可能的解决方法：使用其他付款方式重试

source: Page {current_page} of {total_pages}
ar: الصفحة {current_page} من {total_pages}
ur: {total_pages} کا صفحہ {current_page}
zh_cn: {total_pages}的页面{current_page}

source: Score
ar: أحرز هدفاً
ur: اسکور
zh_cn: 得分了

source: ...and more!
ar: ...و اكثر!
ur: ...اور مزید!
zh_cn: ...和更多！

source: How technically savvy do I need to be to create courses in {studio_name}?
ar: كيف أحتاج من الناحية التقنية أن أكون لإنشاء دورات في {studio_name}؟
ur: {studio_name} میں کورس بنانے کے لئے مجھے کس طرح تکنیکی طور پر حساس ضرورت ہے؟
zh_cn: 我需要在{studio_name}中创建课程的技术要求如何？

source: Video Upload Credentials
ar: تحميل بيانات الفيديو
ur: ویڈیو اپ لوڈ کی سند
zh_cn: 视频上传凭证

source: Course Editor
ar: محرر الدورة
ur: کورس ایڈیٹر
zh_cn: 课程编辑

source: Thank you for purchasing enrollments in {course_name}.
ar: شكرًا لك على شراء عمليات التسجيل في {course_name}.
ur: {course_name} میں اندراج کی خریداری کے لئے شکریہ.
zh_cn: 感谢您购买{course_name}中的注册。

source: Enrollment Start Date
ar: تاريخ بدء التسجيل
ur: اندراج کی تاریخ شروع
zh_cn: 入学开始日期

source: Enter email addresses and/or usernames separated by new lines or commas.
ar: أدخل عناوين البريد الإلكتروني و / أو أسماء المستخدمين مفصولة بخطوط أو فواصل جديدة.
ur: نئی لائنوں یا کمانڈوں کے ذریعہ علیحدہ ای میل پتے اور / یا صارف نام درج کریں.
zh_cn: 输入以新行或逗号分隔的电子邮件地址和/或用户名。

source: A valid password is required
ar: مطلوب كلمة مرور صالحة
ur: ایک درست پاس ورڈ کی ضرورت ہے
zh_cn: 需要有效的密码

source: User {username} does not exist
ar: المستخدم {اسم المستخدم} غير موجود
ur: صارف {صارف نام} موجود نہیں ہے
zh_cn: 用户{用户名}不存在

source: Permission settings for the article were updated.
ar: تم تحديث إعدادات إذن للمادة.
ur: آرٹیکل کے لئے اجازت کی ترتیبات کو اپ ڈیٹ کیا گیا تھا.
zh_cn: 文章的权限设置已更新。

source: Work at {platform_name}
ar: العمل على {platform_name}
ur: {platform_name} پر کام
zh_cn: 在{platform_name}工作

source: Coupon Code
ar: كود القسيمة
ur: کوپن کوڈ
zh_cn: 优惠券代码

source: The Invoice Number field cannot be empty.
ar: لا يمكن أن يكون حقل رقم الفاتورة فارغًا.
ur: انوائس نمبر فیلڈ خالی نہیں ہوسکتی ہے.
zh_cn: 发票号码字段不能为空。

source: e.g. 2014_T1
ar: على سبيل المثال 2014_T1
ur: مثال کے طور پر 2014_T1
zh_cn: 如2014_T1

source: Search for a course
ar: ابحث عن دورة
ur: کورس کے لئے تلاش کریں
zh_cn: 搜索课程

source: example: username@domain.com
ar: مثال: username@domain.com
ur: مثال: username@domain.com
zh_cn: 例如：username@domain.com

source: Error connecting to elasticsearch
ar: خطأ في الاتصال إلى elasticsearch
ur: elasticsearch سے منسلک کرنے میں خرابی
zh_cn: 连接到elasticsearch时出错

source: Source:
ar: مصدر:
ur: ذریعہ:
zh_cn: 资源：

source: Download Your {cert_name_short} (PDF)
ar: نزِّل {cert_name_short} (PDF)
ur: آپ {cert_name_short} (پی ڈی ایف) ڈاؤن لوڈ کریں
zh_cn: 下载您的{cert_name_short}（PDF）

source: Displayed as title on the course details page. Limit to 50 characters.
ar: يتم عرضها كعنوان في صفحة تفاصيل الدورة التدريبية. الحد إلى 50 حرفًا.
ur: کورس کے تفصیلات کے صفحے پر عنوان کے طور پر ڈسپلے. 50 حروف تک محدود
zh_cn: 在课程详细信息页面显示为标题。限制为50个字符。

source: Verification Status
ar: حالة التحقق
ur: توثیق کی حیثیت
zh_cn: 验证状态

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكنك استخدام قوالب LaTeX لمكونات HTML ومكونات المشكلة المتقدمة.
ur: صحیح یا غلط درج کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال رپورٹ نہیں کیا جا سکا. ایک یا زیادہ ایرر آ گئے ہیں. براہ مہربانی ایرر پیغام سے نشان زدہ فیلڈز کو ٹھیک کریں.
zh_cn: 输入true或false。如果为true，则可以将LaTeX模板用于HTML组件和高级问题组件。

source: License
ar: رخصة
ur: لائسنس
zh_cn: 执照

source: Always
ar: دائما
ur: ہمیشہ
zh_cn: 总是

source: Your course:
ar: دورتك:
ur: آپ کا کورس:
zh_cn: 你的课程：

source: Old email is the same as the new email.
ar: البريد الإلكتروني القديم هو نفسه البريد الإلكتروني الجديد.
ur: پرانے ای میل ایک نیا ای میل ہے.
zh_cn: 旧电子邮件与新电子邮件相同。

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
ar: بمجرد أن تتمكن من تسجيل المقالات بطريقة مشابهة للمعلم ، ستكون مستعدًا لتقييم زملائك.
ur: ایک بار جب آپ کسی بھی سکریٹر کو مضامین کو سکور کر سکتے ہیں، آپ اپنے ساتھیوں کو گریڈ کرنے کے لئے تیار ہوں گے.
zh_cn: 一旦您可以像指导员一样对论文进行评分，您就可以为同学评分。

source: Integrating your imported content into this library. This process might take longer with larger libraries.
ar: تكامل المحتوى المستورد الخاص بك في هذه المكتبة. قد تستغرق هذه العملية وقتًا أطول مع مكتبات أكبر.
ur: اس لائبریری میں اپنی درآمد کردہ مواد کو ضم. یہ عمل بڑی لائبریریوں کے ساتھ زیادہ وقت لگ سکتا ہے.
zh_cn: 将导入的内容集成到此库中​​。对于大型图书馆来说，这个过程可能需要更长时间

source: If you did not request this change, you can ignore this email.
ar: إذا لم تطلب هذا التغيير ، فيمكنك تجاهل هذا البريد الإلكتروني.
ur: اگر آپ نے اس تبدیلی کی درخواست نہیں کی، تو آپ اس ای میل کو نظر انداز کر سکتے ہیں.
zh_cn: 如果您未请求更改，则可以忽略此电子邮件。

source: Reindex
ar: الفهرسة
ur: دوبارہ ترمیم کریں
zh_cn: 重新编制

source: Sort:
ar: فرز:
ur: ترتیب دیں:
zh_cn: 分类：

source: {description}
ar: {وصف}
ur: {وضاحت}
zh_cn: {描述}

source: Course Settings
ar: إعدادات الدورة التدريبية
ur: کورس کی ترتیبات
zh_cn: 课程设置

source: Configure list of sources
ar: تكوين قائمة المصادر
ur: ذرائع کی فہرست ترتیب دیں
zh_cn: 配置来源列表

source: Poll question
ar: سؤال التصويت
ur: سروے کا سوال
zh_cn: 民意调查问题

source: Thanks for submitting your photos!
ar: شكرا لتقديم صورك!
ur: آپ کی تصاویر جمع کرنے کے لئے شکریہ!
zh_cn: 感谢您提交您的照片！

source: No content has been added to this course
ar: لم تتم إضافة أي محتوى إلى هذه الدورة التدريبية
ur: اس کورس میں کوئی مواد شامل نہیں کیا گیا ہے
zh_cn: 本课程没有添加任何内容

source: View
ar: رأي
ur: دیکھیں
zh_cn: 视图

source: coupon id not found
ar: رقم القسيمة غير موجود
ur: کوپن کی شناخت نہیں ملی
zh_cn: 优惠券ID未找到

source: The badge image must be square.
ar: يجب أن تكون صورة الشارة مربعة.
ur: بیج تصویر مربع ہونا ضروری ہے.
zh_cn: 徽章图片必须是正方形的。

source: Account Preferences
ar: تفضيلات الحساب
ur: اکاؤنٹ کی ترجیحات
zh_cn: 帐户首选项

source: Transcript Ready
ar: نسخة جاهزة
ur: ٹرانسکرپٹ تیار
zh_cn: 成绩单就绪

source: Instructor-Paced
ar: مدرب الخطى
ur: انسٹریکٹر - پاس
zh_cn: 导师进度

source: This section is a prerequisite. You must complete this section in order to unlock additional content.
ar: هذا القسم هو شرط أساسي. يجب عليك إكمال هذا القسم من أجل فتح محتوى إضافي.
ur: یہ سیکشن ایک لازمی شرط ہے. اضافی مواد کو غیر مقفل کرنے کیلئے آپ کو اس سیکشن کو مکمل کرنا ضروری ہے.
zh_cn: 本节是先决条件。您必须完成此部分才能解锁其他内容。

source: The course you are enrolling for is closed.
ar: الدورة التي تقوم بالتسجيل بها مغلقة.
ur: آپ کورس کے لئے اندراج کر رہے ہیں کورس بند ہے.
zh_cn: 您正在注册的课程已关闭。

source: My Notes
ar: ملاحظاتي
ur: میرا نوٹس
zh_cn: 我的笔记

source: Welcome to the Open edX{registered_trademark} platform!
ar: مرحبًا بك في منصة Open edX {registered_trademark}!
ur: کھولیں edX {رجسٹرڈ ٹریکٹرک} پلیٹ فارم میں خوش آمدید!
zh_cn: 欢迎来到Open edX {registered_trademark}平台！

source: Reset values
ar: إعادة ضبط القيم
ur: اقدار کو دوبارہ ترتیب دیں
zh_cn: 重置值

source: API Access Request
ar: طلب الوصول إلى واجهة برمجة التطبيقات
ur: API رسائی کی درخواست
zh_cn: API访问请求

source: Exporting
ar: تصدير
ur: برآمد
zh_cn: 出口

source: File upload corrupted. Please try again
ar: تحميل الملف تالف. حاول مرة اخرى
ur: فائل اپ لوڈ خراب ہوگئی. دوبارہ کوشش کریں
zh_cn: 文件上传已损坏。请再试一次

source: Download Exported Course
ar: تحميل دورة تصدير
ur: برآمد شدہ کورس ڈاؤن لوڈ کریں
zh_cn: 下载导出的课程

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
ar: لا يمكنك حذف هذه المقالة لأنه ليس لديك إذن لحذف المقالات ذات الأطفال. حاول إزالة الأطفال يدويًا واحدًا تلو الآخر.
ur: آپ اس آرٹیکل کو حذف نہیں کرسکتے کیونکہ آپ کے پاس بچوں کے ساتھ مضامین کو خارج کرنے کی اجازت نہیں ہے. بچوں کو دستی طور پر ایک طرف سے ہٹا دیں.
zh_cn: 您无法删除此文章，因为您无权删除带有子项目的文章。尝试一个一个地手动删除孩子。

source: Enroll In {course_name} | Choose Your Track
ar: التسجيل في {course_name} | اختر المسار الخاص بك
ur: {course_name} | میں اندراج کریں اپنا ٹریک منتخب کریں
zh_cn: 注册{course_name} |选择你的音轨

source: subsections
ar: الأقسام الفرعية
ur: سبسڈیشنز
zh_cn: 小节

source: Zip
ar: الرمز البريدي
ur: زپ
zh_cn: 压缩

source: Cache lookup value for articles
ar: قيمة بحث ذاكرة التخزين المؤقت للمقالات
ur: مضامین کے لئے کیش کی تلاش کی قیمت
zh_cn: 文章的高速缓存查找值

source: This article cannot be deleted because it has children or is a root article.
ar: لا يمكن حذف هذه المقالة لأنها تحتوي على أطفال أو أنها مقالة أساسية.
ur: یہ مضمون حذف نہیں کیا جاسکتا ہے کیونکہ اس کے پاس بچوں ہیں یا جڑ آرٹیکل ہے.
zh_cn: 本文无法删除，因为它有孩子或是根文章。

source: There can be only one default image.
ar: يمكن أن يكون هناك صورة افتراضية واحدة فقط.
ur: صرف ایک ڈیفالٹ تصویر ہوسکتا ہے.
zh_cn: 只能有一个默认图像。

source: Enter the date by which problems are due.
ar: أدخل التاريخ الذي تستحق فيه المشاكل.
ur: تاریخ درج کریں جس کے ذریعہ مسائل کی وجہ سے ہو.
zh_cn: 输入问题发生的日期。

source: Fractions
ar: الكسور
ur: کسور
zh_cn: 馏分

source: Whether to display this module in the table of contents
ar: سواء لعرض هذه الوحدة في جدول المحتويات
ur: چاہے اس ماڈیول کو مواد کی میز میں ڈسپلے کرنا چاہے
zh_cn: 是否在目录中显示此模块

source: Explore the course
ar: استكشاف الدورة
ur: کورس کا مطالعہ کریں
zh_cn: 探索课程

source: Enter the number of enrollment codes.
ar: أدخل عدد رموز التسجيل.
ur: داخلہ کوڈوں کی تعداد درج کریں.
zh_cn: 输入注册码的数量。

source: No
ar: لا
ur: نہیں
zh_cn: 没有

source: Blocked Content Message
ar: رسالة المحتوى المحظور
ur: مسدود مواد کا پیغام
zh_cn: 被阻止的内容消息

source: Force Publish Course
ar: قوة نشر الدورة
ur: فورس شائع کریں کورس
zh_cn: 强制发布课程

source: You have used {num_used} of {num_total} attempt
ar: لقد استخدمت {num_used} من {num_total} محاولة
ur: آپ نے {num_used} کا {num_total} کوشش کی ہے
zh_cn: 您已使用{num_used} {num_total}次尝试

source: You will not get notification for emails that bounce, so please double-check spelling.
ar: لن تتلقى إشعارًا لرسائل البريد الإلكتروني التي ترتد ، لذا يرجى التحقق مرة أخرى من الإملاء.
ur: آپ کو ای میلز کے لئے نوٹیفیکیشن نہیں ملے گی جسے اچھالنا ہے، لہذا براہ کرم ہجے چیک کریں.
zh_cn: 您不会收到反弹电子邮件的通知，因此请仔细检查拼写。

source: Here you can see what extensions have been granted on particular units or for a particular student.
ar: هنا يمكنك رؤية الامتدادات التي تم منحها على وحدات معينة أو لطالب معين.
ur: یہاں آپ دیکھ سکتے ہیں کہ خاصی یونٹس یا ایک مخصوص طالب علم کے لئے کونسی توسیع دی گئی ہے.
zh_cn: 在这里您可以看到特定单位或特定学生已经授予了什么扩展。

source: Invalid Length ({0})
ar: طول غير صالح ({0})
ur: غلط لمبائی ({0})
zh_cn: 无效的长度（{0}）

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
ar: بشكل افتراضي ، يمكن للطلاب تنزيل ملف .srt أو .txt عند تعيين تنزيل النسخة المسموح بها إلى True. إذا كنت تريد تقديم نسخة قابلة للتنزيل بتنسيق مختلف ، فننصحك بتحميل نشرة باستخدام حقل &quot;تحميل بيان&quot;. إذا لم يكن ذلك ممكنًا ، فيمكنك نشر ملف نص في صفحة الملفات والتحميلات أو على الإنترنت ، ثم إضافة عنوان URL للنسخة المكتوبة هنا. يرى الطلاب رابطًا لتنزيل هذا النص أسفل الفيديو.
ur: ڈیفالٹ کے لحاظ سے، طالب علموں کو آپ کو ایس ایس آر یا .txt ٹرانسمیشن ڈاؤن لوڈ کرسکتے ہیں جب آپ درست کرنے کیلئے ڈاؤن لوڈ کردہ ٹرانزیکشن کو مقرر کرتے ہیں. اگر آپ مختلف فارمیٹ میں ڈاؤن لوڈ ہونے والے ٹرانکرپٹ فراہم کرنا چاہتے ہیں تو، ہم سفارش کرتے ہیں کہ آپ اپ لوڈ ہینڈ آؤٹ فیلڈ کا استعمال کرکے ہینڈ آؤٹ اپ لوڈ کریں. اگر یہ ممکنه نہیں ہے تو، آپ فائلوں پر اور فائلوں کو اپ لوڈ کرنے یا انٹرنیٹ پر ٹرانسپٹ فائل بھیج سکتے ہیں، اور پھر یہاں URL کو ٹرانسپٹ کے لئے شامل کریں. طلباء ویڈیو کے نیچے اس نقل کو ڈاؤن لوڈ کرنے کا ایک لنک دیکھتے ہیں.
zh_cn: 默认情况下，当您将Download Transcript Allowed设置为True时，学生可以下载.srt或.txt副本。如果您想以不同格式提供可下载的副本，我们建议您使用上传讲义字段上传讲义。如果这不可行，您可以在文件和上传页面或Internet上发布抄本文件，然后在此处添加抄本的网址。学生会在视频下方看到链接以下载该成绩单。

source: group
ar: مجموعة
ur: گروپ
zh_cn: 组

source: Incorrect ({progress} point)
ar: غير صحيح (نقطة التقدم)
ur: غلط ({ترقی} نقطہ)
zh_cn: 不正确（{progress}点）
