Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Create one or more pre-paid course enrollment codes. Students can use these codes to enroll in the course.
ar: إنشاء واحد أو أكثر من أكواد التسجيل المدفوعة مسبقًا. يمكن للطلاب استخدام هذه الرموز للتسجيل في الدورة التدريبية.
ur: ایک یا زیادہ پری ادا شدہ کورس اندراج کوڈ بنائیں. طلباء کورس میں داخل ہونے کے لئے ان کوڈ کو استعمال کرسکتے ہیں.
zh_cn: 创建一个或多个预付费课程注册码。学生可以使用这些代码注册课程。

source: Repo Location
ar: موقع الريبو
ur: ریپو مقام
zh_cn: 回购地点

source: Show this page
ar: اعرض هذه الصفحة
ur: اس صفحہ کو دکھائیں
zh_cn: 显示此页面

source: Name missing from ID photo
ar: الاسم مفقود من صورة المعرف
ur: ID کی تصویر سے لاپتہ نام
zh_cn: ID照片中缺少名称

source: Student Grades
ar: درجات الطلاب
ur: طالب علم گریڈ
zh_cn: 学生成绩

source: Starts on {}
ar: يبدأ في {}
ur: {} پر شروع ہوتا ہے
zh_cn: 从{}开始

source: Your certificate prevents you from unenrolling from this course
ar: تمنعك شهادتك من إلغاء التسجيل من هذه الدورة التدريبية
ur: آپ کا سرٹیفکیٹ آپ کو اس کورس سے غیر منحصر کرنے سے روکتا ہے
zh_cn: 您的证书可防止您从此课程中取消注册

source: To start accessing course materials, please visit {course_url}
ar: لبدء الوصول إلى مواد الدورة التدريبية ، يرجى زيارة {course_url}
ur: کورس مواد تک پہنچنے کے لۓ، براہ کرم {course_url} ملاحظہ کریں
zh_cn: 要开始访问课程材料，请访问{course_url}

source: Disabled Account
ar: حساب تعطيل
ur: معذور اکاؤنٹ
zh_cn: 已禁用帐户

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
ar: نحن آسفون. حدثت مشكلة بالخادم أثناء محاولة معالجة طلبك الأخير. قد ترغب في العودة إلى لوحة المعلومات {studio_name} أو تجربة هذا الطلب مرة أخرى. إذا كنت لا تزال تواجه مشكلات في الوصول إلى الأشياء ، فلا تتردد في {link_start} الاتصال بـ {studio_name} الدعم {link_end} للحصول على مزيد من المساعدة.
ur: ہم معذرت خواہ ہیں. آپ کی آخری درخواست پر عملدرآمد کرنے کے دوران سرور کے ساتھ ایک مسئلہ تھا. آپ {سٹوڈیو_نام} ڈیش بورڈ پر واپس آنا چاہتے ہیں یا دوبارہ اس درخواست کی کوشش کر سکتے ہیں. اگر آپ ابھی تک چیزوں تک رسائی حاصل کرنے میں دشوار ہیں تو، براہ کرم مزید مدد کیلئے {link_start} رابطہ {سٹوڈیو_ نام} کی حمایت {link_end} پر مفت محسوس کریں.
zh_cn: 我们很抱歉。尝试处理上次请求时，服务器出现问题。您可能想要返回到{studio_name}仪表板或再次尝试此请求。如果您仍然无法访问内容，请随时{link_start}联系{studio_name}支持{link_end}以获取进一步帮助。

source: About {platform_name} Certificates
ar: حول {platform_name} الشهادات
ur: کے بارے میں {platform_name} سرٹیفکیٹ
zh_cn: 关于{platform_name}证书

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
ar: يتم إنشاء تقرير {report_type}. لعرض حالة التقرير ، راجع Pending المهام أدناه. ستتمكن من تنزيل التقرير عند اكتماله.
ur: {report_type} کی رپورٹ تیار کی جا رہی ہے. رپورٹ کی حیثیت کو دیکھنے کے لئے، ذیل میں زیر التواء ٹاسک دیکھیں. جب آپ مکمل ہو جائیں گے تو آپ اس رپورٹ کو ڈاؤن لوڈ کرسکتے ہیں.
zh_cn: {report_type}报告正在创建中。要查看报告的状态，请参阅下面的挂起任务。您可以在报告完成时下载报告。

source: code has been applied
ar: تم تطبيق الشفرة
ur: کوڈ لاگو کیا گیا ہے
zh_cn: 代码已被应用

source: Thank you for enrolling in:
ar: شكرا لك على التسجيل في:
ur: میں اندراج کے لئے شکریہ:
zh_cn: 感谢您参加：

source: must have at least one group
ar: يجب أن يكون لديك مجموعة واحدة على الأقل
ur: کم سے کم ایک گروپ ہونا ضروری ہے
zh_cn: 必须至少有一个组

source: Cost:
ar: كلفة:
ur: لاگت:
zh_cn: 成本：

source: Teams Configuration
ar: تكوين الفرق
ur: ٹیموں کی ترتیب
zh_cn: 团队配置

source: Approved
ar: وافق
ur: منظورشدہ
zh_cn: 批准

source: The request was received, but a service did not finish running in time.
ar: تم تلقي الطلب ، ولكن لم تنتهي الخدمة في الوقت المناسب.
ur: درخواست موصول ہوئی تھی، لیکن سروس وقت پر چل رہا نہیں ہے.
zh_cn: 该请求已收到，但服务未及时完成。

source: Discussion thread list
ar: قائمة موضوع المناقشة
ur: بحث موضوع کی فہرست
zh_cn: 讨论线程列表

source: Submission History Viewer
ar: عارض تاريخ التقديم
ur: جمع کرانے کی تاریخ ناظرین
zh_cn: 提交历史记录查看器

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
ar: تحتوي التجربة على مجموعة غير نشطة. انقل المحتوى إلى مجموعات نشطة ، ثم احذف المجموعة غير النشطة.
ur: تجربہ ایک غیر فعال گروہ ہے. مواد کو فعال گروپوں میں منتقل کریں، پھر غیر فعال گروہ کو حذف کریں.
zh_cn: 该实验有一个不活跃的组。将内容移动到活动组中，然后删除非活动组。

source: Description
ar: وصف
ur: تفصیل
zh_cn: 描述

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
ar: المسار {0} غير موجود ، يرجى إنشائه ، أو تكوين مسار مختلف باستخدام GIT_REPO_DIR
ur: راستہ {0} موجود نہیں ہے، براہ کرم اسے تخلیق کریں، یا GIT_REPO_DIR کے ساتھ ایک مختلف راستہ ترتیب دیں
zh_cn: 路径{0}不存在，请创建它，或者使用GIT_REPO_DIR配置不同的路径

source: View Unit in Studio
ar: عرض الوحدة في ستوديو
ur: سٹوڈیو میں یونٹ دیکھیں
zh_cn: 在Studio中查看单元

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
ar: كن مؤهلاً للائتمان الأكاديمي وأبرز مهاراتك ومعرفتك الجديدة بشهادة تم التحقق منها. استخدم هذه الشهادة القيمة للتأهل للحصول على الائتمان الأكاديمي ، أو التقدم في حياتك المهنية ، أو تعزيز تطبيقاتك المدرسية.
ur: تعلیمی کریڈٹ کے اہل بنیں اور تصدیق شدہ سرٹیفکیٹ کے ساتھ اپنی نئی مہارت اور علم کو نمایاں کریں. تعلیمی کریڈٹ کی اہلیت، اپنے کیریئر کو آگے بڑھانا، یا اپنے اسکول کے ایپلی کیشنز کو مضبوط بنانے کے لئے اس قیمتی اعتبار سے استفادہ کریں.
zh_cn: 有资格获得学分，并通过验证证书强调您的新技能和知识。使用这个有价值的证书来获得学分，晋升你的职业生涯，或加强你的学校申请。

source: The merchant reference code for this authorization request matches the merchant reference code of another authorization request that you sent within the past 15 minutes. Possible action: Resend the request with a unique merchant reference code.
ar: يتطابق رمز التاجر المرجعي لطلب التفويض هذا مع شفرة مرجع التاجر لطلب تفويض آخر أرسلته في غضون الـ 15 دقيقة الماضية. الإجراء المحتمل: إعادة إرسال الطلب برمز مرجعي فريد للتاجر.
ur: اس اجازت کی درخواست کے لئے مرچنٹ حوالہ کوڈ تاجر سے متعلق حوالہ کوڈ سے منسلک ہے کہ آپ نے گزشتہ 15 منٹ کے اندر بھیج دیا ہے. ممکنہ عمل: ایک منفرد مرچنٹ حوالہ کوڈ کے ساتھ درخواست کا دوبارہ جائزہ لیں.
zh_cn: 该授权请求的商户参考码与您在过去15分钟内发送的另一个授权请求的商户参考码匹配。可能的措施：使用独特的商家参考码重新发送请求。

source: Select a .tar.gz File to Replace Your Course Content
ar: حدد ملفًا .tar.gz لاستبدال محتوى الدورة التدريبية
ur: اپنے کورس کے مواد کو تبدیل کرنے کے لئے ایک .tt.gz فائل منتخب کریں
zh_cn: 选择一个.tar.gz文件来替换您的课程内容

source: role
ar: وظيفة
ur: کردار
zh_cn: 角色

source: Cancel and Return to Dashboard
ar: إلغاء والعودة إلى لوحة المعلومات
ur: منسوخ کریں اور ڈیش بورڈ پر واپس جائیں
zh_cn: 取消并返回仪表板

source: Student answer
ar: إجابة الطالب
ur: طالب علم کا جواب
zh_cn: 学生回答

source: To see the content of previously sent emails, click this button:
ar: لمشاهدة محتوى رسائل البريد الإلكتروني المرسلة سابقًا ، انقر فوق هذا الزر:
ur: پہلے بھیجے گئے ای میلز کے مواد کو دیکھنے کے لئے، اس بٹن پر کلک کریں:
zh_cn: 要查看先前发送的电子邮件的内容，请单击此按钮：

source: YouTube Duplicate
ar: يوتيوب مكررة
ur: یو ٹیوب ڈپلیکیٹ
zh_cn: YouTube重复

source: e.g. Computer Science Problems
ar: على سبيل المثال مشاكل علوم الكمبيوتر
ur: مثال کے طور پر کمپیوٹر سائنس کے مسائل
zh_cn: 例如计算机科学问题

source: All possible words from all learners.
ar: كل الكلمات الممكنة من جميع المتعلمين.
ur: تمام سیکھنے والوں کے تمام ممکنہ الفاظ.
zh_cn: 来自所有学习者的所有可能的单词。

source: Tell us your goals.
ar: أخبرنا بأهدافك.
ur: ہمیں اپنے مقاصد کو بتائیں.
zh_cn: 告诉我们你的目标。

source: Request the Ability to Create Courses
ar: طلب القدرة على إنشاء الدورات
ur: کورسز تخلیق کرنے کی صلاحیت کی درخواست کریں
zh_cn: 请求创建课程的能力

source: Warning: The problem has been reset to its initial state!
ar: تحذير: تمت إعادة تعيين المشكلة إلى حالتها الأولية!
ur: انتباہ: مسئلہ اس کی ابتدائی حالت میں دوبارہ تبدیل کردی گئی ہے!
zh_cn: 警告：问题已被重置为初始状态！

source: Proven motivator to complete the course
ar: ثبت محفز لإكمال الدورة
ur: کورس مکمل کرنے کے لئے ثابت قدمی
zh_cn: 成功的激励者来完成课程

source: Download Problem Data for all Problems as a CSV
ar: تنزيل بيانات المشكلة لجميع المشكلات باعتبارها ملف CSV
ur: سی ایس وی کے طور پر تمام مسائل کے لئے مسئلہ ڈیٹا ڈاؤن لوڈ کریں
zh_cn: 将所有问题的问题数据下载为CSV

source: You have been enrolled in {course_name}
ar: لقد تم تسجيلك في {course_name}
ur: آپ {course_name} میں اندراج کردیئے گئے ہیں
zh_cn: 您已加入{course_name}

source: Edit
ar: تصحيح
ur: ترمیم
zh_cn: 编辑

source: Application Name
ar: اسم التطبيق
ur: درخواست نام
zh_cn: 应用名称

source: Error while rendering preview
ar: خطأ أثناء عرض المعاينة
ur: پیش نظارہ پیش کرنے میں خرابی
zh_cn: 渲染预览时出错

source: You are already in a team in this course.
ar: أنت بالفعل في فريق في هذه الدورة.
ur: آپ پہلے ہی اس کورس میں ایک ٹیم میں ہیں.
zh_cn: 你已经在这个课程的团队中。

source: The reason this user wants to access the API.
ar: سبب رغبة هذا المستخدم في الوصول إلى واجهة برمجة التطبيقات.
ur: اس صارف کا API API تک رسائی حاصل کرنا چاہتا ہے.
zh_cn: 这个用户想访问API的原因。

source: Disable Account
ar: تعطيل الحساب
ur: اکاؤنٹ کو غیر فعال کریں
zh_cn: 禁用账户

source: executive summary
ar: ملخص تنفيذي
ur: ایگزیکٹو خلاصہ
zh_cn: 执行摘要

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
ar: القيم من الإعدادات المتقدمة ، بما في ذلك مفاتيح API MATLAB وجوازات السفر LTI
ur: MATLAB API کی چابیاں اور LTI پاسپورٹس سمیت اعلی درجے کی ترتیبات سے قدر
zh_cn: 来自高级设置的值，包括MATLAB API密钥和LTI护照

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
ar: من المتوقع <choice> أو <compoundhint> العلامة. حصلت على {given_tag} بدلاً من ذلك
ur: ایک متوقع <choice> یا <compoundhint> ٹیگ؛ بجائے {given_tag} بجائے
zh_cn: 预计a <choice>要么<compoundhint>标签;取而代之的是{given_tag}

source: Course Content License
ar: ترخيص محتوى الدورة التدريبية
ur: کورس مواد لائسنس
zh_cn: 课程内容许可证

source: Course Display Name
ar: اسم عرض الدورة التدريبية
ur: کورس ڈسپلے کا نام
zh_cn: 课程显示名称

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكن للطلاب إنشاء مشاركات مناقشة مجهولة لجميع المستخدمين.
ur: صحیح یا غلط درج کریں. اگر سچ ہے، تو طالب علم تمام مباحثے کے مباحثے کو بحث کرسکتے ہیں.
zh_cn: 输入true或false。如果属实，学生可以创建对所有用户匿名的讨论帖子。

source: The redemption does not exist against enrollment code ({code}).
ar: لا يوجد استرداد مقابل كود التسجيل ({code}).
ur: داخلہ کوڈ ({کوڈ}) کے خلاف موصول نہیں ہے.
zh_cn: 对于注册码（{code}），兑换不存在。

source: Your score is {current_score}%. You have passed the entrance exam.
ar: نتيجتك هي {current_score}٪. لقد اجتزت اختبار القبول.
ur: آپ کا اسکور {current_score}٪ ہے. آپ نے داخلہ امتحان پاس کر دیا ہے.
zh_cn: 您的分数是{current_score}％。你已经通过了入学考试。

source: Course Team Roles
ar: بالطبع أدوار الفريق
ur: کورس ٹیم رولز
zh_cn: 课程团队角色

source: HTML Code Editor
ar: محرر كود HTML
ur: ایچ ٹی ایم ایل کوڈ ایڈیٹر
zh_cn: HTML代码编辑器

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
ar: سوف تتلقى رسالة بريد إلكتروني للتنشيط. يجب النقر فوق ارتباط التنشيط لإكمال العملية. لا ترى البريد الإلكتروني؟ تحقق من مجلد الرسائل غير المرغوب فيها وحدد رسائل البريد الإلكتروني من class.stanford.edu على أنها &quot;ليست رسائل غير مرغوب فيها&quot; ، نظرًا لأنك ستحتاج إلى تلقي بريد إلكتروني من الدورات التدريبية.
ur: آپ کو ایکٹیویشن ای میل مل جائے گا. عمل کو مکمل کرنے کیلئے آپ کو فعال کاری کے لنک پر کلک کرنا ہوگا. ای میل نہیں دیکھا؟ اپنے سپیم فولڈر کو چیک کریں اور class.stanford.edu سے ای میلز کو نشان زد نہ کریں، کیونکہ آپ اپنے کورس سے ای میل وصول کرنے کے قابل ہو جائیں گے.
zh_cn: 您将收到一封激活邮件。您必须点击激活链接才能完成该过程。没有看到电子邮件？检查您的垃圾邮件文件夹并将class.stanford.edu中的电子邮件标记为“不是垃圾邮件”，因为您希望能够接收来自课程的电子邮件。

source: Course Utilities
ar: بالطبع المرافق
ur: کورس کی افادیت
zh_cn: 课程实用程序

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
ar: تهانينا! تلخص هذه الصفحة ما أنجزته. اعرضها للعائلة والأصدقاء والزملاء في الشبكات الاجتماعية والمهنية.
ur: مبارک ہو! اس صفحے کا خلاصہ خلاصہ ہے. اپنے سوشل اور پیشہ ور نیٹ ورکوں میں اسے خاندان، دوستوں اور ساتھیوں کو دکھائیں.
zh_cn: 恭喜！本页总结了您所完成的工作。把它展示给你的社交和专业网络中的家人，朋友和同事。

source: Is Active
ar: هو نشط
ur: فعال ہے
zh_cn: 活跃

source: You can find the answers to most of your questions in our list of FAQs. After you enroll in a course, you can also find answers in the course discussions.
ar: يمكنك العثور على إجابات لمعظم أسئلتك في قائمة الأسئلة الشائعة. بعد التسجيل في دورة تدريبية ، يمكنك أيضًا العثور على إجابات في مناقشات الدورة التدريبية.
ur: آپ سوالات کے جوابات میں ہماری اکثر سوالات کے جوابات تلاش کرسکتے ہیں. ایک کورس میں داخل ہونے کے بعد آپ کورس کے مباحثے میں جواب بھی تلاش کرسکتے ہیں.
zh_cn: 您可以在我们的常见问题列表中找到大多数问题的答案。注册课程后，您还可以在课程讨论中找到答案。

source: time
ar: زمن
ur: وقت
zh_cn: 时间

source: Purchase Order Number
ar: رقم طلب الشراء
ur: خریداری آرڈر نمبر
zh_cn: 订购单号码

source: You have successfully been enrolled for {course_names}. The following receipt has been emailed to {receipient_emails}
ar: لقد تم تسجيلك بنجاح في {course_names}. تم إرسال الإيصال التالي عبر البريد الإلكتروني إلى {receipient_emails}
ur: آپ {course_names} کے لئے کامیابی سے اندراج کیا گیا ہے. مندرجہ ذیل رسید {وصول کنندہ_ میلوں} کو ای میل کیا گیا ہے.
zh_cn: 您已成功注册{course_names}。以下收据已通过电子邮件发送给{recipient_emails}

source: Certificate Generation History
ar: شهادة جيل التاريخ
ur: سرٹیفکیٹ جنریشن تاریخ
zh_cn: 证书生成历史

source: User with username {} does not exist
ar: المستخدم مع اسم المستخدم {} غير موجود
ur: صارف کا نام {} موجود نہیں ہے
zh_cn: 用户名为{}的用户不存在

source: Module Fields
ar: حقول النموذج
ur: ماڈیول فیلڈز
zh_cn: 模块字段

source: Invalid email change key
ar: مفتاح تغيير البريد الإلكتروني غير صالح
ur: غلط ای میل تبدیل کیجیے
zh_cn: 无效的电子邮件更改密钥

source: Hide notes
ar: إخفاء الملاحظات
ur: نوٹ چھپائیں
zh_cn: 隐藏笔记

source: Title
ar: عنوان
ur: عنوان
zh_cn: 标题

source: altering or editing any content or graphics in the API Content
ar: تغيير أو تحرير أي محتوى أو رسومات في محتوى واجهة برمجة التطبيقات
ur: API مواد میں کسی بھی مواد یا گرافکس کو تبدیل یا ترمیم کریں
zh_cn: 更改或编辑API内容中的任何内容或图形

source: Numerical Input
ar: الإدخال العددي
ur: عددی ان پٹ
zh_cn: 数字输入

source: Grade Cutoffs:
ar: الصفوف القطع:
ur: گریڈ cutoffs:
zh_cn: 等级截止：

source: Permissions
ar: أذونات
ur: اجازت
zh_cn: 权限

source: We've received your information and the verification process has begun. You can check the status of the verification process on your dashboard.
ar: لقد تلقينا معلوماتك وبدأت عملية التحقق. يمكنك التحقق من حالة عملية التحقق على لوحة المعلومات.
ur: ہمیں آپ کی معلومات ملی ہے اور تصدیق کے عمل شروع ہو چکے ہیں. آپ اپنے ڈیش بورڈ پر توثیقی عمل کی حیثیت کو چیک کرسکتے ہیں.
zh_cn: 我们已收到您的信息，验证过程已开始。您可以在仪表板上检查验证过程的状态。

source: Go back to the {link_start}home page{link_end}.
ar: ارجع إلى {link_start} الصفحة الرئيسية {link_end}.
ur: {link_start} ہوم پیج {link_end} پر واپس جائیں.
zh_cn: 返回{link_start}主页{link_end}。

source: Thanks for using our site!
ar: شكرا لاستخدام موقعنا!
ur: ہماری سائٹ کا استعمال کرنے کے لئے شکریہ!
zh_cn: 感谢您使用我们的网站！

source: We're having trouble rendering your component
ar: نحن نواجه مشكلة في تقديم المكون الخاص بك
ur: ہمیں آپ کا جزو لگانے میں مصیبت ہے
zh_cn: 我们无法渲染组件

source: Course Updates and News
ar: تحديثات الدورة والاخبار
ur: کورس کی تازہ ترین معلومات اور نیوز
zh_cn: 课程更新和新闻

source: Problem needs to be reset prior to save.
ar: تحتاج المشكلة إلى إعادة الضبط قبل الحفظ.
ur: بچانے سے قبل مسئلہ دوبارہ ترتیب دینے کی ضرورت ہے.
zh_cn: 保存之前需要重置问题。

source: user
ar: المستعمل
ur: صارف
zh_cn: 用户

source: Invalid permission codename: "{codename}". No such permission exists for the model {module}.{model_name}.
ar: الإذن غير صالح codename: &quot;{codename}&quot;. لا يوجد مثل هذا الإذن للنموذج {module}. {model_name}.
ur: غلط اجازت کوڈڈ نام: &quot;{کوڈڈیم}&quot;. ماڈل {ماڈیول}. {model_name} کے لئے ایسی اجازت موجود نہیں ہے.
zh_cn: 无效的许可代号：“{codename}”。模型{module}。{model_name}不存在此类权限。

source: Specified in seconds (defaults to 86400s, 24hr). In some cases the cache does needs to be refreshed less frequently. Enable long term caching of API responses by setting this to a value greater than 0.
ar: تم تحديده بالثواني (الافتراضيات إلى 86400 ، 24 ساعة). في بعض الحالات ، يجب أن يتم تحديث ذاكرة التخزين المؤقت بشكل أقل. تمكين التخزين المؤقت على المدى الطويل لاستجابات واجهة برمجة التطبيقات عن طريق تعيين هذا على قيمة أكبر من 0.
ur: سیکنڈ میں مقرر کردہ (86400s پر غلطیاں، 24hr). کچھ معاملات میں کیش کو کم بار بار ریفریجری کرنے کی ضرورت ہے. 0 جوابات سے زائد قیمت پر قائم کرکے API جوابات کے طویل مدتی کیشنگ کو فعال کریں.
zh_cn: 以秒为单位指定（默认为86400s，24hr）。在某些情况下，缓存确实需要更频繁地刷新。通过将其设置为大于0的值来启用API响应的长期缓存。

source: How did I do?
ar: كيف فعلت؟
ur: میں نے کیسے کیا
zh_cn: 我怎么办？

source: Export Course Content
ar: محتوى دورة تصدير
ur: برآمد کورس کے مواد
zh_cn: 导出课程内容

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
ar: شكرا لكم لتفعيل حسابك. يمكنك الآن تسجيل الدخول والبدء في استخدام {studio_name} لدورات المؤلف.
ur: اپنے اکاؤنٹ کو فعال کرنے کے لئے شکریہ. آپ اب سائن ان کر سکتے ہیں اور مصنف سٹوڈیوز {studio_name} کا استعمال کرتے ہوئے شروع کر سکتے ہیں.
zh_cn: 感谢您激活您的帐户。您现在可以登录并开始使用{studio_name}创作课程。

source: Please contact your course team if you have any questions.
ar: يرجى الاتصال بفريق الدورة التدريبية إذا كان لديك أي أسئلة.
ur: اگر آپ کے پاس کوئی سوال ہے تو براہ کرم اپنے کورس کی ٹیم سے رابطہ کریں.
zh_cn: 如果您有任何问题，请联系您的课程团队。

source: your YouTube video's ID
ar: معرف فيديو يوتيوب الخاص بك
ur: آپ کی YouTube ویڈیو کی شناخت
zh_cn: 您的YouTube视频ID

source: The git repo location should end with '.git', and be a valid url
ar: يجب أن ينتهي موقع git repo بـ &quot;.git&quot; ، وأن يكون عنوان URL صالحًا
ur: GIT ریپو مقام &#39;.git&#39; کے ساتھ ختم ہونا چاہئے، اور ایک درست url بننا چاہئے
zh_cn: git repo位置应该以&#39;.git&#39;结尾，并且是一个有效的url

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
ar: يتيح لك {studio_name} نسج المحتوى معًا بطريقة تعزز التعلم. أضف مقاطع فيديو ومناقشات ومجموعة متنوعة من التمارين بنقرات قليلة.
ur: {سٹوڈیو_ نام} آپ کو آپ کے مواد کو ایک دوسرے کے ساتھ بونا کرنے دیتا ہے جس طرح سیکھنے کو مضبوط بناتا ہے. صرف چند کلکس کے ساتھ ویڈیو، بحث، اور وسیع پیمانے پر مشقیں شامل کریں.
zh_cn: {studio_name}可让您以强化学习的方式编排您的内容。只需几次点击即可插入视频，讨论和各种练习。

source: Specify when the Show Answer button appears for each problem. Valid values are "always", "answered", "attempted", "closed", "finished", "past_due", "correct_or_past_due", and "never".
ar: حدد متى يظهر الزر &quot;إظهار الإجابة&quot; لكل مشكلة. القيم الصالحة هي &quot;دائمًا&quot; و &quot;تمت الإجابة&quot; و &quot;حاول&quot; و &quot;مغلقة&quot; و &quot;انتهى&quot; و &quot;past_due&quot; و &quot;correct_or_past_due&quot; و &quot;never&quot;.
ur: جب ہر جواب کے لئے دکھائیں جواب بٹن ظاہر ہوتا ہے تو وضاحت کریں. درست اقدار &quot;ہمیشہ&quot;، &quot;جواب&quot;، &quot;کوشش&quot;، &quot;بند&quot;، &quot;ختم&quot;، &quot;past_due&quot;، &quot;correct_or_past_due&quot;، اور &quot;کبھی نہیں&quot; ہیں.
zh_cn: 指定每个问题何时显示“显示答案”按钮。有效值为“始终”，“已回答”，“尝试”，“已关闭”，“已完成”，“已过期”，“正确或正在等待”以及“从不”。

source: Enable Proctored Exams
ar: تمكين الامتحانات بروكتور
ur: پرویکٹرڈ امتحان کو فعال کریں
zh_cn: 启用Proctored Exams

source: Resubmit Verification
ar: إعادة إرسال التحقق
ur: دوبارہ توثیق کریں
zh_cn: 重新提交验证

source: Course starts in {time_remaining_string} on {course_start_date}.
ar: تبدأ الدورة التدريبية في {time_remaining_string} في {course_start_date}.
ur: {course_remaining_string} پر کورس {course_start_date} پر شروع ہوتا ہے.
zh_cn: 课程从{course_start_date}的{time_remaining_string}开始。

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
ar: السماح للمستخدمين الذين سجلوا في بلد مسموح له بالوصول إلى الدورات التدريبية المقيدة من البلدان المستبعدة.
ur: صارفین کو جو اجازت دیئے گئے ملک میں داخل ہونے کی اجازت ہے وہ خارج کردہ ممالک سے محدود کورس تک رسائی حاصل کرنے کے لئے.
zh_cn: 允许在允许国家注册的用户访问受排除国家的受限课程。

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
ar: يمكن لجميع أعضاء فريق الدورة التدريبية الوصول إلى المحتوى في Studio و LMS و Insights ، ولكن لا يتم تسجيلهم تلقائيًا في الدورة التدريبية.
ur: تمام کورس ٹیم کے ارکان سٹوڈیو، ایل ایم ایم اور اندراج میں مواد تک رسائی حاصل کرسکتے ہیں، لیکن اس کورس میں خود بخود داخلہ نہیں ہوتا.
zh_cn: 所有课程团队成员都可以访问Studio，LMS和Insights中的内容，但不会自动注册到课程中。

source: Download the iOS app on the Apple Store
ar: قم بتنزيل تطبيق iOS على Apple Store
ur: ایپل اسٹور پر iOS ایپ ڈاؤن لوڈ کریں
zh_cn: 在Apple Store上下载iOS应用程序

source: Catalogs for {username}
ar: كتالوجات {اسم المستخدم}
ur: {صارف نام} کے لئے کیٹلاگ
zh_cn: {用户名}目录

source: Force On
ar: إجبار على
ur: پر زور
zh_cn: 强迫

source: You do not have access to this dependency module.
ar: ليس لديك حق الوصول إلى وحدة التبعية هذه.
ur: آپ اس انحصار ماڈیول تک رسائی نہیں رکھتے ہیں.
zh_cn: 您无权访问此依赖关系模块。

source: Filter Topics
ar: تصفية الموضوعات
ur: فلٹر موضوعات
zh_cn: 过滤主题

source: Update Coupon Code
ar: تحديث كود القسيمة
ur: کوپن کوڈ اپ ڈیٹ کریں
zh_cn: 更新优惠券代码

source: Contents
ar: محتويات
ur: فہرست
zh_cn: 内容

source: Company Name
ar: اسم الشركة
ur: کمپنی کا نام
zh_cn: 公司名

source: HTML Textbooks
ar: كتب HTML
ur: ایچ ٹی ایم ایل درسی کتابیں
zh_cn: HTML教科书

source: Staffing and Enrollment
ar: التوظيف والتسجيل
ur: اسٹافنگ اور اندراج
zh_cn: 人员配置和注册

source: The Server Encountered an Error
ar: واجه الخادم خطأ
ur: سرور نے غلطی کا سامنا کیا
zh_cn: 服务器遇到错误

source: Export to Git
ar: تصدير إلى Git
ur: Git میں برآمد کریں
zh_cn: 导出到Git

source: Estimated Effort
ar: جهد مقدر
ur: متوقع کوشش
zh_cn: 预计的工作量

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
ar: يمكنك استخدام شريط التمرير ضمن نطاق درجة عام لتحديد ما إذا كانت الدورة التدريبية الخاصة بك تمرر / تفشل أو تم تقديرها بواسطة حرف ، ولتحديد الحدود لكل درجة.
ur: آپ اس سلائیڈر کو مجموعی طور پر گریڈ رینج کے تحت استعمال کرسکتے ہیں کہ یہ بتائیں کہ آیا آپ کا کورس پاس / ناکام یا درجہ بندی کے ذریعہ ہے، اور ہر گریڈ کے لئے تختوں کا تعین کرنا ہے.
zh_cn: 您可以使用总体成绩范围下的滑块来指定您的课程是通过/未通过还是按字母进行评分，并为每个成绩建立阈值。

source: images
ar: صور
ur: تصاویر
zh_cn: 图片

source: Opened by this number of students
ar: افتتح من قبل هذا العدد من الطلاب
ur: طلباء کی اس تعداد کی طرف سے کھول دیا
zh_cn: 由这个数量的学生开设

source: Preview the courseware in the LMS
ar: معاينة البرامج التعليمية في LMS
ur: LMS میں courseware پیش نظارہ
zh_cn: 在LMS中预览课件

source: Supported by the following organizations
ar: بدعم من المنظمات التالية
ur: مندرجہ ذیل تنظیموں کی طرف سے حمایت کی
zh_cn: 由以下组织支持

source: The Site that this SAML configuration belongs to.
ar: الموقع الذي ينتمي إليه تكوين SAML هذا.
ur: اس سائٹ سے جو SAML ترتیب سے تعلق رکھتا ہے.
zh_cn: 此SAML配置所属的网站。

source: Simple, Fast, and Incremental Publishing. With Friends.
ar: نشر بسيط وسريع وتزايدي. مع الأصدقاء.
ur: سادہ، تیز، اور اضافی اشاعت. دوستوں کے ساتھ.
zh_cn: 简单，快速和增量发布。和朋友。

source: Email staff to create course
ar: فريق البريد الإلكتروني لإنشاء الدورة
ur: ای میل کے عملے کورس بنانے کے لئے
zh_cn: 通过电子邮件员工创建课程

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: تتم ملاحظة الحقول المطلوبة <strong class="indicator">بنص غامق وعلامة نجمية (*)</strong> .
ur: مطلوبہ فیلڈ <strong class="indicator">بولڈ متن اور ایک ستارے (*) کی</strong> طرف سے نوٹ کیا جاتا ہے.
zh_cn: 必填字段以<strong class="indicator">粗体文本和星号（*）标注</strong> 。

source: You must wait at least {wait} seconds between submissions.
ar: يجب الانتظار لمدة لا تقل عن {wait} ثانية بين عمليات الإرسال.
ur: آپ کو پیشکشوں کے درمیان کم از کم {انتظار} سیکنڈ کا انتظار کرنا ہوگا.
zh_cn: 提交之间必须至少等待{wait}秒。
