Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Could not find the specified string.
ur: مخصوص تار نہیں مل سکا.

source: %(exam_display_name)s
ur: ٪ (test_display_name) s

source: These settings include basic information about your account.
ur: یہ ترتیبات آپ کے اکاؤنٹ کے بارے میں بنیادی معلومات شامل ہیں.

source: Error deleting student '<%- student_id %>'s state on problem '<%- problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
ur: &lt;٪ - problem_id٪&gt; &#39;مسئلہ پر طالب علم&#39; &lt;٪ - student_id٪&gt; کی ریاست کو حذف کرنے میں خرابی. اس بات کو یقینی بنائیں کہ مسئلہ اور طالب علم کی شناخت مکمل اور درست ہیں.

source: Chapter Name
ur: باب کا نام

source: You've successfully signed into %(currentProvider)s.
ur: آپ کامیابی سے٪ (currentProvider) میں سائن ان کر چکے ہیں.

source: We just need a little more information before you start learning with %(platformName)s.
ur: ٪ (پلیٹ فارم نام) کے ساتھ سیکھنا شروع کرنے سے پہلے ہمیں صرف تھوڑی زیادہ معلومات کی ضرورت ہے.

source: Transcript Languages
ur: ٹرانسپٹ زبانیں

source: Free text notes
ur: مفت ٹیکسٹ نوٹ

source: Use cohorts as the basis for dividing discussions. All learners, regardless of cohort, see the same discussion topics, but within divided topics, only members of the same cohort see and respond to each others’ posts.
ur: بات چیت تقسیم کرنے کے لئے بنیاد کے طور پر کوہٹ استعمال کریں. تمام محققین، قطع نظر کے بغیر، اسی بحث کے موضوعات ملاحظہ کریں، لیکن تقسیم شدہ موضوعات کے اندر، صرف ایک ہی کوارٹر کے اراکین کو صرف ایک دوسرے کے خطوط کو دیکھیں اور جواب دیں.

source: No posts matched your query.
ur: آپ کے سوال سے مل کر کوئی اشاعت نہیں.

source: Country of residence
ur: قیام کا ملک

source: e.g. johndoe@example.com, JaneDoe, joeydoe@example.com
ur: مثال کے طور پر johndoe@example.com، جین ڈو، joeydoe@example.com

source: Started rescore problem task for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ur: &lt;٪ - problem_id٪&gt; &#39;اور طالب علم&#39;٪ - student_id٪&gt; &#39;کے لئے دوبارہ شروع کرنے کا مسئلہ کام شروع کیا. کام کی حیثیت کو دیکھنے کے لئے &#39;ٹاسک اسٹیٹ دکھائیں&#39; کے بٹن پر کلک کریں.

source: Image Description
ur: تصویری تفصیل

source: Accomplishments Pagination
ur: تعریفیں صفحہ بندی

source: All payment options are currently unavailable.
ur: تمام ادائیگی کے اختیارات فی الحال دستیاب نہیں ہیں.

source: (Self-paced) Starts {start}
ur: (خود پیڈ) شروع ہوتا ہے {آغاز}

source: Select a Content Group
ur: ایک مواد گروپ منتخب کریں

source: Fullscreen
ur: مکمل اسکرین یا بڑی اسکرین

source: Automatic transcripts are disabled.
ur: خودکار ٹرانپیکٹس غیر فعال ہیں.

source: Successfully started task to reset attempts for problem '<%- problem_id %>'. Click the 'Show Task Status' button to see the status of the task.
ur: &lt;٪ - problem_id٪&gt; &#39;کے لئے کوششوں کو دوبارہ ترتیب دینے کیلئے کامیابی سے کام شروع کر دیا. کام کی حیثیت کو دیکھنے کے لئے &#39;ٹاسک اسٹیٹ دکھائیں&#39; کے بٹن پر کلک کریں.

source: Read more
ur: مزید پڑھ

source: Add New Component
ur: نیا اجزاء شامل کریں

source: Loading more threads
ur: مزید موضوعات لوڈ کر رہے ہیں

source: Course Video Settings
ur: کورس ویڈیو کی ترتیبات

source: Expand Instructions
ur: ہدایات کو کھولیں

source: You waive some rights for your work, such that others can use it too
ur: آپ اپنے کام کے لئے کچھ حقوق ضائع کرتے ہیں، اس طرح کہ دوسروں کو بھی اس کا استعمال کرسکتا ہے

source: %(download_link_start)sDownload this image (right-click or option-click, save as)%(link_end)s and then %(upload_link_start)supload%(link_end)s it to your backpack.</li>
ur: ٪ (download_link_start) اس تصویر کو ڈاؤن لوڈ کریں (دائیں کلک کریں یا آپشن کلک کریں، کے طور پر محفوظ کریں)٪ (link_end) s اور پھر٪ (upload_link_start) اپ لوڈ لوڈ کریں (link_end) اپنے بیگ پر. </li>

source: Content Group ID
ur: مواد گروپ کی شناخت

source: Optionally, link your personal accounts to the social media icons on your edX profile.
ur: اختیاری طور پر، اپنے ذاتی اکاؤنٹس کو اپنے edX پروفائل پر سوشل میڈیا شبیہیں بھیجیں.

source: Hide transcripts ({transcriptCount})
ur: ٹرانسمیشن چھپائیں ({transcriptCount})

source: What does %(platformName)s do with this photo?
ur: ٪ (پلیٹ فارم نام) اس تصویر کے ساتھ کیا کرتا ہے؟

source: Access to this {blockType} is restricted to: {selectedGroupsLabel}
ur: اس {blockType} تک رسائی محدود ہے: {selectedGroupsLabel}

source: Error: You cannot remove yourself from the Instructor group!
ur: خرابی: آپ اپنے آپ کو انسٹریکٹر گروپ سے نکال نہیں سکتے ہیں!

source: Sign in
ur: داخلہ

source: Delete this {xblock_type} (and prerequisite)?
ur: اس {xblock_type} (اور شرط) کو حذف کریں؟

source: Cohorts Disabled
ur: کوہٹس غیر فعال

source: Assign learners to cohorts by uploading a CSV file
ur: سی.پی.وی. فائل کو اپ لوڈ کرکے سیکھنے والوں کو تفویض کریں

source: Account
ur: اکاؤنٹ

source: Press Remove to remove language
ur: زبان کو ہٹانے کیلئے ہٹا دیں دبائیں

source: You must specify your birth year before you can share your full profile. To specify your birth year, go to the {account_settings_page_link}
ur: اپنی مکمل پروفائل کا اشتراک کرنے سے پہلے آپ کو اپنے پیدائش کا سال مقرر کرنا ضروری ہے. آپ کی پیدائش کا سال مقرر کرنے کے لئے، {account_settings_page_link} پر جائیں

source: Cell padding
ur: سیل بھرتی

source: Draft (Never published)
ur: ڈرافٹ (شائع کبھی نہیں)

source: Organization
ur: تنظیم

source: Loud
ur: لاؤ

source: The country that team members primarily identify with.
ur: ملک جس ٹیم کے ارکان بنیادی طور پر شناخت کرتے ہیں.

source: Showing first response
ur: پہلا جواب دکھا رہا ہے

source: Whole words
ur: مکمل الفاظ

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students. Do you want to proceed?
ur: اگر اس یونٹ کو پہلے شائع کیا گیا تھا اور طالب علموں کو جاری کیا گیا تھا تو، آپ کو اس یونٹ میں جو کسی بھی تبدیلی سے پوشیدہ تھی وہ اب طالب علموں کو نظر آتے ہیں. کیا آپ آگے بڑھنا چاہتے ہیں؟

source: Vote for this post,
ur: اس پوسٹ کے لئے ووٹ دیں،

source: There was an error while verifying the file you submitted.
ur: آپ کی پیش کردہ فائل کی تصدیق کرتے وقت ایک خرابی تھی.

source: Linked Accounts
ur: لنکڈ اکاؤنٹس

source: Signature Image
ur: دستخط کی تصویر

source: Hide from learners
ur: سیکھنے سے چھپائیں

source: Delete table
ur: میز حذف کریں

source: marked as answer %(time_ago)s by %(user)s
ur: ٪ (صارف) کے ذریعہ جواب٪ (time_ago) کے طور پر نشان لگا دیا گیا ہے

source: You can view your information or unlink from {enterprise_name} anytime in your Account Settings.
ur: آپ اپنے اکاؤنٹ کی ترتیبات میں کسی بھی وقت {enterprise_name} سے اپنی معلومات کو دیکھ سکتے ہیں یا غیر فعال کرسکتے ہیں.

source: Not Supported
ur: سہولت مہیا نہیں

source: Scheduled:
ur: شیڈول کردہ

source: {selectedProvider} credentials saved
ur: {منتخب شدہ پراپرڈر} اسناد محفوظ کیے گئے ہیں

source: strong text
ur: مضبوط متن

source: Reply
ur: جواب دیں

source: Your ID must be a government-issued photo ID that clearly shows your face.
ur: آپ کی شناخت سرکاری طور پر تصویر کی شناخت ہوگی جس سے آپ کا چہرہ ظاہر ہوتا ہے.

source: Make sure we can verify your identity with the photos and information you have provided.
ur: یقینی بنائیں کہ ہم آپ کی شناخت کی تصاویر اور معلومات فراہم کر سکتے ہیں جن سے آپ نے فراہم کی ہے.

source: learners are not enrolled in course and not added to the exception list
ur: سیکھنے والے کورس میں داخل نہیں ہوئے ہیں اور استثنی کی فہرست میں شامل نہیں ہیں

source: Current Role:
ur: موجودہ کردار:

source: You must sign out and sign back in before your language changes take effect.
ur: آپ کی زبان میں تبدیلی کے اثرات سے پہلے آپ کو سائن آؤٹ کرنا اور واپس سائن ان کرنا ضروری ہے.

source: If you remove this transcript, the transcript will not be available for any components that use this video.
ur: اگر آپ اس نقل کو ہٹائیں تو، اس ویڈیو کا استعمال کرنے والے کسی بھی اجزاء کیلئے ٹرانسپٹ دستیاب نہیں ہوگا.

source: Advanced
ur: اعلی درجے کی

source: This post could not be unpinned. Refresh the page and try again.
ur: اس اشاعت کو غیر معنوی نہیں کیا جاسکتا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Settings
ur: ترتیبات

source: Please enter a problem location.
ur: براہ کرم ایک دشواری کا مقام درج کریں.

source: Date added
ur: تاریخ شامل

source: Sign in to continue learning as {email}
ur: {ای میل} کے طور پر سیکھنے جاری رکھنے کیلئے سائن ان کریں

source: Remove this team member?
ur: اس ٹیم کے رکن کو ہٹا دیں؟

source: Last Activity %(date)s
ur: آخری سرگرمی٪ (تاریخ) s

source: Section Visibility
ur: سیکشن کی نمائش

source: Your policy changes have been saved.
ur: آپ کی پالیسی میں تبدیلیوں کو بچایا گیا ہے.

source: Instructor Biography
ur: انسٹریکٹر بانی

source: Supported
ur: حمایت کی

source: Are you sure you want to delete this update?
ur: کیا آپ واقعی یہ اپ ڈیٹ حذف کرنا چاہتے ہیں؟

source: Upload is in progress. To avoid errors, stay on this page until the process is complete.
ur: اپ لوڈ جاری ہے. غلطیوں سے بچنے کے لئے، اس صفحے پر رہیں جب تک کہ عمل مکمل ہوجائے.

source: Learners are added to this cohort automatically.
ur: اساتذہ خود کار طریقے سے شامل کردیئے جاتے ہیں.

source: No Webcam Detected
ur: کوئی ویب پتہ نہیں پتہ

source: Upload New File
ur: نئی فائل اپ لوڈ کریں

source: Confirm Timed Transcript
ur: ٹائم ٹرانزیکشن کی توثیق کریں

source: User Email
ur: صارف ای میل

source: (optional)
ur: (اختیاری)

source: Professional Education
ur: پیشہ ورانہ تعلیم

source: You haven't added any content to this course yet.
ur: آپ ابھی تک اس کورس میں کسی بھی مواد کو شامل نہیں کیا ہے.

source: Sign in with Institution/Campus Credentials
ur: ادارے / کیمپس کے اعتبار سے سائن ان کریں

source: {label}: {status}
ur: {لیبل}: {حیثیت}

source: {numPresent} learner was already in the cohort
ur: {numPresent} سیکھنے پہلے ہی کوہوٹر میں تھا

source: Make sure your face is well-lit
ur: یقینی بنائیں کہ آپ کا چہرہ اچھی طرح سے روشن ہے

source: with %(release_date_from)s
ur: ٪ (release_date_from) کے ساتھ

source: File upload succeeded
ur: فائل اپ لوڈ کامیاب ہوگئی

source: Closed
ur: بند

source: Review Your Photos
ur: اپنی تصاویر کا جائزہ لیں

source: We have received your information and are verifying your identity. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days). In the meantime, you can still access all available course content.
ur: ہمیں آپ کی معلومات ملی ہے اور اپنی شناخت کی تصدیق کر رہے ہیں. جب آپ تصدیق شدہ عمل مکمل ہوجاتا ہے تو آپ اپنے ڈیش بورڈ پر ایک پیغام دیکھیں گے (عام طور پر 1-2 دن کے اندر اندر). اس دوران، آپ اب بھی دستیاب دستیاب کورس کے مواد تک رسائی حاصل کرسکتے ہیں.

source: Remove link
ur: لنک ہٹا دیں

source: Blocks
ur: بلاکس

source: Financial Assistance Application
ur: مالی معاونت کی درخواست

source: An error occurred. Please try again.
ur: ایک خرابی آگئی. دوبارہ کوشش کریں.

source: (required)
ur: (ضرورت)

source: Are you sure you want to unenroll from the verified %(certNameLong)s track of %(courseName)s (%(courseNumber)s)?
ur: کیا آپ واقعی٪ (courseName) s (٪ (کورس نمبر) کی تصدیق شدہ٪ (certNameLong) کے ٹریک سے انعقاد کرنا چاہتے ہیں؟

source: Groups
ur: گروپ

source: Already have an {platformName} account?
ur: پہلے سے ہی {platformName} اکاؤنٹ ہے؟

source: Please address the errors on this page first, and then save your progress.
ur: براہ کرم سب سے پہلے اس صفحے پر غلطیوں کو ایڈریس کریں، اور پھر اپنی پیش رفت کو محفوظ کریں.

source: No color
ur: کوئی رنگ نہیں

source: You can pay now even if you don't have the following items available, but you will need to have these by {date} to qualify to earn a Verified Certificate.
ur: آپ اب ادائیگی کر سکتے ہیں یہاں تک کہ اگر آپ کے پاس مندرجہ ذیل آئٹم موجود نہیں ہیں، لیکن آپ کو {تصدیق شدہ} سند حاصل کرنے کے لۓ {تاریخ} کی طرف سے ان کو حاصل کرنے کی ضرورت ہوگی.

source: Open/download this file
ur: اس فائل کو کھولیں / ڈاؤن لوڈ کریں

source: Video position. Press space to toggle playback
ur: ویڈیو پوزیشن. پلے بیک ٹول بار کو جگہ پر دبائیں

source: We use the highest levels of security available to encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
ur: ہم آپ کی تصویر کو خفیہ کاری کرنے کے لۓ دستیاب ترین سلامتی کے اعلی درجے کا استعمال کرتے ہیں اور جائزہ لینے کے لئے اپنی اجازت سروس میں بھیجتے ہیں. آپ کی تصویر اور معلومات کو تصدیق شدہ عمل مکمل ہونے کے بعد٪ (پلیٹ فارم نام) کی جانب سے کہیں بھی محفوظ نہیں ہے یا کہیں بھی نظر آتا ہے.

source: #Replies
ur: # اطلاق

source: Maximum file size: {maxFileSize} GB
ur: زیادہ سے زیادہ فائل کا سائز: {maxFileSize} GB

source: Default (Local Time Zone)
ur: پہلے سے طے شدہ (مقامی ٹائم زون)

source: Hide Annotations
ur: تشریح چھپائیں

source: Follow
ur: پیروی

source: Yes, allow edits to the active Certificate
ur: ہاں، فعال سرٹیفکیٹ میں ترمیم کی اجازت دیتے ہیں

source: The post you selected has been deleted.
ur: آپ کی منتخب کردہ پوسٹ حذف کردی گئی ہے.

source: Please enter your email address below and we will send you instructions for setting a new password.
ur: براہ کرم ذیل میں اپنا ای میل پتہ درج کریں اور ہم ایک نیا پاس ورڈ ترتیب دینے کے لئے آپ کو ہدایات بھیجیں گے.

source: Course is not yet visible to students.
ur: کورس ابھی طلبا کو نظر انداز نہیں کر رہا ہے.

source: Lower Roman
ur: لوئر رومن

source: Enter information to describe your team. You cannot change these details after you create the team.
ur: اپنی ٹیم کی وضاحت کرنے کے لئے معلومات درج کریں. ٹیم بنانے کے بعد آپ ان تفصیلات کو تبدیل نہیں کرسکتے ہیں.

source: HTML source code
ur: HTML ماخذ کوڈ

source: Correct failed component
ur: درست ناکام جزو

source: Making Visible to Students
ur: طلباء کو دیکھنے کے لئے

source: Add a Response
ur: ایک جواب شامل کریں

source: Error:
ur: غلطی:

source: Unpublished units will not be released
ur: غیر شائع شدہ یونٹس جاری نہیں کیے جائیں گے

source: Return to Your Dashboard
ur: اپنے ڈیش بورڈ پر واپس جائیں

source: You need a computer that has a webcam. When you receive a browser prompt, make sure that you allow access to the camera.
ur: آپ کو ایک کمپیوٹر کی ضرورت ہے جس میں ویب کیم ہے. جب آپ براؤزر کے فوری طور پر وصول کرتے ہیں، تو یقینی بنائیں کہ آپ کو کیمرے تک رسائی کی اجازت دیتی ہے.

source: How to use %(platform_name)s discussions
ur: ٪ (platform_name) کی بات چیت کا استعمال کیسے کریں

source: The file must be smaller than {size} in size.
ur: فائل سائز میں {سائز} سے چھوٹا ہونا چاہئے.

source: View %(span_start)s %(team_name)s %(span_end)s
ur: ٪ (span_start) s٪ (team_name) s٪ (span_end) s دیکھیں

source: Page number out of %(total_pages)s
ur: سے باہر نمبر نمبر (total_pages) s

source: The language used throughout this site. This site is currently available in a limited number of languages. Changing the value of this field will cause the page to refresh.
ur: اس سائٹ میں پوری طرح استعمال کی زبان. یہ سائٹ فی الحال محدود زبانوں میں دستیاب ہے. اس فیلڈ کی قیمت کو تبدیل کرنا صفحہ کو تازہ کرنے کی وجہ سے کرے گا.

source: You don't seem to have Flash installed. Get Flash to continue your verification.
ur: آپ کو فلیش انسٹال نہیں لگتا ہے. اپنی تصدیق جاری رکھنے کیلئے فلیش حاصل کریں.

source: Successfully enrolled and sent email to the following users:
ur: درج ذیل صارفین کو کامیابی سے اندراج کرکے ای میل بھیج دیا:

source: The following email addresses and/or usernames are invalid:
ur: مندرجہ ذیل ای میل ایڈریس اور / یا صارف نام غلط ہیں:

source: We couldn't sign you in.
ur: ہم آپ کو نشانہ نہیں بنا سکتے.

source: Move cancelled. "{sourceDisplayName}" has been moved back to its original location.
ur: منسوخ کر دیا گیا &quot;{sourceDisplayName}&quot; کو اپنے اصل مقام پر واپس منتقل کردیا گیا ہے.

source: Staff Only
ur: اسٹاف صرف

source: Table
ur: ٹیبل

source: Add a Chapter
ur: ایک باب شامل کریں

source: Errors
ur: غلطیاں

source: Associated Content Group
ur: ایسوسی ایشن مواد گروپ

source: Message:
ur: پیغام:

source: All Posts
ur: تمام مراسلہ

source: Annotation Text
ur: تشریح متن

source: Grade
ur: گریڈ

source: Please provide a valid URL.
ur: براہ مہربانی ایک درست URL فراہم کریں.

source: Collapse Instructions
ur: بند کریں ہدایات

source: Delete row
ur: قطار حذف کریں

source: Profile Image
ur: پروفائل کی تصویر

source: Showing results for "{searchString}"
ur: &quot;{SearchString}&quot; کیلئے نتائج دکھا رہا ہے

source: Delete this %(item_display_name)s?
ur: یہ٪ (item_display_name) s حذف کریں؟

source: Select a cohort
ur: کوورٹ منتخب کریں

source: There was an error during the upload process.
ur: اپ لوڈ کی کارروائی کے دوران ایک خرابی تھی.

source: Allowance Value
ur: الاؤنس ویلیو

source: Error.
ur: غلطی

source: Report abuse
ur: اطلاع دیں

source: Bookmark this page
ur: اس صفحہ پر نشانی لگائیں

source: {email} is already on the {container} team. Recheck the email address if you want to add a new member.
ur: {ای میل} پہلے ہی {کنٹینر} ٹیم پر ہے. اگر آپ نیا رکن شامل کرنا چاہتے ہیں تو ای میل پتہ دوبارہ دیکھیں.

source: Chapter {order}
ur: باب {حکم}

source: Selected tab
ur: منتخب کردہ ٹیب

source: You have done a dry run of force publishing the course. Nothing has changed. Had you run it, the following course versions would have been change.
ur: آپ نے کورس کو شائع کرنے والے طاقت کا خشک حصہ کیا ہے. کچھ بھی نہیں بدل گیا. اگر تم اسے چلاتے ہو تو، مندرجہ ذیل کورس کے ورژن تبدیل ہوجائیں گے.

source: Instructor Photo URL
ur: انسٹریکٹر تصویر یو آر ایل

source: unsubmitted
ur: غیر متوقع

source: Organization of the signatory
ur: دستخط کی تنظیم

source: The course start date must be later than the enrollment start date.
ur: کورس کی شروعات کی تاریخ میں اندراج شروع کی تاریخ کے بعد ہونا ضروری ہے.

source: Embed
ur: ایمبیڈ کریں

source: {numResponses} other response
ur: {numResponses} دوسرے جواب

source: When learners submit an answer to an assessment, they immediately see whether the answer is correct or incorrect, and the score received.
ur: جب سیکھنے والے نے تشخیص کے جواب میں جواب دیا تو، وہ فوری طور پر دیکھتے ہیں کہ آیا جواب صحیح یا غلط ہے، اور سکور وصول کی گئی ہے.

source: Get Credit
ur: کریڈٹ حاصل کریں

source: This {parentCategory} has no {childCategory}
ur: یہ {والدین زمرہ} میں {childCategory} نہیں ہے

source: Delete File Confirmation
ur: فائل کی توثیق حذف کریں

source: Horizontal Rule (Ctrl+R)
ur: افقی اصول (Ctrl + R)

source: Incorrect url format.
ur: غلط url کی شکل.

source: : video upload complete.
ur: ویڈیو ویڈیو اپ لوڈ مکمل

source: Topic
ur: موضوع

source: Align center
ur: مرکز سیدھ کریں

source: Successfully rescored problem to improve score for user {user}
ur: صارف {صارف} کیلئے سکور کو بہتر بنانے کے لئے کامیابی سے کامیابی سے بچایا

source: Clear Value
ur: واضح قدر

source: Time Zone
ur: ٹائم زون

source: Verified Certificate for {courseName}
ur: {courseName} کیلئے تصدیق شدہ سرٹیفکیٹ

source: Divided
ur: تقسیم

source: Valid
ur: درست

source: Italic
ur: اٹلی

source: An error has occurred. Please try reloading the page.
ur: ایک خرابی آگئی ہے. صفحہ دوبارہ لوڈ کرنے کی کوشش کریں.

source: Click to add a new %(xblock_type)s
ur: نیا ((xblock_type) s نیا شامل کرنے کے لئے کلک کریں

source: No results
ur: کوئی نتیجہ نہیں

source: Users must create and activate their account before they can be promoted to beta tester.
ur: صارفین کو بٹا ٹیسٹر پر فروغ دینے سے پہلے ان کے اکاؤنٹ کو تخلیق کرنا اور چالو کرنا ضروری ہے.

source: Task Status
ur: ٹاسک اسٹیٹ

source: Course Number
ur: کورس نمبر

source: We have encountered an error. Refresh your browser and then try again.
ur: ہم نے ایک غلطی کا سامنا کیا ہے. اپنا براؤزر ریفریش کریں اور پھر دوبارہ کوشش کریں.

source: Enter the name of the cohort
ur: کوورٹ کے نام درج کریں

source: Introduction to Cookie Baking
ur: کوکی بیکنگ کا تعارف

source: The country or region where you live.
ur: ملک یا علاقے جہاں آپ رہتے ہیں.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
ur: طالب علم کا صارف نام / ای میل فیلڈ کی ضرورت ہے اور خالی نہیں ہوسکتی ہے. برائے مہربانی صارف کا نام / ای میل بھریں اور پھر &quot;غیر قانونی سرٹیفکیٹ&quot; کے بٹن کو دبائیں.

source: Billed to
ur: سے بل

source: Filter and sort topics
ur: فلٹر اور موضوعات کو ترتیب دیں

source: These users were successfully added as beta testers:
ur: یہ صارفین بیٹا ٹیسرز کے طور پر کامیابی سے شامل کیے گئے ہیں:

source: record is not in correct format and not added to the exception list
ur: ریکارڈ صحیح شکل میں نہیں ہے اور استثنا کی فہرست میں شامل نہیں ہے

source: {total_results} result
ur: {total_results} نتیجہ

source: Successfully overrode problem score for {user}
ur: کامیابی کے ساتھ {صارف} کے لئے مسئلہ اسکور ختم

source: Profile Visibility:
ur: پروفائل کی نمائش:

source: There is no email history for this course.
ur: اس کورس کے لئے کوئی ای میل کی تاریخ نہیں ہے.

source: This response could not be marked as endorsed. Refresh the page and try again.
ur: اس جواب کو منظور کیا جاسکتا ہے. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Image
ur: تصویر

source: API Secret
ur: API خفیہ

source: Your request could not be completed due to a server problem. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ur: سرور کی دشواری کی وجہ سے آپ کی درخواست مکمل نہیں کی جا سکتی. صفحہ دوبارہ لوڈ کریں اور دوبارہ کوشش کریں. اگر مسئلہ جاری ہے تو، مسئلہ کی اطلاع کے لئے مدد کے ٹیب پر کلک کریں.

source: Update Settings
ur: ترتیبات کو اپ ڈیٹ کریں

source: Check your email
ur: اپنا ای میل چیک کریں

source: Name of the groups that students will be assigned to, for example, Control, Video, Problems. You must have two or more groups.
ur: ایسے گروہوں کا نام جس کے طالب علم کو تفویض کیا جائے گا، مثال کے طور پر، کنٹرول، ویڈیو، مسائل. آپ کے پاس دو یا زیادہ گروپ ہونا ضروری ہے.

source: {sessionDates} (Open until {enrollmentEnd})
ur: {سیشن ڈییٹس} (تک کھولیں {اندراج اورینڈ)

source: Alternative source
ur: متبادل ذریعہ

source: Upgrade All Remaining Courses (
ur: باقی باقی کورسز کو اپ گریڈ کریں (

source: Cut
ur: کٹ

source: This thread is closed.
ur: یہ دھاگہ بند ہے.

source: (Self-paced) Ends {end}
ur: (خود پیڈ) اختتام {اختتام}

source: Add Cohort
ur: کوہوٹ شامل کریں

source: Team "{team}" successfully deleted.
ur: ٹیم &quot;{ٹیم}&quot; کو کامیابی سے خارج کر دیا گیا.

source: Order Details
ur: آرڈر کی تفصیلات

source: Enter the enrollment code.
ur: داخلہ کوڈ داخل کریں.

source: How to create useful text alternatives.
ur: مفید ٹیکسٹ متبادل کیسے بنائیں.

source: Username or email address
ur: استعمال کنندہ کا نام یا ای میل پتہ

source: Discard Changes
ur: تبدیلیاں مسترد کریں

source: Loading your courses
ur: اپنے کورسز لوڈ کر رہے ہیں

source: Create Re-run
ur: دوبارہ چلائیں

source: Proctored exams are timed and they record video of each learner taking the exam. The videos are then reviewed to ensure that learners follow all examination rules.
ur: پروکارڈ امتحان ٹائم کیے جاتے ہیں اور وہ ہر سیکرٹری کا ویڈیو امتحان لے کر ریکارڈ کرتے ہیں. اس ویڈیو کو پھر اس بات کا جائزہ لیا گیا ہے کہ سیکھنے والے تمام امتحان کے قواعد پر عمل کریں.

source: Undo Changes
ur: تبدیلیوں کو واپس لائیں

source: Column
ur: کالم

source: Started {start}
ur: شروع ہوا {آغاز}

source: Cancel team creating.
ur: ٹیم بنانا منسوخ کریں.

source: Is your name on your ID readable?
ur: کیا آپ کا نام آپ کے ID پر پڑھا جا سکتا ہے؟

source: Please enter a valid password
ur: برائے مہربانی صحیح پاسورڈ درج کریں

source: Open Calculator
ur: کھولیں کیلکولیٹر

source: Click OK to have your username and e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ur: تیسری پارٹی کی درخواست پر اپنا صارف نام اور ای میل ایڈریس بھیجنے کے لئے ٹھیک پر کلک کریں. اپنی معلومات کو بھیجنے کے بغیر اس صفحے پر واپس آنے کیلئے منسوخ کریں پر کلک کریں.

source: Left
ur: بائیں

source: Error resetting entrance exam attempts for student '{student_id}'. Make sure student identifier is correct.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ امتحان کی کوششوں کو دوبارہ ترتیب دینے میں خرابی. یقینی بنائیں کہ طالب علم کی شناخت درست ہے.
