Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Learners see the published subsection and can access its content.
ur: سیکھنے والے شائع سبسکرائب ہوتے ہیں اور اس کے مواد تک رسائی حاصل کرسکتے ہیں.

source: content group
ur: مواد گروپ

source: Error removing user
ur: صارف کو ہٹانے میں خرابی

source: There was an error changing the user's role
ur: صارف کا کردار تبدیل کرنے میں ایک خرابی تھی

source: Only properly formatted .csv files will be accepted.
ur: صرف مناسب طریقے سے فارمیٹ کردہ .csv فائلوں کو قبول کیا جائے گا.

source: Could not find a user with username or email address '<%- identifier %>'.
ur: صارف نام یا ای میل پتہ کے ساتھ صارف کو نہیں مل سکا &lt;٪ - شناخت کنندہ٪&gt; &#39;.

source: Processing Re-run Request
ur: دوبارہ چلانے کی درخواست پر عملدرآمد

source: Organization Name
ur: تنظیم کا نام

source: Activating a link in this group will skip to the corresponding point in the video.
ur: اس گروپ میں ایک لنک چالو کرنے میں ویڈیو میں اسی نقطہ پر جائیں گے.

source: Not divided
ur: تقسیم نہیں

source: Cell properties
ur: سیل کی خصوصیات

source: Edit Your Name
ur: اپنے نام میں ترمیم کریں

source: Please enter a term in the {anchorStart} search field{anchorEnd}.
ur: براہ کرم {لنگر اسٹارٹ} تلاش فیلڈ {لنگر اور} میں اصطلاح درج کریں.

source: Student
ur: طالب علم

source: %(num_questions)s question
ur: ٪ (num_questions) کے سوال

source: All learners who are enrolled in this course
ur: تمام اساتذہ جو اس کورس میں داخل ہوئے ہیں

source: Align left
ur: بائیں سیدھا

source: Select a cohort to manage
ur: انتظام کرنے کے لئے ایک ہیور کا انتخاب کریں

source: No transcript uploaded.
ur: کوئی ٹرانکرپٹ اپ لوڈ نہیں

source: Gender
ur: صنف

source: Explore your course!
ur: اپنے کورس کا پتہ لگائیں!

source: Coming Soon
ur: جلد آ رہا ہے

source: All learners in the {cohort_name} cohort
ur: {cohort_name} کوہور میں تمام سیکھنے والے

source: The number of subsections in the course that contain problems of this assignment type.
ur: اس تفہیم کی قسم میں شامل ہونے والے نصاب کی تعداد.

source: Limited Profile
ur: محدود پروفائل

source: Duration (sec)
ur: دورانیہ (سیکنڈ)

source: {filename} is not in a supported file format. Supported file formats are {supportedFileFormats}.
ur: {فائل نام} ایک معاون فائل کی شکل میں نہیں ہے. معاون فائل فارمیٹس {حمایت شدہ فہرست} ہیں.

source: Hiding from Students
ur: طلباء سے چھپا

source: OpenAssessment Save Error
ur: اوپن ایسوسی ایشن محفوظ کریں

source: If you use the Advanced Editor, this problem will be converted to XML and you will not be able to return to the Simple Editor Interface. Proceed to the Advanced Editor and convert this problem to XML?
ur: اگر آپ اعلی درجے کی ایڈیٹر کا استعمال کرتے ہیں تو، یہ مسئلہ ایکس ایم ایل میں تبدیل ہوجائے گا اور آپ سادہ ایڈیٹر انٹرفیس پر واپس نہیں آئیں گے. اعلی درجے کی ایڈیٹر پر آگے بڑھیں اور اس مسئلہ کو XML میں تبدیل کریں؟

source: %(earned)s/%(possible)s point (graded)
ur: ٪ (حاصل کردہ) s /٪ (ممکنہ) کے نقطہ (درجہ بندی)

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ur: طالب علم کا صارف نام / ای میل فیلڈ کی ضرورت ہے اور خالی نہیں ہوسکتی ہے. برائے مہربانی صارف نام / ای میل درج کریں اور پھر &quot;استثنائی فہرست میں شامل کریں&quot; کے بٹن کو دبائیں.

source: Enrolled
ur: اندراج

source: Does the photo of you match your ID photo?
ur: کیا آپ کی تصویر آپ کی شناختی تصویر سے ملتی ہے؟

source: Drag and drop or {spanStart}browse your computer{spanEnd}.
ur: ڈریگ اور ڈراپ یا {spanStart} اپنے کمپیوٹر کو براؤز کریں {spanEnd}.

source: Account Settings page.
ur: اکاؤنٹ کی ترتیبات کا صفحہ.

source: Joined Date
ur: تاریخ میں شامل

source: %(type)s Component Template Menu
ur: ٪ (قسم) کے اجزاء سانچہ مینو

source: Number Sent
ur: نمبر بھیج دیا

source: Error listing task history for this student and problem.
ur: اس طالب علم اور مسئلہ کیلئے کام کی تاریخ کی فہرست میں خرابی.

source: You have been logged out of your edX account. Click Okay to log in again now. Click Cancel to stay on this page (you must log in again to save your work).
ur: آپ اپنے EDX اکاؤنٹ سے باہر گئے ہیں. اب دوبارہ لاگ ان کرنے کے لئے ٹھیک ہے پر کلک کریں. اس صفحے پر رہنے کیلئے منسوخ کریں پر کلک کریں (آپ کو اپنے کام کو بچانے کیلئے دوبارہ لاگ ان کرنا ضروری ہے).

source: Automated Transcripts
ur: خودکار ٹرانزیکٹس

source: Not available
ur: دستیاب نہیں ہے

source: Link
ur: لنک

source: Add URLs for additional versions
ur: اضافی ورژن کیلئے یو آر ایل شامل کریں

source: Rich Text Area. Press ALT-F9 for menu. Press ALT-F10 for toolbar. Press ALT-0 for help
ur: امیر متن ایریا. مینو کے لئے ALT-F9 دبائیں. ٹول بار کے لئے ALT-F10 دبائیں. مدد کے لئے ALT-0 دبائیں

source: Name of the signatory
ur: دستخط کا نام

source: Retake Your Photos
ur: اپنی تصاویر حاصل کریں

source: The enrollment start date cannot be after the enrollment end date.
ur: اندراج شروع ہونے والی تاریخ اندراج کے اختتام کی تاریخ کے بعد نہیں ہوسکتی ہے.

source: Learning Outcome
ur: سیکھنے کا نتیجہ

source: Allow others to copy, distribute, display and perform only verbatim copies of your work, not derivative works based upon it. This option is incompatible with "Share Alike".
ur: دوسروں کو اپنے کام کے صرف verbatim کاپیاں کاپی کرنے، تقسیم، ڈسپلے اور انجام دینے کی اجازت دیتے ہیں، اس پر مبنی تناسب کام نہیں. یہ اختیار &quot;حصص الیکشن&quot; کے ساتھ مطابقت رکھتا ہے.

source: After the subsection\'s due date has passed, learners can no longer access its content. The subsection remains included in grade calculations.
ur: مجوزہ کی تاریخ کے بعد منظور ہونے کے بعد، سیکھنے والوں کو اس کے مواد تک رسائی حاصل نہیں ہوسکتی ہے. سبسینٹیشن گریڈ کی حساب میں شامل ہے.

source: Your import is in progress; navigating away will abort it.
ur: آپ کا درآمد جاری ہے دور کرنے کے لۓ اس کو منسوخ کرے گا.

source: Upload PDF
ur: پی ڈی ایف اپ لوڈ کریں

source: Use the All Topics menu to find specific topics.
ur: مخصوص موضوعات کو تلاش کرنے کے لئے تمام موضوعات مینو کا استعمال کریں.

source: Your message must have a subject.
ur: آپ کا پیغام ہونا ضروری ہے.

source: Zoom In
ur: زوم میں

source: Paste row before
ur: قطار قطار سے پہلے

source: Go to your Dashboard
ur: اپنے ڈیش بورڈ پر جائیں

source: Do not show again
ur: پھر سے مت دکھاو

source: {start_strong}{total}{end_strong} words submitted in total.
ur: {start_strong} {مجموعی} {end_strong} الفاظ مجموعی طور پر پیش کی ہیں.

source: Explain if other.
ur: دوسری وضاحت کرو.

source: Change Session
ur: سیشن تبدیل کریں

source: Loading content
ur: مواد لوڈ کر رہا ہے

source: You are sending an email message with the subject {subject} to the following recipients.
ur: آپ مندرجہ ذیل وصول کنندگان کو {موضوع} موضوع کے ساتھ ایک ای میل پیغام بھیج رہے ہیں.

source: About Me
ur: میرے بارے میں

source: The cohort cannot be saved
ur: کوورٹ محفوظ نہیں کیا جا سکتا

source: Explore Programs
ur: پروگراموں کا مطالعہ کریں

source: You must enter a valid email address in order to add a new team member
ur: نئے ٹیم کے ایک رکن کو شامل کرنے کیلئے آپ کو ایک درست ای میل ایڈریس درج کرنا ضروری ہے

source: Image upload failed.
ur: تصویری اپ لوڈ ناکام ہوگئی.

source: No content-specific discussion topics exist.
ur: کوئی مواد مخصوص بحث کے موضوعات موجود نہیں ہیں.

source: My Team
ur: میری ٹیم

source: Review Rules
ur: جائزہ کے قواعد

source: This course has automatic cohorting enabled for verified track learners, but the required cohort does not exist. You must create a manually-assigned cohort named '{verifiedCohortName}' for the feature to work.
ur: اس کورس میں تصدیق شدہ ٹریک سیکھنے کے لئے خود کار طریقے سے کوھرننگ فعال ہے، لیکن ضروری کوہور موجود نہیں ہے. آپ کو کام کرنے کیلئے خصوصیت کے لئے &#39;Verified_CohortName}&#39; نامی ایک دستی طور پر تفویض شدہ کوہور بنانا ہوگا.

source: delete group
ur: گروپ حذف کریں

source: Your file could not be uploaded
ur: آپ کی فائل اپ لوڈ نہیں کی جا سکتی

source: Order No.
ur: آرڈر نمبر

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} ascending
ur: {currentItemRange} سے باہر {totalItemsCount} دکھا رہا ہے، کے ذریعہ {sortName} آگے بڑھ رہا ہے

source: State
ur: حالت

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} ascending
ur: {currentItemRange} سے {totalItemsCount} میں دکھایا گیا ہے، {assetType} کے ذریعہ فلٹر کیا جاتا ہے، {sortName} کے اوپر چڑھایا جاتا ہے.

source: Insert link
ur: لنک ڈالیں

source: Sections
ur: حصوں

source: Cohorts
ur: کوہٹس

source: team count
ur: ٹیم کی گنتی

source: Email address
ur: ای میل اڈریس

source: Sign in.
ur: داخلہ.

source: Back to sign in
ur: سائن ان کرنے کے لئے واپس

source: HTML preview of post
ur: پوسٹ کے HTML پیش نظارہ

source: Verify Now
ur: اب تصدیق کریں

source: An error has occurred. Wait a few minutes, and then try again.
ur: ایک خرابی آگئی ہے. کچھ منٹ انتظار کرو، اور پھر دوبارہ کوشش کریں.

source: Error starting a task to reset attempts for all students on problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ur: &lt;٪ - problem_id٪&gt; &#39;پر تمام طالب علموں کے لئے کوششوں کو دوبارہ ترتیب دینے کیلئے ایک کام شروع کرنے میں خرابی. اس بات کو یقینی بنائیں کہ مسئلہ کی شناخت مکمل اور درست ہے.

source: New {component_type}
ur: نیا {component_type}

source: An error has occurred. Please try again later.
ur: ایک خرابی آگئی ہے. براہ کرم کچھ دیر بعد کوشش کریں.

source: Always divide content-specific discussion topics
ur: ہمیشہ مواد مخصوص بحث موضوعات تقسیم

source: In the {linkStart}Course Outline{linkEnd}, use this group to control access to a component.
ur: {linkstart} کورس آؤٹ لائن {linkEnd} میں، اس گروپ کا استعمال ایک اجزاء تک رسائی کو کنٹرول کرنے کے لئے.

source: Explore New Programs
ur: نئے پروگراموں کا مطالعہ کریں

source: Special character
ur: خصوصی کردار

source: ID-Verification is not required for this Professional Education course.
ur: اس پروفیشنل تعلیم کے کورس کیلئے ID-Verification کی ضرورت نہیں ہے.

source: Date Added
ur: تاریخ شامل

source: Additional Information
ur: اضافی معلومات

source: Access to this unit is restricted to: {selectedGroupsLabel}
ur: اس یونٹ تک رسائی محدود ہے: {منتخب گروپ گروپز}

source: Leave the current session and decide later
ur: موجودہ سیشن چھوڑ دو اور بعد میں فیصلہ کرو

source: Frequently Asked Questions
ur: اکثر پوچھے گئے سوالات

source: Change image
ur: تصویر تبدیل کریں

source: Error generating list of students who may enroll. Please try again.
ur: طالب علموں کو جو اندراج کر سکتا ہے پیدا کرنے میں خرابی. دوبارہ کوشش کریں.

source: Status
ur: حالت

source: answered question
ur: جواب دیا

source: Error getting entrance exam task history for student '{student_id}'. Make sure student identifier is correct.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ امتحان کے کام کی تاریخ میں خرابی. یقینی بنائیں کہ طالب علم کی شناخت درست ہے.

source: certificate
ur: سرٹیفیکیٹ

source: Collapse All
ur: سب کو ختم کرو

source: Membership
ur: رکنیت

source: Clear formatting
ur: فارمیٹنگ صاف کریں

source: Weekly Highlight Emails
ur: ہفتہ وار ای میلز کو نمایاں کریں

source: Press UP to enter the speed menu then use the UP and DOWN arrow keys to navigate the different speeds, then press ENTER to change to the selected speed.
ur: رفتار مینو میں داخل کرنے کے لئے UP پریس کریں تو مختلف رفتار کو نیویگیشن کرنے کے لئے یوپی اور نیچے تیر تیر کی چابیاں استعمال کریں، پھر ENTER کو منتخب کردہ رفتار میں تبدیل کرنے کیلئے دبائیں.

source: Please add the instructor's title
ur: براہ کرم انسٹریکٹر کا عنوان شامل کریں

source: Failed to rescore problem for user.
ur: صارف کے لئے مسئلہ دوبارہ تبدیل کرنے میں ناکام

source: This post could not be unflagged for abuse. Refresh the page and try again.
ur: اس پوسٹ کو بدعنوان کے لئے غیر منحصر نہیں کیا جا سکتا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Could not submit photos
ur: تصاویر جمع نہیں کر سکی

source: Current conversation
ur: موجودہ بات چیت

source: Error getting issued certificates list.
ur: سرٹیفکیٹس کی فہرست جاری کرنے میں خرابی.

source: Last Updated
ur: آخری اپ ڈیٹ

source: Invalidated
ur: غلط

source: about a year
ur: تقریبا ایک سال

source: Video
ur: ویڈیو

source: The team "{team}" could not be found.
ur: ٹیم &quot;{ٹیم}&quot; نہیں مل سکی.

source: and others
ur: اور دوسرے

source: learner is already white listed and not added to the exception list
ur: سکونر پہلے ہی سفید فہرست درج ہے اور استثنا کی فہرست میں شامل نہیں ہے

source: Video speed:
ur: ویڈیو کی رفتار:

source: and
ur: اور

source: Divide the selected content-specific discussion topics
ur: منتخب کردہ متخصص بحث بحث موضوعات تقسیم کریں

source: Sent To:
ur: کو بھیجا:

source: Pinned
ur: پینل

source: Decrease indent
ur: اندراج کم کریں

source: Required field.
ur: مطلوب خانہ.

source: Want to confirm your identity later?
ur: بعد میں اپنی شناخت کی تصدیق کرنا چاہتے ہیں؟

source: Bold (Ctrl+B)
ur: بولڈ (Ctrl + B)

source: Upload completed
ur: اپ لوڈ مکمل

source: Your upload of '{file}' failed.
ur: &#39;{فائل}&#39; کا اپ لوڈ ناکام ہوگیا.

source: Showing {firstIndex}-{lastIndex} out of {numItems} total
ur: {firstIndex} - {lastIndex} دکھا رہا ہے {numItems} کل سے

source: Enter a username or email.
ur: ایک صارف کا نام یا ای میل داخل کریں.

source: Select language
ur: زبان منتخب کریں

source: Turn on closed captioning
ur: بند کیپشننگ کو بند کریں

source: Upload Videos
ur: ویڈیو اپ لوڈ کریں

source: Words: {0}
ur: الفاظ: {0}

source: You have already verified your ID!
ur: آپ نے پہلے ہی آپ کی شناخت کی تصدیق کی ہے!

source: To share your certificate on Mozilla Backpack, you must first have a Backpack account. Complete the following steps to add your certificate to Backpack.
ur: موزیلالا بیگ پر اپنے سرٹیفکیٹ کا اشتراک کرنے کے لئے، آپ کو سب سے پہلے ایک بیگ اکاؤنٹ ہونا ضروری ہے. اپنے سرٹیفکیٹ بیک اپ پر شامل کرنے کیلئے مندرجہ ذیل اقدامات مکمل کریں.

source: Please check the following validation feedbacks and reflect them in your course settings:
ur: براہ کرم مندرجہ ذیل توثیق کی رائے کی جانچ پڑتال کریں اور اپنے کورس کی ترتیبات میں ان کی عکاسی کریں.

source: Any course progress or grades from your current session will be lost.
ur: آپ کے موجودہ سیشن سے کوئی بھی کورس پیش رفت یا گریڈ کھو جائے گی.

source: Activate
ur: چالو کریں

source: EdX doesn\'t have a timed transcript for this video. Please upload an .srt file.
ur: اس ویڈیو کے لئے ایڈیکس کو ٹائڈ ٹریک نہیں ہے. براہ کرم ایک ایس ایس آر فائل اپ لوڈ کریں.

source: Unreport
ur: غیر حاضر

source: No Timed Transcript
ur: ٹائم ٹرانزیکشن نہیں

source: Middle
ur: مشرق

source: Library User
ur: لائبریری صارف

source: Invalidated By
ur: کی طرف سے غلط

source: Forgot password?
ur: پاسورڈ بھول گے؟

source: open slots
ur: کھلی سلاٹ

source: Your browser doesn't support direct access to the clipboard. Please use the Ctrl+X/C/V keyboard shortcuts instead.
ur: آپ کا براؤزر کلپ بورڈ پر براہ راست رسائی کی حمایت نہیں کرتا. اس کے بجائے براہ کرم Ctrl + X / C / V کی بورڈ شارٹس کا استعمال کریں.

source: Timed Transcript from %(filename)s
ur: ٪ (فائل نام) s سے ٹائم شدہ ٹرانسمیشن

source: No prerequisite
ur: کوئی شرط نہیں

source: Course Key
ur: کورس کلیدی

source: Could not find Certificate Invalidation in the list. Please refresh the page and try again
ur: فہرست میں سرٹیفکیٹ کی خرابی نہیں مل سکی. صفحہ کو تازہ کریں اور دوبارہ کوشش کریں

source: Active Uploads
ur: فعال اپ لوڈ

source: Constrain proportions
ur: تناسب میں اضافہ

source: Textbook name is required
ur: متن کتاب کا نام ضروری ہے

source: Unit Visibility
ur: یونٹ کی نمائش

source: Select the time zone for displaying course dates. If you do not specify a time zone, course dates, including assignment deadlines, will be displayed in your browser's local time zone.
ur: کورس کی تاریخوں کو ظاہر کرنے کے لئے وقت کا زون منتخب کریں. اگر آپ ایک ٹائم زون، کورس کی تاریخ، تفویض کی آخری تاریخ بھی شامل نہیں کرتے ہیں، تو آپ کے براؤزر کے مقامی ٹائم زون میں پیش کیا جائے گا.

source: Subsection is hidden after course end date
ur: کورس ختم ہونے کی تاریخ کے بعد سبسکرائب چھپا ہے

source: Insert Image (upload file or type URL)
ur: تصویر داخل کریں (فائل اپ لوڈ کریں یا یو آر ایل کی قسم)

source: If the subsection does not have a due date, learners always see their scores when they submit answers to assessments.
ur: اگر سبسکرائب کی کوئی تاریخ نہیں ہے تو، سیکھنے والوں کو ہمیشہ ان کے سکور نظر آتے ہیں جب وہ جائزوں کے جواب میں پیش کرتے ہیں.

source: Body
ur: جسم

source: Certificate Status:
ur: سرٹیفکیٹ کی حیثیت:

source: An error occurred retrieving your email. Please try again later, and contact technical support if the problem persists.
ur: آپ کا ای میل دوبارہ حاصل کرنے میں ایک خرابی واقع ہوئی. براہ کرم بعد میں دوبارہ کوشش کریں، اور اگر یہ مسئلہ جاری رہتی ہے تو تکنیکی مدد سے رابطہ کریں.

source: %(field)s must have at least %(count)d characters.
ur: ٪ (فیلڈ) میں کم سے کم٪ (شمار) ڈی حروف ہونا لازمی ہے.

source: Course Handouts
ur: کورس ہینڈ آؤٹ

source: or create a new one here
ur: یا یہاں ایک نئی تخلیق کریں

source: More
ur: مزید

source: Release Date and Time
ur: رہائی کی تاریخ اور وقت

source: Due Date
ur: اخری تاریخ

source: Insert video
ur: ویڈیو داخل کریں

source: Pre
ur: کے لئے

source: Find previous
ur: پچھلا تلاش کریں

source: All Groups
ur: تمام گروپ

source: Duplicate
ur: ڈپلیکیٹ

source: last activity
ur: آخری سرگرمی

source: Hide entire subsection
ur: پوری سبسکرائب چھپائیں

source: Are you sure you want to unenroll from %(courseName)s (%(courseNumber)s)?
ur: کیا آپ واقعی٪ (courseName) s (٪ (کورس نمبر) ے سے غیر اندراج کرنا چاہتے ہیں؟

source: Crossed out items have been refunded.
ur: کراس آؤٹ شدہ اشیاء واپس کردیے گئے ہیں.

source: Course pacing cannot be changed once a course has started.
ur: ایک کورس شروع ہونے کے بعد کورس کی پڈنگ تبدیل نہیں کی جا سکتی.

source: Error generating student profile information. Please try again.
ur: طالب علم کی پروفائل کی معلومات پیدا کرنے میں خرابی. دوبارہ کوشش کریں.

source: Subject
ur: مضمون

source: Task ID
ur: ٹاسک ID

source: You need an ID with your name and photo. A driver's license, passport, or other government-issued IDs are all acceptable.
ur: آپ کے نام اور تصویر کے ساتھ ایک شناخت کی ضرورت ہے. ایک ڈرائیور کا لائسنس، پاسپورٹ، یا دیگر حکومت سے جاری کردہ شناخت سب قابل قبول ہیں.

source: Sorry, there was an error parsing the subtitles that you uploaded. Please check the format and try again.
ur: معذرت، آپ نے اپ لوڈ کردہ سب ٹائٹلز کو ایک غلطی پیش کی. براہ مہربانی فارمیٹ چیک کریں اور دوبارہ کوشش کریں.

source: Code block
ur: کوڈ بلاک

source: Next
ur: اگلے

source: Print
ur: پرنٹ کریں

source: Are you sure?
ur: کیا تمہیں یقین ہے؟

source: Enter team name.
ur: ٹیم کا نام درج کریں

source: It is strongly recommended that you include four or fewer signatories. If you include additional signatories, preview the certificate in Print View to ensure the certificate will print correctly on one page.
ur: یہ تاکید کی جاتی ہے کہ آپ میں چار یا کم دستخط شامل ہیں. اگر آپ اضافی دستخط شامل ہیں تو، پرنٹ دیکھیں میں سرٹیفکیٹ پیش کریں اس بات کا یقین کرنے کے لئے کہ ایک سرٹیفکیٹ درست طریقے سے ایک صفحہ پر پرنٹ کرے گا.

source: Product Name
ur: پروڈکٹ کا نام

source: Only <%= fileTypes %> files can be uploaded. Please select a file ending in <%= fileExtensions %> to upload.
ur: صرف &lt;٪ = فائل ٹائپز&gt;&gt; فائلیں اپ لوڈ کی جا سکتی ہیں. اپ لوڈ کرنے کیلئے براہ کرم فائل &lt;٪ = فائل ایکسچینج٪&gt; میں منتخب کریں.

source: course id
ur: کورس کی شناخت

source: Report abuse, topics, and responses
ur: بدعنوان، موضوعات، اور جوابات کی اطلاع دیں

source: Enrollment Tracks
ur: اندراج ٹریک

source: There has been an error processing your survey.
ur: آپ کے سروے کی تیاری میں ایک خرابی ہوئی ہے.

source: Caution: The last published version of this unit is live. By publishing changes you will change the student experience.
ur: احتیاط: اس یونٹ کے آخری شائع شدہ ورژن زندہ ہے. تبدیلیوں کو شائع کرکے آپ طالب علم کے تجربے کو تبدیل کردیں گے.

source: The data could not be saved.
ur: ڈیٹا محفوظ نہیں کیا جا سکا.

source: Access to some content in this {blockType} is restricted to specific groups of learners.
ur: اس {blockType} میں کچھ مواد تک رسائی تک رسائی کے مخصوص گروپوں تک محدود ہے.

source: These users were not removed as beta testers:
ur: یہ صارفین بیٹا ٹیسرز کے طور پر نہیں ہٹا دیا گیا تھا:

source: Topics
ur: عنوانات

source: Discussion admins, moderators, and TAs can make their posts visible to all students or specify a single group.
ur: بحث کے منتظمین، منتظمین، اور ٹی اے ایس اپنی اشاعتیں تمام طالب علموں کو نظر انداز کر سکتے ہیں یا ایک گروپ کی وضاحت کرسکتے ہیں.

source: Choose new file
ur: نئی فائل منتخب کریں

source: Expand All
ur: تمام توسیع کریں

source: More sessions coming soon.
ur: مزید سیشن جلد ہی آ رہے ہیں.

source: Error: Import failed.
ur: خرابی: درآمد ناکام ہوگئی.

source: timed
ur: ٹائمز

source: Explicitly Hiding from Students
ur: واضح طور پر طلباء سے چھپی ہوئی

source: Verification Deadline
ur: توثیق آخری وقت

source: The URL you entered seems to be an email address. Do you want to add the required mailto: prefix?
ur: آپ نے درج کردہ URL کو ایک ای میل پتہ لگتا ہے. کیا آپ لازمی میلٹو شامل کرنا چاہتے ہیں: سابقہ؟

source: Double-check that your webcam is connected and working to continue.
ur: ڈبل چیک کریں کہ آپ کا ویب کیم منسلک ہے اور جاری رکھنے کے لئے کام کر رہا ہے.

source: Pause
ur: روک دو

source: Restrict access to:
ur: تک رسائی محدود

source: Add a Post
ur: ایک پوسٹ شامل کریں

source: Cannot delete when in use by a unit
ur: ایک یونٹ کی طرف سے استعمال کرتے وقت حذف نہیں کر سکتے ہیں

source: No EdX Timed Transcript
ur: ایڈیکس ٹائم ٹرانسپٹ نہیں ہے

source: Password assistance
ur: پاس ورڈ کی مدد

source: Do you want to allow this student ('{student_id}') to skip the entrance exam?
ur: کیا آپ اس طالب علم (&#39;{student_id}&#39;) کو داخلہ امتحان چھوڑنے کی اجازت دیتے ہیں؟

source: Learners who require verification must pass the selected checkpoint to see the content in this unit. Learners who do not require verification see this content by default.
ur: اس شعبے میں مواد کو دیکھنے کے لۓ اس بات کی تصدیق کرنے والے طلباء کو منتخب چیک پوائنٹ پاس کرنا ہوگا. جو طلباء کی توثیق کی ضرورت نہیں ہے وہ اس مواد کو ڈیفالٹ کے ذریعہ دیکھتے ہیں.

source: Are you sure you want to restrict {email} access to “{container}”?
ur: کیا آپ واقعی {ای میل} تک رسائی حاصل کرنا چاہتے ہیں &quot;{کنٹینر}&quot; تک؟

source: Optional Characteristics
ur: اختیاری خصوصیات

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
ur: براہ مہربانی اس ریکارڈ کو اپنے ریکارڈ کے لئے پرنٹ کریں؛ یہ آپ کی رسید کے طور پر کام کرتا ہے. آپ کو اسی معلومات کے ساتھ بھی ایک ای میل مل جائے گا.

source: Horizontal line
ur: افقی خط

source: Terms of Service and Honor Code
ur: سروس کی شرائط اور اعزاز کوڈ

source: Exit full browser
ur: مکمل براؤزر سے باہر نکلیں

source: Deprecated
ur: ناپسندی

source: This action updates the {provider} information for your entire organization.
ur: یہ کارروائی آپ کے پورے ادارے کیلئے {فراہم کنندہ} کی معلومات کو اپ ڈیٹ کرتا ہے.

source: with %(section_or_subsection)s
ur: ٪ (section_or_subsection) کے ساتھ

source: Header 6
ur: ہیڈر 6

source: Header 5
ur: ہیڈر 5

source: Header 4
ur: ہیڈر 4

source: Header 3
ur: ہیڈر 3

source: Header 2
ur: ہیڈر 2

source: Header 1
ur: ہیڈر 1

source: Search teams
ur: تلاش ٹیمیں

source: Redo
ur: تیار

source: Rows
ur: رائٹس

source: Select a prerequisite subsection and enter a minimum score percentage to limit access to this subsection.
ur: اس سبسکرائب تک رسائی کو محدود کرنے کے لئے ایک لازمی سبسڈی منتخب کریں اور کم سے کم سکور فی صد درج کریں.

source: Other
ur: دیگر

source: Not able to set passing grade to less than %(minimum_grade_cutoff)s%.
ur: ٪ (minimum_grade_cutoff) s٪ سے کم گریڈ قائم کرنے کے قابل نہیں.

source: {numUsersAdded} learner has been added to this cohort.
ur: {num استعمال کرنے والے اشتھارات} سیکھنے اس کوہوٹر میں شامل کردیئے گئے ہیں.

source: You receive messages from {platform_name} and course teams at this address.
ur: آپ {platform_name} اور کورس کے ٹیموں سے اس پتے پر پیغامات وصول کرتے ہیں.

source: Access to some content in this unit is restricted to specific groups of learners
ur: اس یونٹ میں کچھ مواد تک رسائی سیکھنے والوں کے مخصوص گروپوں تک محدود ہے
