Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
ar: حدد الدورة التدريبية التي ترغب في الحصول على شهادة تم التحقق منها. إذا لم تظهر الدورة في القائمة ، فتأكد من أنك قمت بالتسجيل في مسار التدقيق الخاص بالدورة التدريبية.
ur: اس کورس کا انتخاب کریں جس کے لئے آپ تصدیق شدہ سرٹیفکیٹ حاصل کرنا چاہتے ہیں. اگر کورس میں اس فہرست میں شامل نہ ہو تو، اس بات کو یقینی بنائیں کہ کورس کے لئے آپ نے آڈٹ ٹریک میں داخلہ لیا ہے.
zh_cn: 选择您想要获得经过验证的证书的课程。如果课程未出现在列表中，请确保您已注册课程的审核跟踪。

source: Credit Eligibility
ar: أهلية الائتمان
ur: کریڈٹ اہلیت
zh_cn: 信用资格

source: Choose the graded unit:
ar: اختر الوحدة المتدرجة:
ur: درجہ بندی یونٹ منتخب کریں:
zh_cn: 选择分级单位：

source: You must be the coach for this ccx to access this view
ar: يجب أن تكون المدرب لهذا ccx للوصول إلى هذا العرض
ur: اس قول کو تک رسائی حاصل کرنے کے لئے آپ کو اس سی سی ایکس کے لئے کوچ ہونا ضروری ہے
zh_cn: 您必须是该ccx的教练才能访问此视图

source: View Course
ar: عرض الدورة التدريبية
ur: کورس دیکھیں
zh_cn: 查看课程

source: An error occurred with this transaction. For help, contact {support_email}.
ar: حدث خطأ في هذه المعاملة. للحصول على مساعدة ، اتصل بـ {support_email}.
ur: اس ٹرانزیکشن کے ساتھ ایک خرابی واقع ہوئی. مدد کے لئے، {support_email} سے رابطہ کریں.
zh_cn: 此事务发生错误。如需帮助，请联系{support_email}。

source: correct
ar: صيح
ur: درست
zh_cn: 正确

source: coupon id is None
ar: رقم القسيمة هو بلا
ur: کوپن کی شناخت نہیں ہے
zh_cn: 优惠券ID是无

source: Disable Student-Generated Certificates
ar: تعطيل الشهادات التي يولدها الطالب
ur: طالب علم کی تشکیل کردہ سرٹیفکیٹ کو غیر فعال کریں
zh_cn: 禁用学生生成的证书

source: Oauth client name of video pipeline service.
ar: اسم عميل Oauth لخدمة خط أنابيب الفيديو.
ur: ویڈیو پائپ لائن سروس کے Oauth کلائنٹ کا نام.
zh_cn: 视频管道服务的Oauth客户端名称。

source: URL path
ar: مسار عنوان URL
ur: یو آر ایل کا راستہ
zh_cn: 网址路径

source: A license defines how the contents of this block can be shared and reused.
ar: يحدد الترخيص كيفية مشاركة محتويات هذه الكتلة وإعادة استخدامها.
ur: ایک لائسنس اس بات کی وضاحت کرتا ہے کہ اس بلاک کا مواد کس طرح مشترکہ اور دوبارہ استعمال کیا جا سکتا ہے.
zh_cn: 许可证定义了该块的内容如何共享和重用。

source: Dear student,
ar: عزيزي الطالب،
ur: عزیز طالب علم،
zh_cn: 亲爱的学生，

source: Error running code.
ar: خطأ في تشغيل الرمز.
ur: کوڈ چلانے میں خرابی
zh_cn: 运行代码时出错。

source: Manage your data: {permission}
ar: إدارة بياناتك: {إذن}
ur: اپنے ڈیٹا کا نظم کریں: {اجازت}
zh_cn: 管理您的数据：{permission}

source: Not all problems in entrance exam support re-scoring.
ar: ليس كل المشاكل في امتحان الدخول دعم إعادة تسجيل الأهداف.
ur: داخلہ امتحان کی معاونت میں دوبارہ کوئی مسئلہ نہیں ہے.
zh_cn: 并非所有入学考试中的问题都需要重新评分。

source: Enter a username to view catalogs belonging to that user.
ar: أدخل اسم مستخدم لعرض كتالوجات تنتمي إلى هذا المستخدم.
ur: اس صارف سے متعلق کیٹلاگ دیکھنے کے لئے صارف کا نام درج کریں.
zh_cn: 输入用户名以查看属于该用户的目录。

source: Forum/discussion Data
ar: منتدى / مناقشة البيانات
ur: فورم / بحث کے اعداد و شمار
zh_cn: 论坛/讨论数据

source: The course information in the Course Administration tool.
ar: معلومات الدورة التدريبية في أداة إدارة الدورة التدريبية.
ur: کورس ایڈمنسٹریشن کے آلے میں کورس کی معلومات.
zh_cn: 课程管理工具中的课程信息。

source: Specify when to show answer correctness and score to learners. Valid values are "always", "never", and "past_due".
ar: حدد وقت إظهار إجابة الإجابة ودرجات للمتعلمين. القيم الصالحة هي &quot;always&quot; و &quot;never&quot; و &quot;past_due&quot;.
ur: جواب درستی دکھانے اور سیکھنے والوں کو سکور دینے کے لئے وضاحت کریں. درست اقدار &quot;ہمیشہ&quot;، &quot;کبھی نہیں&quot;، اور &quot;past_due&quot; ہیں.
zh_cn: 指定何时向学习者显示答案的正确性和得分。有效值是“始终”，“从不”和“过去的日期”。

source: Date Report Run
ar: تاريخ تقرير التشغيل
ur: تاریخ کی رپورٹ چلائیں
zh_cn: 日期报告运行

source: sign in
ar: تسجيل الدخول
ur: داخلہ
zh_cn: 签到

source: Video Uploads
ar: تحميلات الفيديو
ur: ویڈیو اپ لوڈ
zh_cn: 视频上传

source: Is Time Limited
ar: هو تايم المحدودة
ur: وقت محدود ہے
zh_cn: 时间有限

source: Warning: Importing while a course is running
ar: تحذير: الاستيراد أثناء تشغيل الدورة التدريبية
ur: انتباہ: ایک کورس کے دوران درآمد چل رہا ہے
zh_cn: 警告：课程正在运行时导入

source: An error occurred. Please try again later.
ar: حدث خطأ. الرجاء معاودة المحاولة في وقت لاحق.
ur: ایک خرابی آگئی. براہ کرم کچھ دیر بعد کوشش کریں.
zh_cn: 发生错误。请稍后再试。

source: {platform_name} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
ar: سيكون لدى {platform_name} الحق الوحيد في تحديد ما إذا كان أي استخدام من واجهات برمجة التطبيقات مقبولًا أم لا ، وتحتفظ {platform_name} بالحق في إلغاء دخول واجهة برمجة التطبيقات لأي استخدام يحدده {platform_name} في أي وقت ، وفقًا لتقديرها الخاص ، لا يفيد أو يخدم أفضل مصالح {platform_name} ومستخدميها وشركائها.
ur: {platform_name} کو یہ یقینی بنانے کا واحد حق ہوگا کہ API کے کسی بھی استعمال کو قابل قبول ہے یا {platform_name} کسی بھی استعمال کے لئے API رسائی کو منسوخ کرنے کا حق محفوظ رکھتا ہے جس میں {platform_name} کسی بھی وقت مقرر کرتا ہے، اس کی واحد صوابدیدی میں، {platform_name}، اس کے صارفین اور اس کے ساتھیوں کے بہترین مفادات کو فائدہ یا فائدہ نہیں دیتا.
zh_cn: {平台名称}应有唯一权利确定API的任何使用是否可接受，{平台名称}保留在任何时候全权酌情决定撤销对{平台名称}所确定的任何用途的API访问的权利，不会为{platform_name}，其用户及其合作伙伴带来最大利益或为其服务。

source: Recipient Email
ar: البريد الإلكتروني المستلم
ur: وصول کنندہ کا ای میل
zh_cn: 收件人电子邮件

source: Upload CSV
ar: تحميل ملف CSV
ur: CSV اپ لوڈ کریں
zh_cn: 上传CSV

source: Grade Requirements
ar: متطلبات الصف
ur: گریڈ کی ضروریات
zh_cn: 等级要求

source: A list summarizing what students should look forward to in this section.
ar: قائمة تلخص ما يجب أن يتطلع إليه الطلاب في هذا القسم.
ur: ایک ایسی فہرست کا خلاصہ کیا جا سکتا ہے جو طالب علم اس حصے میں نظر آتے ہیں.
zh_cn: 本部分列出了学生应该期待的内容。

source: Apr
ar: أبريل
ur: اپریل
zh_cn: 四月

source: To earn a certificate, you must complete all requirements before this date.
ar: للحصول على شهادة ، يجب عليك إكمال جميع المتطلبات قبل هذا التاريخ.
ur: ایک سرٹیفکیٹ حاصل کرنے کے لئے، آپ کو اس تاریخ سے پہلے تمام ضروریات کو مکمل کرنا ضروری ہے.
zh_cn: 要获得证书，您必须在此日期之前完成所有要求。

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
ar: بشكل خاص ، إلى أقصى حد يسمح به القانون المعمول به ، لا يوجد {platform_name} أي من الأعضاء {platform_name} سيكون هناك أي مسؤولية عن أي أضرار تبعية أو غير مباشرة أو عقابية أو خاصة أو عرضية أو عرضية ، سواء كانت مستحقة أو غير قابلة للتنفيذ ، سواء كانت NOT {platform_name} أو أي من {platform_name} المشاركون قد تم إهمالهم أو غير ذلك في الخطأ (بما في ذلك ، على سبيل المثال لا الحصر ، دعاوى الإخلال ، الأخطاء ، فقدان الأرباح ، فقدان البيانات أو انقطاع إتاحة البيانات).
ur: لازمی طور پر، قابل اطلاق قانون کی طرف سے مقرر کردہ وسیع پیمانے پر، بغیر {platform_name} کسی {پلیٹ فارم_ نام} کے علاوہ شراکت دار کسی بھی غیر قانونی، غیر قانونی، پائیدار، مخصوص، اختلاط یا غیر قانونی نقصانات کے لئے کسی بھی ذمہ داری نہیں، کسی بھی قابل قبول یا غیر ملکی اور کون ہے یا {platform_name} یا {platform_name} میں سے کوئی بھی شراکت داروں کو فالٹ میں نگراں یا دوسری صورت میں نہیں ملتا ہے (اس میں شامل نہیں، لیکن محدود نہیں، معالجہ کے لئے کلیدیات، نقصانات، نقصانات کے نقصانات، ڈیٹا کی دستیابی میں نقصان یا انفراسٹرکچر کے نقصانات).
zh_cn: 特别是，在适用法律允许的最大范围内，任何{platform_name}参与者都不会对任何相应的，间接的，惩罚性的，特殊的，惩戒性的或偶然性的损害负责，无论这些损害是可预见的还是不可预测的， NOT {platform_name}或任何{platform_name}参与者都有疏忽或其他错误（包括但不限于对诽谤，错误，利润损失，数据丢失或数据可用性中断的索赔）。

source: Create a section, then add subsections and units. Open a unit to add course components.
ar: أنشئ قسمًا ، ثم أضف أقسامًا فرعية ووحدات. افتح وحدة لإضافة مكونات الدورة التدريبية.
ur: ایک سیکشن بنائیں، پھر سبسکرائب کریں اور یونٹس شامل کریں. کورس اجزاء کو شامل کرنے کیلئے ایک یونٹ کھولیں.
zh_cn: 创建一个部分，然后添加小节和单位。打开一个单元来添加课程组件。

source: Download Student Grades as a CSV
ar: تنزيل درجات الطلاب كملف CSV
ur: CSV کے طور پر طالب علم گریڈ ڈاؤن لوڈ کریں
zh_cn: 下载学生成绩作为CSV

source: Code Editor
ar: محرر الكود
ur: کوڈ ایڈیٹر
zh_cn: 代码编辑器

source: Account Activation Info
ar: معلومات تنشيط الحساب
ur: اکاؤنٹ کی سرگرمی کی معلومات
zh_cn: 帐户激活信息

source: Unanswered posts
ar: المشاركات غير المجاب عنها
ur: جواب دیں
zh_cn: 未回复的帖子

source: Continue
ar: استمر
ur: جاری رہے
zh_cn: 继续

source: Whether this learner has posted words to the cloud.
ar: ما إذا كان هذا المتعلم قد قام بنشر كلمات إلى السحابة.
ur: چاہے اس سیکھنے نے بادل کو الفاظ پوسٹ کیا ہے.
zh_cn: 这个学习者是否已经向云发布了文字。

source: No git import logs have been recorded.
ar: لم يتم تسجيل سجلات استيراد git.
ur: کوئی گیٹ درآمد کی لاگت ریکارڈ نہیں کی گئی ہے.
zh_cn: 没有记录git导入日志。

source: An error has occurred with your payment. <b>You have not been charged.</b> Please try to submit your payment again. If this problem persists, contact {email}.
ar: حدث خطأ في دفعتك. <b>لم يتم تحصيل رسوم منك.</b> يرجى محاولة إرسال دفعتك مرة أخرى. إذا استمرت هذه المشكلة ، فاتصل بـ {email}.
ur: آپ کی ادائیگی کے ساتھ ایک خرابی ہوئی ہے. <b>آپ کو چارج نہیں کیا گیا ہے.</b> براہ کرم اپنی ادائیگی دوبارہ جمع کرنے کی کوشش کریں. اگر یہ مسئلہ جاری ہے تو، {ای میل} سے رابطہ کریں.
zh_cn: 您的付款出现错误。 <b>你没有被指控。</b>请尝试再次提交付款。如果问题仍然存在，请联系{电子邮件}。

source: Create Account
ar: إصنع حساب
ur: اکاؤنٹ بنائیں
zh_cn: 创建帐号

source: Number of enrollees (admins, staff, and students) by track
ar: عدد المسجلين (المشرفين والموظفين والطلاب) حسب المسار
ur: ٹریک کی طرف سے enrollees (ایڈمنز، عملہ، اور طالب علم) کی تعداد
zh_cn: 按轨道登记的人数（管理员，员工和学生）

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
ar: طلب المستخدم &quot;{user}&quot; بالبريد الإلكتروني {email} امتيازات منشئ محتوى الدورة التدريبية {studio_name}.
ur: صارف {{صارف} &#39;کے ساتھ ای میل {ای میل} نے کنارے پر {سٹوڈیو_ نام} کورس تخلیق کے استحکام کا مطالبہ کیا ہے.
zh_cn: 使用电子邮件{email}的用户“{user}”已请求{studio_name}课程创建者的权限。

source: Many %(platform_name)s learners are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: يكمل العديد من المتعلمين (platform_name) s المزيد من المشاكل كل أسبوع ، ويشاركوا في منتديات المناقشة. ماذا تريد أن تفعل للحفاظ على التعلم؟
ur: بہت سے٪ (پلیٹ فارم_ نام) سیکھنے والے ہر ہفتے زیادہ مسائل کو پورا کر رہے ہیں اور بحث کے فورمز میں شرکت کرتے ہیں. سیکھنا رکھنے کے لئے آپ کیا کرنا چاہتے ہیں؟
zh_cn: 许多％（platform_name）的学习者每周都会完成更多问题，并参与讨论论坛。你想做什么来继续学习？

source: {short_label} Avg
ar: {short_label} متوسط
ur: {مختصر_ابابیل} اوسط
zh_cn: {short_label}平均

source: Poll answers from xml
ar: استطلاعات الرأي من xml
ur: xml سے پول جواب
zh_cn: 民意调查从xml回答

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
ar: لا توجد استجابة من Xqueue خلال {xqueue_timeout} ثانية. أجهضت.
ur: {xqueue_timeout} سیکنڈ کے اندر Xqueue سے کوئی جواب نہیں. ختم ہوگیا
zh_cn: {xqueue_timeout}秒内没有来自Xqueue的响应。中止。

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ar: نظرًا لأن تاريخ الاستحقاق قد انقضى ، فإن هذا الواجب لم يعد متاحًا. {line_break} إذا كنت قد أكملت هذا الواجب ، فستكون درجةك متاحة على {link_start} صفحة التقدم {link_end}.
ur: کیونکہ تاریخ کی تاریخ منظور ہو چکی ہے، یہ تفویض اب دستیاب نہیں ہے. {line_break} اگر آپ نے اس تفویض کو مکمل کیا ہے تو، آپ کے گریڈ {link_start} ترقی کے صفحے {link_end} پر دستیاب ہے.
zh_cn: 由于截止日期已过，此作业已不再可用。{line_break}如果您已完成此作业，则您的成绩可在{link_start}进度页{link_end}中找到。

source: Visit {course_about_url} to join the course and begin the beta test.
ar: تفضل بزيارة {course_about_url} للانضمام إلى الدورة التدريبية وبدء الاختبار التجريبي.
ur: کورس میں شامل ہونے اور بیٹا ٹیسٹ شروع کرنے کیلئے {course_about_url} ملاحظہ کریں.
zh_cn: 访问{course_about_url}加入课程并开始测试。

source: View Consent
ar: الاطلاع على الموافقة
ur: رضاکارانہ ملاحظہ کریں
zh_cn: 查看同意书

source: Self-paced courses do not have release dates for course content or due dates for assignments. Learners can complete course material at any time before the course end date.
ar: لا تحتوي الدورات التدريبية الذاتية على تواريخ إصدار لمحتوى الدورة التدريبية أو تواريخ الاستحقاق للمهام الدراسية. يمكن للمتعلمين إكمال مادة الدورة التدريبية في أي وقت قبل تاريخ نهاية الدورة التدريبية.
ur: خود پیڈ کورسز کورس کے مواد یا تفویض کے لئے تاریخوں کے لئے تاریخوں کی رہائی کی تاریخ نہیں ہے. کورسز کورس کے اختتام کی تاریخ سے پہلے کسی بھی وقت کورس مواد مکمل کرسکتے ہیں.
zh_cn: 自定进度课程没有课程内容或作业截止日期的发布日期。学员可以在课程结束日期前的任何时候完成课程材料。

source: Missing branch on fresh clone
ar: فرع مفقود على استنساخ جديد
ur: تازہ کلون پر غائب برانچ
zh_cn: 新鲜克隆缺失分支

source: CourseID
ur: کورسڈی

source: This enrollment code has been marked as unused.
ar: تم وضع علامة على رمز التسجيل هذا على أنه غير مستخدم.
ur: اس اندراج کا کوڈ غیر استعمال شدہ طور پر نشان لگا دیا گیا ہے.
zh_cn: 此注册码已被标记为未使用。

source: Confirm that you have properly configured content in each of your experiment groups.
ar: تأكد من أنك قمت بتكوين المحتوى بشكل صحيح في كل مجموعة من مجموعاتك التجريبية.
ur: اس بات کی تصدیق کریں کہ آپ نے اپنے تجربات کے گروپوں میں مواد کو مناسب طریقے سے ترتیب دیا ہے.
zh_cn: 确认您已在每个实验组中正确配置了内容。

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
ar: لقد تلقينا طلبًا لتغيير البريد الإلكتروني المرتبط بحساب {platform_name} من {old_email} إلى {new_email}. إذا كان هذا صحيحًا ، فيرجى تأكيد عنوان بريدك الإلكتروني الجديد عن طريق زيارة:
ur: ہمیں {platform_name} اکاؤنٹ {old_email} سے {new_email} پر منسلک ای میل کو تبدیل کرنے کی درخواست ملی. اگر یہ درست ہے تو، براہ مہربانی اپنے نئے ای میل ایڈریس کو ملاحظہ کرکے کی تصدیق کریں:
zh_cn: 我们收到了一项请求，要求将与{platform_name}帐户相关联的电子邮件从{old_email}更改为{new_email}。如果这是正确的，请通过访问以确认您的新电子邮件地址：

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
ar: الأنشطة التالية غير مقبولة عند استخدام واجهات برمجة التطبيقات (هذه ليست قائمة شاملة):
ur: اے پی پی کا استعمال کرتے وقت مندرجہ ذیل سرگرمیاں قابل قبول نہیں ہیں (یہ ایک مکمل فہرست نہیں ہے):
zh_cn: 使用API​​时以下活动不可接受（这不是详尽的列表）：

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
ar: يتم تحديد هذه التقارير أبجديًا حسب اسم الجامعة. أي ، إنشاء تقرير باستخدام &quot;الحرف الأول&quot; و &quot;الحرف الأول&quot; سيؤدي إلى إنشاء تقارير لجميع الجامعات التي تبدأ بـ A و B و C.
ur: یہ رپورٹ یونیورسٹی کے نام کی طرف سے حروف تہجی سے الگ الگ ہیں. یعنی، &#39;ابتدائی خط&#39; اے اور &#39;اینڈ لیٹر&#39; سی کے ساتھ ایک رپورٹ پیدا کرنے اے، بی، اور سی سے شروع ہونے والی تمام یونیورسٹیوں کے لئے رپورٹ پیدا کرے گی.
zh_cn: 这些报告按大学名称按字母顺序分隔。即生成一个包含“开始信”A和“结束信”C的报告，将为所有以A，B和C开头的大学生成报告。

source: You can click on any of the bars to list the students that attempted the problem, along with the grades they received.
ar: يمكنك النقر على أي من الأشرطة لتسجيل الطلاب الذين حاولوا المشكلة ، بالإضافة إلى الدرجات التي حصلوا عليها.
ur: آپ کسی بھی سلاخوں پر کلک کر سکتے ہیں جو طالب علموں نے اس مسئلے کی کوشش کی ہے، ان کے گریڈ کے ساتھ ساتھ.
zh_cn: 您可以点击任何栏以列出尝试出现问题的学生，以及他们收到的成绩。

source: Students must score {score}{pct_sign} or higher to access course materials.
ar: يجب أن يسجل الطلاب {score} {pct_sign} أو أعلى للوصول إلى مواد الدورة التدريبية.
ur: کورس کے مواد تک رسائی حاصل کرنے کیلئے طلباء {سکور} {pct_sign} یا اس سے زیادہ اسکور کرنا ضروری ہے.
zh_cn: 学生必须获得{分数} {pct_sign}或更高才能访问课程材料。

source: Associate degree
ar: شهادة جامعية
ur: ایسوسی ایٹ ڈگری
zh_cn: 副学士学位

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
ar: إذا كان لديك أي أسئلة حول هذه الدورة التدريبية أو هذا النموذج ، فيمكنك الاتصال {link_start} {mail_to_link} {link_end}.
ur: اگر آپ کے اس کورس یا اس فارم کے بارے میں کوئی سوالات ہیں تو، آپ {link_start} {mail_to_link} {link_end} سے رابطہ کرسکتے ہیں.
zh_cn: 如果您对此课程或此表单有任何疑问，请联系{link_start} {mail_to_link} {link_end}。

source: Show notes
ar: وتظهر الملاحظات
ur: نوٹ دکھائیں
zh_cn: 显示笔记

source: Post a Facebook message to say you've enrolled in this course
ar: انشر رسالة Facebook لتقول أنك قمت بالتسجيل في هذه الدورة التدريبية
ur: اس کورس میں آپ کو اندراج کرانے کا کہنا ہے کہ فیس بک کا پیغام پوسٹ کریں
zh_cn: 发布Facebook消息说你已经参加了这门课程

source: Did not find a user with username "{}" - skipping.
ar: لم يتم العثور على مستخدم باسم المستخدم &quot;{}&quot; - تخطي.
ur: صارف کو صارف کا نام نہیں ملا &quot;{}&quot; - اچھال.
zh_cn: 找不到用户名为“{}”的用户 - 跳过。

source: Monday
ar: الإثنين
ur: سوموار
zh_cn: 星期一

source: You've clicked a link for an enrollment code that has already been used. Check your {link_start}course dashboard{link_end} to see if you're enrolled in the course, or contact your company's administrator.
ar: لقد قمت بالنقر فوق ارتباط للحصول على رمز تسجيل تم استخدامه بالفعل. تحقق من {link_start} لوحة معلومات الدورة التدريبية {link_end} لمعرفة ما إذا كنت مسجلاً في الدورة التدريبية ، أو اتصل بمسؤول شركتك.
ur: آپ نے ایک اندراج کوڈ کے لئے ایک لنک پر کلک کیا ہے جو پہلے سے ہی استعمال کیا گیا ہے. اپنے {link_start} کورس ڈش بورڈ {link_end} کو دیکھنے کے لئے چیک کریں کہ اگر آپ اس کورس میں داخل ہوئے ہیں، یا اپنی کمپنی کے منتظم سے رابطہ کریں.
zh_cn: 您点击了已经使用的注册码链接。查看您的{link_start}课程信息中心{link_end}，查看您是否注册了课程，或与您公司的管理员联系。

source: Your verification was denied for the following reasons:
ar: تم رفض التحقق للأسباب التالية:
ur: مندرجہ ذیل وجوہات کے لئے آپ کی توثیق سے انکار کردیا گیا تھا:
zh_cn: 您的验证因以下原因被拒绝：

source: Individual due date extensions
ar: ملحقات تاريخ الاستحقاق الفردية
ur: انفرادی طور پر تاریخ کی توسیع
zh_cn: 个人到期日期延期

source: To see if you are a global staff user
ar: لمعرفة ما إذا كنت مستخدمًا عالميًا للموظفين
ur: یہ دیکھنے کے لئے کہ اگر آپ گلوبل اسٹاف صارف ہیں
zh_cn: 查看您是否是全球员工用户

source: Current revision not set!!
ar: المراجعة الحالية لم يتم ضبطها !!
ur: موجودہ نظر ثانی نہیں سیٹ !!
zh_cn: 当前版本未设置！

source: Markdown: Basics
ar: تخفيض السعر: الأساسيات
ur: مارکڈاؤن: بنیادیات
zh_cn: Markdown：基础知识

source: giturl must be defined in your course settings before you can export to git.
ar: يجب تحديد giturl في إعدادات الدورة التدريبية الخاصة بك قبل أن تتمكن من التصدير إلى git.
ur: اس سے پہلے کہ آپ گیٹ میں برآمد کر سکتے ہیں اس سے قبل گٹور کو آپ کے کورس کی ترتیبات میں بیان کیا جانا چاہئے.
zh_cn: 在导出到git之前，必须在课程设置中定义giturl。

source: Unsubscribe from this list
ar: إلغاء الاشتراك من هذه القائمة
ur: اس فہرست سے رکنیت ختم
zh_cn: 取消订阅此列表

source: Username or email:
ar: اسم المستخدم أو البريد الالكتروني:
ur: اسم رکنیت یا ای میل:
zh_cn: 用户名或电子邮件：

source: Briefly describe your issue
ar: اشرح بإيجاز مشكلتك
ur: مختصر طور پر آپ کا مسئلہ بیان کریں
zh_cn: 简要描述你的问题

source: Date
ar: تاريخ
ur: تاریخ
zh_cn: 日期

source: Total Credit Card Purchases:
ar: إجمالي مشتريات البطاقات الائتمانية:
ur: کل کریڈٹ کارڈ خریدیں:
zh_cn: 信用卡购买总额：

source: "{email}" is not a valid email address.
ar: &quot;{email}&quot; ليس عنوان بريد إلكتروني صالحًا.
ur: &quot;{ای میل}&quot; ایک درست ای میل ایڈریس نہیں ہے.
zh_cn: “{email}”不是有效的电子邮件地址。

source: Problem successfully {action} for {attempted} students
ar: حدثت مشكلة بنجاح في {action} لـ {triedpted} الطلاب
ur: {کوشش} کے طالب علموں کے لئے کامیابی سے {کارروائی}
zh_cn: {尝试}的学生已成功解决{动作}问题

source: Pages in Your Course
ar: صفحات في الدورة التدريبية الخاصة بك
ur: آپ کے کورس میں صفحات
zh_cn: 课程中的页面

source: Invalid Certificate Configuration.
ar: تكوين شهادة غير صالح.
ur: غلط سرٹیفکیٹ کی ترتیب.
zh_cn: 无效的证书配置。

source: Note: No spaces or special characters are allowed.
ar: ملاحظة: لا يُسمح بوجود مسافات أو أحرف خاصة.
ur: نوٹ: کوئی جگہ یا خاص حروف کی اجازت نہیں ہے.
zh_cn: 注意：不允许有空格或特殊字符。

source: This image file must be larger than {image_min_size}.
ar: يجب أن يكون ملف الصورة هذا أكبر من {image_min_size}.
ur: یہ تصویر فائل {image_min_size} سے بڑا ہونا ضروری ہے.
zh_cn: 此图片文件必须大于{image_min_size}。

source: Discussion Topic Mapping
ar: مناقشة موضوع المناقشة
ur: بحث موضوع نقشہ جات
zh_cn: 讨论主题映射

source: Duplicate this component
ar: تكرار هذا المكون
ur: اس جزوی کو نقل
zh_cn: 复制此组件

source: Suspicious activity detected during proctored exam review. Exam score 0.
ar: تم الكشف عن نشاط مريب أثناء مراجعة الامتحانات. نتيجة الامتحان 0.
ur: پروکارڈ امتحان کے جائزے کے دوران مشتبہ سرگرمی کا پتہ چلا. امتحان سکور 0.
zh_cn: 在监督检查审查期间检测到可疑活动。考试成绩0。

source: {refund_reminder_msg}To receive your refund, contact {billing_email}. Please include your order number in your email. Please do NOT include your credit card information.
ar: {refund_reminder_msg} لاسترداد أموالك المستردة ، اتصل بـ {billing_email}. يرجى تضمين رقم طلبك في البريد الإلكتروني الخاص بك. يرجى عدم تضمين معلومات بطاقتك الائتمانية.
ur: {واپسی_reminder_msg} آپ کی واپسی حاصل کرنے کے لئے {بلنگ میل} سے رابطہ کریں. اپنے ای میل میں اپنا آرڈر نمبر شامل کریں. برائے مہربانی اپنا کریڈٹ کارڈ کی معلومات شامل نہ کریں.
zh_cn: {refund_reminder_msg}要获得退款，请联系{billing_email}。请在您的电子邮件中包含您的订单号。请不要包含您的信用卡信息。

source: Highlights and notes you've made in course content
ar: الملامح والملاحظات التي قمت بإجرائها في محتوى الدورة التدريبية
ur: آپ کو کورس کے مواد میں نمایاں بناتا ہے اور نوٹ
zh_cn: 您在课程内容中所做的亮点和笔记

source: There is a problem with our CyberSource merchant configuration. Please let us know at {0}
ar: توجد مشكلة في تكوين التاجر CyberSource الخاص بنا. يرجى إخبارنا على {0}
ur: ہمارے CyberSource مرچنٹ ترتیب کے ساتھ ایک مسئلہ ہے. برائے مہربانی ہمیں {0}
zh_cn: 我们的Cyber​​Source商家配置存在问题。请让我们知道在{0}

source: Remember when you enrolled in <strong>%(course_name)s</strong>, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: أتذكر عندما قمت بالتسجيل في <strong>٪ (course_name) s</strong> ، ودورات أخرى على٪ (platform_name) s؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ <strong>٪ (course_name) s</strong> ، اور٪ (platform_name) کے دوسرے کورسز میں <strong>داخلا</strong> ہو؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 请记住，您何时参加<strong>％（course_name）s</strong>以及％（platform_name）s上的其他课程？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: Show Reset Button for Problems
ar: إظهار زر إعادة الضبط للمشكلات
ur: مسائل کے لئے ری سیٹ بٹن دکھائیں
zh_cn: 显示问题的重置按钮

source: Share {course_name} on Twitter
ar: شارك {course_name} على Twitter
ur: ٹویٹر پر {course_name} کا اشتراک کریں
zh_cn: 在Twitter上分享{course_name}

source: Re-subscribe Successful!
ar: إعادة الاشتراك بنجاح!
ur: کامیاب سبسکرائب کریں!
zh_cn: 重新订阅成功！

source: Show Discussion
ar: إظهار المناقشة
ur: بحث دکھائیں
zh_cn: 显示讨论

source: Sitemap
ar: خريطة الموقع
ur: سائٹ کا نقشہ
zh_cn: 网站地图

source: History
ar: التاريخ
ur: ہسٹری
zh_cn: 历史

source: (none)
ar: (لا يوجد)
ur: (کوئی بھی نہیں)
zh_cn: （没有）

source: {course_number} Course Info
ar: {course_number} معلومات الدورة التدريبية
ur: {کورس_نمبر} کورس کی معلومات
zh_cn: {course_number}课程信息

source: This course does not support content libraries. Contact your system administrator for more information.
ar: هذه الدورة لا تدعم مكتبات المحتوى. اتصل بمسؤول النظام للحصول على مزيد من المعلومات.
ur: یہ کورس مواد لائبریریوں کی حمایت نہیں کرتا. مزید معلومات کے لئے اپنے سسٹم کے منتظم سے رابطہ کریں.
zh_cn: 本课程不支持内容库。联系您的系统管理员以获取更多信息

source: I am not happy with the quality of the content
ar: أنا لست سعيدًا بجودة المحتوى
ur: میں مواد کی معیار سے خوش نہیں ہوں
zh_cn: 我对内容的质量不满意

source: Due Date Display Format
ar: تاريخ الاستحقاق
ur: کی وجہ سے تاریخ ڈسپلے کی شکل
zh_cn: 截止日期显示格式
