Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Access is restricted to:
ar: يقتصر الوصول إلى:
ur: تک رسائی محدود ہے:
zh_cn: 访问权限仅限于：

source: {course_number} Textbook
ar: {course_number} كتاب مدرسي
ur: {کورس_ نمبر} درسی کتاب
zh_cn: {course_number}课本

source: Statistics are shown for entered words near that word.
ar: يتم عرض الإحصائيات للكلمات المدخلة بالقرب من تلك الكلمة.
ur: اعداد و شمار اس لفظ کے قریب درج کردہ الفاظ کے لئے دکھائے جاتے ہیں.
zh_cn: 显示该词附近的输入词的统计数据。

source: Code
ar: الشفرة
ur: کوڈ
zh_cn: 码

source: Choicegroup must include at least 1 correct and 1 incorrect choice
ar: يجب أن تتضمن Choicegroup خيارًا واحدًا صحيحًا واحدًا على الأقل وواحدًا غير صحيح
ur: انتخابی گروپ میں کم از کم 1 صحیح اور 1 غلط انتخاب لازمی ہے
zh_cn: Choicegroup必须至少包含1个正确的和1个不正确的选项

source: Sep
ar: سبتمبر
ur: ستمبر
zh_cn: 九月

source: Add a New Team Member
ar: إضافة عضو جديد للفريق
ur: ایک نیا ٹیم کے رکن شامل کریں
zh_cn: 添加新的团队成员

source: Your notification settings were updated.
ar: تم تحديث إعدادات الإشعارات الخاصة بك.
ur: آپ کی اطلاعات کی ترتیبات اپ ڈیٹ کی گئی تھیں.
zh_cn: 您的通知设置已更新。

source: 10^ and the exponent
ar: 10 ^ والأس
ur: 10 ^ اور متوقع
zh_cn: 10 ^和指数

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {msg}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: آسف! أرسل لنا معالج الدفع التابع لنا رسالة تالفة بشأن نفقاتك ، لذلك يتعذر علينا التحقق من صحة الرسالة التي وردت من معالج الدفع. رسالة الخطأ المحددة هي: {msg}. نعتذر لعدم تمكننا من التحقق مما إذا كان قد تم تحصيل الرسوم واتخاذ إجراء آخر بشأن طلبك. ربما تم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے ہمیں آپ کے چارج کے بارے میں ایک خراب پیغام بھیجا، لہذا ہم اس بات کی تصدیق نہیں کر سکے کہ اصل میں ادائیگی ادائیگی پروسیسر سے آیا ہے. مخصوص غلطی کا پیغام یہ ہے: {msg}. ہم معذرت کرتے ہیں کہ ہم اس بات کی توثیق نہیں کر سکتے ہیں کہ یہ چارج آپ کے آرڈر پر چلا گیا ہے اور مزید کارروائی لیتا ہے. ممکنہ طور پر آپ کا کریڈٹ کارڈ چارج کیا جاسکتا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理器向我们发回了关于您的收费的损坏消息，因此我们无法验证消息是否实际来自付款处理器。具体的错误信息是：{msg}。很抱歉，我们无法验证收费是否已完成，并对订单采取进一步行动。您的信用卡可能已经收费。请通过{email}与我们联系并提供特定付款问题。

source: Thumbnail image url of the credit provider.
ar: صورة مصغرة لصورة عنوان URL لموفر الائتمان.
ur: کریڈٹ فراہم کنندہ کی تھمب نیل تصویر کا url.
zh_cn: 信贷提供商的缩略图图片网址。

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
ar: يرجى التحقق من مجلدات الرسائل غير المرغوب فيها أو الرسائل غير المرغوب فيها في حالة عدم وجود البريد الإلكتروني في INBOX. ما زال يتعذر العثور على رسالة التحقق؟ طلب المساعدة عبر الرابط أدناه.
ur: اگر آپ کا ای میل آپ کے INBOX میں نہیں ہے تو براہ کرم اپنے جنک یا سپیم فولڈر کو چیک کریں. پھر بھی توثیقی ای میل نہیں مل سکا؟ نیچے دیئے گئے لنک کے ذریعہ مدد کی درخواست کریں.
zh_cn: 如果我们的电子邮件不在您的收件箱中，请检查您的垃圾邮件或垃圾邮件文件夹。仍然无法找到验证电子邮件？通过下面的链接请求帮助。

source: (out of {total})
ar: (من إجمالي {total})
ur: (کل سے باہر)
zh_cn: （在{total}之外）

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: تم إنشاء مراجعة جديدة: دمج بين المراجعة #٪ (r1) d ومراجعة #٪ (r2) د
ur: ایک نئی نظر ثانی کی گئی تھی: ترمیم #٪ (R1) ڈی اور ترمیم #٪ (r2) کے درمیان ضم
zh_cn: 创建了一个新版本：版本＃％（r1）d和版本＃％（r2）d之间的合并

source: Instant Changes
ar: التغييرات الفورية
ur: فوری تبدیلیاں
zh_cn: 即时更改

source: in all groups
ar: في جميع المجموعات
ur: تمام گروپوں میں
zh_cn: 在所有组中

source: Verification photos received
ar: صور التحقق المستلمة
ur: توثیقی تصاویر موصول ہوئی ہیں
zh_cn: 验证收到的照片

source: Certificate Configuration
ar: تكوين الشهادة
ur: سرٹیفکیٹ کی ترتیب
zh_cn: 证书配置

source: Filter:
ar: منقي:
ur: فلٹر:
zh_cn: 过滤：

source: Unit
ar: وحدة
ur: یونٹ
zh_cn: 单元

source: must have name of the configuration
ar: يجب أن يكون اسم التكوين
ur: ترتیب کا نام ہونا ضروری ہے
zh_cn: 必须有配置的名称

source: Mailing address
ar: العنوان البريدي
ur: ڈاک کا پتہ
zh_cn: 邮寄地址

source: close
ar: أغلق
ur: بند کریں
zh_cn: 关

source: Use the checkout page hosted by the E-Commerce service.
ar: استخدم صفحة الدفع التي تستضيفها خدمة التجارة الإلكترونية.
ur: ای کامرس سروس کی میزبانی کردہ چیک آؤٹ صفحے کا استعمال کریں.
zh_cn: 使用电子商务服务托管的结账页面。

source: About Export to Git
ar: حول التصدير لجيت
ur: Git میں برآمد کے بارے میں
zh_cn: 关于导出到Git

source: Audit This Course
ar: تدقيق هذه الدورة
ur: آڈٹ اس کورس
zh_cn: 审核本课程

source: The keys are valid for a limited amount of time. Has the key expired?
ar: المفاتيح صالحة لفترة محدودة من الوقت. هل انتهت صلاحية المفتاح؟
ur: چابیاں محدود وقت کے لئے درست ہیں. کیا کلید ختم ہوگئی ہے؟
zh_cn: 钥匙在有限的时间内有效。密钥过期了吗？

source: Most coaches should not need to make changes to the grading policy.
ar: يجب ألا يحتاج معظم المدربين إلى إجراء تغييرات على سياسة التقدير.
ur: زیادہ سے زیادہ کوچوں کو گریڈنگ پالیسی میں تبدیلیاں کرنے کی ضرورت نہیں ہے.
zh_cn: 大多数教练不需要修改分级政策。

source: A deleted article with slug "%s" already exists.
ar: توجد بالفعل مقالة محذوفة تحتوي على كود &quot;٪ s&quot;.
ur: سلگ &quot;٪ s&quot; کے ساتھ ایک خارج شدہ مضمون پہلے ہی موجود ہے.
zh_cn: 已经存在一个带有slu“”％s“的已删除文章。

source: Specify the language of your course.
ar: حدد لغة الدورة.
ur: اپنے کورس کی زبان کی وضاحت کریں.
zh_cn: 指定课程的语言。

source: Sign Up & Start Making Your {platform_name} Course
ar: قم بالتسجيل وابدأ في صنع {platform_name} الدورة التدريبية
ur: سائن اپ کریں اور آپ {platform_name} کورس شروع کرنا شروع کریں
zh_cn: 注册并开始制作您的{platform_name}课程

source: git clone or pull failed!
ar: فشل استنساخ git أو سحب!
ur: گٹ کلون یا ھیںچو ناکام ہوگیا
zh_cn: git clone或pull失败！

source: # staff
ar: # العاملين
ur: # عملہ
zh_cn: ＃员工

source: Incorrect format for field '{name}'. {detailed_message}
ar: تنسيق غير صحيح للحقل &quot;{name}&quot;. {DETAILED_MESSAGE}
ur: فیلڈ &#39;{نام}&#39; کے لئے غلط شکل. {تفصیلی_message}
zh_cn: 字段“{name}”的格式不正确。 {} DETAILED_MESSAGE

source: {start_bold}{enterprise_name}{end_bold} has partnered with {start_bold}{platform_name}{end_bold} to offer you always available, high-quality learning programs to help you advance your knowledge and your career. {line_break}Please continue with registration, or log in if you are an existing user, and press continue to start learning.
ar: شاركت {start_bold} {enterprise_name} {end_bold} في شراكة مع {start_bold} {platform_name} {end_bold} لتوفر لك دائمًا برامج تعليمية عالية الجودة لمساعدتك في تحسين معرفتك وحياتك المهنية. {line_break} يرجى متابعة التسجيل ، أو تسجيل الدخول إذا كنت مستخدمًا حاليًا ، والضغط على &quot;متابعة&quot; لبدء التعلم.
ur: {start_bold} {enterprise_name} {end_bold} نے آپ کو ہمیشہ کے لئے دستیاب، اعلی معیار کے سیکھنے کے پروگراموں کو پیش کرنے کے لئے {start_bold} {platform_name} {end_bold} کے ساتھ شراکت داری کی ہے تاکہ آپ کو اپنے علم اور اپنے کیریئر کو بڑھانے میں مدد ملے. {line_break} اگر آپ موجودہ صارف ہیں، تو رجسٹریشن کے ساتھ جاری رکھیں، یا لاگ ان کریں، اور سیکھنے شروع کرنے کے لئے جاری رکھیں.
zh_cn: {start_bold} {enterprise_name} {end_bold}与{start_bold} {platform_name} {end_bold}合作，为您提供始终可用的高质量学习计划，以帮助您提升知识和职业发展。 {line_break}请继续注册，或者如果您是现有用户，请登录，然后按继续开始学习。

source: Correct
ar: صيح
ur: درست
zh_cn: 正确

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
ar: إنشاء ملفات بيانات التصدير (يمكنك الآن ترك هذه الصفحة بأمان ، ولكن تجنب إجراء تغييرات جذرية على المحتوى حتى يكتمل هذا التصدير)
ur: ایکسپورٹ ڈیٹا فائلوں کی تخلیق (آپ اب اس صفحہ کو محفوظ طریقے سے چھوڑ سکتے ہیں، لیکن اس برآمد کو مکمل کرنے تک مواد میں سخت تبدیلیوں سے بچنے سے بچنے کے لۓ)
zh_cn: 创建导出数据文件（您现在可以安全地离开此页面，但在导出完成之前避免对内容进行剧烈更改）

source: Success
ar: نجاح
ur: کامیابی
zh_cn: 成功

source: Download a .csv file of all unused enrollment codes for this course.
ar: قم بتنزيل ملف .csv لجميع رموز التسجيل غير المستخدمة لهذه الدورة التدريبية.
ur: اس کورس کے لئے تمام غیر استعمال شدہ اندراج کوڈ کے ایک .csv فائل کو ڈاؤن لوڈ کریں.
zh_cn: 下载本课程所有未使用的注册码的.csv文件。

source: Previewing revision:
ar: معاينة المراجعة:
ur: تجدید نظر ثانی:
zh_cn: 预览版本：

source: Once you have registered and activated your account, you will see {course_name} listed on your dashboard.
ar: بعد تسجيل حسابك وتنشيطه ، سترى {course_name} مدرجًا في لوحة التحكم.
ur: ایک بار جب آپ نے اپنے اکاؤنٹ کو رجسٹرڈ اور فعال کیا ہے، تو آپ {dashboard}} اپنے ڈش بورڈ پر درج کردہ فہرست دیکھیں گے.
zh_cn: 注册并激活您的帐户后，您将在仪表板上看到{course_name}。

source: Pre-Requisite Course key if this course has a pre-requisite course
ar: Pre-Requisite Course key إذا كان هذا المساق يحتوي على دورة متطلب سابق
ur: قبل از ضرورت کورس کی کلید اگر اس کورس میں ایک ضروری کورس ہے
zh_cn: 先决条件课程的关键，如果这门课程有先决条件

source: Did not find a group with name "{}" - skipping.
ar: لم يتم العثور على مجموعة بالاسم &quot;{}&quot; - تخطي.
ur: اس گروپ کو &quot;{}&quot; کے ساتھ نہیں مل سکا.
zh_cn: 未找到名称为“{}”的群组 - 跳过。

source: Regenerate for learners in an error state. ({count})
ar: تجديد للمتعلمين في حالة خطأ. ({} الاعتماد)
ur: ایک غلطی ریاست میں سیکھنے والوں کے لئے دوبارہ تخلیق کریں. ({شمار})
zh_cn: 重新生成处于错误状态的学习者。 （{计数}）

source: Warm regards,<br>The {platform_name} Team
ar: تحياتي حارة، <br> فريق {platform_name}
ur: بے حد شکر گزار، <br> {platform_name} ٹیم
zh_cn: 温暖的问候， <br> {platform_name}团队

source: Group ID {group_id}
ar: معرف المجموعة {group_id}
ur: گروپ کی شناخت {group_id}
zh_cn: 组ID {group_id}

source: The course content and structure (including sections, subsections, and units) are exported. Values from Advanced Settings, including MATLAB API keys and LTI passports, are also exported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, is not exported.
ar: يتم تصدير محتوى الدورة وهيكلها (بما في ذلك الأقسام والأقسام الفرعية والوحدات). يتم أيضًا تصدير القيم من الإعدادات المتقدمة ، بما في ذلك مفاتيح واجهة برمجة التطبيقات MATLAB وجوازات مرور LTI. لا يتم تصدير البيانات الأخرى ، بما في ذلك بيانات الطلاب ومعلومات الدرجات وبيانات منتدى المناقشة وإعدادات الدورة التدريبية ومعلومات فرق الدورة التدريبية.
ur: کورس کے مواد اور ساخت (بشمول حصوں، ضمنی حصوں اور یونٹس) برآمد کیے جاتے ہیں. MATLAB API کی چابیاں اور ایل ٹی آئی پاسپورٹ سمیت برآمد کردہ اعلی درجے کی ترتیبات سے بھی قیمت برآمد کی جاتی ہے. دیگر اعداد و شمار، بشمول طالب علم کے اعداد و شمار، گریڈنگ کی معلومات، بحث فورم کے اعداد و شمار، کورس کی ترتیبات، اور کورس ٹیم کی معلومات، برآمد نہیں کیا جاتا ہے.
zh_cn: 课程内容和结构（包括章节，小节和单元）被导出。高级设置中的值也会导出，包括MATLAB API密钥和LTI护照。其他数据（包括学生数据，评分信息，论坛数据，课程设置和课程团队信息）不会导出。

source: {platform_name} acknowledges the following student accomplishment
ar: {platform_name} يقر بإنجاز الطالب التالي
ur: {platform_name} مندرجہ ذیل طالب علم کی کامیابی کو تسلیم کرتا ہے
zh_cn: {platform_name}确认以下学生成绩

source: Set goal to: {choice}
ar: تعيين الهدف على: {choice}
ur: اس مقصد کو مقرر کریں: {انتخاب}
zh_cn: 设定目标为：{choice}

source: Transcript Languages
ar: لغات النسخ
ur: ٹرانسپٹ زبانیں
zh_cn: 成绩单语言

source: Proctored Exam Review: {review_status}
ar: استعراض الامتحانات بروكتروتيد: {review_status}
ur: پروکارڈ امتحان کا جائزہ: {review_status}
zh_cn: 有效的考试复习：{review_status}

source: Each bar shows the grade distribution for that problem.
ar: يعرض كل شريط توزيع الدرجات لهذه المشكلة.
ur: ہر بار اس مسئلہ کے لئے گریڈ کی تقسیم ظاہر کرتا ہے.
zh_cn: 每个栏显示该问题的等级分布。

source: How it Works
ar: كيف تعمل
ur: یہ کیسے کام کرتا ہے
zh_cn: 怎么运行的

source: Generate Certificates
ar: توليد شهادات
ur: سرٹیفکیٹ بنائیں
zh_cn: 生成证书

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
ar: حدث خطأ في {studio_name} ولم يتم تحميل الصفحة. يرجى المحاولة مرة أخرى في بضع لحظات.
ur: {studio_name} میں ایک خرابی واقع ہوئی اور اس صفحے کو لوڈ نہیں کیا جا سکا. کچھ لمحے میں دوبارہ کوشش کریں.
zh_cn: {studio_name}发生错误，无法加载页面。请稍后重试。

source: Invalid input: {bad_input} not permitted in answer.
ar: إدخال غير صالح: لا يُسمح {bad_input} بالإجابة.
ur: غلط ان پٹ: {bad_input} جواب میں اجازت نہیں دی گئی.
zh_cn: 输入无效：{bad_input}不允许在答案中。

source: Enter the email address for the company contact.
ar: أدخل عنوان البريد الإلكتروني للاتصال بالشركة.
ur: کمپنی کے رابطے کے لئے ای میل ایڈریس درج کریں.
zh_cn: 输入公司联系人的电子邮件地址。

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
ar: يختلف المبلغ الذي يتقاضاه المعالج {0} {1} عن إجمالي تكلفة الطلب {2} {3}.
ur: {0} {1} کے پروسیسر سے چارج کردہ رقم {2} {3} کی کل قیمت سے مختلف ہے.
zh_cn: 处理器{0} {1}收取的金额与订单{2} {3}的总成本不同。

source: Allows specification of an external link to replace discussion forums.
ar: يسمح بمواصفات رابط خارجي ليحل محل منتديات المناقشة.
ur: بحث کے فورموں کو تبدیل کرنے کے لئے بیرونی لنک کی تصویری کی اجازت دیتا ہے.
zh_cn: 允许指定外部链接来取代讨论论坛。

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
ar: تطهير المقالة: قم بإزالتها تمامًا (وجميع محتوياتها) بدون أي تراجع. Purging هي فكرة جيدة إذا كنت ترغب في تحرير سبيكة بحيث يمكن للمستخدمين إنشاء مقالات جديدة في مكانها.
ur: آرٹیکل کو صاف کریں: مکمل طور پر اسے (اور اس کے سبھی مواد) کو ہٹا دیں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. اس ویڈیو پر غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے. براہ مہربانی دوبارہ کوشش کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں.
zh_cn: 清除文章：完全删除它（及其所有内容），无需撤消。如果您想释放slu such以便用户可以在其位置创建新文章，则清除是一个好主意。

source: Grading Rules &amp; Policies
ar: قواعد الدرجات والسياسات
ur: گریڈنگ قواعد و ضوابط
zh_cn: 评分规则和政策

source: You must accept the terms of service.
ar: يجب عليك قبول شروط الخدمة.
ur: آپ کو سروس کی شرائط قبول کرنا ضروری ہے.
zh_cn: 您必须接受服务条款。

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
ar: المقالات الذين فقدوا والديهم =============================== لقد تم حذف آبائهم من هذا المقال. ربما يجب عليك العثور على منزل جديد لهم.
ur: ایسے مضامین جو اپنے والدین کو کھو چکے ہیں =============================== اس آرٹیکل کے بچوں کو ان کے والدین کو خارج کر دیا گیا ہے. آپ شاید ان کے لئے ایک نیا گھر تلاش کریں.
zh_cn: 失去父母的文章===============================这篇文章的孩子们已经删除了他们的父母。你应该为他们找一个新的家。

source: Discover New
ar: اكتشف جديد
ur: نیا دریافت کریں
zh_cn: 发现新的

source: More Options
ar: مزيد من الخيارات
ur: مزید زرائے
zh_cn: 更多的选择

source: The country or region where you live.
ar: البلد أو المنطقة التي تعيش فيها.
ur: ملک یا علاقے جہاں آپ رہتے ہیں.
zh_cn: 您居住的国家或地区。

source: This e-mail key is not valid. Please check:
ar: مفتاح البريد الإلكتروني هذا غير صالح. يرجى المراجعة:
ur: یہ ای میل کلید درست نہیں ہے. براہ مہربانی دیکھ لیجے:
zh_cn: 此电子邮件密钥无效。请检查：

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
ar: ملاحظة: يجب على المنظمة ، ورقم الدورة التدريبية ، ومسار الدورة التدريبية تحديد طريقة الدورة التدريبية الجديدة هذه بشكل فريد.
ur: نوٹ: ایک ساتھ ساتھ، تنظیم، کورس نمبر، اور کورس کی دوڑ کو منفرد طور پر اس نئے کورس کی مثال کی شناخت لازمی ہے.
zh_cn: 注意：组织，课程编号和课程共同必须唯一标识此新课程实例。

source: Add More Users to This Library
ar: إضافة المزيد من المستخدمين إلى هذه المكتبة
ur: اس لائبریری میں مزید صارفین کو شامل کریں
zh_cn: 将更多用户添加到此库

source: This module is disabled at the moment.
ar: هذه الوحدة معطلة في الوقت الحالي.
ur: یہ ماڈیول اس وقت غیر فعال ہے.
zh_cn: 该模块目前处于禁用状态。

source: Search Your Courses
ar: البحث في الدورات الخاصة بك
ur: اپنے کورسز تلاش کریں
zh_cn: 搜索你的课程

source: This link will open/download a PDF document
ar: سيقوم هذا الرابط بفتح / تنزيل وثيقة PDF
ur: یہ لنک PDF دستاویز کھولنے / ڈاؤن لوڈ کرے گا
zh_cn: 此链接将打开/下载PDF文档

source: {chapter} current chapter
ar: {الفصل} الفصل الحالي
ur: {باب} موجودہ باب
zh_cn: {章}当前章节

source: {source_usage_key} not found in {parent_usage_key}.
ar: {source_usage_key} غير موجود في {parent_usage_key}.
ur: {source_usage_key} {parent_usage_key} میں نہیں ملا.
zh_cn: {parent_usage_key}中找不到{source_usage_key}。

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
ar: يجب أن يكون لكل دورة مشرف. إذا كنت المسؤول وتريد نقل ملكية الدورة التدريبية ، فانقر على <strong>إضافة حق وصول المشرف لتعيين مشرف</strong> آخر ، ثم اطلب من المستخدم أن يزيلك من قائمة Course Course.
ur: ہر کورس میں ایڈمن ہونا ضروری ہے. اگر آپ ایڈمن ہیں اور آپ کورس کے مالکیت کو منتقل کرنا چاہتے ہیں تو، صارف کا ایڈمن بنانے کے لئے <strong>ایڈمن تک رسائی شامل کریں پر</strong> کلک <strong>کریں</strong> ، پھر اس صارف سے آپ کو کورس ٹیم کی لسٹ سے نکالنے کے لئے پوچھیں.
zh_cn: 每门课程都必须有一名管理员。如果您是管理员，并且您想要转让该课程的所有权，请点击<strong>添加管理员权限</strong>以使其他用户成为管理员，然后要求该用户将您从课程小组列表中删除。

source: Pursue a verified certificate
ar: تابع شهادة تم التحقق منها
ur: تصدیق شدہ سرٹیفکیٹ پر عمل کریں
zh_cn: 追求一个经过验证的证书

source: Waive the requirement for the learner to take the exam.
ar: تنازل عن متطلبات المتعلم في الامتحان.
ur: امتحان لینے کے لئے سیکھنے کی ضرورت کو مسترد کریں.
zh_cn: 放弃学习者参加考试的要求。

source: incomplete
ar: غير مكتمل
ur: نامکمل
zh_cn: 残缺

source: Read your user profile
ar: قراءة ملف تعريف المستخدم الخاص بك
ur: اپنا صارف پروفائل پڑھیں
zh_cn: 阅读您的用户资料

source: No problem scores in this section
ar: لا توجد نقاط مشكلة في هذا القسم
ur: اس سیکشن میں کوئی مسئلہ نہیں ہے
zh_cn: 本节没有问题分数

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
ar: {b_start} رسمي: {b_end} تلقي شهادة موقعة من المدرب مع شعار المؤسسة
ur: {b_start} سرکاری: {b_end} ادارے کے علامت (لوگو) کے ساتھ ایک انسٹرکٹر- دستخط سرٹیفکیٹ حاصل کریں
zh_cn: {b_start}官方：{b_end}接收教师签署的带有该机构徽标的证书

source: Archived Courses
ar: الدورات المؤرشفة
ur: آرکائیو کورسز
zh_cn: 归档课程

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
ar: ستظهر الآن سلسلة من المقالات المسجلة بواسطة المعلم ، وسيطلب منك تسجيلها بنفسك.
ur: اب آپ انسٹریکٹر ٹرک کی ایک سلسلہ دکھایا جاسکیں گے، اور انہیں اپنے آپ کو اسکور کرنے کے لئے کہا جائے گا.
zh_cn: 你现在将看到一系列教练得分的散文，并且会被要求自己打分。

source: Registration for:
ar: التسجيل في:
ur: کے لئے رجسٹریشن:
zh_cn: 注册：

source: Pre-Course Survey Required
ar: مطلوب مسح ما قبل الدورة
ur: پری کورس سروے کی ضرورت ہے
zh_cn: 需要课前调查

source: Share {course_name} on Facebook
ar: شارك {course_name} على Facebook
ur: فیس بک پر {course_name} کا اشتراک کریں
zh_cn: 在Facebook上分享{course_name}

source: Restrict access to:
ar: قصر الوصول إلى:
ur: تک رسائی محدود
zh_cn: 限制访问：

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the enroll button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
ar: لا يمتلك حساب المستخدم الذي تم تسجيل دخوله حاليًا إذنًا للتسجيل في هذه الدورة التدريبية. قد تحتاج إلى {start_logout_tag} تسجيل الخروج {end_tag} ثم جرّب زر التسجيل مرة أخرى. يرجى زيارة {help_help_tag} صفحة المساعدة {end_tag} للحصول على حل ممكن.
ur: فی الحال لاگ ان صارف کا اکاؤنٹ اس کورس میں اندراج کرنے کی اجازت نہیں ہے. آپ کو {start_logout_tag} لاگ آؤٹ {end_tag} کرنے کی ضرورت ہوسکتی ہے پھر پھر اندراج کے بٹن کی کوشش کریں. ممکنہ حل کیلئے {start_help_tag} مدد کے صفحے {end_tag} پر جائیں.
zh_cn: 当前登录的用户帐户无权注册本课程。您可能需要{start_logout_tag}注销{end_tag}，然后再次尝试注册按钮。请访问{start_help_tag}帮助页面{end_tag}了解可能的解决方案。

source: Inactive card or card not authorized for card-not-present transactions. Possible action: retry with another form of payment.
ar: بطاقة غير نشطة أو بطاقة غير مصرح بها للمعاملات غير الحالية. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: غیر فعال کارڈ یا کارڈ کارڈ نہیں موجود ٹرانزیکشن کے لئے مجاز نہیں ہے. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 无效卡或卡未经卡授权无法进行交易。可能的行动：以另一种形式的付款重试。

source: Bad course location provided
ar: مكان سيئة بالطبع المقدمة
ur: برا کورس مقام فراہم کیا
zh_cn: 提供错误的路线位置

source: URL paths
ar: مسارات عنوان URL
ur: یو آر ایل کے راستے
zh_cn: 网址路径

source: Your overall grading scale for student final grades
ar: مقياس درجاتك الإجمالي للدرجات النهائية للطالب
ur: طالب علم فائنل گریڈ کیلئے آپ کے مجموعی درجہ بندی کا پیمانہ
zh_cn: 学生最终成绩的总分级表

source: Your Shopping cart is currently empty.
ar: سلة التسوق الخاصة بك فارغة حاليا.
ur: آپ کی خریداری کی ٹوکری فی الحال خالی ہے.
zh_cn: 您的购物车目前是空的。

source: Audit This Course (No Certificate)
ar: تدقيق هذه الدورة التدريبية (بدون شهادة)
ur: آڈٹ اس کورس (کوئی سرٹیفکیٹ)
zh_cn: 审核此课程（无证书）

source: Enter the details for Course Instructor
ar: أدخل التفاصيل الخاصة بـ Course Instructor
ur: کورس انسٹرکٹر کے لئے تفصیلات درج کریں
zh_cn: 输入课程讲师的详细信息

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
ar: استخدم تحديثات الدورة التدريبية لإعلام الطلاب بالتواريخ أو الاختبارات الهامة ، وإلقاء الضوء على مناقشات محددة في المنتديات ، وإعلان تغييرات الجدول ، والرد على أسئلة الطلاب. يمكنك إضافة أو تحرير التحديثات في HTML.
ur: اہم تاریخوں یا امتحانوں کے طالب علموں کو مطلع کرنے کے لئے کورس کے اپ ڈیٹس کا استعمال کریں، فورمز میں خاص بات چیت کو نمایاں کریں، شیڈول میں تبدیلیوں کا اعلان کریں اور طالب علم کے سوالات کا جواب دیں. آپ HTML میں اپ ڈیٹس شامل یا ترمیم کریں.
zh_cn: 使用课程更新通知学生重要日期或考试，突出论坛中的特定讨论，通知时间表更改以及回答学生问题。您可以在HTML中添加或编辑更新。

source: Image: %s
ar: الصورة:٪ s
ur: تصویر:٪ s
zh_cn: 图片

source: After this purchase is complete, {username} will be enrolled in this course.
ar: بعد اكتمال عملية الشراء هذه ، سيتم تسجيل {username} في هذه الدورة التدريبية.
ur: اس خریداری کے بعد، اس کورس میں {صارف کا نام} درج کیا جائے گا.
zh_cn: 购买完成后，{username}将被注册到本课程中。

source: To grant or deny this request, use the course creator admin table.
ar: لمنح هذا الطلب أو رفضه ، استخدم جدول إدارة منشئي الدورة التدريبية.
ur: اس درخواست کو منظور یا انکار کرنے کے لئے، کورس کے تخلیق منتظم منتظم کی میزبانی کریں.
zh_cn: 要授予或拒绝此请求，请使用课程创建者管理表。

source: Publishing on Date
ar: النشر على التاريخ
ur: تاریخ پر اشاعت
zh_cn: 在日期发布

source: Catalog search
ar: البحث في الكتالوج
ur: تلاش کی تلاش
zh_cn: 目录搜索

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
ar: عنوان URL لاسترداد القيمة هو: [[أدخل عنوان URL هنا من ملف CSV المرفق]]
ur: آپ کا موصول url ہے: [[منسلک CSV سے یہاں یو آر ایل کو دوبارہ درج کریں]]
zh_cn: 您的兑换网址是：[[从附件CSV输入兑换网址]]

source: {sign_in_link} or {register_link} and then enroll in this course.
ar: {sign_in_link} أو {register_link} ثم التسجيل في هذه الدورة التدريبية.
ur: {sign_in_link} یا {register_link} اور پھر اس کورس میں اندراج کریں.
zh_cn: {sign_in_link}或{register_link}，然后报名参加本课程。

source: Other/Prefer Not to Say
ar: آخر / يفضل عدم قول
ur: دوسرے / پسند نہیں کہنا چاہتے ہیں
zh_cn: 其他/不喜欢说

source: Request API Access
ar: طلب الوصول إلى واجهة برمجة التطبيقات
ur: API رسائی کی درخواست کریں
zh_cn: 请求API访问

source: About Exporting Libraries
ar: حول تصدير المكتبات
ur: لائبریریوں کو برآمد کرنے کے بارے میں
zh_cn: 关于导出库

source: Please Enter the numeric value for the course price
ar: يرجى إدخال القيمة الرقمية لسعر الدورة
ur: براہ مہربانی کورس کی قیمت کے لئے عددی قدر درج کریں
zh_cn: 请输入课程价格的数字值

source: No data provided for user preference update
ar: لا توجد بيانات مقدمة لتحديث تفضيلات المستخدم
ur: صارف ترجیح کو اپ ڈیٹ کے لئے فراہم کردہ کوئی ڈیٹا نہیں
zh_cn: 没有提供用户偏好更新的数据

source: Visual
ar: بصري
ur: بصری
zh_cn: 视觉

source: Free
ar: حر
ur: مفت
zh_cn: 自由
