Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: You must complete the section '{prereq_section_name}' with the required score before you are able to view this content.
ar: يجب عليك إكمال القسم &quot;{prereq_section_name}&quot; بالنتيجة المطلوبة قبل أن تتمكن من مشاهدة هذا المحتوى.
ur: آپ کو لازمی سکور کے ساتھ سیکشن &#39;{prereq_section_name}&#39; مکمل کرنا ضروری ہے اس سے پہلے کہ آپ اس مواد کو دیکھنے کے قابل ہو.
zh_cn: 您必须先填写所需分数的“{prereq_section_name}”部分，然后才能查看此内容。

source: Enable Subsection Prerequisites
ar: تمكين Subsection المتطلبات الأساسية
ur: سبسکرائب کی ضروریات کو فعال کریں
zh_cn: 启用子部分先决条件

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
ar: صحيح إذا كان يجب عرض المناطق الزمنية في التواريخ في الدورة التدريبية. موقوف لصالح due_date_display_format.
ur: یہ سچ ہے کہ اگر کورسز میں کورسز پر ٹائم زونز کو دکھایا جانا چاہئے. due_date_display_format کے حق میں محروم.
zh_cn: 如果时间区应显示在课程日期，则为真。已弃用，以支持due_date_display_format。

source: Location of Annotation backend
ar: موقع التعليق التوضيحي الخلفي
ur: تشریح بیک اپ کی جگہ
zh_cn: 注释后端的位置

source: Your course's schedule determines when students can enroll in and begin a course.
ar: يحدد جدول الدورة التدريبية متى يمكن للطلاب التسجيل في الدورة التدريبية وبدءها.
ur: آپ کے کورس کے شیڈول کا تعین ہوتا ہے جب طالب علم داخل ہوسکتے ہیں اور کورس شروع کرسکتے ہیں.
zh_cn: 您的课程安排将决定学生何时可以注册并开始课程。

source: (for student enrollment and access)
ar: (لتسجيل الطلاب والوصول)
ur: (طالب علم داخلہ اور رسائی کے لئے)
zh_cn: （供学生注册和使用）

source: Blacklist {country} for {course}
ar: القائمة السوداء {country} لـ {course}
ur: {کورس} کے لئے بلیک لسٹ {ملک}
zh_cn: {course}的黑名单{country}

source: Enrollment Mode
ar: وضع التسجيل
ur: اندراج موڈ
zh_cn: 注册模式

source: Remove Flag
ar: إزالة العلم
ur: پرچم کو ہٹا دیں
zh_cn: 删除标志

source: You requested a credit for a capture that was previously voided
ar: لقد طلبت رصيدًا لعملية التقاط تم إلغاءها سابقًا
ur: آپ نے اس گرفتاری کے لۓ ایک کریڈٹ کی درخواست کی ہے جو پہلے سے وابستہ تھی
zh_cn: 您要求获得以前无效的拍摄金额

source: Enter a valid email address that contains at least {min} characters.
ar: أدخل عنوان بريد إلكتروني صالحًا يحتوي على {min} حرف على الأقل.
ur: ایک درست ای میل ایڈریس درج کریں جس میں کم از کم {منٹ} حروف شامل ہیں.
zh_cn: 输入一个包含至少{min}个字符的有效电子邮件地址。

source: %s was successfully added.
ar: تمت إضافة٪ s بنجاح.
ur: ٪ s کامیابی سے شامل کیا گیا تھا.
zh_cn: ％s已成功添加。

source: Unknown
ar: غير معروف
ur: نامعلوم
zh_cn: 未知

source: Enter true or false. If true, the course will be available to mobile devices.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فستتوفر الدورة التدريبية للأجهزة المحمولة.
ur: صحیح یا غلط درج کریں. اگر سچ ہے، کورس موبائل آلات کے لئے دستیاب ہو جائے گا.
zh_cn: 输入true或false。如果属实，该课程将适用于移动设备。

source: There is a problem with this transcript file. Try to upload a different file.
ar: هناك مشكلة في ملف النص هذا. حاول تحميل ملف مختلف.
ur: اس ٹرانسپٹ فائل کے ساتھ ایک مسئلہ ہے. ایک مختلف فائل اپ لوڈ کرنے کی کوشش کریں.
zh_cn: 这个抄本文件存在问题。尝试上传不同的文件。

source: Certificates
ar: شهادات
ur: سرٹیفکیٹس
zh_cn: 证书

source: Add Beta Tester
ar: إضافة اختبار بيتا
ur: بیٹا ٹیسٹر شامل کریں
zh_cn: 添加Beta测试器

source: image revisions
ar: صور التنقيحات
ur: تصویری ترمیم
zh_cn: 图像修订

source: Deleted the selected configuration(s).
ar: حذف التكوين (التكوينات) المحدد.
ur: منتخب کردہ ترتیبات حذف کر دیے گئے ہیں.
zh_cn: 删除选定的配置。

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
ar: كما هو الحال في نظام ملفات UNIX ، يمكن إعطاء الأذونات إلى مستخدم وفقًا لعضوية المجموعة. يتم التعامل مع المجموعات من خلال نظام المصادقة Django.
ur: UNIX فائل سسٹم کی طرح، گروپ کی رکنیت کے مطابق ایک صارف کو اجازت دی جا سکتی ہے. گروپوں کو Django مصنف نظام کے ذریعے سنبھال لیا جاتا ہے.
zh_cn: 与在UNIX文件系统中一样，可以根据组成员资格向用户授予权限。组通过Django认证系统进行处理。

source: Unable to generate redeem codes because of course misconfiguration.
ar: يتعذر إنشاء رموز الاسترداد بسبب التهيئة الخاطئة بالطبع.
ur: کورس کے غلط ترتیب کی وجہ سے ریڈیم کوڈ پیدا کرنے میں ناکام.
zh_cn: 由于配置错误而无法生成兑换码。

source: Describe what you were doing when you encountered the issue. Include any details that will help us to troubleshoot, including error messages that you saw.
ar: صف ما كنت تفعله عند مواجهة المشكلة. قم بتضمين أي تفاصيل تساعدنا على تحرّي الخلل وإصلاحه ، بما في ذلك رسائل الخطأ التي شاهدتها.
ur: بیان کرتے ہیں کہ جب آپ مسئلے کا سامنا کرتے ہیں تو کیا کریں گے. کسی بھی تفصیلات کو شامل کریں جو ہم نے دیکھا کہ غلطی کے پیغامات سمیت آپ کو دشواری کا حل کرنے میں مدد ملے گی.
zh_cn: 描述你在遇到问题时所做的事情。包含将帮助我们排除故障的任何详细信息，包括您看到的错误消息。

source: These dates impact {strong_start}when your courseware can be viewed{strong_end}, but they are {strong_start}not the dates shown on your course summary page{strong_end}. To provide the course start and registration dates as shown on your course summary page, follow the instructions provided by your Program Manager.
ar: تؤثر هذه التواريخ على {strong_start} عندما يمكن مشاهدة البرامج التعليمية الخاصة بك {strong_end} ، ولكنها {strong_start} ليست التواريخ المعروضة في صفحة ملخص الدورة الخاصة بك {strong_end}. لتوفير مواعيد بدء الدورة التدريبية وتسجيلها كما هو موضح في صفحة ملخص الدورة التدريبية الخاصة بك ، اتبع الإرشادات التي يوفرها مدير البرنامج.
ur: یہ تاریخوں {strong_start} پر اثر انداز ہوتے ہیں جب آپ کے کورس {strong_end} کو دیکھا جا سکتا ہے، لیکن وہ {strong_start} نہیں ہیں جو آپ کے کورس کے خلاصہ صفحے پر دکھایا گیا ہے {strong_end}. کورس کورس اور رجسٹریشن کی تاریخ فراہم کرنے کے لۓ اپنے کورس خلاصہ صفحے پر دکھایا گیا ہے، آپ کے پروگرام مینیجر کے ذریعہ فراہم شدہ ہدایات پر عمل کریں.
zh_cn: 这些日期影响{strong_start}，您的课件可以在{strong_start}中查看{strong_start}，而不是课程摘要页面{strong_end}中显示的日期。要提供课程摘要页面上显示的课程开始和注册日期，请按照程序管理员提供的说明进行操作。

source: Required Information to Create a New Course
ar: المعلومات المطلوبة لإنشاء دورة جديدة
ur: نیا کورس تخلیق کرنے کے لئے ضروری معلومات
zh_cn: 创建新课程所需的信息

source: Choose Language
ar: اختر اللغة
ur: زبان منتخب کریں
zh_cn: 选择语言

source: Posts I'm Following
ar: المشاركات التي أتابعها
ur: مراسلہ میں مندرجہ ذیل ہوں
zh_cn: 我正在关注的帖子

source: Enter true or false. If true, students cannot view the progress graph.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فلن يتمكن الطلاب من عرض الرسم البياني للتقدم.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، طالب علم ترقی گراف نہیں دیکھ سکتے ہیں.
zh_cn: 输入true或false。如果属实，则学生无法查看进度图。

source: Keep learning in %(course_name)s
ar: استمر في التعلم في٪ (course_name) s
ur: ٪ (course_name) s میں سیکھنا جاری رکھیں
zh_cn: 继续学习％（课程名称）

source: Current revision changed for %s.
ar: تم تغيير النسخة الحالية لـ٪ s.
ur: موجودہ ترمیم٪ s کے لئے بدل گیا.
zh_cn: 当前版本已更改为％s。

source: When your payment is complete, return to the dashboard and click the {bold_start}Request Credit{bold_end} button under the course title to request an official academic transcript at the institution that granted the credit.
ar: عند اكتمال عملية الدفع ، ارجع إلى لوحة التحكم وانقر على زر {bold_start} طلب الائتمان {bold_end} تحت عنوان الدورة لطلب نسخة أكاديمية رسمية من المؤسسة التي منحت الرصيد.
ur: جب آپ کی ادائیگی مکمل ہوجائی جاتی ہے تو، ڈیش بورڈ پر واپس آ جائیں اور کورس کے تحت {bold_start} درخواست کریڈٹ {bold_end} بٹن پر کلک کریں جس میں کریڈٹ دیا گیا ہے.
zh_cn: 付款完成后，请返回仪表板，然后点击课程标题下的{bold_start}请求学分{bold_end}按钮，以向授予该学分的机构申请正式的学术成绩单。

source: Course Introduction Video
ar: بالطبع مقدمة فيديو
ur: کورس کا تعارف ویڈیو
zh_cn: 课程简介视频

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
ar: إذا تمت الموافقة على طلبك ، فسوف نزودك بتعليمات للتحقق من هويتك على edx.org حتى تتمكن من البدء في العمل نحو إكمال دورة edX الخاصة بك.
ur: اگر آپ کی درخواست منظوری دی جاتی ہے تو ہم آپ کو اپنی شناخت کو edx.org پر دیئے جانے کے لئے دے گا تاکہ آپ اپنے ایکس ایکس کورس کو مکمل کرنے کے لۓ کام شروع کر سکیں.
zh_cn: 如果您的申请获得批准，我们会向您提供在edx.org上验证您的身份的说明，以便您可以开始致力于完成edX课程。

source: %s has been restored
ar: تمت استعادة٪ s
ur: ٪ s بحال کردیا گیا ہے
zh_cn: ％s已被恢复

source: Payer authentication could not be authenticated
ar: لا يمكن مصادقة مصادقة الدافع
ur: پیار کی توثیق کی تصدیق نہیں کی جا سکتی
zh_cn: 付款人身份验证无法通过身份验证

source: Heading
ar: عنوان
ur: سرخی
zh_cn: 标题

source: Your certificate is available
ar: شهادتك متاحة
ur: آپ کا سرٹیفکیٹ دستیاب ہے
zh_cn: 您的证书可用

source: View Dashboard
ar: عرض لوحة التحكم
ur: ڈیش بورڈ دیکھیں
zh_cn: 查看仪表板

source: Could not parse amount as a decimal
ar: لا يمكن تحليل المبلغ كقيمة عشرية
ur: رقم کو ایک ڈیسر کے طور پر پارس نہیں مل سکا
zh_cn: 无法将数量解析为小数

source: User ID
ar: معرف المستخدم
ur: صارف کی شناخت
zh_cn: 用户名

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
ar: المناقشات تجري حاليا صيانة. سوف نعيدهم قريبا!
ur: بات چیت فی الحال بحالی سے گزر رہی ہے. ہم انہیں جلد ہی بیک اپ کریں گے!
zh_cn: 讨论目前正在进行维护。我们会尽快让他们回来！

source: There is a problem with this certificate.
ar: هناك مشكلة في هذه الشهادة.
ur: اس سرٹیفکیٹ کے ساتھ ایک مسئلہ ہے.
zh_cn: 这个证书有问题。

source: Change Enrollment Code Status
ar: تغيير حالة رمز التسجيل
ur: اندراج کوڈ کی حیثیت کو تبدیل کریں
zh_cn: 更改注册码状态

source: Enrollment confirmation
ar: تأكيد التسجيل
ur: اندراج کی توثیق
zh_cn: 入学确认

source: Schedule & Details
ar: الجدول والتفاصيل
ur: شیڈول اور تفصیلات
zh_cn: 附表和细节

source: Keeping Your Course Organized
ar: الحفاظ على تنظيم الدورة التدريبية الخاصة بك
ur: اپنے کورس کو منظم کرنا
zh_cn: 保持课程的有序组织

source: Need help registering with {platform_name}?
ar: هل تحتاج إلى مساعدة في التسجيل باستخدام {platform_name}؟
ur: {platform_name} کے ساتھ مدد رجسٹریشن کی ضرورت ہے؟
zh_cn: 需要帮助{platform_name}注册？

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
ar: قم بتحرير اسم ملف الصورة المصغرة للفيديو. يمكنك ضبط صورة الفيديو المصغرة في صفحة الإعدادات والتفاصيل.
ur: ویڈیو تھمب نیل تصویر فائل کے نام میں ترمیم کریں. آپ ویڈیو تھمب نیل کی تصویر ترتیبات اور تفصیلات کے صفحہ پر سیٹ کرسکتے ہیں.
zh_cn: 编辑视频缩略图图像文件的名称。您可以在设置和详细信息页面上设置视频缩略图。

source: Select the highest level of education you have completed.
ar: حدد أعلى مستوى من التعليم الذي أكملته.
ur: آپ نے مکمل کیا تعلیم کی اعلی ترین سطح کا انتخاب کریں.
zh_cn: 选择您已完成的最高级别的教育。

source: Build out your profile to personalize your identity on {platform_name}.
ar: أنشئ ملفًا شخصيًا لتخصيص هويتك على {platform_name}.
ur: {platform_name} پر اپنی شناخت کو ذاتی بنانے کیلئے اپنی پروفائل بنا دیں.
zh_cn: 在{platform_name}上构建您的个人资料以个性化您的身份。

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
ar: يساعدك أعضاء فريق الدورة التدريبية مع دور الموظفين في إدارة الدورة التدريبية. يمكن للموظفين تسجيل المتعلمين وإلغاء التسجيل ، بالإضافة إلى تعديل درجاتهم والوصول إلى جميع بيانات الدورة التدريبية. يمكن للموظفين أيضًا الوصول إلى مقررك في Studio and Insights. يمكنك فقط إعطاء أدوار فريق المقرر للمستخدمين المسجلين.
ur: اسٹاف کردار کے ساتھ کورس کے ٹیم کے ارکان آپ کے کورس کا انتظام کرنے میں مدد کرتے ہیں. اسٹاف سیکھنے والوں کو اندراج اور غیر معزول کر سکتے ہیں، ساتھ ساتھ ان کے گریڈ میں ترمیم اور تمام کورس کے اعداد و شمار تک رسائی حاصل کرسکتے ہیں. سٹوڈیو اور انسپائٹس میں اسٹاف تک آپ کا کورس تک رسائی حاصل ہے. آپ کورسز ٹیم کے رول کو صارفین کو اندراج کرنے کے لئے صرف دے سکتے ہیں.
zh_cn: 具有员工角色的课程团队成员可帮助您管理课程。员工可以注册并取消注册学习者，并修改他们的成绩并访问所有课程数据。工作人员还可以在Studio和Insights中访问您的课程。您只能将课程团队角色授予注册用户。

source: You're already enrolled for this course. Visit your {link_start}dashboard{link_end} to see the course.
ar: أنت مسجل بالفعل لهذه الدورة التدريبية. تفضل بزيارة {link_start} لوحة المعلومات {link_end} لمشاهدة الدورة التدريبية.
ur: آپ پہلے ہی اس کورس کے لئے اندراج کر رہے ہیں. کورس دیکھنے کیلئے اپنے {link_start} ڈیش بورڈ {link_end} پر جائیں.
zh_cn: 你已经参加了这门课程。访问您的{link_start}信息中心{link_end}查看课程。

source: Add comment
ar: أضف تعليق
ur: تبصرہ شامل کریں
zh_cn: 添加评论

source: current revision
ar: مراجعة حالية
ur: موجودہ نظر ثانی
zh_cn: 当前修订

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
ar: تم تفعيل هذا الحساب ، الذي تم إعداده باستخدام {email} ، بالفعل. يرجى تسجيل الدخول لبدء العمل في {studio_name}.
ur: یہ اکاؤنٹ، {ای میل} کا استعمال کرتے ہوئے قائم ہے، پہلے ہی چالو کر دیا گیا ہے. {سٹوڈیو_ نام} کے اندر کام کرنے کے لئے براہ کرم سائن ان کریں.
zh_cn: 这个使用{email}设置的帐户已被激活。请登录开始在{studio_name}中工作。

source: Keep up the momentum!
ar: حافظ على الزخم!
ur: رفتار رکھو!
zh_cn: 保持势头！

source: See XML source line {sourcenum}.
ar: راجع سطر مصدر XML {sourcenum}.
ur: XML ذریعہ لائن {sourcenum} ملاحظہ کریں.
zh_cn: 请参阅XML源代码行{sourcenum}。

source: Error in resetting your password. Please try again.
ar: خطأ في إعادة تعيين كلمة المرور الخاصة بك. حاول مرة اخرى.
ur: اپنا پاس ورڈ دوبارہ ترتیب دینے میں خرابی دوبارہ کوشش کریں.
zh_cn: 重置密码时出错。请再试一次。

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
ar: النسبة المئوية للملحق (٪) والملحقات المترية (d، c، m، u، n، p، k، M، G، T)
ur: فی صد نشانی (٪) اور میٹرک انکس (ڈی، سی، ایم، یو، ن، پی، ک، ایم، جی، ٹی)
zh_cn: 百分号（％）和度量词缀（d，c，m，u，n，p，k，M，G，T）

source: Issued On:
ar: الصادر في:
ur: جاری ہوا:
zh_cn: 发布：

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
ar: يمكنك أيضًا إنشاء أنواع الواجبات ، مثل الواجبات المنزلية والمختبرات والاختبارات والاختبارات ، وتحديد مقدار تقدير كل نوع من أنواع المهام لكل طالب.
ur: آپ تفویض کی اقسام، جیسے ہوم ورک، لیبز، کوئز، اور امتحان بھی تشکیل دے سکتے ہیں، اور اس بات کی وضاحت کریں کہ کتنی طالب علم کی گریڈ ہر تفویض کی قسم ہے.
zh_cn: 您还可以创建作业类型，如作业，实验室，测验和考试，并指定每个作业类型值多少学生的成绩。

source: Deadline for purchasing and requesting credit.
ar: الموعد النهائي لشراء وطلب الائتمان.
ur: خریداری اور کریڈٹ کی درخواست کے لئے آخری وقت.
zh_cn: 购买和申请信用的截止日期。

source: View this course as:
ar: عرض هذه الدورة التدريبية على النحو التالي:
ur: اس کورس کے طور پر دیکھیں:
zh_cn: 查看此课程为：

source: problem responses
ar: استجابات مشكلة
ur: مسئلہ کے جواب
zh_cn: 问题反应

source: Subscribe to the {platform_name} YouTube channel
ar: اشترك في قناة {platform_name} YouTube
ur: {platform_name} یو ٹیوب چینل کو سبسکرائب کریں
zh_cn: 订阅{platform_name} YouTube频道

source: Incomplete
ar: غير مكتمل
ur: نامکمل
zh_cn: 残缺

source: Course End Date
ar: تاريخ انتهاء الدورة التدريبية
ur: کورس کے اختتام کی تاریخ
zh_cn: 课程结束日期

source: There was a problem with the staff answer to this problem: complex boundary.
ar: كانت هناك مشكلة في إجابة الموظفين على هذه المشكلة: الحدود المعقدة.
ur: عملے کے ساتھ اس مسئلہ کا جواب تھا: پیچیدہ حد.
zh_cn: 工作人员回答这个问题时存在一个问题：复杂的边界。

source: Enter the date to announce your course.
ar: أدخل التاريخ للإعلان عن دورتك.
ur: اپنے کورس کا اعلان کرنے کے لئے تاریخ درج کریں.
zh_cn: 输入日期以宣布您的课程。

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
ar: لم يستوفِ طلبك المعايير / الإرشادات التي حددها {platform_name} الموظفون.
ur: آپ کی درخواست نے {platform_name} اسٹافز کی وضاحت کردہ معیار / ہدایات کو پورا نہیں کیا.
zh_cn: 您的请求未符合{platform_name}工作人员指定的标准/准则。

source: Download a CSV of problem responses
ar: يمكنك تنزيل ملف CSV لردود المشكلة
ur: دشواری ردعمل کے ایک CSV ڈاؤن لوڈ کریں
zh_cn: 下载问题回复的CSV

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on edX. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
ar: السماح لمدرسي الدورة التدريبية بتعيين أدوار مدرب CCX ، والسماح للمدربين بإدارة الدورات المخصصة على edX. عند الخداع ، لا يمكن إنشاء الدورات المخصصة ، ولكن سيتم الاحتفاظ بالدروس المخصصة الحالية.
ur: CCX کوچ کرداروں کو تفویض کرنے کے لئے کورس کے اساتذہ کی اجازت دیں، اور کوچ کو edX پر اپنی مرضی کے کورسز کو منظم کرنے کی اجازت دیں. جب غلط، اپنی مرضی کے کورسز کو نہیں بنایا جاسکتا ہے، لیکن موجودہ کسٹم کورسز کو محفوظ رکھا جائے گا.
zh_cn: 允许课程导师分配CCX Coach角色，并允许教练管理edX上的自定义课程。如果为false，则无法创建自定义课程，但现有的自定义课程将保留。

source: Feedback on your work from the grader:
ar: ردود الفعل على عملك من الممهدة:
ur: grader سے آپ کے کام پر تاثرات:
zh_cn: 您对平地机工作的反馈：

source: In order to sign in, you need to activate your account.<br /><br />We just sent an activation link to <strong>{email}</strong>. If you do not receive an email, check your spam folders or <a href="{support_url}">contact {platform} Support</a>.
ar: لتسجيل الدخول ، يلزمك تنشيط حسابك. <br /><br /> لقد أرسلنا للتو رابط تنشيط إلى <strong>{email}</strong> . إذا لم تستلم رسالة بريد إلكتروني ، فتحقق من مجلدات الرسائل غير المرغوب فيها أو <a href="{support_url}">اتصل بـ {platform} Support</a> .
ur: سائن ان کرنے کے لئے، آپ کو اپنے اکاؤنٹ کو فعال کرنے کی ضرورت ہے. <br /><br /> ہم نے صرف <strong>{ای میل} پر</strong> ایک سرگرمی کا لنک بھیجا ہے. اگر آپ کو ایک ای میل نہیں ملتا ہے تو، اپنے سپیم فولڈر کو چیک کریں یا <a href="{support_url}">{پلیٹ فارم} سپورٹ سے رابطہ کریں</a> .
zh_cn: 为了登录，您需要激活您的帐户。 <br /><br />我们刚刚发送了一封激活链接到<strong>{email}</strong> 。如果您没有收到电子邮件，请检查您的垃圾邮件文件夹或<a href="{support_url}">联系{平台}支持</a> 。

source: Course End
ar: نهاية الدورة
ur: کورس اختتام
zh_cn: 课程结束

source: You can then enroll in {course_name}.
ar: يمكنك بعد ذلك التسجيل في {course_name}.
ur: آپ پھر {course_name} میں اندراج کرسکتے ہیں.
zh_cn: 然后，您可以注册{course_name}。

source: Answer not provided for {input_type}
ar: الإجابة غير مقدمة لـ {input_type}
ur: {input_type} کے لئے فراہم کردہ جواب نہیں
zh_cn: 没有为{input_type}提供答案

source: Comment level too deep
ar: مستوى التعليق عميق للغاية
ur: تبصرہ کی سطح بہت گہری ہے
zh_cn: 评论级别太深

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply to injunctive remedies (or an equivalent type of urgent legal relief) in any jursdiction.
ar: أنت توافق على أن الشروط ، واجهات برمجة التطبيقات ، وأي مطالبة أو نزاع ينشأ عن أو تتعلق بالشروط أو واجهات برمجة التطبيقات ستحكمها قوانين كومنولث ماساتشوستس ، مع استبعاد تعارضها مع أحكام القانون. أنت توافق على أن جميع هذه الدعاوى والنزاعات سوف يتم الاستماع إليها وحلها حصريًا في المحاكم الفيدرالية أو محاكم الولاية الموجودة في مدينة كامبريدج بولاية ماساتشوستس الأمريكية ، وتخدمها. أنت توافق على الاختصاص الشخصي لهذه المحاكم على أنت لهذا الغرض ، وتتنازل أنت وتوافق على عدم لتأكيد أي اعتراض على مثل هذه الإجراءات في تلك المحاكم (بما في ذلك أي دفاع أو اعتراض على عدم وجود ولاية قضائية أو مكان مناسب أو إزعاج من المنتدى). بغض النظر عما سبق ذكره ، فإنك توافق على أنه سيظل يسمح لـ {platform_name} بالتقدم إلى التعويضات القضائية (أو أي نوع مكافئ من الإعانات القانونية العاجلة) في أي حالة من الحالات.
ur: آپ اس بات سے اتفاق کرتے ہیں کہ شرائط، APIs، اور کسی بھی دعوی یا تنازعات یا API کے شرائط سے متعلق ہونے والی تنازعات کے لۓ قانون کے مراکز کے تنازعات کو چھوڑ کر، مشترکہ میساچیٹس کے قوانین کی طرف سے کنٹرول کیا جائے گا. آپ اس بات سے اتفاق کرتے ہیں کہ اس طرح کے دعوی اور تنازعے کو سنبھالا اور خاص طور پر وفاقی یا ریاستی محکموں میں واقع کیا جاسکتا ہے جو کیمبرج، میساچیٹس، امریکہ کی خدمت کرتے ہیں اور آپ اس مقصد کے لئے ان پر عدالتوں کے ذاتی دائرہ اختیار کی رضامندي کرتے ہیں. ان عدالتوں میں اس طرح کی کارروائیوں پر کسی بھی اعتراض پر زور دینا (بشمول مناسب دائرہ کار یا مقام یا فورم کی تکلیف) کے فقدان کی کوئی دفاع یا اعتراض بھی شامل ہے. آگے بڑھنے کے باوجود، آپ اس بات سے اتفاق کرتے ہیں کہ {platform_name} کو اب بھی کسی بھی جرائم میں تابکاری سے متعلق علاج (یا ایک غیر قانونی قسم کی فوری قانونی امداد) پر لاگو کرنے کی اجازت دی جائے گی.
zh_cn: 您同意，条款，API以及由此条款或API引起或与之相关的任何索赔或争议均受马萨诸塞州联邦法律管辖，但不包括其法律冲突条款。您同意，所有此类索赔和纠纷都将在位于美国马萨诸塞州剑桥的联邦或州法院专门审理并解决。您同意为此目的对这些法院对您进行个人管辖，并且您放弃并且不同意在这些法院对这种诉讼提出异议（包括任何抗辩或反对缺乏适当的管辖权或地点或论坛不便）。尽管有上述规定，您同意{platform_name}仍然可以在任何争议中适用于禁令救济（或同等类型的紧急法律救济）。

source: Administer Courses
ar: إدارة الدورات
ur: کورسز کا انتظام کریں
zh_cn: 管理课程

source: Replace my library with the selected file
ar: استبدل المكتبة الخاصة بي بالملف المحدد
ur: منتخب کردہ فائل کے ساتھ میری لائبریری کو تبدیل کریں
zh_cn: 将我的库替换为选定的文件

source: must contain {0} or more non ascii characters
ar: يجب أن يحتوي على {0} أو أكثر من أحرف غير ascii
ur: {0} یا زیادہ غیر اسسیسی حروف پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多非ASCII字符

source: Today is {date}
ar: اليوم هو {date}
ur: آج {تاریخ}
zh_cn: 今天是{date}

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
ar: وصف قابل للقراءة من قبل الإنسان لشهادة المثال. على سبيل المثال ، &quot;التحقق&quot; أو &quot;الشرف&quot; للتمييز بين نوعين من الشهادات.
ur: مثال کے طور پر سرٹیفکیٹ کی انسانی پڑھنے کے قابل بیان. مثال کے طور پر، &#39;تصدیق شدہ&#39; یا &#39;اعزاز&#39; کو دو اقسام کے سرٹیفکیٹ کے درمیان مختلف کرنے کے لئے.
zh_cn: 示例证书的可读描述。例如，&#39;验证&#39;或&#39;荣誉&#39;来区分两种证书类型。

source: Score Override
ar: تجاوز النتيجة
ur: اسکور اوورائڈ
zh_cn: 分数覆盖

source: Whether or not the answers have been saved since last submit
ar: ما إذا كان قد تم حفظ الإجابات منذ إرسال آخر مرة أم لا
ur: آخری جمع کرانے کے بعد سے جوابات یافتہ نہیں ہیں یا نہیں
zh_cn: 自上次提交后是否保存了答案

source: Courses in the {}
ar: الدورات في {}
ur: کورسز {}
zh_cn: {}课程

source: Enter true or false. If true, the course appears in the list of new courses on edx.org, and a New! badge temporarily appears next to the course image.
ar: أدخل صح أو خطأ. إذا كان الأمر صحيحًا ، فستظهر الدورة التدريبية في قائمة الدورات التدريبية الجديدة على edx.org ، و New! شارة تظهر مؤقتًا بجوار صورة الدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر سچ ہے، کورس edx.org پر نئے کورسوں کی فہرست میں ظاہر ہوتا ہے، اور نیا! بیج کورس کی تصویر کے آگے عارضی طور پر ظاہر ہوتا ہے.
zh_cn: 输入true或false。如果属实，该课程将出现在edx.org上的新课程列表中，并且是新！徽章暂时出现在课程图片旁边。

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
ar: لقد تم إبطال حقوق إنشاء الدورات التدريبية الخاصة بك إلى {studio_name}. إذا كنت تعتقد أن هذا كان خطأً ، فيرجى الاتصال {email}
ur: {سٹوڈیو_ نام} کے کورس کے تخلیق کردہ حقوق کو منسوخ کر دیا گیا ہے. اگر آپ کو یقین ہے کہ یہ غلطی میں تھا، تو براہ مہربانی {ای میل} سے رابطہ کریں
zh_cn: {studio_name}的课程创建权已被撤销。如果您认为这是错误的，请联系{email}

source: Url for Annotation Storage
ar: Url للتعليق التوضيحي
ur: تشریح اسٹوریج کے لئے یو آر ایل
zh_cn: 注解存储的URL

source: Insufficient funds in the account. Possible fix: retry with another form of payment
ar: أموال غير كافية في الحساب. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: اکاؤنٹ میں ناکافی فنڈز. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 帐户资金不足。可能的解决方法：使用其他付款方式重试

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: لا تحتوي الدورة التدريبية حاليًا على صورة مصغّرة للفيديو. يرجى تحميل واحد (بتنسيق JPEG أو PNG ، والحد الأدنى للأبعاد المقترحة هو 375 بكسل × 200 بكسل)
ur: آپ کے کورس میں ویڈیو تھمب نیل تصویر نہیں ہے. براہ کرم ایک اپ لوڈ کریں (JPEG یا PNG کی شکل، اور کم از کم تجویز کردہ طول و عرض 375px وسیع 200px کی طرف سے وسیع ہیں)
zh_cn: 您的课程目前没有视频缩略图。请上传一张（JPEG或PNG格式，最小建议尺寸为375px宽×200px高）

source: Course id '{course_id}' is not valid
ar: معرف الدورة التدريبية &#39;{course_id}&#39; غير صالح
ur: کورس id &#39;{course_id}&#39; درست نہیں ہے
zh_cn: 课程ID“{course_id}”无效
