Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Add your first content group
ur: اپنا پہلا مواد گروپ شامل کریں

source: endorsed %(time_ago)s
ur: تصدیق شدہ٪ (time_ago) s

source: Deleting a team is permanent and cannot be undone. All members are removed from the team, and team discussions can no longer be accessed.
ur: کسی ٹیم کو حذف کرنا مستقل ہے اور اسے غیر مستحکم نہیں کیا جاسکتا ہے. تمام اراکین کو ٹیم سے ہٹا دیا گیا ہے، اور ٹیم کے مباحثے تک رسائی حاصل نہیں ہوسکتی ہے.

source: Click on this button to mute or unmute this video or press UP or DOWN buttons to increase or decrease volume level.
ur: اس ویڈیو پر گونگا یا انمیٹ کرنے کے لئے اس بٹن پر کلک کریں یا حجم کی سطح کو بڑھانے یا کم کرنے کیلئے UP یا DOWN بٹن دبائیں.

source: Requester
ur: درخواست

source: Assessment Results Visibility
ur: تشخیص کے نتائج کی نمائش

source: Return and add email address
ur: واپسی اور ای میل پتہ شامل کریں

source: Checkout with PayPal
ur: پے پال کے ساتھ چیک آؤٹ

source: Joined
ur: شامل

source: Allow others to distribute derivative works only under a license identical to the license that governs your work. This option is incompatible with "No Derivatives".
ur: دوسروں کو ڈس کلیٹو کاموں کو صرف لائسنس کے تحت تقسیم کرنے کی اجازت دیں جو آپ کے کام پر عملدرآمد کرے گی. یہ اختیار &quot;نہیں ڈیریویٹیٹ&quot; کے ساتھ مطابقت رکھتا ہے.

source: Submitted
ur: پیش کردہ

source: Delete "<%= signatoryName %>" from the list of signatories?
ur: حذف کریں &lt;&lt;= = signatoryName٪&gt; &quot;سائنیٹریٹریز کی فہرست سے؟

source: To use the current photo, select the camera button {icon}. To take another photo, select the retake button {icon}.
ur: موجودہ تصویر کا استعمال کرنے کیلئے، کیمرے کے بٹن {آئکن} کو منتخب کریں. ایک اور تصویر لینے کے لۓ، دوبارہ بٹن کو منتخب کریں {icon}.

source: Enrollment Opens on
ur: اندراج کھولتا ہے

source: Actions
ur: ایکشنز

source: Optional long description
ur: اختیاری طویل وضاحت

source: Click to change
ur: تبدیل کرنے کے لئے کلک کریں

source: Upset Learner
ur: سیکھتے ہیں

source: All Topics
ur: تمام موضوعات

source: Undo moving
ur: آگے بڑھو

source: Video ID
ur: ویڈیو ID

source: Could not find users associated with the following identifiers:
ur: مندرجہ ذیل شناخت کے ساتھ منسلک صارفین تلاش نہیں کر سکتے ہیں:

source: Formats
ur: شکلیں

source: My Orders
ur: میرے احکام

source: Options for {license_name}
ur: {license_name} کے اختیارات

source: Preferred Language
ur: پسندیدہ زبان

source: Public
ur: عوام

source: Financial Assistance
ur: مالی امداد

source: Background color
ur: پس منظر کا رنگ

source: Paste is now in plain text mode. Contents will now be pasted as plain text until you toggle this option off.
ur: پیسٹ اب سادہ متن کے موڈ میں ہے. اس اختیار کو دور کرنے تک فہرست ابھی سادہ متن کے طور پر چلے جائیں گے.

source: Country or Region of Residence
ur: ملک یا رہائش کا علاقہ

source: Update
ur: اپ ڈیٹ

source: Undo
ur: واپس کریں

source: Fill browser
ur: براؤزر بھریں

source: The {cohortGroupName} cohort has been created. You can manually add students to this cohort below.
ur: {cohortGroupName} کوہور پیدا کیا گیا ہے. آپ ذیل میں اس کوھورٹ میں طلباء کو دستی طور پر شامل کرسکتے ہیں.

source: You can use your {accountName} account to sign in to your {platformName} account.
ur: آپ اپنے {platformName} اکاؤنٹ میں سائن ان کرنے کیلئے اپنے {accountName} کا اکاؤنٹ استعمال کرسکتے ہیں.

source: Must complete verification checkpoint
ur: توثیقی چیک پوائنٹ لازمی ہے

source: Instructor Photo
ur: انسٹرکٹر تصویر

source: Generate the user's certificate
ur: صارف کا سرٹیفکیٹ بنائیں

source: Description of the certificate
ur: سرٹیفکیٹ کا تفصیل

source: Always show assessment results
ur: ہمیشہ تشخیص کے نتائج دکھائیں

source: View discussion
ur: بحث دیکھیں

source: Paragraph
ur: پیراگراف

source: This link will open in a modal window
ur: یہ لنک موڈل ونڈو میں کھل جائے گا

source: Save Changes
ur: تبدیلیاں محفوظ کرو

source: details about the failure
ur: ناکامی کے بارے میں تفصیلات

source: Mute
ur: گونگا

source: Move
ur: اقدام

source: Tell other learners a little about yourself: where you live, what your interests are, why you're taking courses, or what you hope to learn.
ur: دیگر سیکھنے والوں کو اپنے بارے میں تھوڑا سا بتاؤ: جہاں آپ رہتے ہیں، آپ کی دلچسپی کیا ہے، آپ کورسز کیوں لے رہے ہیں، یا آپ کو سیکھنے کی امید ہے.

source: Please verify that you have uploaded a valid image (PNG and JPEG).
ur: براہ کرم تصدیق کریں کہ آپ نے ایک درست تصویر (PNG اور JPEG) اپ لوڈ کی ہیں.

source: Please enter your %(field)s.
ur: براہ مہربانی اپنے٪ (فیلڈ) کے درجے درج کریں.

source: Please enter an integer greater than 0.
ur: براہ کرم 0 سے زیادہ ایک عدد داخل کریں.

source: Align right
ur: صحیح سیدھ کریں

source: Create Account
ur: اکاؤنٹ بنائیں

source: Press discard changes to discard changes.
ur: تبدیلیوں کو منسوخ کرنے کیلئے تبدیلیاں دبائیں.

source: Grading
ur: گریڈنگ

source: Question
ur: سوال

source: Source
ur: ذریعہ

source: Add a comment
ur: ایک تبصرہ شامل کریں

source: Edit this certificate?
ur: اس سرٹیفکیٹ میں ترمیم کریں

source: Team description cannot have more than 300 characters.
ur: ٹیم کی وضاحت 300 سے زیادہ حروف نہیں ہوسکتی ہے.

source: Units
ur: یونٹس

source: Removal is in progress. To avoid errors, stay on this page until the process is complete.
ur: ہٹانا جاری ہے. غلطیوں سے بچنے کے لئے، اس صفحے پر رہیں جب تک کہ عمل مکمل ہوجائے.

source: Everyone who has staff privileges in this course
ur: ہر کوئی جو اس کورس میں استحقاق رکھتا ہے

source: Title
ur: عنوان

source: Upper Alpha
ur: اپر الفا

source: There is invalid code in your content. Please check to make sure it is valid HTML.
ur: آپ کے مواد میں غلط کوڈ ہے. براہ کرم یقینی بنائیں کہ یہ درست ایچ ٹی ایم ایل ہے.

source: {email}
ur: {ای میل}

source: Started At
ur: شروع میں

source: View Teams in the %(topic_name)s Topic
ur: ٪ (topic_name) کے موضوع میں ٹیموں کو دیکھیں

source: emphasized text
ur: زور دیا متن

source: Edit HTML
ur: HTML میں ترمیم کریں

source: You have not created any content groups yet.
ur: آپ نے ابھی تک کوئی مواد گروپ نہیں بنائے ہیں.

source: This team does not have any members.
ur: اس ٹیم میں کسی بھی رکن نہیں ہے.

source: Support education research by providing additional information
ur: اضافی معلومات فراہم کر کے تعلیم کی تحقیقات کی حمایت کریں

source: Release Status:
ur: رہائی کی حیثیت:

source: Next: %(nextStepTitle)s
ur: اگلا:٪ (اگلے اسٹیٹ ٹیبلٹ) s

source: %d minute
ur: ٪ d منٹ

source: Anchor
ur: لنگر

source: e.g. 'Sky with clouds'. The description is helpful for users who cannot see the image.
ur: مثلا بادلوں کے ساتھ آسمان. وضاحت صارفین کے لئے مددگار ہے جو تصویر کو نہیں دیکھ سکتے.

source: {transcriptClientTitle}_{transcriptLanguageCode}.{fileExtension}
ur: {transcriptClientTitle} _ {ٹرانزیکشن زبان کوڈ}. {fileExtension}

source: Revoke access
ur: رسائی کالعدم

source: Enroll Now
ur: ابھی نام درج کرائیں

source: Not Graded
ur: درجہ بندی نہیں

source: Timed Transcript Conflict
ur: ٹرانزیکشن تنازعہ

source: Upload Signature Image
ur: دستخط تصویر اپ لوڈ کریں

source: Start Date
ur: شروع کرنے کی تاریخ

source: Close Calculator
ur: کیلکولیٹر بند کریں

source: EdX has a timed transcript for this video. If you want to replace this transcript, upload a new .srt transcript file. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript.
ur: اس ویڈیو کے لئے ایڈیکس ایک ٹائم ٹرانزیکشن ہے. اگر آپ اس نقل کو تبدیل کرنا چاہتے ہیں تو، ایک نئی. ایس آر آر ٹرانسپٹ فائل کو اپ لوڈ کریں. اگر آپ اس نقل میں ترمیم کرنا چاہتے ہیں تو، آپ موجودہ ٹرانزیشن کو ڈاؤن لوڈ کرسکتے ہیں، ترمیم کریں اور دوبارہ اپ لوڈ کرسکتے ہیں.

source: %(num_students)s student opened Subsection
ur: ٪ (num_students) کے طالب علم کو سبسکرائب کیا گیا

source: Additional posts could not be loaded. Refresh the page and try again.
ur: اضافی مراسلہ لوڈ نہیں کی جا سکتی. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Low
ur: کم

source: Are you sure you want to select this session?
ur: کیا آپ واقعی یہ سیشن منتخب کرنا چاہتے ہیں؟

source: We couldn't create your account.
ur: ہم آپ کا اکاؤنٹ نہیں بن سکا.

source: remove all
ur: سب کو ہٹا دیں

source: Use enrollment tracks as the basis for dividing discussions. All learners, regardless of their enrollment track, see the same discussion topics, but within divided topics, only learners who are in the same enrollment track see and respond to each others’ posts.
ur: بات چیت تقسیم کرنے کے لئے بنیاد کے طور پر اندراج ٹریکز کا استعمال کریں. تمام سیکھنے والے، قطع نظر ان کے اندراج کے راستے پر، اسی بحث کے موضوعات ملاحظہ کریں، لیکن تقسیم شدہ موضوعات کے اندر، صرف اساتذہ جو ایک ہی اندراج میں ہیں، ایک دوسرے کے پیغامات کو دیکھیں اور جواب دیں.

source: Sent To
ur: کو بھیجا

source: Show Previews
ur: پیش نظارہ دکھائیں

source: Emails successfully sent. The following users are no longer enrolled in the course:
ur: ای میلز کو کامیابی سے بھیجا گیا مندرجہ ذیل صارفین اب کورس میں داخل نہیں ہوئے ہیں:

source: Be sure your entire face is inside the frame
ur: اس بات کا یقین کرو کہ آپ کا پورا چہرہ فریم کے اندر ہے

source: Center
ur: مرکز

source: Footer
ur: فوٹر

source: posted %(time_ago)s by %(author)s
ur: ٪ (time_ago) کی طرف سے٪ (مصنف) s پوسٹ کیا گیا

source: You have unsaved changes. Do you really want to leave this page?
ur: آپ کے پاس محفوظ کردہ تبدیلییں ہیں. کیا آپ واقعی اس صفحہ کو چھوڑنا چاہتے ہیں؟

source: Subject:
ur: مضمون:

source: Heading
ur: سرخی

source: %(username)s
ur: ٪ (صارف نام) s

source: General
ur: جنرل

source: Limit Access
ur: محدود رسائی

source: Photo Captured successfully.
ur: تصویر کامیابی سے قبضہ

source: Currently selected
ur: فی الحال منتخب کردہ

source: Cohort Name
ur: کوہوٹر نام

source: An error has occurred. Please try again.
ur: ایک خرابی آگئی ہے. دوبارہ کوشش کریں.

source: Max file size exceeded
ur: زیادہ سے زیادہ فائل کا سائز زیادہ ہوگیا

source: Ignore all
ur: سب کو نظر انداز کریں

source: there is currently {numVotes} vote
ur: فی الحال {numvotes} ووٹ ہے

source: Are you sure you wish to delete this item. It cannot be reversed! Also any content that links/refers to this item will no longer work (e.g. broken images and/or links)
ur: کیا آپ واقعی یہ آئٹم حذف کرنا چاہتے ہیں. یہ تبدیل نہیں کیا جاسکتا ہے! اس کے علاوہ کوئی بھی مواد جو اس آئٹم کے لنکس / حوالہ سے زیادہ کام نہیں کرے گا (مثال کے طور پر ٹوٹا ہوا تصاویر اور / یا لنکس)

source: Add your first group configuration
ur: اپنی پہلی گروپ ترتیب میں شامل کریں

source: Insert column after
ur: کالم درج کریں

source: The combined length of the organization and library code fields cannot be more than <%=limit%> characters.
ur: تنظیم اور لائبریری کوڈ فیلڈز کی مشترکہ لمبائی &lt;٪ = حد٪&gt; حروف سے زیادہ نہیں ہوسکتی ہے.

source: You can no longer change sessions.
ur: آپ مزید سیشن تبدیل نہیں کر سکتے ہیں.

source: Take me to the new location
ur: مجھے نئے مقام پر لے لو

source: Will Be Visible To:
ur: دیکھیں گے:

source: Poster
ur: پوسٹر

source: Paste
ur: پیسٹ کریں

source: Bulleted List (Ctrl+U)
ur: بلبل فہرست (Ctrl + U)

source: Templates
ur: سانچے

source: Click OK to have your username sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ur: تیسری پارٹی کی درخواست پر اپنا صارف نامہ بھیجنے کے لئے ٹھیک پر کلک کریں. اپنی معلومات کو بھیجنے کے بغیر اس صفحے پر واپس آنے کیلئے منسوخ کریں پر کلک کریں.

source: {screen_reader_start}Warning:{screen_reader_end} The previously selected content group was deleted. Select another content group.
ur: {screen_reader_start} انتباہ: {screen_reader_end} پہلے منتخب کردہ مواد گروپ کو حذف کردیا گیا تھا. دوسرا مواد گروپ منتخب کریں.

source: Sent By:
ur: کی طرف سے بھیجا:

source: Deleting
ur: حذف کرنا

source: Find next
ur: اگلا تالاش کریں

source: off
ur: بند

source: Upload a CSV file
ur: ایک CSV فائل اپ لوڈ کریں

source: The file could not be uploaded.
ur: فائل کو اپ لوڈ نہیں کیا جا سکا.

source: {hours}:{minutes} (current UTC time)
ur: {گھنٹے}: {منٹ} (موجودہ یو این سی وقت)

source: This file type is not supported. Supported file type is {supportedFileFormat}.
ur: یہ فائل کی قسم کی حمایت نہیں کی جاتی ہے. معاون فائل کی قسم {سپورٹ فولائل فارمیٹ} ہے.

source: Total
ur: کل

source: Press discard changes to discard your changes.
ur: اپنی تبدیلیوں کو ختم کرنے کے لئے تبدیلیاں پریس کریں.

source: The minimum grade for course credit is not set.
ur: کورس کی کریڈٹ کے لئے کم از کم گریڈ قائم نہیں کیا گیا ہے.

source: Insert column before
ur: پہلے کالم ڈالیں

source: You have not created any group configurations yet.
ur: آپ نے ابھی تک کسی گروپ ترتیب کو نہیں بنایا ہے.

source: unanswered question
ur: جوابی سوال

source: All learners in the {track_name} track
ur: {track_name} ٹریک میں تمام سیکھنے والے

source: Split cell
ur: سپلٹ سیل

source: Error deleting entrance exam state for student '{student_id}'. Make sure student identifier is correct.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ امتحان کی ریاست کو حذف کرنے میں خرابی. یقینی بنائیں کہ طالب علم کی شناخت درست ہے.

source: To continue learning with this account, sign in below.
ur: اس اکاؤنٹ کے ساتھ سیکھنے جاری رکھنے کے لئے، ذیل میں سائن ان کریں.

source: Deleting a textbook cannot be undone and once deleted any reference to it in your courseware's navigation will also be removed.
ur: کسی درسی کتاب کو حذف نہیں کیا جاسکتا اور ایک بار آپ کو اس کے نیوی گیشن میں کسی بھی حوالہ کو خارج کر دیا جائے گا.

source: This certificate has already been activated and is live. Are you sure you want to continue editing?
ur: یہ سرٹیفکیٹ پہلے ہی چالو کر رہا ہے اور زندہ ہے. کیا آپ واقعی میں ترمیم جاری رکھنا چاہتے ہیں؟

source: Already a member
ur: پہلے سے ہی رکن

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
ur: درج ذیل صارفین کو اندراج کے ای میلز کو کامیابی سے بھیج دیا. انہیں رجسٹر کرنے کے بعد انہیں اندراج کرنے کی اجازت ہوگی:

source: To finalize course credit, %(display_name)s requires %(platform_name)s learners to submit a credit request.
ur: کورس کریڈٹ کو حتمی شکل دینے کے لئے،٪ (display_name) کی ضرورت ہے٪ (platform_name) سیکھنے والے کریڈٹ کی درخواست جمع کرنے کے لئے.

source: {sessionDates} - Currently Selected
ur: {sessiondates} - فی الحال منتخب کردہ

source: Enter a student's username or email address.
ur: ایک طالب علم کے صارف نام یا ای میل ایڈریس درج کریں.

source: Notes visible
ur: نوٹس دکھائیں

source: Last updated
ur: آخری اپ ڈیٹ

source: Error generating proctored exam results. Please try again.
ur: پروکیکڈ امتحان کے نتائج پیدا کرنے میں خرابی دوبارہ کوشش کریں.

source: Studio's having trouble saving your work
ur: سٹوڈیو آپ کے کام کو بچانے میں مشکل ہے

source: Robots
ur: روبوٹ

source: Link Description
ur: لنک تفصیل

source: Timed Transcript Found
ur: ٹائم شدہ ٹرانسمیشن ملا

source: Reason
ur: وجہ

source: To receive a certificate, you must also verify your identity before {date}.
ur: ایک سرٹیفکیٹ حاصل کرنے کے لئے، آپ {تاریخ} سے پہلے آپ کی شناخت کی بھی تصدیق کرنا ضروری ہے.

source: Validation Error While Saving
ur: محفوظ کرنے کے دوران توثیق کی خرابی

source: Error adding/removing users as beta testers.
ur: صارفین کو بیٹا ٹیسرز کے طور پر شامل کرنے / ہٹانے میں خرابی.

source: Something went wrong changing this enrollment. Please try again.
ur: اس اندراج کو تبدیل کرنے میں کچھ غلط ہو گیا. دوبارہ کوشش کریں.

source: Heading 6
ur: سرخی 6

source: Photo Identification
ur: تصویر کی شناخت

source: Heading 4
ur: سرخی 4

source: Drop target image
ur: ہدف تصویر ڈراو

source: The timed transcript for the first video file does not appear to be the same as the timed transcript for the second video file.
ur: پہلی ویڈیو فائل کے لئے ٹائم شدہ ٹریک اس کی دوسری ویڈیو فائل کے لئے ٹائم ٹرانزیکشن کے طور پر ہی نہیں ہوتا.

source: This annotation has %(count)s flag.
ur: اس تشریح میں٪ (شمار) کی پرچم ہے.

source: Components
ur: اجزاء

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from {platformName} to verify your identity.
ur: اگر آپ ابھی اپنی شناخت کی توثیق نہیں کرتے ہیں تو، آپ اپنے کورس کو اپنے ڈیش بورڈ سے بھی تلاش کرسکتے ہیں. اپنی شناخت کی توثیق کے لئے آپ {platformName} سے دور دراز یاد دہانی حاصل کریں گے.

source: Due Date:
ur: اخری تاریخ:

source: Please enter an integer between 0 and 100.
ur: براہ مہربانی 0 اور 100 کے درمیان ایک انٹری درج کریں.

source: Sign in here using your email address and password.
ur: اپنے ای میل پتہ اور پاس ورڈ کا استعمال کرکے یہاں سائن ان کریں.

source: This problem has been reset.
ur: یہ مسئلہ ری سیٹ کردی گئی ہے.

source: Encoding
ur: انکوڈنگ

source: Your request could not be completed. Reload the page and try again.
ur: آپ کی درخواست مکمل نہیں کی جا سکتی. صفحہ دوبارہ لوڈ کریں اور دوبارہ کوشش کریں.

source: Clear search
ur: تلاش صاف کریں

source: We couldn't find any results for "%s".
ur: ہم &quot;٪ s&quot; کے لئے کوئی نتیجہ نہیں مل سکا.

source: Warning
ur: انتباہ

source: Photo of %(fullName)s
ur: تصویر کا٪ (مکمل نام) s

source: H Align
ur: H سیدھا

source: Settings updated
ur: ترتیبات اپ ڈیٹ

source: Could not grade your answer. The submission was aborted.
ur: آپ کا جواب گریڈ نہیں کیا جا سکا. جمع کردی گئی تھی.

source: Add your first textbook
ur: اپنی پہلی نصابی کتاب میں شامل کریں

source: Link types should be unique.
ur: لنک کی اقسام کو منفرد ہونا چاہئے.

source: Transcript will be displayed when you start playing the video.
ur: جب آپ ویڈیو چلانے شروع کرتے ہیں تو ٹرانسپٹ دکھایا جائے گا.

source: Upload your first asset
ur: اپنی پہلی اثاثہ اپ لوڈ کریں

source: Due Time in UTC:
ur: UTC میں کی وجہ سے وقت:

source: Editor
ur: ایڈیٹر

source: Edit Team
ur: ٹیم میں ترمیم کریں

source: Loading posts list
ur: خطوط کی فہرست لوڈ ہو رہی ہے

source: This browser cannot play .mp4, .ogg, or .webm files.
ur: یہ براؤزر .mp4، .ogg، یا .webm فائلوں کو نہیں چل سکتا.

source: No Content Group
ur: کوئی مواد گروپ نہیں

source: This image file type is not supported. Supported file types are {supportedFileFormats}.
ur: یہ تصویر فائل کی قسم کی حمایت نہیں کی جاتی ہے. معاون فائل کی اقسام {معاونتفائل فہرست} ہیں.

source: Preview
ur: پیش نظارہ

source: Upload your banner image.
ur: اپنا بینر تصویر اپ لوڈ کریں.

source: You are enrolling in: {courseName}
ur: آپ ان میں داخلہ کر رہے ہیں: {courseName}

source: High Definition
ur: اعلی معیار

source: Take a photo of your ID
ur: اپنی شناخت کی تصویر لیں

source: Recommended image resolution is {imageResolution}, maximum image file size should be {maxFileSize} and format must be one of {supportedImageFormats}.
ur: سفارش کردہ تصویر قرارداد {imageResolution} ہے، زیادہ سے زیادہ تصویر فائل کا سائز ہونا چاہئے {maxFileSize} اور فارمیٹ میں ہونا لازمی ہے {معاونآپ کی فہرست}.

source: You could not be subscribed to this post. Refresh the page and try again.
ur: آپ کو اس اشاعت میں سبسکرائب نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Error getting student list.
ur: طالب علم کی فہرست حاصل کرنے میں خرابی

source: Chapter name and asset_path are both required
ur: باب کا نام اور asset_path دونوں کی ضرورت ہے

source: Visual aids
ur: بصری ایڈز

source: Use your webcam to take a photo of your face. We will match this photo with the photo on your ID.
ur: اپنے چہرے کی تصویر لینے کے لئے اپنے ویب کیم کا استعمال کریں. ہم اس تصویر سے آپ کی شناخت پر تصویر کے ساتھ ملیں گے.

source: Select fidelity
ur: مخلص کو منتخب کریں

source: This post is visible only to %(group_name)s.
ur: یہ اشاعت صرف٪ (group_name) کے لئے نظر آتا ہے.

source: Load all responses
ur: تمام جوابات لوڈ کریں

source: Saved cohort
ur: محفوظ کاہور

source: Edit your post below.
ur: ذیل میں اپنی پوسٹ میں ترمیم کریں.

source: The number of assignments of this type that will be dropped. The lowest scoring assignments are dropped first.
ur: اس قسم کی تفویض کی تعداد کو گرا دیا جائے گا. سب سے کم اسکورنگ کا کام سب سے پہلے گرا دیا گیا ہے.

source: Replace
ur: تبدیل کریں

source: Mark enrollment code as unused
ur: غیر استعمال شدہ طور پر داخلہ اندراج کوڈ

source: about an hour
ur: تقریبا ایک گھنٹہ

source: Add Allowance
ur: الاؤنس شامل کریں

source: Previous
ur: پچھلا

source: Please enter a valid donation amount.
ur: براہ کرم ایک درست عطیہ رقم درج کریں.

source: You are currently sharing a limited profile.
ur: آپ فی الحال محدود پروفائل کا اشتراک کر رہے ہیں.

source: Error getting student progress url for '<%- student_id %>'. Make sure that the student identifier is spelled correctly.
ur: &#39;&lt;٪ - student_id٪&gt;&#39; کے لئے طالب علم ترقی کے url کو حاصل کرنے میں خرابی. اس بات کو یقینی بنائیں کہ طالب علم کی شناخت کو درست طریقے سے ہجے کر دیا گیا ہے.

source: Promote another member to Admin to remove your admin rights
ur: اپنے منتظم حقوق کو دور کرنے کے لئے ایک اور رکن ایڈمن کو فروغ دیں

source: about a minute
ur: تقریبا ایک منٹ

source: Enter username or email
ur: اسم رکنیت یا ای میل داخل کریں

source: Certificate Generated
ur: سرٹیفکیٹ تیار

source: Reset my password
ur: میرا پاس ورڈ دوبارہ ترتیب دیں

source: Please add the instructor's biography
ur: براہ کرم انسٹریکٹر کی جیونی شامل کریں

source: All subsections
ur: تمام سبسڈیشنز

source: The photo of your face matches the photo on your ID.
ur: آپ کے چہرے کی تصویر آپ کی شناخت پر تصویر سے ملتی ہے.

source: Add a New Allowance
ur: ایک نیا الاؤنس شامل کریں

source: Assign students to cohorts by uploading a CSV file.
ur: طالب علموں کو ایک CSV فائل کو اپ لوڈ کرنے کی طرف اشارہ کرنا.

source: Recent Activity
ur: حالیہ سرگرمی

source: Cancel enrollment code
ur: داخلہ کوڈ منسوخ کریں

source: First time here?
ur: پہلی بار یہاں؟

source: (Community TA)
ur: (کمیونٹی ٹی اے)

source: No receipt available
ur: رسید دستیاب نہیں ہے

source: Title of the signatory
ur: دستخط کا عنوان

source: Date posted
ur: شائع کردہ تاریخ

source: Turn off transcripts
ur: ٹرانزیکٹس کو بند کریں

source: Editing post
ur: اشاعت میں ترمیم کریں

source: Subsection Visibility
ur: سبسکرائب کی نمائش

source: Following
ur: درج ذیل

source: Minimum Score:
ur: کم از کم اسکور:

source: Some images in this post have been omitted
ur: اس اشاعت میں کچھ تصاویر اتار دی گئی ہیں

source: Choose a content group to associate
ur: شریک کرنے کیلئے ایک مواد گروپ منتخب کریں

source: Select a time allotment for the exam. If it is over 24 hours, type in the amount of time. You can grant individual learners extra time to complete the exam through the Instructor Dashboard.
ur: امتحان کے لئے ایک وقت مختص منتخب کریں. اگر یہ 24 گھنٹوں سے زیادہ ہے، تو وقت کی مقدار میں ٹائپ کریں. آپ انسٹرکٹر ڈیش بورڈ کے ذریعہ امتحان کو مکمل کرنے کے لئے انفرادی سیکھنے اضافی وقت فراہم کرسکتے ہیں.

source: There was an error retrieving preview results for this catalog. Please check that your query is correct and try again.
ur: اس کیٹلاگ کے لئے پیش نظارہ کے نتائج حاصل کرنے میں ایک غلطی تھی. براہ کرم چیک کریں کہ آپ کا سوال درست ہے اور دوبارہ کوشش کریں.

source: File format not supported. Please upload a file with a {ext} extension.
ur: فائل کی شکل کی حمایت نہیں کی گئی. براہ کرم {ext} توسیع کے ساتھ ایک فائل اپ لوڈ کریں.

source: Restore enrollment code
ur: داخلہ کوڈ بحال کریں

source: Report annotation as inappropriate or offensive.
ur: تشریح کی اطلاع نامناسب یا جارحانہ طور پر.

source: Could not submit order
ur: حکم جمع نہیں کیا جا سکا

source: Paste row after
ur: قطار کے بعد قطار

source: (Self-paced) Ended {end}
ur: (خود پیڈ) اختتامی {اختتام}

source: The timed transcript for this video on edX is out of date, but YouTube has a current timed transcript for this video.
ur: EDX پر اس ویڈیو کے لئے ٹائم شدہ ٹرانکرپٹ تاریخ سے باہر ہے، لیکن YouTube میں اس ویڈیو کے لئے موجودہ ٹائم شدہ ٹرانزیشن ہے.

source: minutes
ur: منٹ

source: upload a PDF file or provide the path to a Studio asset file
ur: پی ڈی ایف فائل اپ لوڈ کریں یا سٹوڈیو اثاثہ فائل کو راستہ فراہم کریں

source: Download the user's certificate
ur: صارف کا سرٹیفکیٹ ڈاؤن لوڈ کریں

source: You have already reported this annotation.
ur: آپ نے پہلے ہی اس تشریح کی اطلاع دی ہے.

source: Certificate Details
ur: سرٹیفکیٹ کی تفصیلات

source: Subscript
ur: سبسکرائب
