Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Community TAs.
ar: أعضاء TAs المجتمع هم أعضاء المجتمع الذين يساعدون فرق المساق في إجراء مناقشات معتدلة. يمكنهم مشاهدة المشاركات بواسطة المتعلمين في المسار المخصص لهم أو مسار التسجيل ، ويمكنهم تحرير المشاركات أو حذفها أو مسح العلامات أو إغلاق أو إعادة فتح سلاسل الرسائل ، وتأييد الردود. يتم وضع علامات على مشاركاتهم كـ &quot;Community TA&quot;. يمكن إضافة المتعلمين المسجلين فقط كأعضاء في خدمة المجتمع.
ur: کمیونٹی ٹی اےز کمیونٹی کے ممبر ہیں جنہوں نے کورس ٹیموں کو اعتدال پسند بات چیت میں مدد فراہم کی ہے. وہ ان کے تفویض کوہور یا اندراج ٹریک میں سیکھنے والوں کی طرف سے خطوط دیکھ سکتے ہیں، اور پوزیشن، صاف جھنگوں، قریبی یا دوبارہ کھولنے کے سلسلے میں ترمیم یا خارج کرسکتے ہیں، اور رد عمل کو قبول کرسکتے ہیں. ان کی اشاعتیں &#39;کمیونٹی ٹی اے&#39; کے طور پر نشان لگا دیا گیا ہے. صرف اندراج شدہ سیکھنے والوں کو کمیونٹی ٹی اے کے طور پر شامل کیا جا سکتا ہے.
zh_cn: 社区助教是社区成员，帮助课程团队进行讨论。他们可以通过学习者在其分配的队列或注册轨迹中查看帖子，并可以编辑或删除帖子，清除标志，关闭或重新打开主题，并支持回复。他们的帖子被标记为“社区TA”。只有已注册的学习者可以添加为社区助教。

source: Poster URL
ar: عنوان الملصق
ur: پوسٹر یو آر ایل
zh_cn: 海报网址

source: Item is already present in target location.
ar: العنصر موجود بالفعل في الموقع المستهدف.
ur: آئٹم ہدف کی جگہ میں پہلے ہی موجود ہے.
zh_cn: 物品已存在于目标位置。

source: Error: No grader has been set up for this problem.
ar: خطأ: لم يتم إعداد أي من هذه المرحلة لهذه المشكلة.
ur: خرابی: اس مسئلہ کے لئے کوئی grader قائم نہیں کیا گیا ہے.
zh_cn: 错误：没有为此问题设置分级器。

source: You are unenrolled from
ar: أنت غير مسجل من
ur: آپ سے غیرت نہیں ہے
zh_cn: 你没有注册

source: Were you expecting to see a particular library here?
ar: هل كنت تتوقع رؤية مكتبة معينة هنا؟
ur: کیا آپ یہاں ایک خاص لائبریری دیکھ رہے تھے؟
zh_cn: 你期望在这里看到一个特定的图书馆吗？

source: Create an HTML file that contains an executive summary for this course.
ar: قم بإنشاء ملف HTML يحتوي على ملخص تنفيذي لهذه الدورة التدريبية.
ur: ایک HTML فائل بنائیں جس میں اس کورس کے ایگزیکٹو خلاصہ شامل ہے.
zh_cn: 创建一个包含本课程执行摘要的HTML文件。

source: You have been removed as a beta tester for {course_name} at {site_name} by a member of the course staff. The course will remain on your dashboard, but you will no longer be part of the beta testing group.
ar: لقد تمت إزالتك باعتبارك أحد مختبري النسخة التجريبية لـ {course_name} في {site_name} بواسطة أحد أعضاء فريق الدورة التدريبية. ستظل الدورة التدريبية على لوحة التحكم ، ولكن لن تكون جزءًا من مجموعة الاختبار التجريبي.
ur: آپ کو کورس کے عملے کے ایک رکن کے ذریعہ {course_name} پر {site_name} کے لئے بیٹا ٹیسٹر کے طور پر ہٹا دیا گیا ہے. کورس آپ کے ڈیش بورڈ پر رہیں گے، لیکن آپ اب بیٹا ٹیسٹنگ گروپ کا حصہ نہیں رہیں گے.
zh_cn: 您已被课程人员的成员作为{site_name}的{course_name}的测试版测试人员移除。该课程将保留在您的仪表板上，但您将不再是Beta测试组的成员。

source: Peer Grading
ar: تصنيف الأقران
ur: پیر گریڈنگ
zh_cn: 同伴评分

source: Self-Paced
ar: ذاتية السرعة
ur: خود کی جگہ
zh_cn: 自定进度

source: Please share with us your reasons for registering with {platform_name}
ar: يرجى مشاركتنا أسبابك في التسجيل مع {platform_name}
ur: {platform_name} کے ساتھ رجسٹر کرنے کے لئے ہمارے وجوہات کے ساتھ اشتراک کریں.
zh_cn: 请与我们分享您使用{platform_name}注册的理由

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
ar: اضبط هذا على &quot;true&quot; لوضع علامة على هذه الدورة التدريبية على أنها ذاتية التوجيه. لا تحتوي الدورات التدريبية الذاتية على مواعيد مستحقة للمهام الدراسية ، ويمكن للطلاب التقدم خلال الدورة بأي معدل قبل انتهاء الدورة التدريبية.
ur: خود کو اس کورس کو نشان زد کے طور پر نشان زد کرنے کیلئے اسے &quot;سچو&quot; میں مقرر کریں. خود پیڈ کورسز تفویض کے لئے مناسب تاریخ نہیں ہیں، اور طالب علم کورس کے اختتام سے پہلے کسی بھی شرح سے آگے بڑھا سکتے ہیں.
zh_cn: 将此设置为“true”以将此课程标记为自学。自学课程没有到期日的作业，学生可以在课程结束前以任何速度完成课程。

source: Number of days a learner has to upgrade after content is made available
ar: عدد الأيام التي يجب على المتعلم فيها الترقية بعد إتاحة المحتوى
ur: مواد کی دستیابی کے بعد سیکھنے والے کو اپ گریڈ کرنا ہوگا
zh_cn: 内容提供后学习者需要升级的天数

source: It looks like {email} belongs to an existing account. Try again with a different email address.
ar: يبدو أن {email} ينتمي إلى حساب حالي. حاول مرة أخرى باستخدام عنوان بريد إلكتروني مختلف.
ur: ایسا لگتا ہے کہ {ای میل} موجودہ اکاؤنٹ سے متعلق ہے. مختلف ای میل ایڈریس کے ساتھ دوبارہ کوشش کریں.
zh_cn: 它看起来像{email}属于一个现有帐户。请使用其他电子邮件地址再试一次。

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
ar: يستخدم {studio_name} تدرجًا هرميًا بسيطًا في {strong_start} أقسام {strong_end} و {strong_start} أقسام فرعية {strong_end} لتنظيم المحتوى الخاص بك.
ur: {سٹوڈیو_ نام} آپ کے مواد کو منظم کرنے کیلئے {strong_start} کے حصوں {strong_end} اور {strong_start} سبسڈیشنز {strong_end} کے سادہ تنظیمی ڈھانچے کا استعمال کرتا ہے.
zh_cn: {studio_name}使用{strong_start}节{strong_end}和{strong_start}小节{strong_end}的简单层次结构来组织您的内容。

source: emailed
ar: عبر البريد الالكتروني
ur: ای میل
zh_cn: 电子邮件

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: أدخل مفتاح واجهة برمجة التطبيقات الذي توفره MathWorks للوصول إلى خدمة MATLAB المستضافة. يتم منح هذا المفتاح للاستخدام الحصري في هذه الدورة التدريبية لمدة محددة. لا تشارك مفتاح واجهة برمجة التطبيقات مع الدورات التدريبية الأخرى. أخبر MathWorks على الفور إذا كنت تعتقد أن المفتاح مكشوف أو مخترق. للحصول على مفتاح للدورة التدريبية الخاصة بك ، أو للإبلاغ عن مشكلة ، الرجاء الاتصال moocsupport@mathworks.com
ur: MATLAB ہوسٹڈ سروس تک رسائی حاصل کرنے کے لئے MathWorks کی طرف سے فراہم API کی کلید درج کریں. یہ کلید مخصوص مدت کے لئے اس کورس میں مخصوص مدت کے لئے دی جاتی ہے. دوسرے کورسوں کے ساتھ API کی کلید کا اشتراک نہ کریں. اگر آپ کو یقین ہے کہ چابی کو بے نقاب یا سمجھا جاتا ہے تو فورا مطلع کریں MathWorks. اپنے کورس کے لئے ایک کلید حاصل کرنے کے لئے، یا ایک مسئلہ کی رپورٹ کرنے کے لئے، براہ کرم moocsupport@mathworks.com سے رابطہ کریں
zh_cn: 输入MathWorks提供的用于访问MATLAB Hosted Service的API密钥。此密钥授予此课程专用于指定的时间。不要与其他课程共享API密钥。如果您认为钥匙被暴露或被盗用，请立即通知MathWorks。要获得课程的关键信息或报告问题，请联系moocsupport@mathworks.com

source: Invalidate Certificates
ar: الشهادات الباطلة
ur: غیر قانونی سرٹیفکیٹس
zh_cn: 使证书失效

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below.
ar: يتم إنشاء تقرير {report_type}. لعرض حالة التقرير ، راجع Pending المهام أدناه.
ur: {report_type} کی رپورٹ تیار کی جا رہی ہے. رپورٹ کی حیثیت کو دیکھنے کے لئے، ذیل میں زیر التواء ٹاسک دیکھیں.
zh_cn: {report_type}报告正在创建中。要查看报告的状态，请参阅下面的挂起任务。

source: Compliance
ar: الالتزام
ur: تعمیل
zh_cn: 合规

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
ar: يمكن أن يساعدك رصيد الدورة التدريبية في الحصول على بداية سريعة على شهادتك الجامعية ، أو إنهاء درجة سبق أن بدأت ، أو الوفاء بالمتطلبات في مؤسسة أكاديمية مختلفة.
ur: کورس کریڈٹ آپ کو آپ کی یونیورسٹی کی ڈگری پر چھلانگ کی شروعات حاصل کرنے میں مدد مل سکتی ہے، پہلے ہی شروع کر دیا ڈگری ختم، یا مختلف تعلیمی ادارے میں ضروریات کو پورا کر سکتے ہیں.
zh_cn: 课程学分可帮助您在大学学位课程中获得快速启动，完成已开始的学位课程或在不同的学术机构完成要求。

source: You have successfully enrolled in {course_name}. This course has now been added to your dashboard.
ar: لقد قمت بالتسجيل بنجاح في {course_name}. تمت إضافة هذه الدورة التدريبية الآن إلى لوحة المعلومات.
ur: {کامیابی_نام} میں کامیابی سے آپ نے اندراج کیا ہے. یہ کورس اب آپ کے ڈیش بورڈ میں شامل کیا گیا ہے.
zh_cn: 您已成功注册{course_name}。此课程现已添加到您的仪表板。

source: You must select a session by {expiration_date} to access the course.
ar: يجب تحديد جلسة عن طريق {expiration_date} للوصول إلى الدورة التدريبية.
ur: کورس تک رسائی کیلئے آپ کو {expiration_date} کے ذریعہ سیشن کا انتخاب کرنا ہوگا.
zh_cn: 您必须通过{expiration_date}选择会话才能访问课程。

source: LEARN MORE
ar: أعرف أكثر
ur: اورجانیے
zh_cn: 学到更多

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
ar: العمود الفقري للدورة الخاصة بك هو كيف يتم تنظيمه. يقدم {studio_name} محررًا {strong_start} مخططًا تفصيليًا {strong_end} ، مما يوفر تسلسلًا هرميًا بسيطًا وسحبًا وإسقاطًا سهلًا لمساعدتك في تنظيم طلابك.
ur: آپ کے کورس کی ریبون یہ ہے کہ یہ کس طرح منظم ہے. {سٹوڈیو_ نام} ایک {strong_start} آؤٹ لائن {strong_end} ایڈیٹر پیش کرتا ہے، آپ کی مدد کرنے کے لئے سادہ سایڈست اور آسان ڈریگ اور ڈراپ فراہم کرتا ہے اور آپ کے طالب علم منظم رہ جاتے ہیں.
zh_cn: 你课程的骨干是它的组织方式。 {studio_name}提供{strong_start}大纲{strong_end}编辑器，提供简单的层次结构和简单的拖放操作，帮助您和学生保持组织。

source: The image file name can only contain letters, numbers, hyphens (-), and underscores (_).
ar: لا يمكن أن يحتوي اسم ملف الصورة إلا على أحرف وأرقام وواصلات (-) وشرطات سفلية (_).
ur: تصویر فائل کا نام صرف حروف، نمبر، ہائفینس (-)، اور اندراج (_) پر مشتمل ہوسکتا ہے.
zh_cn: 图像文件名称只能包含字母，数字，连字符（ - ）和下划线（_）。

source: Your course image URL
ar: عنوان URL لصورة الدورة التدريبية الخاصة بك
ur: آپ کا کورس تصویر URL
zh_cn: 您的课程图片网址

source: Problem Weight
ar: مشكلة الوزن
ur: مسئلہ وزن
zh_cn: 问题重量

source: ID Verified Ribbon/Badge
ar: معرف التحقق الشريط / شارة
ur: ID کی تصدیق شدہ ربن / بیج
zh_cn: ID验证功能区/徽章

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
ar: يجب الانتظار على الأقل {wait_secs} بين عمليات الإرسال. يتبقى {المتبقية}.
ur: آپ کو سب سے کم {wait_secs} پیشکشوں کے درمیان انتظار کرنا ہوگا. {remaining_secs} باقی ہے.
zh_cn: 提交之间必须至少等待{wait_secs}。剩余{remaining_secs}。

source: name
ar: اسم
ur: نام
zh_cn: 名称

source: Pre-Course Survey Name
ar: اسم المسح التمهيدي
ur: پری کورس سروے کا نام
zh_cn: 课前调查名称

source: The course you are looking for is closed for enrollment as of {date}.
ar: تم إغلاق الدورة التي تبحث عنها للتسجيل اعتبارًا من {date}.
ur: کورس آپ جو ڈھونڈ رہے ہیں {تاریخ} کے نام پر اندراج کے لئے بند کر دیا گیا ہے.
zh_cn: 您要查找的课程已于{date}截止报名。

source: An edX Verified Certificate signifies that the learner has agreed to abide by the edX honor code and completed all of the required tasks of this course under its guidelines, as well as having their photo ID checked to verify their identity.
ar: تشير شهادة EDX التي تم التحقق منها إلى أن المتعلم قد وافق على الالتزام بكود شرف edX وأنجز جميع المهام المطلوبة لهذه الدورة بموجب إرشاداتها ، بالإضافة إلى التحقق من هوية المستخدم للتحقق من هويته.
ur: ایک EDX تصدیق شدہ سرٹیفکیٹ اس بات کی نشاندہی کرتا ہے کہ سیکھنے نے EDX اعزاز کوڈ کو برقرار رکھنے پر اتفاق کیا ہے اور اس کورس کے تمام ضروری کاموں کو اس کے ہدایات کے تحت مکمل کیا ہے، اور ان کی تصویر کی شناخت ان کی شناخت کی توثیق کرنے کی جانچ پڑتال کی ہے.
zh_cn: edX认证证书表示学习者已经同意遵守edX荣誉代码，并根据其指导方针完成了本课程的所有必需任务，并且检查了其照片ID以验证其身份。

source: Your {platform_name} verification has expired.
ar: انتهت صلاحية التحقق {platform_name}.
ur: آپ {platform_name} کی توثیق ختم ہوگئی ہے.
zh_cn: 您的{platform_name}验证已过期。

source: Examples
ar: أمثلة
ur: مثال
zh_cn: 例子

source: If your course does not appear on your dashboard, contact {payment_support_link}.
ar: إذا لم تظهر الدورة التدريبية على لوحة التحكم ، فاتصل بـ {payment_support_link}.
ur: اگر آپ کا کورس آپ کے ڈیش بورڈ پر نہیں آتا تو {payment_support_link} سے رابطہ کریں.
zh_cn: 如果您的课程未显示在您的信息中心上，请与{payment_support_link}联系。

source: Upload Course Banner Image
ar: تحميل صورة شعار الدورة التدريبية
ur: اپ لوڈ کورس بینر کی تصویر
zh_cn: 上传课程横幅图片

source: Internal reference code for this invoice.
ar: رمز مرجعي داخلي لهذه الفاتورة.
ur: اس انوائس کے اندرونی حوالہ کوڈ.
zh_cn: 此发票的内部参考代码。

source: Value '{preference_value}' is not a valid time zone selection.
ar: القيمة &quot;{preference_value}&quot; ليست تحديدًا صالحًا للمنطقة الزمنية.
ur: ویلیو &#39;{ترجیحی صفول}&#39; ایک درست ٹائم زون کا انتخاب نہیں ہے.
zh_cn: 值“{preference_value}”不是有效的时区选择。

source: Email of the user that will be attached to all annotations that will be found in 'Instructor' tab.
ar: البريد الإلكتروني للمستخدم الذي سيتم إرفاقه بجميع التعليقات التوضيحية التي سيتم العثور عليها في علامة التبويب &quot;معلم&quot;.
ur: صارف کے ای میل جو تمام تشریحات سے منسلک کیا جائے گا جو &#39;انسٹرکٹر&#39; کے ٹیب میں مل جائے گا.
zh_cn: 用户的电子邮件将附加到将在“教师”选项卡中找到的所有注释。

source: Your imported content has now been integrated into this library
ar: تم الآن دمج المحتوى المستورد في هذه المكتبة
ur: آپ کی درآمد کردہ مواد اب اس لائبریری میں داخل ہو چکی ہے
zh_cn: 您导入的内容现在已被集成到此库中

source: There is a problem with the information in your CyberSource account. Please let us know at {0}
ar: هناك مشكلة في المعلومات الموجودة في حساب CyberSource الخاص بك. يرجى إخبارنا على {0}
ur: آپ سائبرسورس اکاؤنٹ میں معلومات کے ساتھ ایک مسئلہ ہے. برائے مہربانی ہمیں {0}
zh_cn: 您的Cyber​​Source帐户中的信息存在问题。请让我们知道在{0}

source: Successfully disabled {}'s account
ar: تم تعطيل حساب {} بنجاح
ur: کامیابی سے {} کا اکاؤنٹ غیر فعال کردیا گیا
zh_cn: 成功禁用{}的帐户

source: Statistic
ar: إحصائية
ur: اعداد و شمار
zh_cn: 统计

source: Your course creator status for {studio_name}
ar: حالة منشئ الدورة التدريبية الخاصة بك لـ {studio_name}
ur: {سٹوڈیو_ نام} کیلئے آپ کا کورس تخلیق کی حیثیت
zh_cn: {studio_name}的课程创建者状态

source: Contact Us
ar: اتصل بنا
ur: ہم سے رابطہ کریں
zh_cn: 联系我们

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: اسم الفئة الفرعية للمناقشة. يظهر هذا الاسم في الجزء الأيمن من منتدى المناقشة للدورة التدريبية.
ur: بحث کے لئے ایک ذیلی نام. یہ نام کورس کے بحث کے فورم کے بائیں جانب میں ظاہر ہوتا ہے.
zh_cn: 讨论的子类别名称。此名称显示在课程讨论论坛的左侧窗格中。

source: Enrollment is closed
ar: التسجيل مغلق
ur: اندراج بند ہے
zh_cn: 注册已关闭

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
ar: أدخل أزواج التواريخ التي لا يمكن للطلاب المشاركة فيها في منتديات المناقشة. داخل الأقواس المتوفرة ، أدخل مجموعة إضافية من الأقواس المربعة المحيطة بكل زوج من التواريخ التي تضيفها. تنسيق كل زوج من التواريخ كـ [&quot;YYYY-MM-DD&quot;، &quot;YYYY-MM-DD&quot;]. لتحديد الأوقات بالإضافة إلى التواريخ ، قم بتهيئة كل زوج كـ [&quot;YYYY-MM-DDTHH: MM&quot; ، &quot;YYYY-MM-DDTHH: MM&quot;]. تأكد من تضمين &quot;T&quot; بين التاريخ والوقت. على سبيل المثال ، يبدو الإدخال الذي يحدد فترتي تعتيم مثل هذا ، بما في ذلك الزوج الخارجي من الأقواس المربعة: [[&quot;2015-09-15&quot;، &quot;2015-09-21&quot;]، [&quot;2015-10-01&quot;، &quot; 2015/10/08 &quot;]]
ur: تاریخوں کے جوڑوں درج کریں جس کے درمیان طالب علم بحث فورمز میں پوسٹ نہیں کرسکتے. فراہم کردہ بریکٹ کے اندر اندر، ہر اضافی تاریخوں کے ارد گرد مربع بریکٹ کی اضافی سیٹ درج کریں جو آپ شامل کرتے ہیں. تاریخوں کے ہر جوڑے کی تشکیل [[YYYY-MM-DD &quot;،&quot; YYYY-MM-DD &quot;] کے طور پر. اوقات اور تاریخوں کی وضاحت کرنے کے لئے، ہر جوڑی کی شکل میں [&quot;YYYY-MM-DDTHH: MM&quot;، &quot;YYYY-MM-DDTHH: MM&quot;] کی شکل میں. تاریخ اور وقت کے درمیان &quot;T&quot; شامل کرنے کے لئے اس بات کا یقین کریں. مثال کے طور پر، دو بلیک آؤٹ دوروں کی وضاحت کرنے والے ایک اندراج اس طرح لگ رہا ہے، بشمول مربع بریکٹ کی بیرونی جوڑی: [[&quot;2015-09-15&quot;، &quot;2015-09-21&quot;]، [&quot;2015-10-01&quot;]، &quot; 2015-10-08 &quot;]]
zh_cn: 输入学生无法张贴到讨论论坛的日期对。在提供的括号内，围绕每个添加的日期对输入一组额外的方括号。将每个日期对格式化为[“YYYY-MM-DD”，“YYYY-MM-DD”]。要指定时间和日期，请将每个对格式化为[“YYYY-MM-DDTHH：MM”，“YYYY-MM-DDTHH：MM”]。确保在日期和时间之间包含“T”。例如，定义两个停电期的条目如下所示，包括外部的一对方括号：[[“2015-09-15”，“2015-09-21”]，[“2015-10-01”，“ 2015年10月8&quot; 日]

source: Awarded to:
ar: منحت إلى:
ur: کے لئے حاصل کیا:
zh_cn: 颁奖给：

source: Ask a Question
ar: طرح سؤال
ur: ایک سوال پوچھنا
zh_cn: 问一个问题

source: The name that will identify you in your courses. It cannot be changed later.
ar: الاسم الذي سيعرفك في دوراتك. فإنه لا يمكن تغييرها في وقت لاحق.
ur: جو نام آپ کے کورسوں میں آپ کی شناخت کرے گا. اسے بعد میں تبدیل نہیں کیا جا سکتا.
zh_cn: 这个名字将在你的课程中识别你。以后不能更改。

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {msg}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
ar: آسف! نظرًا لحدوث خطأ ، تم تحصيل رسوم الشراء الخاصة بك بمبلغ مختلف عن إجمالي الطلب! رسالة الخطأ المحددة هي: {msg}. من المحتمل أن يتم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ایک غلطی کی وجہ سے آپ کی خریداری کا حکم کل سے مختلف رقم کے لئے چارج کیا گیا تھا! مخصوص غلطی کا پیغام یہ ہے: {msg}. آپ کا کریڈٹ کارڈ شاید چارج کیا گیا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!由于出现错误，您的购买金额与订单总额不同！具体的错误信息是：{msg}。您的信用卡可能已被收费。请通过{email}与我们联系并提供特定付款问题。

source: Inactive Groups
ar: مجموعات غير نشطة
ur: غیر فعال گروپ
zh_cn: 无效组

source: Request user's username
ar: طلب اسم مستخدم المستخدم
ur: درخواست صارف کا صارف نام
zh_cn: 请求用户的用户名

source: I don't have the academic or language prerequisites
ar: ليس لدي المتطلبات الأكاديمية أو اللغة
ur: میرے پاس تعلیمی یا زبان کی ضروریات نہیں ہے
zh_cn: 我没有学术或语言的先决条件

source: Create My {platform_name} Account
ar: أنشئ حسابي على {platform_name}
ur: میرا {platform_name} اکاؤنٹ بنائیں
zh_cn: 创建我的{platform_name}帐户

source: We hope you are enjoying learning with us so far in %(first_course_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: نأمل أن تستمتع بالتعلم معنا حتى الآن في٪ (first_course_name) s! تتيح لك الشهادة التي تم التحقق منها إبراز معرفتك ومهاراتك الجديدة. شهادة٪ (platform_name) s رسمية ويمكن مشاركتها بسهولة. الترقية بواسطة٪ (user_schedule_upgrade_deadline_time) s.
ur: ہم امید کرتے ہیں کہ آپ ابھی تک ہمارے ساتھ سیکھنے سے لطف اندوز کر رہے ہیں٪ (first_course_name) s! ایک تصدیق شدہ سرٹیفکیٹ آپ کو اپنے نئے علم اور مہارت کو اجاگر کرنے کی اجازت دیتا ہے. ایک٪ (پلیٹ فارم_ نام) سرٹیفکیٹ سرکاری اور آسانی سے مستحکم ہے. ٪ (user_schedule_upgrade_deadline_time) کی طرف سے اپ گریڈ کریں.
zh_cn: 我们希望你在享受％（first_course_name）s的学习！经过验证的证书可让您突出显示您的新知识和技能。 ％（platform_name）的证书是官方的，并且可以轻松共享。通过％（user_schedule_upgrade_deadline_time）进行升级。

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
ar: معرف فريد لشهادة المثال. يتم استخدام هذا عندما نتلقى استجابة من قائمة الانتظار لتحديد شهادة المثال التي تمت معالجتها.
ur: مثالی سرٹیفکیٹ کے لئے ایک منفرد شناختی والا. یہ استعمال کیا جاتا ہے جب ہم قطار سے ایک جواب موصول ہونے کا تعین کرنے کے لئے کس طرح مثال کے طور پر سرٹیفکیٹ پر عملدرآمد کیا گیا تھا.
zh_cn: 示例证书的唯一标识符。当我们收到来自队列的响应以确定哪个示例证书已被处理时，就会使用它。

source: Legal
ar: قانوني
ur: قانونی
zh_cn: 法律

source: Log into your {platform_name} Account
ar: سجِّل الدخول إلى حسابك على {platform_name}
ur: اپنے {platform_name} اکاؤنٹ میں لاگ ان کریں
zh_cn: 登录到您的{platform_name}帐户

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
ar: وتتقدم الدورات التدريبية التي يسيرها المعلم بخطى ثابتة يحددها المؤلف. يمكنك تكوين تواريخ الإصدار لمحتوى الدورة التدريبية ومواعيد الاستحقاق للمهام.
ur: کورس کے مصنف کا کہنا ہے کہ رفتار سے اس کورس کے پیچیدہ کورسوں کی ترقی ہے. آپ کورس کے مواد اور تفویض کے لئے تاریخوں کے لئے رہائشی تاریخوں کو ترتیب دے سکتے ہیں.
zh_cn: 教师节奏的课程按照课程作者设定的速度进行。您可以配置课程内容的发布日期和作业的截止日期。

source: Add a New Page
ar: أضف صفحة جديدة
ur: نیا صفحہ شامل کریں
zh_cn: 添加一个新页面

source: {platform_name} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
ar: يجوز أيضًا لـ {platform_name} تحديث أو تعديل واجهات برمجة التطبيقات من وقت لآخر دون إشعار مسبق. قد تؤثر هذه التغييرات على استخدامك لواجهة برمجة التطبيقات أو طريقة تفاعلك مع واجهة برمجة التطبيقات. إذا أجرينا تغييرًا غير مقبول بالنسبة لك ، فيجب التوقف عن استخدام واجهات برمجة التطبيقات. استمرار استخدام واجهات برمجة التطبيقات يعني أنك تقبل التغيير.
ur: {platform_name} کو بغیر کسی پیشگی نوٹس کے وقت API سے اپ ڈیٹ یا اس میں ترمیم کرسکتا ہے. ان تبدیلیوں کو آپ کے API کے استعمال پر اثر انداز ہوسکتا ہے یا جس طرح سے آپ کے انضمام کے ساتھ API سے بات چیت ہوتی ہے. اگر ہم ایسی تبدیلی کرتے ہیں جو آپ کے لئے ناقابل قبول نہیں ہے تو، آپ کو API کے استعمال سے روکنا چاہئے. APIs کے مسلسل استعمال کا مطلب یہ ہے کہ آپ تبدیلی کو قبول کرتے ہیں.
zh_cn: {平台名称}也可能会不时更新或修改API，恕不另行通知。这些更改可能会影响您对API的使用或您的集成与API进行交互的方式。如果我们进行一项您无法接受的更改，则应停止使用这些API。继续使用这些API意味着您接受这一更改。

source: Unscheduled
ar: غير المجدولة
ur: ناپسندیدہ
zh_cn: 未计划

source: Email Settings
ar: إعدادات البريد الإلكتروني
ur: ای میل کی ترتیبات
zh_cn: 邮件设置

source: Read the list of courses in which you are a staff member.
ar: اقرأ قائمة الدورات التي تكون فيها أحد الموظفين.
ur: کورسز کی فہرست پڑھیں جس میں آپ عملے کے رکن ہیں.
zh_cn: 阅读你是一名工作人员的课程列表。

source: Component Display Name
ar: اسم عرض المكون
ur: اجزاء ڈسپلے کا نام
zh_cn: 组件显示名称

source: Save
ar: حفظ
ur: محفوظ کریں
zh_cn: 保存

source: Basic Information
ar: معلومات اساسية
ur: بنیادی معلومات
zh_cn: 基本信息

source: Only one coupon redemption is allowed against an order
ar: يُسمح باسترداد كوبون واحد فقط مقابل أحد الطلبات
ur: آرڈر کے خلاف صرف ایک کوپن چھوٹ کی اجازت ہے
zh_cn: 订单只能兑换一张优惠券

source: Remove beta testers
ar: إزالة اختبار بيتا
ur: بیٹا امتحان ہٹا دیں
zh_cn: 删除Beta版测试人员

source: For example, MITx
ar: على سبيل المثال ، MITx
ur: مثال کے طور پر، MITX
zh_cn: 例如，MITx

source: Bachelor's degree
ar: درجة البكالريوس
ur: بیچلر ڈگری
zh_cn: 学士学位

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
ar: للمستخدمين المتقدمين فقط. يمكن أن تؤدي الأخطاء في سياسة التقدير إلى فشل عرض الدورة التدريبية. لا يتحقق هذا النموذج من صحة السياسة قبل الحفظ.
ur: جدید ترین صارفین کیلئے صرف گریڈنگ پالیسی میں غلطیاں ظاہر کرنے کے لئے ناکامی کا سبب بن سکتی ہے. اس فارم کو بچانے سے پہلے پالیسی کی توثیق کی جانچ پڑتال نہیں کی جاتی ہے.
zh_cn: 仅适用于高级用户。评分政策中的错误可能导致课程无法显示。此表格在保存之前不检查保单的有效性。

source: Enter the default date by which problems are due.
ar: أدخل التاريخ الافتراضي الذي تستحقه المشاكل.
ur: پہلے سے طے شدہ تاریخ درج کریں جس کے ذریعہ مسائل کی وجہ سے ہو.
zh_cn: 输入问题到期的缺省日期。

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
ar: يشير هذا الإعداد إلى القواعد التي يجب أن يتبعها فريق المراقبين عند عرض مقاطع الفيديو.
ur: یہ ترتیب اس بات کی نشاندہی کرتا ہے کہ ویڈیو دیکھنے کے بعد پروکیکٹنگ ٹیم کو کونسی اصولوں کا پیچھا کرنا چاہئے.
zh_cn: 此设置指示监视团队在查看视频时应遵循的规则。
