Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
ar: يمكنك تقييد الوصول إلى هذا المكون للمتعلمين في مسارات تسجيل أو مجموعات محتوى محددة.
ur: آپ مخصوص اندراج کے پٹریوں یا مواد گروپوں میں سیکھنے والوں کو اس اجزاء تک رسائی محدود کر سکتے ہیں.
zh_cn: 您可以限制学生在特定的注册轨道或内容组中访问此组件。

source: Click to generate a CSV file of all proctored exam results in this course.
ar: انقر لإنشاء ملف CSV لجميع نتائج الاختبارات المضمنة في هذه الدورة التدريبية.
ur: اس کورس میں تمام متوقع امتحان کے نتائج کا ایک CSV فائل پیدا کرنے کے لئے کلک کریں.
zh_cn: 点击以生成本课程中所有监考成绩的CSV文件。

source: {course_number} {course_name} Cover Image
ar: {course_number} {course_name} صورة الغلاف
ur: {course_number} {course_name} کور تصویر
zh_cn: {course_number} {course_name}封面图片

source: {studio_name} Documentation
ar: {studio_name} التوثيق
ur: {سٹوڈیو_نام} دستاویزی
zh_cn: {studio_name}文档

source: Overall Grade Range
ar: نطاق الصف العام
ur: مجموعی طور پر گریڈ رینج
zh_cn: 总体成绩范围

source: Content Experiment
ar: تجربة المحتوى
ur: مواد تجربہ
zh_cn: 内容实验

source: Owner
ar: صاحب
ur: مالک
zh_cn: 所有者

source: Home
ar: الصفحة الرئيسية
ur: گھر
zh_cn: 家

source: You're receiving this e-mail because you requested a password reset for your user account at %(platform_name)s.
ar: أنت تتلقى رسالة البريد الإلكتروني هذه لأنك طلبت إعادة تعيين كلمة مرور لحساب المستخدم الخاص بك على٪ (platform_name) s.
ur: آپ یہ ای میل وصول کررہے ہیں کیونکہ آپ نے اپنے صارف اکاؤنٹ کے لئے پاس ورڈ ری سیٹ کی درخواست کی ہے (platform_name) s.
zh_cn: 您收到此电子邮件是因为您要求为％（平台名称）处的用户帐户重置密码。

source: Your exported course can now be downloaded
ar: يمكن الآن تنزيل الدورة المصدرة الخاصة بك
ur: آپ کے برآمد شدہ کورس اب ڈاؤن لوڈ کیا جا سکتا ہے
zh_cn: 您的导出课程现在可以下载

source: Recommended image resolution is {image_file_max_width}x{image_file_max_height}. The minimum resolution is {image_file_min_width}x{image_file_min_height}.
ar: دقة الصورة الموصى بها هي {image_file_max_width} x {image_file_max_height}. الحد الأدنى للدقة هو {image_file_min_width} x {image_file_min_height}.
ur: سفارش کردہ تصویر قرارداد {image_file_max_width} x {image_file_max_height} ہے. کم از کم قرارداد {image_file_min_width} x {image_file_min_height} ہے.
zh_cn: 推荐的图像分辨率是{image_file_max_width} x {image_file_max_height}。最低分辨率是{image_file_min_width} x {image_file_min_height}。

source: LTI Application Information
ar: معلومات تطبيق LTI
ur: LTI درخواست کی معلومات
zh_cn: LTI应用信息

source: Adjust all enrolled learners' grades for a specific problem
ar: ضبط جميع درجات المتعلمين المسجلين لمشكلة معينة
ur: ایک مخصوص مسئلہ کے لئے تمام درجے والے سیکھنے والوں کے گریڈ کو ایڈجسٹ کریں
zh_cn: 针对特定问题调整所有已注册的学习者的成绩

source: Bypass the course home tab when students arrive from the dashboard, sending them directly to course content.
ar: تجاوز علامة تبويب الصفحة الرئيسية للدورة التدريبية عند وصول الطلاب من لوحة المعلومات ، وإرسالها مباشرة إلى محتوى الدورة التدريبية.
ur: جب طالب علم ڈیش بورڈ سے آتے ہیں تو کورس کے ہوم ٹیب کو بکس کریں، براہ راست مواد کو کورس میں بھیجنے کے لۓ.
zh_cn: 当学生从仪表板到达时绕过课程主页选项卡，直接发送到课程内容。

source: Something wrong with SubRip transcripts file during parsing.
ar: شيء خاطئ في ملف نص SubRip أثناء التحليل.
ur: غلطی کے دوران سب رئپ ٹرانسمیشن فائل کے ساتھ کچھ غلط.
zh_cn: 解析期间SubRip转录文件有问题。

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
ar: عندما تكون مستعدًا لإنشاء شهادات للدورة التدريبية الخاصة بك ، انقر فوق إنشاء الشهادات. لا تحتاج إلى القيام بذلك إذا قمت بتعيين وضع الشهادة إلى إنشاء عند الطلب.
ur: جب آپ اپنے کورس کے سرٹیفکیٹ تیار کرنے کے لئے تیار ہیں، تو سرٹیفکیٹ پیدا کریں پر کلک کریں. آپ کو ایسا کرنے کی ضرورت نہیں ہے اگر آپ نے اپنی مرضی کے مطابق موڈ کو مطالبہ کرنے کی نسل کو مقرر کیا ہے.
zh_cn: 当您准备好为您的课程生成证书时，请点击生成证书。如果您已将证书模式设置为按需生成，则不需要执行此操作。

source: Submitting
ar: تقديم
ur: جمع کر رہا ہے
zh_cn: 提交

source: Privacy
ar: الإجمالية
ur: پرائیویسی
zh_cn: 隐私

source: Batch Enrollment
ar: انتساب دفعة
ur: بیچ اندراج
zh_cn: 批量注册

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
ar: اسمح للطلاب بتنزيل إصدارات من هذا الفيديو بتنسيقات مختلفة إذا لم يتمكنوا من استخدام مشغل فيديو edX أو لا يمكنهم الوصول إلى YouTube. يجب إضافة عنوان URL واحد على الأقل غير YouTube في حقل عناوين URL لملف الفيديو.
ur: طالب علموں کو اس ویڈیو کے ورژن کو مختلف فارمیٹس میں ڈاؤن لوڈ کرنے کی اجازت دیتے ہیں اگر وہ edX ویڈیو پلیئر کا استعمال نہیں کرسکتے ہیں یا YouTube تک رسائی نہیں رکھتے ہیں. آپ کو ویڈیو فائل یو آر ایل فیلڈ میں کم سے کم ایک غیر YouTube یو آر ایل شامل کرنا ضروری ہے.
zh_cn: 如果学生无法使用edX视频播放器或无法访问YouTube，请允许学生以不同格式下载此视频的各个版本。您必须在视频文件网址字段中添加至少一个非YouTube网址。

source: The file must be one of the following types: {valid_file_types}.
ar: يجب أن يكون الملف من الأنواع التالية: {valid_file_types}.
ur: فائل مندرجہ ذیل اقسام میں سے ایک ہونا چاہیے: {valid_file_types}.
zh_cn: 该文件必须是以下类型之一：{valid_file_types}。

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
ar: اشتعلت خلل؟ ليس هناك أى مشكلة. عندما تريد ، يتم تشغيل تغييراتك عندما تنقر على &quot;حفظ&quot;.
ur: ایک بگ پکڑ لیا کوئی مسئلہ نہیں. جب آپ چاہتے ہیں تو، آپ کو محفوظ کریں جب آپ کی تبدیلیاں زندہ رہیں.
zh_cn: 抓到一个错误？没问题。当你想要的时候，当你点击保存时你的更改就会生效。

source: Number of sections:
ar: عدد الاقسام:
ur: حصوں کی تعداد:
zh_cn: 部分数量：

source: Back to Student FAQs
ar: العودة إلى الأسئلة الشائعة للطلاب
ur: طالب علم کے سوالات پر واپس جائیں
zh_cn: 回到学生常见问题

source: Basic
ar: الأساسية
ur: بنیادی
zh_cn: 基本

source: Page Size
ar: مقاس الصفحه
ur: صفحہ سائز
zh_cn: 页面大小

source: Can I create courses in {studio_name}?
ar: هل يمكنني إنشاء دورات تدريبية في {studio_name}؟
ur: کیا میں {studio_name} میں کورس بنا سکتا ہوں؟
zh_cn: 我可以在{studio_name}中创建课程吗？

source: Upgrade by <strong>%(user_schedule_upgrade_deadline_time)s</strong>.
ar: الترقية بواسطة <strong>٪ (user_schedule_upgrade_deadline_time) s</strong> .
ur: <strong>٪ (user_schedule_upgrade_deadline_time) کی</strong> طرف سے اپ گریڈ کریں.
zh_cn: 通过<strong>％（user_schedule_upgrade_deadline_time）进行</strong>升级。

source: Wiki images
ar: صور ويكي
ur: وکیپیڈیا تصاویر
zh_cn: Wiki图片

source: Important!
ar: مهم!
ur: اہم!
zh_cn: 重要！

source: Schedule start < course start
ar: بدء الجدول الزمني &lt;بدء الدورة
ur: شیڈول شروع کریں &lt;کورس شروع
zh_cn: 计划开始&lt;课程开始

source: Resume Course
ar: دورة استئناف
ur: دوبارہ شروع کورس
zh_cn: 恢复课程

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
ar: تتم إضافة المكون الجديد في أسفل الصفحة أو المجموعة. يمكنك بعد ذلك تحرير المكون ونقله.
ur: صفحہ یا گروپ کے نچلے حصے میں نیا اجزاء شامل ہے. اس کے بعد آپ جزو کو ترمیم اور منتقل کر سکتے ہیں.
zh_cn: 新组件添加到页面或组的底部。然后您可以编辑和移动组件。

source: File History
ar: ملف التاريخ
ur: فائل کی تاریخ
zh_cn: 文件历史

source: June
ar: يونيو
ur: جون
zh_cn: 六月

source: Enter your mailing address.
ar: أدخل عنوانك البريدي.
ur: اپنا میل ایڈریس درج کریں
zh_cn: 输入你的邮寄地址。

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
ar: انقر على {em_start} تهيئة المجموعة الجديدة {em_end} لإضافة تهيئة جديدة. لتعديل تهيئة ، مرّر مؤشر الماوس فوق المربع وانقر على {em_start} تعديل {em_end}. يمكنك حذف تكوين مجموعة فقط إذا لم يكن مستخدمًا في التجربة. لحذف أحد التهيئات ، مرّر مؤشر الماوس فوق المربع وانقر على رمز الحذف.
ur: نئی ترتیب کو شامل کرنے کیلئے {em_start} نیا گروپ کی ترتیب {em_end} پر کلک کریں. ترتیب میں ترمیم کرنے کے لئے، اس باکس پر ہور اور {em_start} میں ترمیم کریں {em_end}. آپ صرف ایک گروپ ترتیب کو خارج کر سکتے ہیں اگر یہ استعمال میں استعمال نہیں ہوتا ہے. ایک ترتیب کو حذف کرنے کے لئے، اس کے باکس پر ہور اور خارج کرنے والے آئکن پر کلک کریں.
zh_cn: 点击{em_start}新建组配置{em_end}添加新配置。要编辑配置，请将鼠标悬停在其框上，然后点击{em_start}编辑{em_end}。只有在实验中未使用组配置的情况下，才能删除组配置。要删除配置，请将鼠标悬停在其框上并点击删除图标。

source: Download a CSV of learners who can enroll
ar: يمكنك تنزيل ملف CSV للمتعلمين الذين يمكنهم التسجيل
ur: سیکھنے والوں کا ایک CSV ڈاؤن لوڈ کریں جو اندراج کرسکتے ہیں
zh_cn: 下载可注册的学员的CSV

source: The display name for this component. Analytics reports may also use the display name to identify this component.
ar: اسم العرض لهذا المكون. قد تستخدم تقارير Analytics أيضًا اسم العرض لتعريف هذا المكون.
ur: اس جزو کے لئے ڈسپلے کا نام. تجزیہ کی رپورٹوں کو اس جزو کی شناخت کیلئے ڈسپلے کا نام بھی استعمال کر سکتا ہے.
zh_cn: 此组件的显示名称。 Analytics报告也可能使用显示名称来识别此组件。

source: Input quantity and press enter.
ar: كمية المدخلات واضغط على دخول.
ur: ان پٹ کی مقدار اور دبائیں.
zh_cn: 输入数量并按回车。

source: ChoiceGroup: unexpected tag {tag_name}
ar: ChoiceGroup: علامة غير متوقعة {tag_name}
ur: چائس گروپ: غیر متوقع ٹیگ {tag_name}
zh_cn: ChoiceGroup：意外标记{tag_name}

source: You can unenroll in the course and receive a full refund for 2 days after the course start date.
ar: يمكنك إلغاء التسجيل في الدورة التدريبية واسترداد الأموال بالكامل لمدة يومين بعد تاريخ بدء الدورة التدريبية.
ur: آپ اس کورس میں نیںال کر سکتے ہیں اور کورس کے آغاز کی تاریخ کے بعد 2 دن کے لئے مکمل رقم کی واپسی حاصل کرسکتے ہیں.
zh_cn: 您可以取消注册课程并在课程开始日期后的2天内获得全额退款。

source: Save changes
ar: حفظ التغييرات
ur: تبدیلیاں محفوظ کرو
zh_cn: 保存更改

source: Enter the chrome, or navigation tools, to use for the XBlock in the LMS. Valid values are: "chromeless" -- to not use tabs or the accordion; "tabs" -- to use tabs only; "accordion" -- to use the accordion only; or "tabs,accordion" -- to use tabs and the accordion.
ar: أدخل chrome ، أو أدوات التنقل ، لاستخدامها في XBlock في LMS. القيم الصالحة هي: &quot;chromeless&quot; - لعدم استخدام علامات التبويب أو الأكورديون ؛ &quot;علامات التبويب&quot; - لاستخدام علامات التبويب فقط ؛ &quot;الأكورديون&quot; - لاستخدام الأكورديون فقط ؛ أو &quot;علامات التبويب ، الأكورديون&quot; - لاستخدام علامات التبويب والأكورديون.
ur: LMS میں XBlock کے لئے استعمال کرنے کے لئے کروم یا نیویگیشن ٹولز درج کریں. درست اقدار ہیں: &quot;کرم بیک&quot; - ٹیبز یا ایڈیشن کا استعمال نہیں کرنے کے لئے؛ &quot;ٹیب&quot; - صرف ٹیبز استعمال کرنے کے لئے؛ &quot;accordion&quot; - accordion صرف استعمال کرنے کے لئے؛ یا &quot;ٹیبز، ایڈیشن&quot; - ٹیب اور ایڈیشن استعمال کرنے کے لئے.
zh_cn: 输入用于LMS中XBlock的镶边或导航工具。有效值为：“无铬” - 不使用标签或手风琴; “标签” - 仅使用标签; “手风琴” - 仅使用手风琴;或“选项卡，手风琴” - 使用标签和手风琴。

source: Certificate purchases help {platform_name} continue to offer free courses
ar: تساعد مشتريات الشهادة {platform_name} في تقديم دورات مجانية
ur: سرٹیفکیٹ خریداری کی خریداری {platform_name} کو مفت کورسز پیش کرتے رہیں گے
zh_cn: 证书购买帮助{platform_name}继续提供免费课程

source: A country is required
ar: بلد مطلوب
ur: ایک ملک کی ضرورت ہے
zh_cn: 一个国家是必需的

source: Create a .csv file that contains enrollment information for your course.
ar: قم بإنشاء ملف .csv يحتوي على معلومات التسجيل للدورة التدريبية الخاصة بك.
ur: ایک .csv فائل بنائیں جس میں آپ کے کورس کے اندراج کی معلومات شامل ہے.
zh_cn: 创建一个包含课程注册信息的.csv文件。

source: Download Unused Enrollment Codes
ar: تحميل رموز التسجيل غير المستخدمة
ur: غیر استعمال شدہ اندراج کوڈز ڈاؤن لوڈ کریں
zh_cn: 下载未使用的注册码

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
ar: تم تصميم بيانات الاعتماد الخاصة بك (مثل سر العميل والمعرفات) ليتم استخدامها فقط بواسطتك. سوف تحتفظ بسرية بيانات الاعتماد الخاصة بك وتثبيط الآخرين من استخدام بيانات الاعتماد الخاصة بك. قد لا تكون بيانات الاعتماد الخاصة بك مضمنة في مشاريع مفتوحة المصدر.
ur: آپ کی اسناد (جیسا کہ کلائنٹ خفیہ اور شناخت) آپ کو صرف آپ کے ذریعہ استعمال کرنے کا ارادہ رکھتے ہیں. آپ اپنے اسناد کو خفیہ رکھیں گے اور دوسروں کو آپ کے اسناد کے استعمال سے ہراساں کریں گے. ممکنہ طور پر آپ کے اسناد کو کھلا ذریعہ کے منصوبوں میں سرایت نہیں کیا جاسکتا.
zh_cn: 您的凭证（例如客户秘密和身份证）仅供您使用。您将保证您的凭据保密，并阻止他人使用您的凭证。您的凭证可能未嵌入到开源项目中。

source: This name will be used on any certificates that you earn.
ar: سيتم استخدام هذا الاسم على أي شهادات تربحها.
ur: یہ نام کسی بھی سرٹیفکیٹ پر استعمال کیا جائے گا جو آپ حاصل کرتے ہیں.
zh_cn: 此名称将用于您获得的任何证书。

source: Teams
ar: فرق
ur: ٹیمیں
zh_cn: 小组

source: PermissionDenied: Failed in authenticating {user}
ar: PermiedDenied: فشل في المصادقة على {user}
ur: اجازت نامہ: {صارف} کی تصدیق کرنے میں ناکام
zh_cn: PermissionDenied：验证{user}失败

source: Make sure you enter the information carefully. You will not receive notification for invalid usernames or email addresses.
ar: تأكد من إدخال المعلومات بعناية. لن تتلقى إشعارًا بأسماء المستخدمين أو عناوين البريد الإلكتروني غير الصالحة.
ur: یقینی بنائیں کہ آپ احتیاط سے معلومات درج کریں. آپ کو غیر قانونی صارف نام یا ای میل ایڈریس کے لئے نوٹیفکیشن نہیں ملیں گے.
zh_cn: 确保您仔细输入信息。您将不会收到无效用户名或电子邮件地址的通知。

source: Invalid
ar: غير صالحة
ur: غلط
zh_cn: 无效

source: Report a problem
ar: الإبلاغ عن مشكلة
ur: مسئلے کے بارے میں بتائیے
zh_cn: 报告一个问题

source: Repair Results
ar: نتائج الإصلاح
ur: مرمت کے نتائج
zh_cn: 修理结果

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
ar: توضح شهادة {cert_type} مستوى عالٍ من الإنجاز في برنامج دراسي ، وتتضمن التحقق من هوية الطالب.
ur: ایک {certificate_type} سرٹیفکیٹ مطالعہ کے پروگرام میں اعلی درجے کی کامیابی حاصل کرتا ہے، اور طالب علم کی شناخت کی تصدیق بھی شامل ہے.
zh_cn: {cert_type}证书在学习计划中表现出高水平的成绩，并包括对学生身份的验证。

source: Internal Service URL
ar: عنوان URL للخدمة الداخلية
ur: اندرونی سروس یو آر ایل
zh_cn: 内部服务网址

source: The display name for this component. (Not shown to learners)
ar: اسم العرض لهذا المكون. (لا يظهر للمتعلمين)
ur: اس جزو کے لئے ڈسپلے کا نام. (سیکھنے والوں کو نہیں دکھایا گیا)
zh_cn: 此组件的显示名称。 （未向学习者显示）

source: Day certificates will become available for passing verified learners.
ar: ستصبح شهادات اليوم متاحة للمتعلمين الذين تم التحقق منهم.
ur: تصدیق شدہ سیکھنے کو منظور کرنے کے لئے دن کے سرٹیفکیٹ دستیاب ہو جائیں گے.
zh_cn: 日证书将可用于通过验证的学员。

source: Unlink
ar: فك ارتباط
ur: انلاک
zh_cn: 取消链接

source: locked
ar: مقفل
ur: بند کر دیا
zh_cn: 锁定

source: Upgrade Deadline
ar: ترقية الموعد النهائي
ur: آخری تاریخ کو اپ گریڈ کریں
zh_cn: 升级截止日期

source: Text
ar: نص
ur: متن
zh_cn: 文本

source: Confirm Password
ar: تأكيد كلمة المرور
ur: پاس ورڈ کی توثیق کریں
zh_cn: 确认密码

source: Specify a student to see all of that student's extensions.
ar: حدد طالبًا لرؤية كل امتدادات ذلك الطالب.
ur: اس طالب علم کے تمام اخراجات کو دیکھنے کے لئے طالب علم کی وضاحت کریں.
zh_cn: 指定学生查看该学生的所有扩展。

source: Highest level of education completed
ar: اعلى مستويات التعلم قد اكتملت
ur: تعلیم کی بلند ترین سطح مکمل ہوگئی
zh_cn: 最高学历完成

source: Gradebook
ar: دفتر التقديرات
ur: گریڈ بک
zh_cn: 成绩册

source: Purchase Order Number:
ar: رقم طلب الشراء:
ur: خریداری آرڈر نمبر:
zh_cn: 订购单号码：

source: The course has ended.
ar: انتهت الدورة.
ur: کورس ختم ہوگیا ہے.
zh_cn: 课程已经结束。

source: Login.
ar: تسجيل الدخول.
ur: میں لاگ ان کریں.
zh_cn: 登录。

source: To copy a URL, double click the value in the URL column, then copy the selected text.
ar: لنسخ عنوان URL ، انقر نقرًا مزدوجًا على القيمة في عمود عنوان URL ، ثم انسخ النص المحدد.
ur: یو آر ایل کاپی کرنے کے لئے، یو آر ایل کالم میں قیمت پر کلک کریں، پھر منتخب متن کاپی کریں.
zh_cn: 要复制URL，请双击URL列中的值，然后复制选定的文本。

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
ar: أدخل وصفًا لتطبيق الجهة الخارجية. في حالة طلب اسم المستخدم و / أو البريد الإلكتروني ، استخدم مربع النص هذا لإعلام المستخدمين عن سبب إعادة توجيه اسم المستخدم و / أو البريد الإلكتروني إلى تطبيق جهة خارجية.
ur: تیسری پارٹی کی درخواست کی وضاحت درج کریں. اگر صارف کا نام اور / یا ای میل کی درخواست کی جاتی ہے، تو اس ٹیکسٹ باکس کو صارف کو مطلع کرنے کے لئے استعمال کریں کیوں کہ ان کا صارف نام اور / یا ای میل تیسری پارٹی کی درخواست پر آگے بڑھایا جائے گا.
zh_cn: 输入第三方应用程序的描述。如果请求用户名和/或电子邮件，请使用此文本框通知用户为什么他们的用户名和/或电子邮件将被转发到第三方应用程序。

source: Email or password is incorrect.
ar: البريد الالكتروني او كلمة المرور غير صحيحة.
ur: ای میل یا پاس ورڈ غلط ہے.
zh_cn: 电子邮件或密码不正确。

source: The card type is not accepted by the payment processor. Possible fix: retry with another form of payment
ar: لا يقبل معالج الدفع نوع البطاقة. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: ادائیگی کی پروسیسر کی طرف سے کارڈ کی قسم قبول نہیں کی جاتی ہے. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 付款处理器不接受卡类型。可能的解决方法：使用其他付款方式重试

source: Resume your course now
ar: استئناف دراستك الآن
ur: اپنا کورس دوبارہ شروع کرو
zh_cn: 现在恢复你的课程

source: No formal education
ar: لا يوجد تعليم رسمي
ur: رسمی تعلیم نہیں
zh_cn: 没有正式的教育

source: In Progress
ar: في تَقَدم
ur: کام جاری ہے
zh_cn: 进行中

source: General system failure.
ar: فشل النظام العام.
ur: عام نظام کی ناکامی
zh_cn: 一般系统故障。

source: Download All Enrollment Codes
ar: تنزيل كل رموز التسجيل
ur: تمام اندراج کوڈز ڈاؤن لوڈ کریں
zh_cn: 下载所有注册码

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
ar: نحن اسفون. لم يوافق طاقم الدورة التدريبية على طلبك لتغيير اسمك من {old_name} إلى {new_name}. إذا كنت بحاجة إلى مزيد من المساعدة ، فيرجى إرسال الدعم الفني عبر البريد الإلكتروني على {email}
ur: ہم معافی چاہتے ہیں. ہمارے کورس کے عملے نے آپ کا نام {old_name} سے {new_name} پر تبدیل کرنے کی منظوری نہیں دی. اگر آپ کو مزید مدد کی ضرورت ہے تو، براہ مہربانی {ای میل} پر ٹیک کی حمایت کو ای میل کریں.
zh_cn: 我们很抱歉。我们的课程人员未批准您将您的姓名从{old_name}更改为{new_name}的请求。如果您需要进一步的帮助，请发送电子邮件至{email}

source: Default Timed Transcript
ar: نسخة محدثة مؤقتة
ur: پہلے سے طے شدہ ٹرانسمیشن
zh_cn: 默认计时抄本

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
ar: أدخل الحد الأقصى لعدد الطلاب الذين يمكنهم التسجيل في الدورة التدريبية. للسماح لعدد غير محدود من الطلاب ، أدخل null.
ur: کورس میں داخل ہونے والے طلباء کی زیادہ سے زیادہ تعداد درج کریں. لامحدود تعداد میں طالب علموں کو اجازت دینے کے لئے، سست درج کریں.
zh_cn: 输入可以参加课程的最多学生人数。要允许不限数量的学生，请输入null。

source: Create new catalog:
ar: إنشاء كتالوج جديد:
ur: نئی فہرست بنائیں:
zh_cn: 创建新的目录：

source: No email address provided.
ar: لم يتم تقديم عنوان بريد إلكتروني.
ur: کوئی ای میل ایڈریس نہیں دی گئی.
zh_cn: 未提供电子邮件地址。

source: An access_token is required when passing value ({}) for provider.
ar: مطلوب access_token عند تمرير القيمة ({}) للموفر.
ur: قیمت فراہم کرنے کے لئے ایک access_token کی ضرورت ہوتی ہے ({}) فراہم کرنے کے لئے.
zh_cn: 传递提供者的值（{}）时需要access_token。

source: Known Error Case
ar: حالة الخطأ المعروفة
ur: ناممکن غلطی کا کیس
zh_cn: 已知的错误情况

source: After this date, course content will be archived.
ar: بعد هذا التاريخ ، سيتم أرشفة محتوى الدورة التدريبية.
ur: اس تاریخ کے بعد، کورس کا مواد محفوظ کیا جائے گا.
zh_cn: 此日期之后，课程内容将被存档。

source: What can I do on this page?
ar: ماذا أفعل في هذه الصفحة؟
ur: میں اس صفحہ پر کیا کر سکتا ہوں؟
zh_cn: 我能在这个页面上做什么？

source: The total number of enrollment codes to create
ar: العدد الإجمالي لرموز التسجيل لإنشاء
ur: تخلیق کرنے کے لئے اندراج کوڈ کی کل تعداد
zh_cn: 要创建的注册码总数

source: Cannot rescore problems with possible file submissions
ar: لا يمكن تسجيل المشاكل مع عمليات إرسال الملفات المحتملة
ur: ممنوع فائل کی پیشکشوں کے ساتھ مسائل کو دوبارہ تبدیل نہیں کر سکتے ہیں
zh_cn: 无法重新解决可能的文件提交问题

source: All units have been added.
ar: تمت إضافة جميع الوحدات.
ur: تمام یونٹس شامل کردیئے گئے ہیں.
zh_cn: 所有单位已被添加。

source: Set Price
ar: ضع سعر
ur: قیمت مقرر کریں
zh_cn: 设定价格

source: Currency
ar: دقة
ur: کرنسی
zh_cn: 货币

source: Enjoy learning with {platform_name}.
ar: استمتع بالتعلم مع {platform_name}.
ur: {platform_name} کے ساتھ سیکھنے کا لطف اٹھائیں.
zh_cn: 使用{platform_name}享受学习乐趣。

source: Problem failed to be {action} for any of {attempted} students
ar: أخفقت المشكلة في {action} لأي من {دعاء} الطلاب
ur: کسی بھی {کوشش کردہ} طالب علموں کے لئے مسئلہ {کارروائی} ہونے میں ناکام ہوگیا
zh_cn: 对于{未遂的}学生中的任何一个，问题都不是{动作}

source: An error occurred while creating your receipt.
ar: حدث خطأ أثناء إنشاء إيصالك.
ur: آپ کی رسید بنانے کے دوران ایک خرابی واقع ہوئی.
zh_cn: 创建收据时发生错误。

source: This unit's access settings refer to deleted or invalid group configurations.
ar: تشير إعدادات الوصول لهذه الوحدة إلى تكوينات المجموعة المحذوفة أو غير الصالحة.
ur: یہ یونٹ کی رسائی کی ترتیبات حذف شدہ یا غلط گروہ کی ترتیبات کا حوالہ دیتے ہیں.
zh_cn: 本机的访问设置是指已删除或无效的组配置。

source: Sign Out
ar: خروج
ur: باہر جائیں
zh_cn: 登出

source: Go Back
ar: عُد
ur: واپس جاو
zh_cn: 回去

source: Verifying
ar: التحقق
ur: توثیقی
zh_cn: 验证

source: The price per item sold, including discounts.
ar: سعر السلعة المباعة ، بما في ذلك الخصومات.
ur: قیمت فی اشیاء، بشمول چھوٹ شامل ہیں.
zh_cn: 每件商品的价格，包括折扣。

source: Completed the course "{course_name}" ({course_mode})
ar: أكملت الدورة التدريبية &quot;{course_name}&quot; ({course_mode})
ur: کورس &quot;{course_name}&quot; مکمل ({course_mode})
zh_cn: 完成“{course_name}”（{course_mode}）课程

source: A library has not yet been selected.
ar: لم يتم تحديد مكتبة بعد.
ur: ایک لائبریری ابھی تک منتخب نہیں کیا گیا ہے.
zh_cn: 图书馆尚未被选中。

source: Poll answers from all students
ar: إجابات استطلاع من جميع الطلاب
ur: تمام طالب علموں سے سروے کا جواب
zh_cn: 投票答案来自所有学生

source: Language reset to the default
ar: إعادة تعيين اللغة إلى الافتراضي
ur: زبان ڈیفالٹ پر ری سیٹ کریں
zh_cn: 语言重置为默认值

source: Add new article
ar: أضف مقالة جديدة
ur: نیا مضمون شامل کریں
zh_cn: 添加新文章

source: Email or username
ar: البريد الإلكتروني أو اسم المستخدم
ur: ای میل یا اسم صارف
zh_cn: 电子邮件或用户名

source: Wiki Revision Preview
ar: مراجعة مراجعة الويكي
ur: ویکیپیڈیا کے تجزیہ کا جائزہ
zh_cn: Wiki修订预览

source: Signed Out
ar: تسجيل الخروج
ur: سائن آؤٹ
zh_cn: 退出

source: Action Required: Activate your {platform_name} account
ar: الإجراء المطلوب: تنشيط حساب {platform_name} الخاص بك
ur: ایکشن کی ضرورت ہے: اپنے {platform_name} اکاؤنٹ کو چالو کریں
zh_cn: 需要采取的措施：激活您的{platform_name}帐户

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
ar: أدخل جوازات السفر لأدوات دورة LTI بالتنسيق التالي: &quot;id: client_key: client_secret&quot;.
ur: کورس کی درج ذیل شکل میں LTI کے اوزار کے لئے پاسپورٹ درج کریں: &quot;id: client_key: client_secret&quot;.
zh_cn: 按照以下格式输入课程LTI工具的护照：“id：client_key：client_secret”。

source: Select your country or region of residence.
ar: اختر بلدك أو منطقة الإقامة.
ur: اپنا ملک یا رہائش گاہ کا انتخاب کریں.
zh_cn: 选择您的国家或居住地区。

source: The contact who should receive the invoice
ar: جهة الاتصال التي يجب أن تتلقى الفاتورة
ur: رابطہ کون انوائس وصول کرنا چاہئے
zh_cn: 应该收到发票的联系人

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {studio_name} web site.
ar: إذا لم تطلب هذا ، فلن تحتاج إلى القيام بأي شيء ؛ لن تتلقى أي بريد إلكتروني منا. رجاءا لا ترد على هذا الأيميل؛ إذا كنت بحاجة إلى مساعدة ، فتحقق من قسم المساعدة على موقع الويب {studio_name}.
ur: اگر آپ نے اس کی درخواست نہیں کی، تو آپ کو کچھ کرنے کی ضرورت نہیں ہے. آپ ہمارے پاس مزید ای میل نہیں ملیں گے. براہ مہربانی اس ای میل کا جواب نہ دیں؛ اگر آپ کو مدد کی ضرورت ہو تو، {سٹوڈیو_ نام} ویب سائٹ کی مدد کے سیکشن کو چیک کریں.
zh_cn: 如果你没有要求，你不需要做任何事情;你将不会再收到我们的电子邮件。请不要回复这封邮件;如果您需要帮助，请查看{studio_name}网站的帮助部分。

source: Add to LinkedIn Profile
ar: أضف إلى صفحتك
ur: لنکڈ پروفائل میں شامل کریں
zh_cn: 添加到LinkedIn档案
