Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Learners do not see whether their answers to assessments were correct or incorrect, nor the score received, until after the due date for the subsection has passed.
ur: اساتذہ کو یہ معلوم نہیں ہے کہ آیا ان کے جوابات کا جائزہ درست یا غلط تھا، اور نہ ہی سکور موصول ہوئی ہیں، جب تک سبسکرائب کے لئے مقررہ تاریخ منظور نہیں ہوا ہے.

source: enter code here
ur: کوڈ ڈالئے

source: Team Name (Required) *
ur: ٹیم کا نام (ضروری) *

source: All users on the Exception list who do not yet have a certificate
ur: استقبال کی فہرست پر تمام صارفین جو ابھی تک ایک سرٹیفکیٹ نہیں ہے

source: Set as a Special Exam
ur: خصوصی امتحان کے طور پر مقرر کریں

source: Allowances
ur: الاؤنس

source: {numVotes} Vote
ur: {numvotes} ووٹ

source: Please select a file in .srt format.
ur: براہ مہربانی ایس ایس آر کی شکل میں فائل منتخب کریں.

source: Publishing
ur: اشاعت

source: To verify your identity, you need a webcam and a government-issued photo ID.
ur: اپنی شناخت کی توثیق کرنے کے لئے، آپ کو ایک ویب کیم اور ایک سرکاری طور پر جاری کردہ تصویر کی شناخت کی ضرورت ہے.

source: A driver's license, passport, or government-issued ID with your name and photo.
ur: آپ کے نام اور تصویر کے ساتھ ڈرائیور کا لائسنس، پاسپورٹ، یا حکومت سے جاری کردہ ID.

source: No sources
ur: کوئی ذرائع نہیں

source: %(field)s can only contain up to %(count)d characters.
ur: ٪ (فیلڈ) صرف٪ (شمار) ڈی حروف پر مشتمل ہوسکتا ہے.

source: This discussion could not be loaded. Refresh the page and try again.
ur: اس بحث کو لوڈ نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: All topics
ur: تمام موضوعات

source: Thank you for submitting your photos. We will review them shortly. You can now sign up for any %(platformName)s course that offers verified certificates. Verification is good for one year. After one year, you must submit photos for verification again.
ur: آپ کی تصاویر جمع کرنے کے لئے شکریہ. ہم جلد ہی ان کا جائزہ لیں گے. اب آپ کسی بھی (پلیٹ فارم نام) کورس کے لئے سائن اپ کرسکتے ہیں جو تصدیق شدہ سرٹیفکیٹ پیش کرتا ہے. ایک سال کے لئے توثیق اچھا ہے. ایک سال کے بعد، آپ کو پھرثیق کے لئے تصاویر جمع کرنا ضروری ہے.

source: Description
ur: تفصیل

source: Adjust video volume
ur: ویڈیو کا حجم ایڈجسٹ کریں

source: There was an error with the upload
ur: اپ لوڈ کے ساتھ ایک خرابی تھی

source: Please enter non-negative integer.
ur: برائے مہربانی غیر منفی اشارے درج کریں.

source: We're sorry, there was an error
ur: ہمیں افسوس ہے، وہاں ایک غلطی تھی

source: This Group Configuration is used in:
ur: یہ گروپ ترتیب میں استعمال کیا جاتا ہے:

source: Your Program Journey
ur: آپ کا پروگرام کا سفر

source: You are now enrolled as a verified student for:
ur: آپ اب ایک تصدیق شدہ طالب علم کے طور پر اندراج کر رہے ہیں:

source: Certificate has been successfully invalidated for <%= user %>.
ur: &lt;٪ = صارف٪&gt; کیلئے سرٹیفکیٹ کامیابی سے باطل کردی گئی ہے.

source: {organization}\'s logo
ur: {تنظیم} علامت (لوگو)}

source: Check the box to remove %(count)s flag.
ur: ٪ (گنتی) کے پرچم کو ہٹا دیں باکس کو چیک کریں.

source: Deleting this {xblock_type} is permanent and cannot be undone.
ur: اس {xblock_type} کو حذف کرنا مستقل ہے اور اسے غیر مستحکم نہیں کیا جاسکتا ہے.

source: Press update settings to update the information for your organization.
ur: اپنی تنظیم کے بارے میں معلومات کو اپ ڈیٹ کرنے کے لئے اپ ڈیٹ کی ترتیبات پریس کریں.

source: Edit
ur: ترمیم

source: Cannot delete when in use by an experiment
ur: تجربے کے دوران جب استعمال نہیں کرسکتے ہیں

source: Textbook Name
ur: متن کتاب کا نام

source: Disable Account
ur: اکاؤنٹ کو غیر فعال کریں

source: Teams
ur: ٹیمیں

source: Make sure that the full name on your account matches the name on your ID.
ur: اس بات کو یقینی بنائیں کہ آپ کے اکاؤنٹ پر مکمل نام آپ کے ID پر نام سے ملتا ہے.

source: Go to Dashboard
ur: ڈیش بورڈ پر جائیں

source: Hide content after due date
ur: مقررہ تاریخ کے بعد مواد چھپائیں

source: Choose a course run:
ur: کورس چلائیں منتخب کریں:

source: for
ur: کے لئے

source: Color
ur: رنگ

source: You have successfully updated your goal.
ur: آپ نے اپنے مقصد کو کامیابی سے اپ ڈیٹ کیا ہے.

source: Are you sure you want to delete {email} from the course team for “{container}”?
ur: کیا آپ واقعی &quot;{کنٹینر}&quot; کیلئے کورس ٹیم سے {ای میل} حذف کرنا چاہتے ہیں؟

source: (contains %(student_count)s student)
ur: (٪ (طالب علم کے مطابق) کے طالب علم پر مشتمل ہے

source: All units
ur: تمام یونٹس

source: Highlight {highlight_index}
ur: {highlight_index} کو نمایاں کریں

source: Your request could not be completed. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ur: آپ کی درخواست مکمل نہیں کی جا سکتی. صفحہ دوبارہ لوڈ کریں اور دوبارہ کوشش کریں. اگر مسئلہ جاری ہے تو، مسئلہ کی اطلاع کے لئے مدد کے ٹیب پر کلک کریں.

source: Not yet
ur: ابھی تک نہیں

source: There was an error while unpacking the file.
ur: فائل کو کھولنے میں ایک خرابی تھی.

source: Hide notes
ur: نوٹ چھپائیں

source: To take a successful photo, make sure that:
ur: کامیاب تصویر لینے کے لۓ، یہ یقینی بنائیں کہ:

source: Title
ur: عنوان

source: Note: Learners can be in only one cohort. Adding learners to this group overrides any previous group assignment.
ur: نوٹ: سیکھنے میں صرف ایک کوہٹ میں ہوسکتا ہے. اس گروپ میں سیکھنے والے کو کسی بھی پچھلے گروہ کے تفویض پر قابو پانے کی ضرورت ہے.

source: Help other learners decide whether to join your team by specifying some characteristics for your team. Choose carefully, because fewer people might be interested in joining your team if it seems too restrictive.
ur: دوسرے سیکھنے والوں میں مدد کریں کہ آپ کی ٹیم کے لئے کچھ خصوصیات کی وضاحت کرکے اپنی ٹیم میں شمولیت اختیار کرنا چاہے. احتیاط سے چنیں، کیونکہ کم از کم لوگ آپ کی ٹیم میں شامل ہونے میں دلچسپی رکھتے ہیں اگر یہ بہت محدود ہے.

source: Certificate of <%= user %> has already been invalidated. Please check your spelling and retry.
ur: &lt;٪ = صارف٪&gt; کے سرٹیفکیٹ پہلے ہی باطل کردیا گیا ہے. براہ کرم اپنا ہجے چیک کریں اور دوبارہ کوشش کریں.

source: Upper Roman
ur: اپر رومن

source: Undo move
ur: آگے بڑھو

source: ${listPrice}
ur: $ {فہرست قیمت}

source: Upload an image
ur: ایک تصویر اپ لوڈ کریں

source: This component has validation issues.
ur: اس اجزاء میں توثیق کے مسائل ہیں.

source: Bold
ur: بولڈ

source: This Group Configuration is not in use. Start by adding a content experiment to any Unit via the {linkStart}Course Outline{linkEnd}.
ur: یہ گروپ ترتیب استعمال میں نہیں ہے. {linkStart} کورس آؤٹ لائن {linkEnd} کے ذریعہ کسی بھی یونٹ میں مواد کے تجربے کا اضافہ کرکے شروع کریں.

source: Reset attempts for all students on problem '<%- problem_id %>'?
ur: &lt;٪ - problem_id٪&gt; &#39;پر تمام طالب علموں کی کوششوں کو دوبارہ ترتیب دیں.

source: Load next {num_items} result
ur: اگلے {num_items} نتیجہ لوڈ کریں

source: Replace with
ur: تبدیل کریں

source: You are upgrading your enrollment for: {courseName}
ur: آپ اپنے اندراج کو اپ گریڈ کر رہے ہیں: {courseName}

source: Course Credit Requirements
ur: کورس کریڈٹ کی ضروریات

source: Right to left
ur: دائیں سے بائیں

source: This may be happening because of an error with our server or your internet connection. Try refreshing the page or making sure you are online.
ur: یہ ہمارے سرور یا آپ کے انٹرنیٹ کنکشن کے ساتھ ایک غلطی کی وجہ سے ہو رہا ہے. صفحہ کو تازہ کرنے کی کوشش کریں یا اس بات کو یقینی بنانا کہ آپ آن لائن ہیں.

source: Enter the page number you'd like to quickly navigate to.
ur: وہ صفحہ نمبر درج کریں جو آپ جلدی نیویگیشن کرنا چاہتے ہیں.

source: Failed to reset attempts for user.
ur: صارف کے لئے کوششوں کو دوبارہ ترتیب دینے میں ناکام

source: Add to Exception List
ur: استثنائی فہرست میں شامل کریں

source: anonymous
ur: گمنام

source: provide the title/name of the chapter that will be used in navigating
ur: باب کا لقب / نام فراہم کریں جو تشریف لے کر استعمال کیا جائے گا

source: minute
ur: منٹ

source: Joined %(date)s
ur: شامل (٪ تاریخ) s

source: Video Source Language
ur: ویڈیو ماخذ زبان

source: There was an error. Please reload the page and try again.
ur: ایک غلطی تھی. براہ کرم صفحہ دوبارہ لوڈ کریں اور دوبارہ کوشش کریں.

source: Topic area
ur: موضوع کا علاقہ

source: {maxWidth}x{maxHeight} pixels
ur: {maxWidth} x {maxHeight} پکسلز

source: Fully Supported
ur: مکمل طور پر حمایت کی

source: Lock this asset
ur: یہ اثاثہ بند کریں

source: Remove from Invalidation Table
ur: غلطی کی میز سے ہٹا دیں

source: The following options are available for the {license_name} license.
ur: {license_name} لائسنس کے لئے مندرجہ ذیل اختیارات دستیاب ہیں.

source: Proctored Exam
ur: پروجیکٹ کردہ امتحان

source: {browse_span_start}Browse teams in other topics{span_end} or {search_span_start}search teams{span_end} in this topic. If you still can't find a team to join, {create_span_start}create a new team in this topic{span_end}.
ur: {browse_span_start} دیگر موضوعات میں ٹیموں {span_end} یا {search_span_start} تلاش ٹیموں {span_end} کو اس موضوع میں براؤز کریں. اگر آپ ابھی بھی شامل نہیں ہونے کی ٹیم کو تلاش نہیں کرسکتے ہیں، {create_span_start} {topic_end} اس موضوع میں ایک نئی ٹیم بنائے.

source: There has been a failure to export to XML at least one component. It is recommended that you go to the edit page and repair the error before attempting another export. Please check that all components on the page are valid and do not display any error messages.
ur: ایکس ایم ایل کو کم سے کم ایک جزو برآمد کرنے میں ناکامی ہوئی ہے. یہ سفارش کی گئی ہے کہ آپ ترمیم کے صفحے پر جائیں اور ایک اور برآمد کی کوشش کرنے سے پہلے غلطی کی مرمت کریں. براہ کرم چیک کریں کہ صفحے پر تمام اجزاء درست ہیں اور کسی بھی غلطی کے پیغامات کو ظاہر نہیں کرتے ہیں.

source: Due:
ur: کی وجہ سے:

source: Subsection
ur: سبسکرائب

source: You have unsaved changes are you sure you want to navigate away?
ur: آپ کے پاس محفوظ شدہ تبدیلیاں ہیں کیا آپ کو یقین ہے کہ آپ کو نیویگیشن کرنا چاہتے ہیں؟

source: Height
ur: اونچائی

source: Show posts by {username}.
ur: {صارف کا نام} کی طرف سے خطوط دکھائیں.

source: Try the transaction again in a few minutes.
ur: چند منٹ میں دوبارہ ٹرانزیکشن کی کوشش کریں.

source: Error getting task history for problem '<%- problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ur: مسئلہ &#39;&lt;٪ - problem_id٪&gt;&#39; اور طالب علم &#39;٪ - student_id٪&gt;&#39; کے لئے کام کی تاریخ حاصل کرنے میں خرابی. اس بات کو یقینی بنائیں کہ مسئلہ اور طالب علم کی شناخت مکمل اور درست ہیں.

source: Successfully enrolled the following users:
ur: درج ذیل صارفین کو کامیابی سے اندراج کر دیا

source: Post type
ur: پوسٹ کی قسم

source: Web:
ur: ویب:

source: This course has automatic cohorting enabled for verified track learners, but cohorts are disabled. You must enable cohorts for the feature to work.
ur: اس کورس میں تصدیق شدہ ٹریک سیکھنے کے لئے خود کار طریقے سے ہم آہنگی فعال ہے، لیکن کوہٹ غیر فعال ہیں. آپ کو کام کرنے کے لئے کوہٹس کو فعال کرنا ضروری ہے.

source: Create team.
ur: ٹیم بنائیں

source: Video ended
ur: ویڈیو ختم ہوگئی

source: You can link your social media accounts to simplify signing in to {platform_name}.
ur: آپ اپنے سوشل میڈیا اکاؤنٹس {platform_name} میں سائن ان کرنے کے لئے آسان بنانے کے لئے لنک کرسکتے ہیں.

source: Invalid email address: {email}
ur: غلط ای میل ایڈریس: {ای میل}

source: Search all posts
ur: تمام مراسلہ تلاش کریں

source: Time Limit
ur: وقت کی حد

source: Bulk Exceptions
ur: بلک استثنا

source: Course Title Override
ur: کورس کا عنوان اوورائڈ

source: Update team.
ur: اپ ڈیٹ ٹیم

source: Show Annotations
ur: تشریحات دکھائیں

source: Starts {start}
ur: {آغاز} شروع ہوتا ہے

source: Learners do not see the subsection in the course outline. The subsection is not included in grade calculations.
ur: اساتذہ کورس کے آؤٹ لائن میں سبسکرائب نہیں دیکھتے. سبسکرائب گریڈ کی حساب میں شامل نہیں ہے.

source: Reason field should not be left blank.
ur: وجہ فیلڈ کو خالی نہیں چھوڑا جانا چاہئے.

source: Updating with latest library content
ur: تازہ ترین لائبریری کے مواد کے ساتھ اپ ڈیٹ کرنا

source: Mark as Answer
ur: جواب کے طور پر نشان زد کریں

source: Task inputs
ur: ٹاسک آدانوں

source: This image is for decorative purposes only and does not require a description.
ur: یہ تصویر صرف آرائشی مقاصد کے لئے ہے اور وضاحت کی ضرورت نہیں ہے.

source: Highlighted text
ur: ہائی ٹیکڈ متن

source: This configuration is currently used in content experiments. If you make changes to the groups, you may need to edit those experiments.
ur: اس ترتیب کو فی الحال مواد تجربات میں استعمال کیا جاتا ہے. اگر آپ گروپوں میں تبدیلی کرتے ہیں، تو آپ ان تجربات میں ترمیم کرنے کی ضرورت ہوسکتی ہے.

source: The cohort cannot be added
ur: کوورٹ شامل نہیں کیا جا سکتا

source: {categoryText} in {parentDisplayname}
ur: {categoryText} میں {parentDisplayname}

source: Check your email for an activation message.
ur: چالو کرنے کے پیغام کے لئے اپنا ای میل چیک کریں.

source: Show invisible characters
ur: پوشیدہ حروف دکھائیں

source: Donate
ur: عطیہ

source: Thumbnail for {videoName}
ur: {videoName} کے لئے تھمب نیل

source: Lock/unlock file
ur: فائل لاک / انلاک کریں

source: Insert row before
ur: پہلے قطار داخل کریں

source: Key should only contain letters, numbers, _, or -
ur: کلید میں صرف حروف، نمبر، _، یا -

source: An error has occurred. Try refreshing the page, or check your Internet connection.
ur: ایک خرابی آگئی ہے. صفحہ کو تازہ کرنے کی کوشش کریں یا اپنا انٹرنیٹ کنکشن چیک کریں.

source: Sorted by
ur: کی طرف سے ترتیب

source: Text color
ur: متن کا رنگ

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from %(platformName)s to verify your identity.
ur: اگر آپ ابھی اپنی شناخت کی توثیق نہیں کرتے ہیں تو، آپ اپنے کورس کو اپنے ڈیش بورڈ سے بھی تلاش کرسکتے ہیں. آپ کی شناخت کی توثیق کے لئے آپ کو٪ (platformName) کی جانب سے باقاعدہ یاد دہانی ملے گی.

source: You will use your webcam to take a picture of your face and of your government-issued photo ID.
ur: آپ اپنے ویب کیم کا استعمال کرتے ہوئے آپ کے چہرے اور آپ کی حکومت سے جاری کردہ تصویر کی شناختی تصویر کا استعمال کریں گے.

source: Document properties
ur: دستاویز کی خصوصیات

source: Select turnaround
ur: تبدیلی کا انتخاب کریں

source: Default
ur: پہلے سے طے شدہ

source: Required
ur: ضرورت ہے

source: All groups must have a name.
ur: تمام گروپوں کا نام ہونا ضروری ہے.

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam, along with the {linkStart}general proctored exam rules{linkEnd}.
ur: کسی بھی قواعد و ضوابط کی استثناء کی وضاحت کریں کہ ویڈیو کا جائزہ لینے کے دوران پروکیکنگ جائزہ لینے والے ٹیم کو نافذ کرنا چاہئے. مثال کے طور پر، آپ وضاحت کر سکتے ہیں کہ کیلکولیٹروں کی اجازت ہے. {مخصوص اسٹارڈ} عام پروکسیڈ امتحان کے قوانین {linkEnd} کے ساتھ ساتھ، سیکھنے والے امتحان شروع ہونے سے پہلے یہ مخصوص قواعد سیکھنے والوں کے لئے نظر آتے ہیں.

source: <%= user %> already in exception list.
ur: &lt;٪ = صارف٪&gt; پہلے سے ہی استثناء کی فہرست میں.

source: Allow students to generate certificates for this course?
ur: طالب علم اس کورس کے لئے سرٹیفکیٹ پیدا کرنے کی اجازت دیں؟

source: Location in Course
ur: کورس میں مقام

source: Ends {end}
ur: {اختتام} ختم ہوتا ہے

source: An error occurred while removing the member from the team. Try again.
ur: ٹیم سے رکن کو ہٹانے میں ایک خرابی واقع ہوئی. دوبارہ کوشش کریں.

source: Text to display
ur: ڈسپلے کرنے کے لئے متن

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
ur: مطالبات پر روابط پیدا ہوتے ہیں اور طالب علم کی معلومات کے حساس نوعیت کی وجہ سے 5 منٹ کے اندر اندر ختم ہوتے ہیں.

source: Join Team
ur: ٹیم میں شمولیت

source: What You Need for Verification
ur: آپ کی توثیق کے لئے کیا ضرورت ہے

source: Please describe this image or agree that it has no contextual value by checking the checkbox.
ur: براہ کرم اس تصویر کی وضاحت کریں یا اس بات سے اتفاق کریں کہ چیک باکس کی جانچ پڑتال کرکے اس کا کوئی متوازن قدر نہیں ہے.

source: This page contains information about orders that you have placed with {platform_name}.
ur: اس صفحہ میں آپ کے {پلیٹ فارم} کے ساتھ رکھے ہوئے احکامات کے بارے میں معلومات شامل ہیں.

source: Remove chapter %(chapterDisplayName)s
ur: باب٪ (باب ڈسپلے نام) s ہٹا دیں

source: Validation Error
ur: توثیق کی خرابی

source: Return to Export
ur: برآمد میں واپسی

source: This unit has validation issues.
ur: اس یونٹ میں توثیق کے مسائل ہیں.

source: Government-Issued Photo ID
ur: حکومت نے شائع کردہ تصویر کی شناخت

source: Note: Do not hide graded assignments after they have been released.
ur: نوٹ: ان کی رہائی کے بعد درجہ بندی کردہ تفویض کو چھپانا نہ کریں.

source: Sequence error! Cannot navigate to %(tab_name)s in the current SequenceModule. Please contact the course staff.
ur: ترتیب کی غلطی! موجودہ SequenceModule میں٪ (tab_name) s پر نیویگیٹ نہیں کر سکتے ہیں. براہ کرم کورس کے عملے سے رابطہ کریں.

source: Prevent students from generating certificates in this course?
ur: طالب علموں کو اس کورس میں سرٹیفکیٹ پیدا کرنے سے روکنا؟

source: Learners are added to this cohort only when you provide their email addresses or usernames on this page.
ur: اس کوہٹ میں اساتذہ میں شامل کیا جاتا ہے صرف اس وقت جب آپ اس صفحہ پر اپنا ای میل پتے یا صارف نام فراہم کرتے ہیں.

source: Highlights for {display_name}
ur: {display_name} کے لئے جھلکیاں

source: All teams
ur: تمام ٹیمیں

source: post anonymously
ur: گمنام سے پوچھ لو

source: Error retrieving grading configuration.
ur: گریڈنگ ترتیب کو دوبارہ حاصل کرنے میں خرابی.

source: Average
ur: اوسط

source: Titles more than 100 characters may prevent students from printing their certificate on a single page.
ur: 100 حروف سے زیادہ عنوانات طالب علموں کو ایک ہی صفحے پر ان کے سرٹیفکیٹ کو چھپانے سے روک سکتے ہیں.

source: An error has occurred. Check your Internet connection and try again.
ur: ایک خرابی آگئی ہے. اپنا انٹرنیٹ کنکشن چیک کریں اور دوبارہ کوشش کریں.

source: Editing response
ur: ترمیم کرنے کا جواب

source: A valid email address is required
ur: ایک درست ای میل ایڈریس لازمی ہے

source: View
ur: دیکھیں

source: {numMoved} learner was moved from {prevCohort}
ur: {numMoved} سیکھنے {prevCohort} سے منتقل کردیا گیا تھا

source: This is the name of the group
ur: یہ گروپ کا نام ہے

source: Graded as:
ur: کے طور پر درجہ بندی:

source: My Notes
ur: میرا نوٹس

source: Not Currently Available
ur: فی الحال دستیاب نہیں ہے

source: Upload translation
ur: ترجمہ اپ لوڈ کریں

source: Please enter a score.
ur: براہ کرم ایک سکور درج کریں.

source: Insert template
ur: ٹیمپلیٹ ڈالیں

source: You have no handouts defined
ur: آپ کے پاس کوئی ہینڈ آؤٹ نہیں ہے

source: Name or short description of the configuration
ur: ترتیب کے نام یا مختصر وضاحت

source: Author
ur: مصنف

source: Email Address (Sign In)
ur: ای میل ایڈریس (سائن ان)

source: Click to edit
ur: ترمیم کرنے کے لئے کلک کریں

source: Group information
ur: گروپ کی معلومات

source: The following errors were generated:
ur: مندرجہ ذیل غلطیاں پیدا کی گئی تھیں:

source: Not selected
ur: منتخب نہیں کیا گیا

source: This learner is currently sharing a limited profile.
ur: یہ سیکھنے فی الحال ایک محدود پروفائل کا اشتراک کر رہا ہے.

source: Video image upload started
ur: ویڈیو تصویر اپ لوڈ شروع ہوگئی

source: These users will be allowed to enroll once they register:
ur: ان صارفین کو رجسٹریشن کے بعد اندراج کرنے کی اجازت ہوگی.

source: Moving
ur: منتقل

source: Insert row after
ur: قطار کے بعد داخل کریں

source: {ReqTextSpanStart}Requirements{spanEnd}{lineBreak}{InstructionsSpanStart}{videoImageResoultion}{lineBreak} {videoImageSupportedFileFormats}{spanEnd}
ur: {ریق ٹیکسٹس فہرست} تقاضے {spanEnd} {lineBreak} {ہدایاتسپانٹ اسٹارٹ} {videoImageResoultion} {lineBreak} {videoImageSupportedFileFormats} {spanEnd}

source: Could not find Certificate Exception in white list. Please refresh the page and try again
ur: سفید فہرست میں سرٹیفکیٹ استثنا نہیں مل سکا. صفحہ کو تازہ کریں اور دوبارہ کوشش کریں

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Task Status' button to see the status of the task.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ داخلہ ریورس کا کام شروع کیا. کام کی حیثیت کو دیکھنے کے لئے &#39;ٹاسک اسٹیٹ دکھائیں&#39; کے بٹن پر کلک کریں.

source: Learners do not see whether their answers to assessments were correct or incorrect, nor the score received, until after the course end date has passed.
ur: اساتذہ کو یہ معلوم نہیں ہے کہ آیا ان کے جوابات کا تعین صحیح یا غلط تھا، اور نہ ہی سکور موصول ہونے تک، کورس کے اختتام کی تاریخ منظور ہونے کے بعد تک.

source: Maximum
ur: زیادہ سے زیادہ

source: Load Another File
ur: ایک اور فائل لوڈ کریں

source: LEARN MORE
ur: اورجانیے

source: Type in a URL or use the "Choose File" button to upload a file from your machine. (e.g. 'http://example.com/img/clouds.jpg')
ur: یو آر ایل میں ٹائپ کریں یا اپنی مشین سے فائل کو اپ لوڈ کرنے کیلئے &quot;فائل کا انتخاب کریں&quot; کا بٹن استعمال کریں. (مثال کے طور پر &#39;http://example.com/img/clouds.jpg&#39;)

source: Photo requirements:
ur: تصویر کی ضروریات:

source: name
ur: نام

source: Prerequisite: %(prereq_display_name)s
ur: شرط:٪ (prereq_display_name) s

source: Skip
ur: چھوڑ دو

source: Your import has failed.
ur: آپ کا درآمد ناکام ہوگیا ہے.

source: This link will open in a new browser window/tab
ur: یہ لنک ایک نیا براؤزر ونڈو / ٹیب میں کھل جائے گا

source: Link your {accountName} account to your {platformName} account and use {accountName} to sign in to {platformName}.
ur: اپنا {اکاؤنٹ نام} اکاؤنٹ اپنے {platformName} اکاؤنٹ میں لنک کریں اور {platformName} میں سائن ان کرنے کیلئے {accountName} استعمال کریں.

source: Entrance exam state is being deleted for student '{student_id}'.
ur: طالب علم کے &#39;student_id}&#39; کے لئے داخلہ امتحان کی حیثیت ختم ہوگئی ہے.

source: {unread_comments_count} new
ur: {unread_comments_count} نیا

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ur: مسئلہ &#39;&lt;٪ = problem_id٪&gt;&#39; اور طالب علم &#39;٪ - student_id٪&gt;&#39; کے لئے مسئلہ دوبارہ کوشش کرنے میں خرابی ہے. اس بات کو یقینی بنائیں کہ مسئلہ اور طالب علم کی شناخت مکمل اور درست ہیں.

source: Add to Dictionary
ur: ڈکشنری میں شامل کریں

source: Upgrade to a Verified Certificate for {courseName}
ur: {courseName} کے لئے ایک تصدیق شدہ سرٹیفکیٹ پر اپ گریڈ کریں

source: Enable Weekly Highlight Emails
ur: ہفتہ وار نمایاں ای میلز کو فعال کریں

source: Unscheduled
ur: ناپسندیدہ

source: {totalItems} total
ur: {کل امیموں} کل

source: Save
ur: محفوظ کریں

source: Add Additional Signatory
ur: اضافی دستخط شامل کریں

source: The following information is already a part of your {platform} profile. We\'ve included it here for your application.
ur: مندرجہ ذیل معلومات آپ کے {پلیٹ فارم} پروفائل کا حصہ ہیں. ہم نے یہاں آپ کی درخواست کے لئے یہاں شامل کیا ہے.

source: Check the box to remove %(totalFlags)s flag.
ur: ٪ (کل فالکس) کے پرچم کو ہٹا دیں باکس کو چیک کریں.

source: Editable
ur: قابل تدوین

source: Markdown Editing Help
ur: مارکڈڈ ترمیم کی مدد

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} descending
ur: {currentItemRange} سے {totalItemsCount} دکھا رہا ہے، {assetType} کی طرف سے فلٹر، sorted {sortName} descending

source: Order History
ur: آرڈر کی تاریخ

source: Noncommercial
ur: غیر تجارتی

source: The selected content group does not exist
ur: منتخب کردہ مواد گروپ موجود نہیں ہے

source: Group %s
ur: گروپ٪ s

source: correct
ur: درست

source: Merge cells
ur: خلیات ضم

source: Error posting your message.
ur: آپ کا پیغام پوسٹ کرنے میں خرابی

source: Specify whether discussion topics are divided
ur: وضاحت کریں کہ بحث کے موضوعات تقسیم کیے جائیں گے

source: Image must be in PNG format
ur: تصویر PNG کی شکل میں ہونا ضروری ہے

source: Match case
ur: میچ کیس

source: Please add the institute where the instructor is associated
ur: براہ کرم انسٹی ٹیوٹ کو شامل کریں جہاں انسٹرکٹر منسلک ہے

source: Updating Tags
ur: ٹیگز اپ ڈیٹ کرنا
