Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: {platform_name} AND THE {platform_name} PARTICIPANTS (AS HERINAFTER DEFINED) DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE. "{platform_name} PARTICIPANTS" MEANS MIT, HARVARD, THE OTHER MEMBERS, THE ENTITIES PROVIDING INFORMATION, API CONTENT OR SERVICES FOR THE APIS, THE COURSE INSTRUCTORS AND THEIR STAFFS.
ar: {Platform_name} والمشاركون {platform_name} (كما هو محدد في الكتيب) لا يضمنون أن APIS سيعملون في إدارة خالية من الأخطاء أو خالية من الأخطاء ، وأن APIS خالية من الفيروسات أو مكونات ضارة أخرى ، أو أن APIS أو API المحتوى سوف تفي احتياجاتك أو توقعاتك. {platform_name} و {platform_name} PARTICIPANTS أيضًا لا تقدم أي ضمانات حول دقة ، أو اكتمال ، أو توقيت ، أو جودة APIS أو أي محتوى واجهة برمجة التطبيقات ، أو أن أي محتوى واجهة برمجة تطبيقات خاصة ستتم إتاحته. &quot;{platform_name} PARTICIPANTS&quot; MITS MIT، HARVARD، THE OTHER MEMBERS، THE INTITIES PROVIDK INFORMATION، API API or SERVICES for the APIS، THE COURSE INSTRUCTORS and THEIRFSFS.
ur: {platform_name} اور {platform_name} شراکت دار (AS HERAFAFTER DEFINED) اس بات کا یقین نہیں کرتے کہ یہ درخواست کسی غیر محفوظ شدہ یا غلط فری منیجر میں چل جائے گی، اس سے بچنے والے وائرس یا دیگر ہتھوڑا اجزاء سے پاک ہیں، یا اس کا اطلاق یا API مواد فراہم کی جائے گی آپ کی ضروریات یا اخراجات کو پورا کریں. {platform_name} اور {platform_name} شراکت داری کے علاوہ ACCURACYYY، COMPLETENESS، TIMELINESS، یا APIS یا کسی API کے مواد کے معیار کے بارے میں کوئی وارنٹی نہیں، یا کسی بھی شرائط API کے مواد دستیاب ہونے کے لئے تیار ہو جائے گا. &quot;{پلیٹ فارم نام} شراکت داروں&quot; MEANS MIT، HARVARD، دیگر ارکان، ایپیز کے لئے معلومات فراہم کرنے والے اداروں، API مواد یا خدمات، کورس کی تعمیراتی اور ان کے اسٹافز.
zh_cn: {platform_name}和{platform_name}参与者（如HERINAFTER的定义）不保证AP将以不中断或无错误的方式运行，API不含病毒或其他有害组件，或API或API内容提供将满足您的需求或期望。 {platform_name}和{platform_name}参与者也不对APIS或任何API内容的准确性，完整性，及时性或质量，或任何特定的API内容将继续提供担保。 “{platform_name}参与者”是指MIT，HARVARD，其他成员，为APIS提供信息，API内容或服务的实体，课程导师及其工作人员。

source: {site_name} - Confirm Enrollment
ar: {site_name} - تأكيد التسجيل
ur: {site_name} - اندراج کی توثیق کریں
zh_cn: {site_name} - 确认注册

source: Your answers were previously saved. Click '{button_name}' to grade them.
ar: تم حفظ إجاباتك مسبقًا. انقر فوق &quot;{button_name}&quot; لتصنيفها.
ur: آپ کا جواب پہلے ہی محفوظ کیا گیا تھا. انہیں گریڈ کرنے کیلئے &#39;{button_name}&#39; پر کلک کریں.
zh_cn: 您的答案先前已保存。点击“{button_name}”为它们打分。

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
ar: يسمح بناء الجملة تخفيض السعر. راجع٪ (start_link) scheatsheet٪ (end_link) s للحصول على المساعدة.
ur: مارکڈن نحو کی اجازت ہے. مدد کے لئے٪ (start_link) اسکیم شیٹ٪ (end_link) s ملاحظہ کریں.
zh_cn: Markdown语法是允许的。请参阅％（start_link）scheatsheet％（end_link）以获得帮助。

source: show deprecation messaging in Studio
ar: عرض رسائل الإيقاف في Studio
ur: سٹوڈیو میں ڈسیکشن پیغام رسانی دکھائیں
zh_cn: 在Studio中显示弃用消息

source: Preferences for {platform_name}
ar: تفضيلات {platform_name}
ur: {platform_name} کے لئے ترجیحات
zh_cn: {platform_name}的偏好设置

source: Generate Example Certificates
ar: توليد شهادات سبيل المثال
ur: مثال کے طور پر سرٹیفکیٹ بنائیں
zh_cn: 生成示例证书

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
ar: نحن ننصح بإرسال ما لا يزيد عن رسالة بريد إلكتروني واحدة في الأسبوع. قبل إرسال البريد الإلكتروني ، قم بمراجعة النص بعناية وإرساله إلى نفسك أولاً ، بحيث يمكنك معاينة التنسيق والتأكد من أن الصور والارتباطات المضمنة تعمل بشكل صحيح.
ur: ہم سفارش کرتے ہیں کہ فی ہفتہ ایک ای میل پیغام سیکھیں. اپنے ای میل بھیجنے سے پہلے، متن کو احتیاط سے جائزہ لیں اور اپنے آپ کو سب سے پہلے بھیجیں، لہذا آپ فارمیٹنگ کا جائزہ لیں اور اس بات کا یقین کرسکتے ہیں کہ سرایت شدہ تصاویر اور روابط صحیح طریقے سے کام کریں.
zh_cn: 我们建议每周向学习者发送不超过一封电子邮件。在发送电子邮件之前，请仔细阅读文本并将其发送给自己，以便预览格式并确保嵌入的图像和链接正常工作。

source: Dates that control when your course can be viewed
ar: التواريخ التي تتحكم في وقت عرض الدورة التدريبية الخاصة بك
ur: جب آپ کا کورس دیکھا جاسکتا ہے تو اس کا بندوبست
zh_cn: 控制何时可以查看课程的日期

source: COURSE NOT FOUND. Please check that the course ID is valid.
ar: بالطبع لم يتم العثور على. يرجى التحقق من صحة معرف الدورة التدريبية.
ur: کورس نہیں ہے. براہ کرم چیک کریں کہ کورس کی شناخت درست ہے.
zh_cn: 课程未找到。请检查课程编号是否有效。

source: Conditional Value
ar: قيمة شرطية
ur: مشروط قیمت
zh_cn: 有条件的价值

source: The user {username} is not enrolled in the course associated with this team.
ar: المستخدم {اسم المستخدم} غير مسجل في الدورة التدريبية المرتبطة بهذا الفريق.
ur: صارف {صارف کا نام} اس ٹیم سے منسلک کورس میں داخل نہیں ہوا ہے.
zh_cn: 用户{用户名}未登记与此团队相关的课程。

source: Date of the last view of the bumper
ar: تاريخ آخر عرض للوفير
ur: بمپر کے آخری نقطہ نظر کی تاریخ
zh_cn: 保险杠的最后一个视图的日期

source: Learn more about grading policy settings
ar: تعرف على المزيد حول تحديد درجات السياسة
ur: گریڈنگ پالیسی کی ترتیبات کے بارے میں مزید جانیں
zh_cn: 了解有关评级策略设置的更多信息

source: Dictionary with the current student score
ar: القاموس مع درجة الطالب الحالية
ur: موجودہ طالب علم کے سکور کے ساتھ ڈکشنری
zh_cn: 带有当前学生分数的字典

source: Take a course with {platform} online
ar: شارك في دورة تدريبية عبر {platform} عبر الإنترنت
ur: {پلیٹ فارم} آن لائن کے ساتھ ایک کورس لیں
zh_cn: 通过{平台}在线学习课程

source: Html contents to display for this module
ar: يتم عرض محتويات Html لهذه الوحدة
ur: اس ماڈیول کے لئے ظاہر کرنے کے لئے ایچ ٹی ایم ایل کے مواد
zh_cn: 为此模块显示的Html内容

source: Sign into {studio_name}
ar: تسجيل الدخول إلى {studio_name}
ur: {studio_name} میں سائن ان کریں
zh_cn: 登录{studio_name}

source: Data in row #{row_num} must have exactly four columns: email, username, full name, and country
ar: يجب أن تحتوي البيانات في الصف # {row_num} على أربعة أعمدة: البريد الإلكتروني واسم المستخدم والاسم الكامل والبلد
ur: قطار # {row_num} میں ڈیٹا بالکل چار کالم ہونا چاہئے: ای میل، صارف کا نام، مکمل نام، اور ملک
zh_cn: 第{row_num}行中的数据必须正好有四列：电子邮件，用户名，全名和国家/地区

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
ar: اختر نوع مشكلة لجلب من المكتبة. إذا تم تحديد &quot;أي نوع&quot; لا يتم تطبيق أي تصفية.
ur: لائبریری سے لے جانے کیلئے ایک مسئلہ کی قسم منتخب کریں. اگر &quot;کوئی قسم&quot; منتخب کیا جاتا ہے تو کوئی فلٹرنگ لاگو نہیں ہوتا ہے.
zh_cn: 选择要从库中获取的问题类型。如果选择“任何类型”，则不应用过滤。

source: Raw
ar: الخام
ur: خام
zh_cn: 生的

source: Source URL
ar: عنوان URL المصدر
ur: ماخذ یو آر ایل
zh_cn: 来源网址

source: You have unsaved changes.
ar: لم تحفظ التغييرات.
ur: آپ کے پاس محفوظ کردہ تبدیلییں ہیں.
zh_cn: 您有未保存的更改。

source: You must provide target_index ({target_index}) as an integer.
ar: يجب عليك تقديم target_index ({target_index}) كعدد صحيح.
ur: آپ کو target_index ({target_index}) فراہم کرنا لازمی طور پر فراہم کرنا ہوگا.
zh_cn: 您必须将target_index（{target_index}）作为整数提供。

source: Usage and Quotas
ar: الاستخدام والحصص
ur: استعمال اور کوٹاس
zh_cn: 用法和配额

source: Ready
ar: جاهز
ur: تیار
zh_cn: 准备

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
ar: تم رفض طلبك للحصول على حقوق إنشاء الدورة التدريبية لـ {studio_name}. إذا كنت تعتقد أن هذا كان خطأً ، فيرجى الاتصال {email}
ur: {سٹوڈیو_ نام} کے کورس تخلیق کے حقوق کے لئے آپ کی درخواست مسترد کردی گئی ہے. اگر آپ کو یقین ہے کہ یہ غلطی میں تھا، تو براہ مہربانی {ای میل} سے رابطہ کریں
zh_cn: 您向{studio_name}创建课程权限的请求已被拒绝。如果您认为这是错误的，请联系{email}

source: XML data for the problem
ar: بيانات XML لهذه المشكلة
ur: مسئلہ کے لئے XML ڈیٹا
zh_cn: XML数据的问题

source: The course mode for this badge image. For example, "verified" or "honor".
ar: وضع الدورة لصورة هذه الشارة. على سبيل المثال ، &quot;تم التحقق&quot; أو &quot;الشرف&quot;.
ur: اس بیج تصویر کے لئے کورس کے موڈ. مثال کے طور پر، &quot;تصدیق&quot; یا &quot;اعزاز&quot;.
zh_cn: 此徽章图像的课程模式。例如，“已验证”或“荣誉”。

source: set pre-requisite course
ar: ضبط دورة ما قبل الشرط
ur: پہلے سے لازمی کورس مقرر کریں
zh_cn: 设置先决条件课程

source: Cannot rescore with all_students and unique_student_identifier.
ar: لا يمكن التسجيل مع all_students و unique_student_identifier.
ur: all_students اور unique_student_identifier کے ساتھ دوبارہ تبدیل نہیں کر سکتے ہیں.
zh_cn: 无法使用all_students和unique_student_identifier重新定位。

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
ar: يمكنك إنشاء صفحات مخصصة وتعديلها لتزويد الطلاب بمحتوى دورة تدريبية إضافي. على سبيل المثال ، يمكنك إنشاء صفحات لسياسة التقدير ، وشرائح الدورة التدريبية ، وتقويم الدورة التدريبية.
ur: اضافی نصاب کے مواد کے ساتھ طالب علموں کو فراہم کرنے کے لئے آپ اپنی مرضی کے صفحات تخلیق اور ترمیم کرسکتے ہیں. مثال کے طور پر، آپ گریڈنگ پالیسی، کورس سلائڈز، اور ایک کورس کیلنڈر کے لئے صفحات بنا سکتے ہیں.
zh_cn: 您可以创建和编辑自定义页面，为学生提供额外的课程内容。例如，您可以为评分政策，课程幻灯片和课程日历创建页面。

source: Studio Accessibility Policy
ar: سياسة إمكانية الوصول إلى الاستوديو
ur: سٹوڈیو تک رسائی کی پالیسی
zh_cn: 工作室无障碍政策

source: Enrollment:
ar: التسجيل:
ur: اندراج:
zh_cn: 注册：

source: No Library Selected
ar: لا توجد مكتبة محددة
ur: کوئی لائبریری منتخب نہیں
zh_cn: 未选择图书馆

source: Course does not start until {}
ar: لا تبدأ الدورة حتى {}
ur: کورس تک {}} شروع نہیں ہوتا
zh_cn: 课程直到{}才开始

source: Congratulations! You are now eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ar: تهانينا! أنت الآن مؤهل لتلقي رصيد الدورة من {موفري} لإكمال دورة {platform_name} بنجاح! {link_start} شراء رصيد الآن. {link_end}
ur: مبارک ہو! آپ اب {platform_name} کورس کامیابی سے مکمل کرنے کیلئے {فراہم کنندہ} سے کورس کریڈٹ حاصل کرنے کے اہل ہیں! {link_start} ابھی کریڈٹ خریدیں. {link_end}
zh_cn: 恭喜！您现在有资格从{providers}获得课程学分，以成功完成{platform_name}课程！ {link_start}立即购买功劳。{link_end}

source: Congratulations, {user_name}!
ar: تهانينا ، {user_name}!
ur: مبارک ہو، {user_name}!
zh_cn: 恭喜，{user_name}！

source: Sincerely yours,The {course_name} Team
ar: مع خالص التقدير ، فريق {course_name}
ur: مخلص تمہارا، {course_name} ٹیم
zh_cn: 您真诚的，{course_name}团队

source: You can restrict access to this unit to learners in specific content groups.
ar: يمكنك تقييد الوصول إلى هذه الوحدة للمتعلمين في مجموعات محتوى محددة.
ur: آپ مخصوص یونٹ گروپوں میں سیکھنے والوں کو اس یونٹ تک رسائی محدود کر سکتے ہیں.
zh_cn: 您可以将访问权限限制在特定内容组中的学习者。

source: Student Admin
ar: الطالب المسؤول
ur: طالب علم ایڈمن
zh_cn: 学生管理员

source: Student Email or Username
ar: البريد الإلكتروني الطالب أو اسم المستخدم
ur: طالب علم ای میل یا صارف نامہ
zh_cn: 学生电邮或用户名

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
ar: {em_start} ملاحظة: {em_end} عندما تقوم بإدخال سلاسل كقيم سياسة ، تأكد من استخدام علامات اقتباس مزدوجة (&quot;) حول السلسلة. لا تستخدم علامات اقتباس مفردة (&#39;).
ur: {em_start} نوٹ: {em_end} جب آپ پالیسی اقدار کے طور پر ڈور داخل کرتے ہیں، تو یقینی بنائیں کہ آپ سٹرنگ کے ارد گرد ڈبل quotation marks (&quot;) استعمال کرتے ہیں. واحد کوٹیشن نمبروں کا استعمال نہ کریں (&#39;).
zh_cn: {em_start}注意：{em_end}当您输入字符串作为策略值时，确保在字符串周围使用双引号（“），不要使用单引号（&#39;）。

source: by recent activity
ar: من خلال النشاط الأخير
ur: حالیہ سرگرمی سے
zh_cn: 通过最近的活动

source: Recent git load activity for {course_id}
ar: نشاط حمل git الأخير لـ {course_id}
ur: {course_id} کیلئے حالیہ گیٹ لوڈ کی سرگرمی
zh_cn: 最近的{course_id}的git加载活动

source: There was an error saving your information. Please see below.
ar: حدث خطأ في حفظ معلوماتك. من فضلك، انظر بالأسفل.
ur: آپ کی معلومات کو بچانے میں ایک خرابی تھی. نیچے ملاحظہ کریں.
zh_cn: 保存您的信息时出错。请看下面。

source: Do not use spaces in expressions.
ar: لا تستخدم المسافات في التعبيرات.
ur: اظہار میں خالی جگہوں کا استعمال نہ کریں.
zh_cn: 不要在表达式中使用空格。

source: Course Seat Purchases
ar: مشتريات مقعد بالطبع
ur: کورس سیٹ خریدیں
zh_cn: 课程座位购买

source: Your Platform Name Here
ar: اسم المنصة الخاص بك هنا
ur: آپ کے پلیٹ فارم کا نام یہاں
zh_cn: 你的平台名称在这里

source: Shopping Cart
ar: عربة التسوق
ur: خریداری کی ٹوکری
zh_cn: 购物车

source: Download CSV
ar: تنزيل ملف CSV
ur: CSV ڈاؤن لوڈ کریں
zh_cn: 下载CSV

source: Number of seconds to cache course content retrieved from Sailthru.
ar: عدد الثواني التي تم تخزينها في محتوى الدورة التدريبية الذي تم استرداده من Sailthru.
ur: سلیتھورس سے حاصل کیش کورس کے مواد میں سیکنڈ کی تعداد.
zh_cn: 缓存从Sailthru检索的课程内容的秒数。

source: Insufficient funds in the account. Possible action: retry with another form of payment.
ar: أموال غير كافية في الحساب. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: اکاؤنٹ میں ناکافی فنڈز. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 帐户资金不足。可能的行动：以另一种形式的付款重试。

source: Allows courses to share the same css class across runs even if they have different numbers.
ar: يسمح الدورات لمشاركة نفس الطبقة CSS عبر تشغيل حتى لو كان لديهم أرقام مختلفة.
ur: کورسز کو مختلف نمبروں پر بھی اس طرح کے سی ایس ایس کلاس میں حصہ لینے کی اجازت دیتا ہے.
zh_cn: 允许课程跨运行共享相同的CSS类，即使它们具有不同的编号。

source: Hide External Tool
ar: اخفاء اداة خارجية
ur: بیرونی آلے چھپائیں
zh_cn: 隐藏外部工具

source: You are eligible to upgrade in these courses:
ar: أنت مؤهل للترقية في هذه الدورات:
ur: آپ ان کورسوں میں اپ گریڈ کرنے کے اہل ہیں:
zh_cn: 您有资格升级这些课程：

source: My Stats (Beta)
ar: إحصائياتي (إصدار تجريبي)
ur: میری اعداد و شمار (بیٹا)
zh_cn: 我的统计信息（Beta）

source: %s has been marked as deleted
ar: تم وضع علامة على٪ s كمحذف
ur: ٪ s کو حذف کر دیا گیا ہے
zh_cn: ％s已被标记为已删除

source: The score student must meet in order to successfully complete the entrance exam.
ar: يجب أن يلتقي طالب الدرجة حتى يكمل امتحان القبول بنجاح.
ur: داخلہ امتحان کو کامیابی سے مکمل کرنے کے لئے سکور طالب علم کو پورا کرنا ضروری ہے.
zh_cn: 得分学生必须满足才能成功完成入学考试。

source: Processor Failure. Possible fix: retry the payment
ar: فشل المعالج. إصلاح محتمل: أعد محاولة الدفع
ur: پروسیسر ناکامی. ممکنہ طے: ادائیگی دوبارہ کریں
zh_cn: 处理器故障。可能的解决方法：重试付款

source: {platform_name} Staff
ar: {platform_name} الموظفون
ur: {platform_name} اسٹاف
zh_cn: {platform_name}工作人员

source: Enrollment Role
ar: دور التسجيل
ur: اندراج رول
zh_cn: 注册角色

source: {header_open}{title}{header_close}
ar: {header_open} {عنوان} {} header_close
ur: {header_open} {عنوان} {ہیڈر_close}
zh_cn: {header_open} {标题} {} header_close

source: {number_of_courses} courses in program
ar: {number_of_courses} دورات في البرنامج
ur: پروگرام میں {number_of_courses} کورسز
zh_cn: 课程中的{number_of_courses}课程

source: None
ar: لا شيء
ur: کوئی بھی نہیں
zh_cn: 没有

source: answer-pool value should be an integer
ar: يجب أن تكون قيمة answer-pool عددًا صحيحًا
ur: جواب پول قیمت لازمی طور پر ہونا چاہئے
zh_cn: 答案池的值应该是一个整数

source: edX Documentation
ar: وثائق EDX
ur: edX دستاویزی
zh_cn: edX文档

source: Manage course staff and instructors
ar: إدارة موظفي الدورة والمعلمين
ur: کورس کے عملے اور اساتذہ کو منظم کریں
zh_cn: 管理课程人员和教师

source: Certificate Web/HTML View Overrides
ar: شهادة ويب / HTML عرض Overrides
ur: سرٹیفکیٹ ویب / HTML دیکھیں اوورائڈس
zh_cn: 证书Web / HTML视图覆盖

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
ar: {student_name} ، لقد استوفيت متطلبات الاعتماد في هذه الدورة التدريبية. {a_start} انتقل إلى لوحة المعلومات {a_end} لشراء رصيد الدورة التدريبية.
ur: {student_name}، آپ نے اس کورس میں کریڈٹ کے لئے ضروریات کو پورا کیا ہے. {a_start} کورس کریڈٹ خریدنے کے لئے اپنے ڈیش بورڈ {a_end} پر جائیں.
zh_cn: {student_name}，你已经达到了本课程的学分要求。 {a_start}转到您的信息中心{a_end}购买课程学分。

source: Terms of Service
ar: شروط الخدمة
ur: سروس کی شرائط
zh_cn: 服务条款

source: Compressing
ar: ضغط
ur: کمپریسنگ
zh_cn: 压缩

source: Rescore Learner's Submission
ar: Rescore Learner&#39;s Submission
ur: ریسورس سیکرٹری کی جمع کرانے
zh_cn: 重新提交学习者提交的内容

source: Organization Contact Name
ar: اسم جهة الاتصال
ur: تنظیم کا نام نام
zh_cn: 组织联系人姓名

source: {programming_language} editor
ar: {programming_language} محرر
ur: {programming_language} ایڈیٹر
zh_cn: {programming_language}编辑器

source: Disable the dynamic upgrade deadline for this organization.
ar: تعطيل الموعد النهائي للترقية الديناميكية لهذه المؤسسة.
ur: اس تنظیم کے لئے متحرک اپ گریڈ کی تاریخ کو غیر فعال کریں.
zh_cn: 禁用此组织的动态升级截止日期。

source: I, and my company, accept the {link_start}{platform_name} API Terms of Service{link_end}.
ar: أنا ، وشركتي ، نقبل {link_start} {platform_name} بنود خدمة واجهة برمجة التطبيقات {link_end}.
ur: میں، اور میری کمپنی، {link_start} {platform_name} API سروس کی شرائط {link_end} کو قبول کرتے ہیں.
zh_cn: 我和我的公司接受{link_start} {platform_name} API服务条款{link_end}。

source: Male
ar: الذكر
ur: مرد
zh_cn: 男

source: The requested capture amount exceeds the originally authorized amount.
ar: مبلغ الالتقاط المطلوب يتجاوز المبلغ الأصلي المأذون به.
ur: درخواست کی گرفتاری کی رقم اصل میں اختیار شدہ رقم سے زیادہ ہے.
zh_cn: 请求的捕获量超过原始授权量。

source: Created new user: "{}"
ar: تم إنشاء مستخدم جديد: &quot;{}&quot;
ur: نیا صارف تشکیل: &quot;{}&quot;
zh_cn: 创建新用户：“{}”

source: Course Not Graded
ar: بالطبع غير متدرج
ur: کورس نہیں گرڈ
zh_cn: 课程没有评分

source: Select the default license for course content
ar: حدد الترخيص الافتراضي لمحتوى الدورة التدريبية
ur: کورس کے مواد کیلئے ڈیفالٹ لائسنس منتخب کریں
zh_cn: 选择课程内容的默认许可证

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
ar: {studio_name} هو حل مستضاف لشركائنا في xConsortium والضيوف المحددين. تظهر الدورات التي أنت عضو في فريق لك أعلاه لتعديلها ، بينما تمنح امتيازات منشئي الدورة التدريبية من خلال {platform_name}. يقوم فريقنا حاليًا بتقييم طلبك.
ur: {سٹوڈیو_ نام} ہمارے XConsortium شراکت داروں اور منتخب مہمانوں کے لئے ایک میزبان حل ہے. کورسز جن کے لئے آپ ٹیم ٹیم کا رکن آپ کے پاس ترمیم کرنے کے لئے مندرجہ بالا ظاہر ہوتا ہے، جبکہ کورس تخلیقی استحقاق {platform_name} کی طرف سے دی جاتی ہیں. ہماری ٹیم فی الحال آپ کی درخواست کا جائزہ لے رہی ہے.
zh_cn: {studio_name}是我们的xConsortium合作伙伴和选定访客的托管解决方案。您作为团队成员的课程出现在上面供您编辑，而课程创建者权限由{platform_name}授予。我们的团队正在评估您的请求。

source: External resource
ar: الموارد الخارجية
ur: بیرونی وسائل
zh_cn: 外部资源

source: {num} of {total}
ar: {عدد} من {total}
ur: {نوم} کا {مجموعی}
zh_cn: {total}的{num}

source: Matlab API key
ar: مفتاح واجهة برمجة التطبيقات Matlab
ur: Matlab API کی چابی
zh_cn: Matlab API密钥

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
ar: إدخال تجاوزات خاصة بالدورة لمعلمات قالب Web / HTML هنا (تنسيق JSON)
ur: یہاں ویب / ایچ ٹی ایم ایل ٹیمپلیٹ پیرامیٹرز کے لئے کورس کے مخصوص اوورائڈز داخل کریں (جے ایسون کی شکل)
zh_cn: 在此输入Web / HTML模板参数的课程特定覆盖（JSON格式）

source: Removing {codenames} permissions from group "{group}"
ar: إزالة أذونات {codenames} من المجموعة &quot;{group}&quot;
ur: گروپ &quot;{گروپ}&quot; سے {کوڈڈیم نام} اجازتوں کو ہٹانے
zh_cn: 从组“{group}”中删除{codenames}权限

source: Minimum Credit-Eligible Grade:
ar: الحد الأدنى للصف الائتماني المؤهل:
ur: کم سے کم کریڈٹ مستحق گریڈ:
zh_cn: 最低信用等级：

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
ar: أدخل علامة التبويب المحددة في XBlock. إذا لم يتم التعيين ، يتم تحديد علامة التبويب الدورة التدريبية.
ur: ٹیب درج کریں جسے XBlock میں منتخب کیا جاتا ہے. اگر سیٹ نہیں کیا جائے تو، کورس ٹیب منتخب کیا جاتا ہے.
zh_cn: 输入在XBlock中选择的选项卡。如果未设置，则选中“课程”选项卡。

source: Return to Your Dashboard
ar: العودة إلى لوحة المعلومات الخاصة بك
ur: اپنے ڈیش بورڈ پر واپس جائیں
zh_cn: 返回您的仪表板

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
ar: إظهار حالة مهام الإنقاذ التي قدمتها لهذا المتعلم والمشكلة.
ur: اس سیکھنے اور دشواری کے لئے آپ کو جمع کرانے والے کاموں کے لئے حیثیت دکھائیں.
zh_cn: 显示您为此学习者和问题提交的重新分级任务的状态。

source: <b>Congratulations!</b> {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
ar: <b>تهانينا!</b> لقد وافق {provider_name} على طلبك للحصول على رصيد الدورة التدريبية. للاطلاع على رصيد الدورة التدريبية ، تفضل بزيارة موقع الويب {link_to_provider_site}.
ur: <b>مبارک ہو!</b> {provider_name} نے کورس کی کریڈٹ کے لئے آپ کی درخواست منظور کی ہے. اپنے کورس کریڈٹ کو دیکھنے کے لئے، {link_to_provider_site} ویب سائٹ پر جائیں.
zh_cn: <b>恭喜！</b> {provider_name}已批准您的课程学分请求。要查看课程学分，请访问{link_to_provider_site}网站。

source: {platform_name} Content Quality Assessment
ar: {platform_name} تقييم جودة المحتوى
ur: {platform_name} مواد کوالٹی کی تشخیص
zh_cn: {platform_name}内容质量评估

source: Your legal name must be a minimum of two characters long
ar: يجب أن يكون اسمك القانوني لا يقل عن حرفين
ur: آپ کا قانونی نام کم سے کم دو حروف طویل ہونا ضروری ہے
zh_cn: 您的法定名称必须至少包含两个字符

source: Complete the course
ar: أكمل الدورة
ur: کورس مکمل کریں
zh_cn: 完成课程

source: Once you have registered and activated your account, visit {course_about_url} to join the course.
ar: بمجرد تسجيل حسابك وتنشيطه ، تفضل بزيارة {course_about_url} للانضمام إلى الدورة التدريبية.
ur: ایک بار جب آپ نے اپنا اکاؤنٹ رجسٹرڈ اور فعال کیا ہے، کورس میں شامل ہونے کیلئے {course_about_url} ملاحظہ کریں.
zh_cn: 注册并激活帐户后，请访问{course_about_url}加入课程。

source: TBD
ar: يحدد لاحقا
ur: ٹی بی ڈی

source: Balance Due: {currency_symbol}{sale_price}
ar: الرصيد المستحق: {currency_symbol} {sale_price}
ur: بیلنس کی وجہ سے: {currency_symbol} {sale_price}
zh_cn: 余额到期：{currency_symbol} {sale_price}

source: Add a multiple choice question
ar: أضف سؤال الاختيار من متعدد
ur: ایک سے زیادہ پسند سوال شامل کریں
zh_cn: 添加一个选择题

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
ar: لا يمكن تحرير مجموعات XBlock / القوالب التي تم تعطيلها في Studio ، بغض النظر عن مستوى الدعم. تذكر أيضًا التحقق مما إذا تم تعطيل كافة مثيلات XBlock في XBlockConfiguration.
ur: قطع نظر کی سطح کے بغیر، غیر فعال شدہ XBlock / ٹیمپلیٹ مجموعہ سٹوڈیو میں ترمیم نہیں کیا جا سکتا. یہ بھی یاد رکھیں کہ XBlockConfiguration میں XBlock کی تمام مثال غیر فعال ہیں.
zh_cn: 无论支持级别如何，在Studio中都无法编辑禁用的XBlock /模板组合。请记住还要检查XBlockConfiguration中是否禁用了XBlock的所有实例。

source: Allow Public Wiki Access
ar: اسمح لدخول ويكيكي العام
ur: پبلک وکیپیڈیا رسائی کی اجازت دیں
zh_cn: 允许公开Wiki访问

source: Allow Anonymous Discussion Posts
ar: السماح بمناقشة المناقشة المجهولة
ur: گمنام بحث کے مراسلے کی اجازت دیں
zh_cn: 允许匿名讨论帖子

source: Copyright
ar: حقوق النشر
ur: کاپی رائٹ
zh_cn: 版权

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
ar: استخدم برنامج أرشيف لاستخراج البيانات من ملف .tar.gz. تتضمن البيانات المستخرجة ملف course.xml ، بالإضافة إلى المجلدات الفرعية التي تحتوي على محتوى الدورة التدريبية.
ur: .tar.gz فائل سے اعداد و شمار کو نکالنے کے لئے آرکائیو پروگرام کا استعمال کریں. نکالنے والے اعداد و شمار کورس .xml فائل، ساتھ ساتھ ذیلی فولڈر شامل ہیں جن میں کورس کے مواد شامل ہیں.
zh_cn: 使用归档程序从.tar.gz文件中提取数据。提取的数据包括course.xml文件以及包含课程内容的子文件夹。
