Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: General decline by the processor. Possible action: retry with another form of payment.
ar: الانخفاض العام من قبل المعالج. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: پروسیسر کی طرف سے عام کمی. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 处理器普遍下降。可能的行动：以另一种形式的付款重试。

source: Welcome
ar: أهلا بك
ur: خوش آمدید
zh_cn: 欢迎

source: Total Discounted Seats
ar: إجمالي المقاعد المخصومة
ur: کل ڈسکاؤنٹ شدہ سیٹ
zh_cn: 总折扣座位

source: by most votes
ar: من قبل معظم الأصوات
ur: زیادہ تر ووٹ کے ذریعہ
zh_cn: 大多数选票

source: Source/Citation
ar: المصدر / استشهاد
ur: ماخذ / حوالہ
zh_cn: 来源/引文

source: Flagged
ar: ترفع علم
ur: نشان لگا دیا گیا
zh_cn: 标记

source: Your verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
ar: انتهت صلاحية التحقق الخاص بك. للحصول على شهادة تم التحقق منها ، يجب عليك إرسال صورة جديدة لنفسك ومعرّف الهوية الصادر عن جهة حكومية قبل الموعد النهائي للتحقق للدورة التدريبية.
ur: آپ کی توثیق ختم ہوگئی ہے. ایک تصدیق شدہ سرٹیفکیٹ حاصل کرنے کے لئے، آپ کو اپنے کورس کے لئے توثیق کی حد سے پہلے اپنے آپ کی نئی تصویر اور آپ کی حکومت سے جاری کردہ تصویر کی شناخت پیش کرنا ضروری ہے.
zh_cn: 您的验证已过期。要获得经过验证的证书，您必须在课程的验证截止日期前提交自己的新照片和政府颁发的带照片的身份证件。

source: The authorization has already been reversed.
ar: تم بالفعل إلغاء التفويض.
ur: اجازت نامہ پہلے ہی تبدیل کردی گئی ہے.
zh_cn: 授权已经被撤销。

source: Access is not restricted
ar: الوصول غير مقيد
ur: رسائی محدود نہیں ہے
zh_cn: 访问不受限制

source: Sincerely, Anant
ar: مع خالص التقدير ، أنانت
ur: مخلص، اننت
zh_cn: 真诚的，阿南特

source: No selected price or selected price is below minimum.
ar: لا يوجد سعر محدد أو سعر محدد أقل من الحد الأدنى.
ur: کوئی منتخب کردہ قیمت یا منتخب قیمت کم سے کم نہیں ہے.
zh_cn: 没有选定的价格或选定的价格低于最小值。

source: attachment revisions
ar: مراجعات المرفقات
ur: منسلک ترمیم
zh_cn: 附件修订

source: You have successfully verified your ID with edX
ar: لقد تحققت بنجاح من معرفك مع edX
ur: آپ نے EDX کے ساتھ آپ کی شناخت کامیابی سے تصدیق کی ہے
zh_cn: 您已经使用edX成功验证了您的ID

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
ar: تحدد التهيئة كيفية تجميع المستخدمين لتجربة المحتوى هذه. تنبيه: سيؤثر تغيير تكوين المجموعة للتجربة المرئية للطلاب على بيانات التجربة.
ur: ترتیب اس بات کی وضاحت کرتا ہے کہ صارفین کو اس مواد کے تجربے کے لئے کس طرح گروپ کیا جاتا ہے. احتیاط: کسی طالب علم کی نظر آنے والے تجربے کے گروپ کی ترتیب کو تبدیل کرنا تجربہ ڈیٹا پر اثر انداز ہوگا.
zh_cn: 该配置定义了用户对此内容实验的分组方式。小心：更改学生可见实验的组配置将影响实验数据。

source: You cannot verify your identity at this time.
ar: لا يمكنك التحقق من هويتك في هذا الوقت.
ur: آپ اس وقت اپنی شناخت کی توثیق نہیں کر سکتے ہیں.
zh_cn: 您目前无法验证您的身份。

source: The information you entered is incorrect.
ar: المعلومات التي أدخلتها غير صحيحة.
ur: آپ کی درج کردہ معلومات غلط ہے.
zh_cn: 您输入的信息不正确。

source: © 2012–{year} edX Inc.
ar: © 2012-2012 {year} edX Inc.
ur: © 2012- {سال} edX انکارپوریٹڈ

source: Download Your ID Verified {cert_name_short} (PDF)
ar: تنزيل هويتك تم التحقق منها {cert_name_short} (PDF)
ur: اپنے ID کی تصدیق شدہ {cert_name_short} (پی ڈی ایف) ڈاؤن لوڈ کریں
zh_cn: 下载您的ID验证{cert_name_short}（PDF）

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
ar: (3) في صفحة تأكيد التسجيل ، انقر فوق الزر &quot;تنشيط رمز التسجيل&quot;. سيظهر هذا تأكيد التسجيل.
ur: (3) داخلہ تصدیق کے صفحے پر، &#39;فعال اندراج کوڈ&#39; کے بٹن پر کلک کریں. یہ اندراج کی توثیق دکھایا جائے گا.
zh_cn: （3）在登记确认页面上，点击&#39;激活登记代码&#39;按钮。这将显示登记确认。

source: Do not show bumper again
ar: لا تظهر الوفير مرة أخرى
ur: دوبارہ بم نہ ڈالو
zh_cn: 不要再显示保险杠

source: This component is out of date. The library has new content.
ar: هذا المكون قديم. تحتوي المكتبة على محتوى جديد.
ur: یہ جزو تاریخ سے باہر ہے. لائبریری میں نئی ​​مواد ہے.
zh_cn: 此组件已过时。图书馆有新的内容。

source: You haven't earned any certificates yet.
ar: لم تكسب أي شهادات حتى الآن.
ur: آپ نے ابھی تک کسی بھی سرٹیفکیٹ نہیں لیا ہے.
zh_cn: 你还没有获得任何证书。

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
ar: تستخدم التجربة تكوين مجموعة محذوفة. حدد تكوين مجموعة صحيح أو احذف هذه التجربة.
ur: تجربے کو خارج کردہ گروپ کی تشکیل کا استعمال کرتا ہے. ایک درست گروہ ترتیب کو منتخب کریں یا اس تجربے کو حذف کریں.
zh_cn: 该实验使用已删除的组配置。选择一个有效的组配置或删除这个实验。

source: Title can't be empty
ar: لا يمكن أن يكون العنوان فارغًا
ur: عنوان خالی نہیں ہوسکتی ہے
zh_cn: 标题不能为空

source: Course Material
ar: مواد الدورة
ur: کورس مواد
zh_cn: 课程材料

source: unanswered
ar: لم يتم الرد عليها
ur: جواب نہیں
zh_cn: 悬而未决

source: I don't have the time
ar: ليس لدي الوقت
ur: میرے پاس وقت نہیں ہے
zh_cn: 我没有时间

source: This type of component cannot be shown while viewing the course as a specific student.
ar: لا يمكن عرض هذا النوع من المكونات أثناء مشاهدة الدورة التدريبية كطالب محدد.
ur: اس خاص قسم کے جزو کسی خاص طالب علم کے طور پر کورس کو دیکھنے کے دوران نہیں دکھایا جا سکتا.
zh_cn: 这种类型的组件在查看特定学生的课程时无法显示。

source: I agree to the {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}
ar: أوافق على {platform_name} {tos_link_start} {terms_of_service} {tos_link_end}
ur: میں {platform_name} {tos_link_start} {terms_of_service} {tos_link_end} سے اتفاق کرتا ہوں.
zh_cn: 我同意{platform_name} {tos_link_start} {terms_of_service} {tos_link_end}

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
ar: يتم سرد المكونات بالترتيب الذي تمت إضافته ، مع إضافة أحدثها في الأسفل. استخدم أسهم ترقيم الصفحات للتنقل من صفحة إلى أخرى إذا كان لديك أكثر من صفحة واحدة من المكونات في مكتبتك.
ur: اجزاء اس ترتیب میں درج کیے گئے ہیں جس میں وہ شامل کیے گئے ہیں، سب سے زیادہ حال ہی میں نیچے دیئے گئے شامل ہیں. اگر آپ کے پاس لائبریری میں اجزاء کے ایک سے زائد صفحات ہیں تو صفحے سے صفحے پر تشریف لے جانے کے لئے صفحہ بندی کے تیر استعمال کریں.
zh_cn: 组件以它们添加的顺序列出，最近添加的组件在最下面。如果您的库中有多个组件页面，请使用分页箭头在页面之间进行导航。

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
ar: يحتوي هذا الإرسال على محتوى صريح أو مسيء أو (أظن) مسروق.
ur: یہ جمع کرانے میں واضح، جارحانہ، یا (مجھے شک ہے) جادوگر مواد ہے.
zh_cn: 此提交内容明确，冒犯或（我怀疑）剽窃内容。

source: Skipping user "{}" because the specified and existing email addresses do not match.
ar: تخطي المستخدم &quot;{}&quot; لأن عناوين البريد الإلكتروني المحددة والحالية لا تتطابق.
ur: صارف کو توڑنے والا &quot;{}&quot; ہے کیونکہ مخصوص اور موجودہ ای میل پتے مماثل نہیں ہوتے ہیں.
zh_cn: 跳过用户“{}”，因为指定的和现有的电子邮件地址不匹配。

source: Enrollment Link
ar: رابط التسجيل
ur: اندراج لنک
zh_cn: 注册链接

source: The file %s was deleted.
ar: تم حذف الملف٪ s.
ur: فائل٪ حذف کردی گئی تھی.
zh_cn: 文件％s已被删除。

source: To access course materials, you must score {required_score}% or higher on this exam. Your current score is {current_score}%.
ar: للوصول إلى مواد الدورة التدريبية ، يجب عليك تسجيل {required_score}٪ أو أعلى في هذا الاختبار. الدرجة الحالية هي {current_score}٪.
ur: کورس کے مواد تک رسائی حاصل کرنے کے لئے، آپ کو اس امتحان پر {required_score}٪ یا اس سے زیادہ اسکور کرنا ہوگا. آپ کا موجودہ اسکور {current_score}٪ ہے.
zh_cn: 要访问课程资料，您必须在此考试中取得{required_score}％或更高的分数。您当前的得分是{current_score}％。

source: Work Visually, Organize Quickly
ar: العمل بصريا ، وتنظيم بسرعة
ur: آفاقی طور پر کام، فوری طور پر منظم کریں
zh_cn: 视觉上的工作，快速组织

source: This setting indicates whether this exam is a proctored exam.
ar: يشير هذا الإعداد إلى ما إذا كان هذا الاختبار عبارة عن اختبار متبع.
ur: یہ ترتیب یہ بتاتی ہے کہ آیا یہ امتحان ایک پروکارڈ امتحان ہے.
zh_cn: 此设置表明此考试是否为监考考试。

source: View About Page in studio
ar: عرض حول الصفحة في الاستوديو
ur: سٹوڈیو میں صفحہ کے بارے میں دیکھیں
zh_cn: 在工作室中查看关于页面

source: Remember me
ar: تذكرنى
ur: مجھے پہچانتے ہو
zh_cn: 记住我

source: Adding content to your library
ar: إضافة محتوى إلى مكتبتك
ur: آپ کی لائبریری میں مواد شامل کرنا
zh_cn: 将内容添加到您的库

source: Take a photo of your ID
ar: التقاط صورة من الهوية الخاصة بك
ur: اپنی شناخت کی تصویر لیں
zh_cn: 拍一张你的ID的照片

source: Public Username
ar: اسم مستخدم عام
ur: عوامی صارف نام
zh_cn: 公共用户名

source: Course Info
ar: معلومات الدورة
ur: کورس کی معلومات
zh_cn: 课程信息

source: Payment Error
ar: خطأ الدفع
ur: ادائیگی کی خرابی
zh_cn: 付款错误

source: Put your Honor Code here!
ar: ضع رمز الشرف الخاص بك هنا!
ur: اپنا اعزاز کوڈ یہاں رکھیں!
zh_cn: 把你的荣誉代码放在这里！

source: Drag to reorder
ar: اسحب لإعادة ترتيب
ur: دوبارہ ترتیب دینے کے لئے ڈریگ کریں
zh_cn: 拖动重新排序

source: Make a Suggestion
ar: قدم اقتراح
ur: ایک تجویز بنائیں
zh_cn: 提个建议

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
ar: يبدو أن {email_address} ينتمي إلى حساب حالي. حاول مرة أخرى باستخدام عنوان بريد إلكتروني مختلف.
ur: ایسا لگتا ہے کہ {email_address} ایک موجودہ اکاؤنٹ سے تعلق رکھتا ہے. مختلف ای میل ایڈریس کے ساتھ دوبارہ کوشش کریں.
zh_cn: 它看起来像{email_address}属于一个现有的帐户。请使用其他电子邮件地址再试一次。

source: Next Hint
ar: التالي تلميح
ur: اگلے اشارہ
zh_cn: 下一个提示

source: List all students with due date extensions
ar: اذكر قائمة بجميع الطلاب ذوي امتدادات التاريخ المستحقة
ur: تمام طلبا کے مطابق تاریخ کی توسیع کے ساتھ فہرست کریں
zh_cn: 列出所有到期日期延长的学生

source: Add Learning Outcome
ar: إضافة نتائج التعلم
ur: سیکھنے کے نتائج شامل کریں
zh_cn: 添加学习成果

source: For content experiments, you can drag components to other groups.
ar: بالنسبة لتجارب المحتوى ، يمكنك سحب المكونات إلى مجموعات أخرى.
ur: مواد کے استعمال کے لۓ، آپ اجزاء کو دیگر گروپوں میں گھسیٹ سکتے ہیں.
zh_cn: 对于内容实验，您可以将组件拖到其他组中。

source: Less
ar: أقل
ur: کم
zh_cn: 减

source: Sign Up for {studio_name}
ar: الاشتراك في {studio_name}
ur: {سٹوڈیو_ نام} کیلئے سائن اپ کریں
zh_cn: 注册{studio_name}

source: Your transaction has been cancelled. If you feel an error has occurred, contact {email}.
ar: تم إلغاء معاملتك. إذا شعرت بحدوث خطأ ، فاتصل بـ {email}.
ur: آپ کا ٹرانزیکشن منسوخ کردیا گیا ہے. اگر آپ کو ایک غلطی محسوس ہوئی ہے تو، {ای میل} سے رابطہ کریں.
zh_cn: 您的交易已被取消。如果您发现错误，请联系{电子邮件}。

source: You have been un-enrolled from course {course_name} by a member of the course staff. Please disregard the invitation previously sent.
ar: لقد تم إلغاء تسجيلك من الدورة التدريبية {course_name} بواسطة أحد أعضاء فريق الدورة التدريبية. يرجى تجاهل الدعوة التي أرسلت سابقا.
ur: آپ کو کورس کے عملے کے ایک رکن کی طرف سے کورس {کورس_ نام} سے غیر اندراج کیا گیا ہے. براہ کرم پہلے بھیجے جانے والے دعوت کو بے نقاب کریں.
zh_cn: 您已经被课程人员的课程{course_name}取消注册。请忽略以前发送的邀请。

source: Hide {studio_name} Help
ar: إخفاء {studio_name} المساعدة
ur: مدد کریں {studio_name} مدد
zh_cn: 隐藏{studio_name}帮助

source: You can not move an item into itself.
ar: لا يمكنك نقل عنصر داخل نفسه.
ur: آپ خود کو کسی چیز کو منتقل نہیں کرسکتے.
zh_cn: 您无法将项目移入其中。

source: Note: This feature is available only to courses with a small number of enrolled learners.
ar: ملاحظة: لا تتوفر هذه الميزة إلا للدورات التدريبية التي تتضمن عددًا قليلاً من المتعلمين المسجلين.
ur: نوٹ: یہ خصوصیت صرف ایک چھوٹی سی تعداد میں داخلا سیکھنے والوں کے ساتھ کورسز کے لئے دستیاب ہے.
zh_cn: 注意：此功能仅适用于少量登记学员的课程。

source: Download profile information as a CSV
ar: قم بتنزيل معلومات الملف الشخصي على هيئة ملف CSV
ur: پروفائل کی معلومات کو CSV کے طور پر ڈاؤن لوڈ کریں
zh_cn: 以CSV格式下载配置文件信息

source: There's just one more step: Before you enroll in a course, you need to activate your account. We've sent an email message to {email_start}{email}{email_end} with instructions for activating your account. If you don't receive this message, check your spam folder.
ar: هناك خطوة واحدة إضافية: قبل التسجيل في دورة تدريبية ، تحتاج إلى تنشيط حسابك. لقد أرسلنا رسالة بريد إلكتروني إلى {email_start} {email} {email_end} تتضمن تعليمات لتنشيط حسابك. إذا لم تستلم هذه الرسالة ، فتحقق من مجلد الرسائل غير المرغوب فيها.
ur: صرف ایک اور قدم ہے: آپ کو کورس میں اندراج کرنے سے پہلے، آپ کو اپنے اکاؤنٹ کو فعال کرنے کی ضرورت ہے. ہم نے اپنے اکاؤنٹ کو فعال کرنے کیلئے ہدایات کے ساتھ {email_start} {ای میل} {email_end} کو ایک ای میل پیغام بھیجا ہے. اگر آپ کو یہ پیغام نہیں ملتا ہے تو، اپنے سپیم فولڈر کو چیک کریں.
zh_cn: 还有一步：在注册课程之前，您需要激活您的帐户。我们已向{email_start} {email} {email_end}发送了一封电子邮件，其中包含激活您的帐户的说明。如果您未收到此消息，请检查您的垃圾邮件文件夹。

source: Response to %(thread_title)s
ar: ردا على٪ (thread_title) s
ur: ٪ (موضوع کا عنوان) کے جواب
zh_cn: 响应％（thread_title）s

source: Available Actions
ar: الإجراءات المتاحة
ur: دستیاب کام
zh_cn: 可用操作

source: What do advanced settings do?
ar: ماذا تفعل الإعدادات المتقدمة؟
ur: اعلی درجے کی ترتیبات کیا کرتے ہیں؟
zh_cn: 高级设置有什么作用？

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
ar: نافذة الوقت بعد التسجيل والتي يمكن خلالها منح المستخدمين رد أموال ، ممثلة بالميكروثانية. الافتراضي هو 14 يوما.
ur: اندراج کے بعد وقت کی ونڈو جس کے دوران صارف مائیکرو سیکنڈ میں نمائندگی کرتے ہیں، رقم کی واپسی کی جا سکتی ہے. ڈیفالٹ 14 دن ہے.
zh_cn: 登记后的时间窗口，在此期间用户可以获得退款，以微秒表示。默认值是14天。

source: Profile:
ar: الملف الشخصي:
ur: پروفائل:
zh_cn: 简介：

source: Adjust a learner's entrance exam results
ar: ضبط نتائج اختبار مدخل المتعلم
ur: سیکھنے کے داخلے کے امتحان کے نتائج کو ایڈجسٹ کریں
zh_cn: 调整学员的入学考试成绩

source: Company Contact Email
ar: الشركة الاتصال البريد الإلكتروني
ur: کمپنی سے رابطہ ای میل
zh_cn: 公司联系邮箱

source: Each bar shows the number of students that opened the subsection.
ar: يعرض كل شريط عدد الطلاب الذين فتحوا القسم الفرعي.
ur: ہر بار اس طالب علموں کی تعداد کو ظاہر کرتا ہے جو فرائض کھولتا ہے.
zh_cn: 每个栏显示打开小节的学生人数。

source: Requirements
ar: المتطلبات
ur: ضروریات
zh_cn: 要求

source: %(min_score)s is not a valid grade percentage
ar: ٪ (min_score) s ليس نسبة مئوية صالحة
ur: ٪ (min_score) ایک درست گریڈ فی صد نہیں ہے
zh_cn: ％（min_score）s不是有效的等级百分比

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكن للطلاب تنزيل الشهادات قبل انتهاء الدورة التدريبية ، إذا استوفوا متطلبات الشهادة.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، طالب علموں کو کورس ختم ہونے سے قبل سرٹیفکیٹ ڈاؤن لوڈ کرسکتے ہیں، اگر وہ سرٹیفکیٹ کی ضروریات کو پورا کر چکے ہیں.
zh_cn: 输入true或false。如果属实，如果学生符合证书要求，则可以在课程结束前下载证书。

source: Select a Group Configuration
ar: حدد تكوين المجموعة
ur: گروپ ترتیب منتخب کریں
zh_cn: 选择一个组配置

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
ar: يتم توقيع الشهادات الصادرة عن {platform_name} بواسطة مفتاح gpg بحيث يمكن التحقق منها بشكل مستقل من قِبل أي شخص لديه المفتاح العام {platform_name}. للتحقق المستقل ، يستخدم {platform_name} ما يُطلق عليه &quot;التوقيع المنفصل&quot; &quot;&quot;.
ur: {platform_name} کے ذریعہ جاری کردہ سرٹیفکیٹ ایک جی پی پی کی اہمیت سے دستخط کیے جاتے ہیں تاکہ وہ {platform_name} عوامی کلید کے ساتھ آزادانہ طور پر کسی بھی قسم کی توثیق کی جاسکیں. مستقل توثیق کے لئے، {platform_name} کا استعمال کرتا ہے جو ایک &quot;الگ شدہ دستخط&quot; کہا جاتا ہے.
zh_cn: 由{platform_name}发布的证书由gpg密钥签名，以便任何具有{platform_name}公钥的用户都可以独立验证它们。对于独立验证，{platform_name}使用所谓的“分离签名”“”。

source: Use the Sailthru content API to fetch course tags.
ar: استخدم Sailthru content API لجلب علامات الدورة التدريبية.
ur: کورس ٹیگز حاصل کرنے کے لئے Sailthru مواد API کا استعمال کریں.
zh_cn: 使用Sailthru content API来获取课程标签。

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
ar: تحتاج إلى <a href="%(login_url)s">تسجيل الدخول</a> أو <a href="%(signup_url)s">التسجيل</a> لاستخدام هذه الوظيفة.
ur: آپ کو اس فنکشن کا استعمال کرنے کے لئے <a href="%(login_url)s">لاگ ان</a> یا <a href="%(signup_url)s">سائن اپ</a> کرنے کی ضرورت ہے.
zh_cn: 您需要<a href="%(login_url)s">登录</a>或<a href="%(signup_url)s">注册</a>以使用此功能。

source: Activation Invalid
ar: التنشيط غير صالح
ur: چالو کرنے کی غلط
zh_cn: 激活无效

source: Available
ar: متاح
ur: دستیاب
zh_cn: 可得到

source: Course About Page Image
ar: دورة حول صورة الصفحة
ur: صفحۂ تصویر کے بارے میں کورس
zh_cn: 关于页面图像的课程

source: Release-On Date Publishing
ar: تاريخ النشر على النشر
ur: ریلیز پر تاریخ اشاعت
zh_cn: 发行日期发布

source: Deleted
ar: تم الحذف
ur: حذف کر دیا گیا
zh_cn: 删除

source: Number of seconds to delay the sending of User Welcome email after user has been created
ar: عدد الثواني التي تؤجل إرسال البريد الإلكتروني الترحيبي للمستخدم بعد إنشاء المستخدم
ur: صارف تخلیق ہونے کے بعد صارف خوش آمدید ای میل بھیجنے میں تاخیر کرنے کے سیکنڈ کی تعداد
zh_cn: 用户创建后延迟发送用户欢迎电子邮件的秒数

source: Articles for object
ar: مقالات عن وجوه
ur: اعتراض کے لئے مضامین
zh_cn: 对象文章

source: Minimum Grade for Credit
ar: الحد الأدنى للصف الائتماني
ur: کریڈٹ کے لئے کم از کم گریڈ
zh_cn: 信用最低等级

source: Password Reset
ar: إعادة ضبط كلمة المرور
ur: پاس ورڈ ری سیٹ
zh_cn: 重设密码

source: Unable to send email activation link. Please try again later.
ar: غير قادر على إرسال رابط تنشيط البريد الإلكتروني. الرجاء معاودة المحاولة في وقت لاحق.
ur: ای میل کی سرگرمی کا لنک بھیجنے سے قاصر. براہ کرم کچھ دیر بعد کوشش کریں.
zh_cn: 无法发送电子邮件激活链接。请稍后再试。

source: Course Summary Page
ar: صفحة ملخص الدورة
ur: کورس خلاصہ پیج
zh_cn: 课程摘要页面

source: Mode for Annotation Tool
ar: الوضع لأداة التعليق التوضيحي
ur: تشریح کے آلے کے لئے موڈ
zh_cn: 注释工具模式

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
ar: تأكد من أن الملف الذي تحمّله بتنسيق CSV بدون أحرف أو صفوف غريبة.
ur: اس بات کو یقینی بنائیں کہ آپ کی اپ لوڈ کردہ فائل CSV فارمیٹ میں بیرونی حروف یا قطار کے ساتھ ہے.
zh_cn: 确保您上传的文件为CSV格式，不含无关字符或行。

source: Error: The request was received but there was a server timeout. This error does not include timeouts between the client and the server. Possible fix: retry the payment after some time.
ar: خطأ: تم تلقي الطلب ولكن كان هناك مهلة للخادم. لا يتضمن هذا الخطأ المهلات بين العميل والخادم. إصلاح محتمل: أعد محاولة الدفع بعد مرور بعض الوقت.
ur: خرابی: درخواست موصول ہوئی تھی لیکن سرور ٹائم آؤٹ تھا. یہ غلطی کلائنٹ اور سرور کے درمیان ٹائم آؤٹ نہیں ہے. ممکنہ طے: کچھ وقت بعد ادائیگی دوبارہ کریں.
zh_cn: 错误：收到请求但服务器超时。此错误不包括客户端和服务器之间的超时。可能的解决方法：在一段时间后重试付款。

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
ar: {em_start} تنبيه: {em_end} عند تصدير دورة تدريبية ، يتم تضمين معلومات مثل مفاتيح واجهة برمجة التطبيقات MATLAB وجوازات مرور LTI وسلاسل الرمز السري للتعليق التوضيحي وعناوين URL للتعليقات التوضيحية في البيانات التي تم تصديرها. إذا كنت تشارك ملفاتك المصدرة ، فقد تكون أيضًا مشتركة في المعلومات الحساسة أو الخاصة بالترخيص.
ur: {em_start} احتیاط: {em_end} جب آپ کسی کورس کو برآمد کرتے ہیں تو، MATLAB API کی چابیاں، LTI پاسپورٹس، تشریح خفیہ ٹوکن کی ترتیبات، اور تشریح سٹوریج یو آر ایل برآمد شدہ اعداد و شمار میں شامل ہیں. اگر آپ اپنی برآمد کردہ فائلوں کا اشتراک کرتے ہیں تو آپ حساس یا لائسنس کی مخصوص معلومات بھی شریک کرسکتے ہیں.
zh_cn: {em_start}警告：{em_end}导出课程时，导出的数据中会包含诸如MATLAB API密钥，LTI护照，注释秘密令牌字符串和注释存储URL之类的信息。如果您共享导出的文件，那么您也可能共享敏感或特定于许可证的信息。

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
ar: لقد سجلنا الخطأ ويعمل فريقنا حاليًا على حل هذا الخطأ في أقرب وقت ممكن.
ur: ہم نے غلطی کا اظہار کیا ہے اور اس وقت ہمارے عملے اس غلطی کو جلد از جلد حل کرنے کے لئے کام کر رہے ہیں.
zh_cn: 我们已记录错误，我们的员工正在努力尽快解决此错误。

source: Could Not Link Accounts
ar: لا يمكن ربط الحسابات
ur: اکاؤنٹس کو لنک نہیں مل سکا
zh_cn: 无法链接帐户

source: Outline
ar: الخطوط العريضة
ur: آؤٹ لائن
zh_cn: 大纲

source: Your file could not be saved: %s
ar: تعذر حفظ الملف الخاص بك:٪ s
ur: آپ کی فائل کو محفوظ نہیں کیا جاسکتا:٪ s
zh_cn: 您的文件无法保存：％s

source: Uploading
ar: تحميل
ur: اپ لوڈ کرنا
zh_cn: 上传

source: Trying to add a different currency into the cart
ar: تحاول إضافة عملة مختلفة إلى العربة
ur: ٹوکری میں مختلف کرنسی کو شامل کرنے کی کوشش کر رہا ہے
zh_cn: 试图将不同的货币添加到购物车中

source: Price: {currency_symbol}{course_price} Quantity: {quantity} Sub-Total: {currency_symbol}{sub_total} Discount: {currency_symbol}{discount}
ar: السعر: {currency_symbol} {course_price} الكمية: {quantity} المجموع الفرعي: {currency_symbol} {sub_total} الخصم: {currency_symbol} {discount}
ur: قیمت: {currency_symbol} {course_price} مقدار: {مقدار} ذیلی کل: {currency_symbol} {sub_total} ڈسکاؤنٹ: {currency_symbol} {رعایت}
zh_cn: 价格：{currency_symbol} {course_price}数量：{数量}小计：{currency_symbol} {sub_total}折扣：{currency_symbol} {折扣}

source: The ISO 639-1 language code for this language.
ar: رمز لغة ISO 639-1 لهذه اللغة.
ur: اس زبان کے لئے ISO 639-1 زبان کوڈ.
zh_cn: 此语言的ISO 639-1语言代码。

source: Error: The request was received, but there was a timeout at the payment processor. Possible fix: retry the payment.
ar: خطأ: تم تلقي الطلب ، ولكن كان هناك مهلة في معالج الدفع. إصلاح محتمل: أعد محاولة الدفع.
ur: خرابی: درخواست موصول ہوئی تھی، لیکن ادائیگی کے پروسیسر میں ایک ٹائم آؤٹ تھا. ممکنہ طے: ادائیگی دوبارہ کریں.
zh_cn: 错误：请求已收到，但付款处理器发生超时。可能的解决方法：重试付款。

source: Verified: Pending Verification
ar: التحقق: التحقق المعلق
ur: تصدیق شدہ: موصول ہونے والی توثیق
zh_cn: 已验证：待验证

source: SET CERTIFICATE EXCEPTIONS
ur: سیٹ اپ کی تصدیق کے اخراجات
zh_cn: 设置证书例外

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
ar: تم تصميم {studio_name} ليكون سهل الاستخدام من قِبل أي شخص على دراية ببيئات التأليف المشتركة على الويب (Wordpress و Moodle وما إلى ذلك). لا يلزم معرفة البرمجة ، ولكن بالنسبة إلى بعض الميزات الأكثر تقدمًا ، ستكون الخلفية التقنية مفيدة. كما هو الحال دائمًا ، نحن هنا للمساعدة ، لذلك لا تتردد في الغوص في.
ur: {سٹوڈیو_ نام} عام ویب پر مبنی تصویری ماحول (ورڈپریس، موڈل، وغیرہ) کے ساتھ واقف ہونے والے تقریبا کسی بھی شخص کو استعمال کرنے کے لئے ڈیزائن کیا گیا ہے. کوئی پروگرامنگ کی ضرورت نہیں ہے، لیکن کچھ اعلی درجے کی خصوصیات کے لئے، ایک تکنیکی پس منظر مددگار ثابت ہوگا. ہمیشہ کی طرح، ہم یہاں مدد کرنے کے لئے ہیں، لہذا حق میں ڈوب کرنے میں ہچکچاتے نہیں ہیں.
zh_cn: {studio_name}被设计成几乎任何熟悉常见的基于网络的创作环境（Wordpress，Moodle等）的人都可以轻松使用。不需要编程知识，但对于某些更高级的功能，技术背景将会有所帮助。和往常一样，我们在这里提供帮助，所以不要犹豫，马上进入。

source: I just enrolled in {number} {title} through {platform} {url}
ar: لقد التحقت للتو بـ {number} {title} من خلال {platform} {url}
ur: میں نے صرف {نمبر} {عنوان} کے ذریعہ {پلیٹ فارم} {url} میں داخلا کیا
zh_cn: 我刚刚通过{platform} {url}注册了{number} {title}

source: End Letter:
ar: نهاية الخطاب:
ur: اختتام خط:
zh_cn: 结束信：

source: Feedback from user
ar: ردود الفعل من المستخدم
ur: صارف سے تاثرات
zh_cn: 来自用户的反馈

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ar: مع دورات ذاتية الإيقاع ، تتعلم على جدولك الخاص. نحن نشجعك على قضاء بعض الوقت مع الدورة التدريبية كل أسبوع. اهتمامك المركّز سيؤتي ثماره في النهاية!
ur: خود پیڈ کورس کے ساتھ، آپ اپنے اپنے شیڈول پر سیکھتے ہیں. ہم آپ کو ہر ہفتے کورس کے ساتھ وقت خرچ کرنے کی حوصلہ افزائی کرتے ہیں. آپ کے توجہ مرکوز کی توجہ آخر میں ادا کرے گی!
zh_cn: 通过自学课程，您可以按自己的时间表学习。我们鼓励你每周花时间学习课程。最终你的注意力将得到回报！

source: Order Number: {order_number}
ar: رقم الطلب: {order_number}
ur: آرڈر نمبر: {آرڈر_نمبر}
zh_cn: 订单号：{order_number}

source: Last Name
ar: الكنية
ur: آخری نام
zh_cn: 姓

source: Tuesday
ar: الثلاثاء
ur: منگل
zh_cn: 星期二
