Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Invalid encoding type, transcripts should be UTF-8 encoded.
ar: نوع الترميز غير صالح ، يجب أن تكون النصوص بتنسيق UTF-8.
ur: غلط انکوڈنگ کی قسم، ٹرانسمیشن کو UTF-8 انکوڈ ہونا چاہئے.
zh_cn: 无效的编码类型，转录本应该是UTF-8编码的。

source: Article deleted: %s
ar: المادة المحذوفة:٪ s
ur: آرٹیکل حذف کر دیا گیا:٪ s
zh_cn: 文章删除：％s

source: The enrollment code has been restored.
ar: تمت استعادة رمز التسجيل.
ur: داخلہ کوڈ بحال کر دیا گیا ہے.
zh_cn: 注册码已恢复。

source: Deleted user {username}
ar: المستخدم المحذوف {اسم المستخدم}
ur: حذف کردہ صارف {صارف کا نام}
zh_cn: 已删除的用户{用户名}

source: Last day your course is active
ar: اليوم الأخير دورتك نشط
ur: آخری دن آپ کا کورس فعال ہے
zh_cn: 最后一天你的课程是活跃的

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
ar: أدخل صح أو خطأ. إذا كانت هذه القيمة صحيحة ، فيمكنك إخفاء قسم فرعي حتى يحصل المتدربون على الحد الأدنى من الدرجات في قسم فرعي آخر.
ur: صحیح یا غلط درج کریں. اگر یہ قیمت سچ ہے، تو آپ سبسکرائب کو چھپا سکتے ہیں جب تک سیکھنے والے کسی اور، لازمی ضمنی حصے میں کم از کم سکور حاصل نہیں کرتے ہیں.
zh_cn: 输入true或false。如果这个值是真的，你可以隐藏一个小节，直到学习者在另一个先决条件小节中获得最低分数为止。

source: Set preview mode
ar: ضبط وضع المعاينة
ur: پیش نظارہ موڈ مقرر کریں
zh_cn: 设置预览模式

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
ar: لا ترى لغتك المفضلة؟ {link_start} تطوع لتصبح مترجماً! {link_end}
ur: آپ کی ترجیحی زبان کو نہیں دیکھا؟ {link_start} رضاکارانہ مترجم بننے کے لئے {link_end}
zh_cn: 没有看到您的首选语言？ {link_start}志愿成为翻译员！{link_end}

source: Invalid email {email_address}.
ar: البريد الإلكتروني غير صالح {email_address}.
ur: غلط ای میل {ای میل_ریس}
zh_cn: 无效的电子邮件地址{email_address}。

source: Note: only instructors may annotate.
ar: ملاحظة: المدرسون فقط يمكنهم التعليق.
ur: نوٹ: صرف اساتذہ کو تشریح کر سکتا ہے.
zh_cn: 注意：只有教师可以注释。

source: Select another problem type.
ar: حدد نوع مشكلة آخر.
ur: ایک اور مسئلہ کی قسم منتخب کریں.
zh_cn: 选择另一个问题类型。

source: Current course creator state
ar: دولة مبدع الدورة الحالية
ur: موجودہ کورس تخلیقی ریاست
zh_cn: 当前课程创建者状态

source: Student Support: Manage User
ar: دعم الطلاب: إدارة المستخدم
ur: طالب علم کی سپورٹ: صارف کا نظم کریں
zh_cn: 学生支持：管理用户

source: The organization that purchased enrollments in the course
ar: المنظمة التي اشترت التسجيلات في الدورة التدريبية
ur: جس تنظیم نے کورس میں داخلہ لیا تھا
zh_cn: 在课程中购买注册的组织

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
ar: كل سطر هو قائمة مفصولة بفواصل. العنصر الأول في كل سطر هو سبيكة التصنيف التي قمت بإنشائها والتي تحتوي على مكون إصدار &#39;openx__course&#39;. العناصر المتبقية في كل سطر هي مفاتيح الدورة التدريبية التي يحتاج المتعلم إكمالها ليتم منحها الشارة. على سبيل المثال: slug_for_compsci_courses_group_badge، course-v1: CompSci + Course + First، course-v1: CompsSci + Course + Second
ur: ہر لائن ایک کوما الگ الگ فہرست ہے. ہر سطر میں پہلی شے ایک بیز کلاس کی سلیگ ہے جس نے آپ نے تخلیق کیا ہے کہ &#39;openx__course&#39; کا جاری حصہ ہے. ہر لائن میں باقی اشیاء بیج سے نوازنے کے لئے سیکھنے والے کو مکمل کرنے کے لئے کورس کی چابیاں ہیں. مثال کے طور پر: slug_for_compsci_courses_group_badge، کورس v1: CompSci + کورس + سب سے پہلے، کورس V1: CompsSci + کورس + سیکنڈ
zh_cn: 每一行都是逗号分隔的列表。每行中的第一项是您创建的徽章类别的子弹，其具有“openedx_course”发行组件。每一行中的剩余项目是学习者需要完成授予徽章的课程密钥。例如：slug_for_compsci_courses_group_badge，course-v1：CompSci + Course + First，course-v1：CompsSci + Course + Second

source: Number of Verified Students Contributing More than the Minimum
ar: عدد الطلاب الذين تم التحقق منهم المساهمة أكثر من الحد الأدنى
ur: کم از کم سے زیادہ شراکت کرنے والے مستحکم طلباء کی تعداد
zh_cn: 已通过验证的学生数量超过最低标准

source: Grading policy definition for this class
ar: تعريف سياسة التقدير لهذه الفئة
ur: اس کلاس کے لئے گریڈنگ پالیسی کی تعریف
zh_cn: 为这个班级定级政策定义

source: No status information available
ar: لا معلومات الحالة المتاحة
ur: کوئی حیثیت کی معلومات دستیاب نہیں ہے
zh_cn: 没有可用的状态信息

source: Set goal to: {goal_text}
ar: تعيين الهدف على: {goal_text}
ur: اس مقصد کو مقرر کریں: {goal_text}
zh_cn: 设定目标为：{goal_text}

source: You should Register before trying to access the Unit
ar: يجب عليك التسجيل قبل محاولة الوصول إلى الوحدة
ur: یونٹ تک رسائی حاصل کرنے سے قبل آپ کو رجسٹر کرنا چاہئے
zh_cn: 在尝试访问单元之前，您应该注册

source: Choose n at random
ar: اختر ن عشوائيا
ur: بے ترتیب پر ن کا انتخاب کریں
zh_cn: 随机选择n

source: Transcripts
ar: النصوص
ur: ٹرانسمیشن
zh_cn: 成绩单

source: This course does not use a mode that offers certificates.
ar: لا تستخدم هذه الدورة التدريبية وضعًا يقدم شهادات.
ur: یہ کورس ایسے طریقوں کا استعمال نہیں کرتا جو سرٹیفکیٹ پیش کرتا ہے.
zh_cn: 本课程不使用提供证书的模式。

source: Current Course:
ar: المسار الحالي:
ur: موجودہ کورس:
zh_cn: 当前课程：

source: Course Learning Information
ar: معلومات الدورة التعليمية
ur: کورس سیکھنے کی معلومات
zh_cn: 课程学习信息

source: Library Code
ar: رمز المكتبه
ur: لائبریری کوڈ
zh_cn: 图书馆代码

source: Course Tools
ar: أدوات الدورة التدريبية
ur: کورس کے اوزار
zh_cn: 课程工具

source: Course is full
ar: الدورة ممتلئة
ur: کورس مکمل ہے
zh_cn: 课程已满

source: You can not move {source_usage_key} at an invalid index ({target_index}).
ar: لا يمكنك نقل {source_usage_key} في فهرس غير صالح ({target_index}).
ur: آپ {source_usage_key} کو ایک غیر معمولی انڈیکس ({target_index}) پر منتقل نہیں کرسکتے ہیں.
zh_cn: 您无法将{source_usage_key}移动到无效索引处（{target_index}）。

source: datetime
ar: التاريخ والوقت
ur: تاریخ وقت
zh_cn: 约会时间

source: Card Type
ar: نوع البطاقة
ur: کارڈ کی قسم
zh_cn: 卡的种类

source: Sailthru connection retry interval (secs).
ar: Sailthru retry retry interval (secs).
ur: سیلیلورس کنکشن دوبارہ وقفہ (سیکنڈ).
zh_cn: Sailthru连接重试间隔（秒）。

source: Generated
ar: ولدت
ur: پیدا
zh_cn: 产生

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
ar: عذرًا ، هذه الوحدة غير متوفرة مؤقتًا. يعمل موظفونا لإصلاحه في أقرب وقت ممكن. يرجى مراسلتنا عبر البريد الإلكتروني على {tech_support_email} للإبلاغ عن أي مشكلات أو تعطل.
ur: ہمیں افسوس ہے، یہ ماڈیول عارضی طور پر دستیاب نہیں ہے. ہمارا عملہ جتنی جلدی ممکن ہو اسے ٹھیک کرنے کے لئے کام کررہا ہے. کسی بھی دشواری یا ٹائم ٹائم کی اطلاع دینے کیلئے براہ کرم ہمیں {tech_support_email} پر ای میل کریں.
zh_cn: 很抱歉，此模块暂时无法使用。我们的员工正在努力尽快解决它。请发送电子邮件至{tech_support_email}，报告任何问题或停机时间。

source: Example
ar: مثال
ur: مثال
zh_cn: 例

source: source
ar: مصدر
ur: ذریعہ
zh_cn: 资源

source: Generate ORA Data Report
ar: إنشاء تقرير بيانات ORA
ur: ORA ڈیٹا رپورٹ بنائیں
zh_cn: 生成ORA数据报告

source: Goals
ar: الأهداف
ur: مقاصد
zh_cn: 目标

source: Trademarks
ar: العلامات التجارية
ur: ٹریڈ مارک
zh_cn: 商标

source: Certificate is being created.
ar: يتم إنشاء الشهادة.
ur: سرٹیفکیٹ تیار کیا جا رہا ہے.
zh_cn: 证书正在创建。

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
ar: انقر لإنشاء ملف CSV لجميع الطلاب المسجلين في هذه الدورة التدريبية ، إلى جانب معلومات الملف الشخصي مثل عنوان البريد الإلكتروني واسم المستخدم:
ur: اس کورس میں درج تمام طالب علموں کی ایک CSV فائل پیدا کرنے کے لئے کلک کریں، پروفائل کی معلومات جیسے ای میل ایڈریس اور صارف نام:
zh_cn: 点击以生成本课程中注册的所有学生的CSV文件以及个人资料信息，例如电子邮件地址和用户名：

source: Number of Enrollment Codes
ar: عدد رموز التسجيل
ur: اندراج کوڈوں کی تعداد
zh_cn: 注册码数量

source: Both
ar: على حد سواء
ur: دونوں
zh_cn: 都

source: Course Banner Image
ar: بالطبع صورة بانر
ur: کورس بینر کی تصویر
zh_cn: 课程横幅图像

source: Send me a copy of the invoice
ar: ارسل لي نسخة من الفاتورة
ur: مجھے انوائس کی ایک کاپی بھیج دو
zh_cn: 给我发送一份发票

source: Hide Page From Learners
ar: إخفاء الصفحة من المتعلمين
ur: سیکھیں
zh_cn: 从学习者隐藏页面

source: Time spent on all course work
ar: الوقت المستغرق في جميع الدورات الدراسية
ur: تمام کورس کے کام پر وقت گزرا
zh_cn: 花在所有课程上的时间

source: instructors
ar: المدربين
ur: اساتذہ
zh_cn: 教官

source: Uploaded by
ar: تم الرفع بواسطة
ur: کی طرف سے اپ لوڈ
zh_cn: 已上传

source: Create Enrollment Report
ar: إنشاء تقرير التسجيل
ur: اندراج کی رپورٹ بنائیں
zh_cn: 创建注册报告

source: This content is graded
ar: هذا المحتوى متدرج
ur: یہ مواد درجہ بندی کی جاتی ہے
zh_cn: 此内容已分级

source: Go A Week Or A Semester At A Time
ar: الذهاب في الأسبوع أو فصل دراسي في كل مرة
ur: ایک ہفتہ میں ایک ہفتہ یا سمسٹر جانا
zh_cn: 每周去一个学期或一个学期

source: Your Course Creator Request Status
ar: حالة طلب منشئي الدورة التدريبية الخاصة بك
ur: آپ کا کورس خالق درخواست کی حیثیت
zh_cn: 您的课程创建者请求状态

source: Reenable Account
ur: قابل اعتماد اکاؤنٹ
zh_cn: 重新启用帐户

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
ar: أنت على وشك الإبلاغ عن إرسال. يجب عليك فقط الإبلاغ عن إرسال يحتوي على محتوى فاضح أو مسيء أو مشتبه به. إذا لم يتم إرسال الطلب إلى السؤال أو كان غير صحيح ، فيجب أن تعطيه درجة الصفر وتعليقاتك المصاحبة بدلاً من الإبلاغ عنه.
ur: آپ جمع کرانے کے بارے میں ہیں. آپ کو صرف ایک جمع کرانے پر پرچم ہونا چاہئے جس میں واضح، جارحانہ، یا (شکست) جادوگر مواد شامل ہے. اگر جمع کرانے کے سوال کو یا غلط نہیں ہے، تو آپ اسے صفر کے سکور اور پرچم دینے کے بجائے رائے دینا چاہئے.
zh_cn: 您即将举行提交。您只应该提交包含明确，冒犯或（可疑）剽窃内容的提交内容。如果提交的内容不是针对问题的，或者是不正确的，您应该给它一个零分和随附的反馈，而不是标记它。

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
ar: قم بصياغة المخطط التفصيلي وبناء المحتوى في أي مكان. أدوات السحب والإسقاط بسيطة تتيح لك إعادة تنظيم بسرعة.
ur: اپنے آؤٹ لائن کو مسودہ بنائیں اور کہیں بھی مواد تیار کریں. سادہ ڈریگ اور ڈراپ ٹولز آپ کو فوری طور پر دوبارہ منظم کرنے دیں.
zh_cn: 起草您的大纲并随时随地构建内容。简单的拖放工具可让您快速重新组织。

source: The display name for this component.
ar: اسم العرض لهذا المكون.
ur: اس جزو کے لئے ڈسپلے کا نام.
zh_cn: 此组件的显示名称。

source: Save Language Settings
ar: حفظ إعدادات اللغة
ur: زبان کی ترتیبات محفوظ کریں
zh_cn: 保存语言设置

source: You can add additional custom pages to your course.
ar: يمكنك إضافة صفحات مخصصة إضافية للدورة التدريبية الخاصة بك.
ur: آپ اپنے کورس میں اضافی اپنی مرضی کے صفحات شامل کر سکتے ہیں.
zh_cn: 您可以将其他自定义页面添加到课程中。

source: Please Enter the Integer Value for Coupon Discount
ar: يرجى إدخال القيمة الصحيحة لخصم القسيمة
ur: کوپن ڈسکاؤنٹ کے لئے انوگر ویلیو درج کریں
zh_cn: 请输入优惠券折扣的整数值

source: Date format four digit year dash two digit month dash two digit day
ar: تنسيق التاريخ أربعة أرقام سنة داش رقمين الشهر داش يومين رقم
ur: تاریخ کی شکل چار عددی سال ڈیش دو ہندسوں مہینے دو دن کے دن ڈیش
zh_cn: 日期格式四位数年份短划线两位数月份短划线两位数日期

source: You are not sure enough!
ar: أنت غير متأكد بما فيه الكفاية!
ur: آپ کافی یقین نہیں ہیں!
zh_cn: 你不太清楚！

source: Platform Version
ar: إصدار النظام الأساسي
ur: پلیٹ فارم ورژن
zh_cn: 平台版本

source: GIT URL
ar: عنوان GIT
ur: GIT یو آر ایل
zh_cn: GIT网址

source: Your university identity server did not return your ID information to us. Please try logging in again. (You may need to restart your browser.)
ar: لم يُرجع خادم الهوية الخاص بالجامعة معلومات هويتك إلينا. من فضلك حاول تسجيل الدخول مرة أخرى. (قد تحتاج إلى إعادة تشغيل المتصفح.)
ur: آپ کے یونیورسٹی کی شناخت سرور نے آپ کی شناختی معلومات ہمیں ہمارے پاس واپس نہیں دی. براہ کرم دوبارہ لاگ ان کرنے کی کوشش کریں. (آپ کو اپنے براؤزر کو دوبارہ شروع کرنے کی ضرورت ہوسکتی ہے.)
zh_cn: 您的大学身份服务器没有将您的身份信息返回给我们。请尝试再次登录。 （您可能需要重新启动浏览器。）

source: Valid e-mail address required.
ar: مطلوب عنوان بريد إلكتروني صالح.
ur: درست ای میل پتہ کی ضرورت ہے.
zh_cn: 需要有效的电子邮件地址。

source: These Dates Are Not Used When Promoting Your Course
ar: لا يتم استخدام هذه التواريخ عند ترقية الدورة التدريبية الخاصة بك
ur: آپ کے کورس کو فروغ دینے کے وقت یہ تاریخ استعمال نہیں ہوتے ہیں
zh_cn: 在推广课程时不会使用这些日期

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
ar: لم تسجل الدخول. لمشاهدة محتوى دورة تدريبية إضافي ، {sign_in_link} أو {register_link} ، والتسجيل في هذه الدورة التدريبية.
ur: آپ سائن ان نہیں ہیں. اضافی کورس کے مواد، {sign_in_link} یا {register_link} کو دیکھنے کے لئے، اور اس کورس میں اندراج کریں.
zh_cn: 您尚未登录。要查看其他课程内容{sign_in_link}或{register_link}，并注册本课程。

source: Score (for override only)
ar: النتيجة (للتجاوز فقط)
ur: اسکور (صرف اوورائڈ کے لئے)
zh_cn: 分数（仅限覆盖）

source: Enroll in StudioX: Creating a Course with edX Studio
ar: التسجيل في StudioX: إنشاء دورة تدريبية مع edX Studio
ur: StudioX میں داخلہ: EDX سٹوڈیو کے ساتھ ایک کورس بنانا
zh_cn: 注册StudioX：使用edX Studio创建课程

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
ar: عيّن هذه القيمة إلى True إذا كنت تريد أن تكون هذه الصورة هي الصورة الافتراضية لأي أوضاع الدورة التدريبية التي لا تحتوي على صورة شارة محددة. يمكنك الحصول على صورة افتراضية واحدة فقط.
ur: اس قدر کو سچ پر مقرر کریں اگر آپ چاہتے ہیں کہ یہ تصویر کسی بھی کورس کے طریقوں کے لئے ڈیفالٹ تصویر بنائے جس میں کوئی مخصوص بج تصویر نہیں ہے. آپ کو صرف ایک ڈیفالٹ تصویر ہوسکتا ہے.
zh_cn: 如果您希望此图像成为没有指定徽章图像的任何课程模式的默认图像，请将此值设置为True。您只能有一个默认图像。

source: Upload New File
ar: تحميل ملف جديد
ur: نئی فائل اپ لوڈ کریں
zh_cn: 上传新文件

source: Share Alike
ar: شارك بالمثل
ur: علی علیہ السلام کا اشتراک کریں
zh_cn: 分享相同

source: Instructions
ar: تعليمات
ur: ہدایات
zh_cn: 说明

source: Explore Courses
ar: اكتشف الدورات
ur: کورسز کا مطالعہ کریں
zh_cn: 探索课程

source: Certificate exception (user={user}) does not exist in certificate white list. Please refresh the page and try again.
ar: استثناء الشهادة (user = {user}) غير موجود في القائمة البيضاء للتوثيق. يرجى تحديث الصفحة وحاول مرة أخرى.
ur: سرٹیفیکیٹ استثنا (صارف = {صارف}) سرٹیفکیٹ سفید فہرست میں موجود نہیں ہے. صفحہ کو تازہ کریں اور دوبارہ کوشش کریں.
zh_cn: 证书白名单中不存在证书例外（用户= {用户}）。请刷新页面并重试。

source: The external URL to download the video.
ar: عنوان URL الخارجي لتنزيل الفيديو.
ur: ویڈیو ڈاؤن لوڈ کرنے کے لئے بیرونی یو آر ایل.
zh_cn: 下载视频的外部URL。

source: Total Enrolled
ar: الإجمالي المسجل
ur: کل اندراج
zh_cn: 总计已注册

source: {studio_name} helps manage your online courses, so you can focus on teaching them
ar: يساعدك {studio_name} في إدارة دوراتك عبر الإنترنت ، حتى يمكنك التركيز على تدريسها
ur: {سٹوڈیو_ نام} آپ کے آن لائن کورسز کو منظم کرنے میں مدد ملتی ہے، لہذا آپ ان کو تعلیم دینے پر توجہ دے سکتے ہیں
zh_cn: {studio_name}有助于管理您的在线课程，因此您可以专注于教授它们

source: Self Paced
ar: النفس يسير
ur: خود کی جگہ
zh_cn: 自我步伐

source: Internal Server Error
ar: خطأ في الخادم الداخلي
ur: اندرونی سرور کی خرابی
zh_cn: 内部服务器错误

source: Course price per seat:
ar: سعر الدورة للمقعد الواحد:
ur: کورس کی قیمت فی سیٹ:
zh_cn: 每座的课程价格：

source: This page cannot be reordered
ar: لا يمكن إعادة ترتيب هذه الصفحة
ur: یہ صفحہ دوبارہ ترتیب نہیں دیا جا سکتا
zh_cn: 此页面不能重新排序

source: User does not exist.
ar: المستخدم غير موجود.
ur: صارف موجود نہیں.
zh_cn: 用户不存在。

source: If you have concerns about sharing your data, please contact your administrator at {enterprise_customer_name}.
ar: إذا كانت لديك مخاوف بشأن مشاركة بياناتك ، فالرجاء الاتصال بالمشرف على {enterprise_customer_name}.
ur: اگر آپ کے ڈیٹا کا اشتراک کرنے کے بارے میں خدشات ہیں تو، براہ مہربانی {enterprise_customer_name} پر اپنے منتظم سے رابطہ کریں.
zh_cn: 如果您担心分享数据，请联系您的管理员{enterprise_customer_name}。

source: Course Team
ar: فريق الدورة
ur: کورس ٹیم
zh_cn: 课程团队

source: Add an explanation for this question
ar: أضف شرحًا لهذا السؤال
ur: اس سوال کے بارے میں وضاحت شامل کریں
zh_cn: 为此问题添加解释

source: The request is missing one or more required fields.
ar: يفتقد الطلب حقلًا واحدًا أو أكثر من الحقول المطلوبة.
ur: درخواست ایک یا زیادہ مطلوبہ شعبوں کو غائب کر رہی ہے.
zh_cn: 该请求缺少一个或多个必填字段。

source: Updating Course
ar: تحديث الدورة
ur: کورس کو اپ ڈیٹ کرنا
zh_cn: 更新课程

source: Specify the {platform_name} email address or username of a student here:
ar: حدد عنوان البريد الإلكتروني {platform_name} أو اسم المستخدم لطالب هنا:
ur: یہاں ایک طالب علم کا {platform_name} ای میل پتہ یا صارف نام کی وضاحت کریں:
zh_cn: 在此指定学生的{platform_name}电子邮件地址或用户名称：

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
ar: للتسجيل في {course_names} ، قدمنا ​​عنوان URL للتسجيل لك. يرجى اتباع التعليمات أدناه للمطالبة بوصولك.
ur: {course_names} میں اندراج کرنے کے لئے ہم نے آپ کے لئے رجسٹریشن یو آر ایل فراہم کیا ہے. اپنی رسائی کا دعوی کرنے کے لئے ذیل میں دی گئی ہدایات پر عمل کریں.
zh_cn: 要注册{course_names}，我们为您提供了注册网址。请按照下面的说明来索取您的访问权限。

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
ar: استخدم برنامج أرشيف لاستخراج البيانات من ملف .tar.gz. تتضمن البيانات المستخرجة ملف library.xml ، بالإضافة إلى المجلدات الفرعية التي تحتوي على محتوى المكتبة.
ur: .tar.gz فائل سے اعداد و شمار کو نکالنے کے لئے آرکائیو پروگرام کا استعمال کریں. نکالنے والے اعداد و شمار میں لائبریری.کسیم فائل بھی شامل ہے، اس کے ساتھ ساتھ ذیلی فولڈرز جن میں لائبریری کے مواد شامل ہیں.
zh_cn: 使用归档程序从.tar.gz文件中提取数据。提取的数据包括library.xml文件以及包含库内容的子文件夹。

source: XQA Key
ar: مفتاح XQA
ur: XQA کی چابی
zh_cn: XQA密钥

source: Email
ar: البريد الإلكتروني
ur: ای میل
zh_cn: 电子邮件

source: Unenroll
ar: إلغاء تسجيل
ur: نام نہاد
zh_cn: 取消注册

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
ar: يجب إكمال التحقق بنجاح قبل هذا التاريخ للتأهل للحصول على شهادة تم التحقق منها.
ur: تصدیق شدہ سرٹیفکیٹ کی اہلیت کے لئے آپ کو اس تاریخ سے پہلے کامیابی سے مکمل طور پر مکمل کرنا ضروری ہے.
zh_cn: 您必须在此日期之前成功完成验证才有资格获得验证证书。

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
ar: تم تعطيل حسابك. إذا كنت تعتقد أن ذلك قد تم عن طريق الخطأ ، فيرجى الاتصال بنا على {support_email}
ur: آپ کا اکاؤنٹ غیر فعال کردیا گیا ہے. اگر آپ کو یقین ہے کہ یہ غلطی میں کیا گیا تھا، تو براہ مہربانی {support_email} سے رابطہ کریں
zh_cn: 您的帐户已禁用。如果您认为这是错误的，请通过{support_email}与我们联系

source: API Client ID
ar: معرف عميل واجهة برمجة التطبيقات
ur: API کلائنٹ ID
zh_cn: API客户端ID

source: Clear search
ar: مسح البحث
ur: تلاش صاف کریں
zh_cn: 清除搜索

source: Course Is New
ar: بالطبع جديد
ur: کورس نیا ہے
zh_cn: 课程是新的

source: You are not currently enrolled in this course. {link_start}Enroll now!{link_end}
ar: أنت غير مسجل حاليًا في هذه الدورة التدريبية. {link_start} التسجيل الآن! {link_end}
ur: آپ فی الحال اس کورس میں داخل نہیں ہوئے ہیں. {link_start} اب اندراج کریں! {link_end}
zh_cn: 你目前没有参加这门课程。 {link_start}立即注册！{link_end}

source: image revision
ar: مراجعة الصورة
ur: تصویری نظر ثانی
zh_cn: 图像修订

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API and any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
ar: مرحبًا بك في {platform_name}. نشكرك على استخدام واجهة برمجة التطبيقات API&#39;s API Discovery وأية واجهات برمجة تطبيقات إضافية قد نعرضها من وقت لآخر (بشكل جماعي ، &quot;واجهات برمجة التطبيقات&quot;). يرجى قراءة شروط الخدمة هذه قبل الدخول إلى واجهات برمجة التطبيقات أو استخدامها. تمثل شروط الخدمة هذه ، وأي شروط إضافية ضمن وثائق واجهة برمجة التطبيقات المرافقة ، وأي سياسات أو إرشادات سارية تعمل من خلالها {platform_name} متاحة و / أو تحديثات من وقت لآخر ، اتفاقيات (بشكل إجمالي ، &quot;الشروط&quot;) بينك وبين {platform_name}. بالوصول إلى واجهات برمجة التطبيقات أو استخدامها ، فإنك تقبل وتوافق على الالتزام قانونيًا بالشروط ، سواء كنت مستخدمًا مسجلاً أم لا. إذا كنت لا تفهم أو لا ترغب في الالتزام بالبنود ، يجب ألا تستخدم واجهات برمجة التطبيقات.
ur: {platform_name} میں خوش آمدید. {platform_name} کے کورس ریسرچ API اور کسی بھی اضافی APIs کا استعمال کرنے کے لئے آپ کا شکریہ جو ہم وقت سے پیش کرتے ہیں (مجموعی طور پر &quot;APIs&quot;). اے پی پی تک رسائی یا استعمال کرنے سے قبل ان کی سروس کی شرائط پڑھیں. سروس کی شرائط، API دستاویزات کے اندر اندر کسی بھی اضافی شرائط، اور کسی بھی قابل اطلاق پالیسیوں اور ہدایات جو کہ {platform_name} وقت اور وقت سے دستیاب وقت پر دستخط کرتا ہے (مجموعی طور پر، &quot;شرائط&quot;) آپ اور {platform_name} کے درمیان ہیں. API تک رسائی یا استعمال کرتے ہوئے، آپ کو قانونی طور پر پابندیاں قبول کرتے ہیں اور شرائط سے پابند ہیں، چاہے آپ رجسٹرڈ صارف ہو یا نہیں. اگر آپ سمجھتے ہیں یا نہیں شرائط کے پابند رہنا چاہتے ہیں، تو آپ کو API کے استعمال نہیں کرنا چاہئے.
zh_cn: 欢迎来到{platform_name}。感谢您使用{platform_name}的课程发现API以及我们随时可能提供的任何其他API（统称为“API”）。请在访问或使用API​​之前阅读这些服务条款。这些服务条款，随附API文档中的任何附加条款以及{平台名称}不时提供和/或更新的任何适用政策和准则均为您与{platform_name}之间的协议（统称为“条款”）。通过访问或使用API​​，您接受并同意受条款的法律约束，无论您是否是注册用户。如果您不明白或不希望受条款约束，则不应使用API​​。

source: Get the {platform_name} Mobile App!
ar: احصل على {platform_name} تطبيق الجوال!
ur: {platform_name} موبائل اپلی کیشن حاصل کریں!
zh_cn: 获取{platform_name}移动应用程序！

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
ar: لا يتم السماح بوظيفة عامل في الإجابة عن هذه المشكلة. الإجابة المقدمة كانت: {bad_input}
ur: اس مسئلہ کے جواب میں فیکٹریل فنکشن کی اجازت نہیں ہے. فراہم کردہ جواب تھا: {bad_input}
zh_cn: 阶段函数不允许回答这个问题。提供的答案是：{bad_input}

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liabiliy.
ar: يمكنك التوقف عن استخدام واجهات برمجة التطبيقات في أي وقت. أنت توافق على أنه يجوز لـ {platform_name} ، وفقًا لتقديرها الخاص وفي أي وقت ، إنهاء استخدامك لواجهة برمجة التطبيقات أو أي محتوى لواجهة برمجة التطبيقات لأي سبب أو بدون سبب ، بدون إشعار مسبق أو توكيل.
ur: آپ کسی بھی وقت اے پی پی کا استعمال روک سکتے ہیں. آپ اس بات سے اتفاق کرتے ہیں کہ {platform_name}، اپنے واحد صوابدیدی میں اور کسی بھی وقت، کسی بھی وجہ سے کسی بھی وجہ سے کسی بھی وجہ سے، API کے استعمال یا API کے استعمال کو ختم کرسکتے ہیں، بغیر کسی پیشگی اطلاع یا ذمہ داری کے بغیر.
zh_cn: 您可以随时停止使用这些API。您同意{platform_name}在任何时候自行决定并随时可以出于任何理由或无理由终止您对API或任何API内容的使用，恕不另行通知或承担任何责任。

source: {email} has requested {studio_name} course creator privileges on edge
ar: طلب {email} امتيازات منشئ محتوى الدورة التدريبية {studio_name}
ur: {ای میل} نے کنارے پر {سٹوڈیو_ نام} کورس سازی کے استحکام کا مطالبہ کیا ہے
zh_cn: {email}已请求{studio_name}课程创建者权限

source: Edit Price
ar: تحرير السعر
ur: قیمت میں ترمیم کریں
zh_cn: 编辑价格

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
ar: إصدار البنك غير متوفر. إصلاح محتمل: أعد المحاولة مرة أخرى بعد بضع دقائق
ur: جاری بینک دستیاب نہیں ہے. ممکنہ طے: چند منٹ کے بعد دوبارہ دوبارہ کوشش کریں
zh_cn: 发行银行不可用。可能的解决方法：几分钟后重试

source: Grading
ar: وضع العلامات
ur: گریڈنگ
zh_cn: 等级

source: An invoice for {currency_symbol}{total_price} is attached. Payment is due upon receipt. You can find information about payment methods on the invoice.
ar: تم إرفاق فاتورة بقيمة {currency_symbol} {total_price}. الدفع مستحق عند الاستلام. يمكنك العثور على معلومات حول طرق الدفع في الفاتورة.
ur: {currency_symbol} {total_price} کے لئے انوائس منسلک ہے. رسید پر ادائیگی کی وجہ سے ہے. آپ انوائس پر ادائیگی کے طریقوں کے بارے میں معلومات حاصل کرسکتے ہیں.
zh_cn: 附有{currency_symbol} {total_price}的发票。付款到期后付款。您可以在发票上找到有关付款方式的信息。
