Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: You are deleting an article. Please confirm.
ar: أنت تحذف مقالة. يرجى تأكيد.
ur: آپ ایک مضمون حذف کر رہے ہیں. تصدیق کریں.
zh_cn: 您正在删除一篇文章。请确认。

source: Quotes
ar: يقتبس
ur: حوالہ جات
zh_cn: 行情

source: {studio_name} Home
ar: {studio_name} الرئيسية
ur: {سٹوڈیو_نام} ہوم
zh_cn: {studio_name}主页

source: If no additional billing details are populated the payment confirmation will be sent to the user making the purchase.
ar: إذا لم يتم ملء أي تفاصيل فوترة إضافية ، فسيتم إرسال تأكيد الدفع إلى المستخدم الذي يجري عملية الشراء.
ur: اگر کوئی اضافی بلنگ کی تفصیلات آباد نہیں ہوتی تو ادائیگی کی تصدیق صارف کو بھیجا جائے گی.
zh_cn: 如果没有额外的结算细节填充，支付确认将发送给进行购买的用户。

source: attachment revision
ar: مراجعة المرفق
ur: منسلک ترمیم
zh_cn: 附件修订

source: You have successfully purchased <b>{number} course registration code</b> for {course_names}.
ar: لقد اشتريت بنجاح <b>{code} رمز التسجيل للدورة التدريبية</b> لـ {course_names}.
ur: آپ نے {course_names} کیلئے { <b>نمبر} کورس کا رجسٹریشن کوڈ</b> کامیابی سے خریدا ہے.
zh_cn: 您已成功购买{course_names}的<b>{number}课程注册码</b> 。

source: Image:
ar: صورة:
ur: تصویر:
zh_cn: 图片：

source: Pursue a {cert_name_long} to highlight the knowledge and skills you gain in this course.
ar: تابع {cert_name_long} لتسليط الضوء على المعرفة والمهارات التي تكتسبها في هذه الدورة.
ur: اس کورس میں حاصل کردہ علم اور مہارت کو اجاگر کرنے کیلئے {certificate_name_long} پر عمل کریں.
zh_cn: 追求{cert_name_long}以突出您在本课程中获得的知识和技能。

source: The authorization request was approved by the issuing bank but declined by CyberSource based on your legacy Smart Authorization settings. Possible action: retry with a different form of payment.
ar: تمت الموافقة على طلب التفويض من قِبل المصرف المُصدر ولكن تم رفضه بواسطة CyberSource استنادًا إلى إعدادات &quot;التفويض الذكي&quot; القديمة. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع مختلفة.
ur: اجازت دینے کی درخواست جاری بینک کی طرف سے منظوری دی گئی تھی لیکن آپ کی میراث سمارٹ اجازت کی ترتیبات کی بنیاد پر سائبر ایسورس کی طرف سے انکار کر دیا گیا تھا. ممکنہ عمل: ادائیگی کے مختلف قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 授权请求得到了发卡银行的批准，但由Cyber​​Source根据您的旧智能授权设置拒绝。可能的操作：以不同的付款方式重试。

source: How do pages look to students in my course?
ar: كيف تنظر الصفحات إلى الطلاب في الدورة التدريبية؟
ur: صفحات اپنے کورس میں طالب علموں کو کس طرح دیکھتے ہیں؟
zh_cn: 页面在我的课程中如何看待学生？

source: Remove
ar: إزالة
ur: دور
zh_cn: 去掉

source: Practice scores are hidden.
ar: يتم إخفاء درجات الممارسة.
ur: پریکٹس اسکور پوشیدہ ہیں.
zh_cn: 实践分数是隐藏的。

source: Invalid data, generate_for must be "new" or "all".
ar: البيانات غير صالحة ، يجب أن يكون generate_for &quot;جديدًا&quot; أو &quot;الكل&quot;.
ur: غلط ڈیٹا، generate_for &quot;نیا&quot; یا &quot;سب&quot; ہونا ضروری ہے.
zh_cn: 无效的数据，generate_for必须是“新”或“全部”。

source: Viewing granted extensions
ar: عرض الامتيازات الممنوحة
ur: دیکھنے کی توسیع دی گئی ہے
zh_cn: 查看授予的扩展

source: {partner_short_name} {course_number} Certificate | {platform_name}
ur: {partner_short_name} {course_number} سرٹیفکیٹ | {platform_name}
zh_cn: {partner_short_name} {course_number}证书| {} PLATFORM_NAME

source: Due date extensions for {0} {1} ({2})
ar: امتدادات التاريخ المستحقة {0} {1} ({2})
ur: {0} {1} ({2}) کیلئے تاریخ کی تاریخ کی توسیع
zh_cn: {0} {1}（{2}）的截止日期延期

source: For anyone, anywhere, anytime
ar: لأي شخص ، في أي مكان وفي أي وقت
ur: کسی کے لئے، کہیں بھی، کسی بھی وقت
zh_cn: 随时随地为任何人提供服务

source: You are enrolled in the honor track for this course. The honor track does not include a certificate.
ar: أنت مسجل في مسار الشرف لهذه الدورة. لا يتضمن مسار الشرف شهادة.
ur: آپ اس کورس کے لئے اعزاز ٹریک میں داخل ہوئے ہیں. اعزاز ٹریک میں ایک سرٹیفکیٹ شامل نہیں ہے.
zh_cn: 你参加了这门课程的荣誉课程。荣誉赛道不包括证书。

source: Comma-separated list of usernames which will be able to view this catalog.
ar: قائمة بأسماء المستخدمين المفصولة بفواصل والتي ستتمكن من مشاهدة هذا الكتالوج.
ur: صارف ناموں کی کما الگ الگ فہرست جو اس کیٹلاگ کو دیکھنے کے قابل ہو گی.
zh_cn: 逗号分隔的用户名列表将能够查看此目录。

source: Allows hiding of the progress tab.
ar: يسمح باخفاء علامة التبويب التقدم.
ur: ترقی کے ٹیب کے چھپنے کی اجازت دیتا ہے.
zh_cn: 允许隐藏进度选项卡。

source: Unable to update or clone git repository.
ar: غير قادر على تحديث أو استنساخ مستودع git.
ur: Git ذخیرہ کو اپ ڈیٹ یا کلون کرنے میں ناکام.
zh_cn: 无法更新或克隆git存储库。

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
ar: في صفحات الوحدة في مخطط الدورة التدريبية ، يمكنك تقييد الوصول إلى المكونات إلى المتعلمين استنادًا إلى مسار التسجيل الخاص بهم.
ur: کورس کے آؤٹ لائن میں یونٹ کے صفحات پر، آپ اپنے اندراج کے ٹریک پر مبنی سیکھنے والوں کے اجزاء تک رسائی محدود کر سکتے ہیں.
zh_cn: 在课程大纲的单元页面上，您可以根据学员的注册路径限制学习者对组件的访问。

source: We hope you're enjoying <strong>%(course_name)s</strong>! We want to let you know what you can look forward to in week %(week_num)s:
ar: نأمل أن تستمتع <strong>٪ (course_name) s</strong> ! نريد أن نخبرك بما يمكنك التطلع إليه في الأسبوع٪ (week_num) s:
ur: ہمیں امید ہے کہ آپ <strong>٪ (کورس_ نام) کی</strong> لطف اندوز ہو رہے ہیں! ہم آپ کو یہ بتانا چاہتے ہیں کہ آپ ہفتے میں٪ (ہفتہ_وموم) کے لۓ کیا دیکھ سکتے ہیں:
zh_cn: 我们希望你喜欢<strong>％（course_name）</strong> ！我们想让你知道你可以期待在星期％（week_num）s：

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
ar: لإخفاء محتوى القسم الفرعي من المتعلمين بعد مرور تاريخ الاستحقاق الفرعي ، حدد رمز التهيئة لجزء فرعي ، ثم حدد {em_start} إخفاء المحتوى بعد تاريخ الاستحقاق {em_end}. تظل درجات القسم الفرعي متضمنة في حسابات الدرجة.
ur: سبسکرائب ہونے والے تاریخ کی تاریخ کے بعد سبسکرائب کرنے والے مواد کو چھپانے کے لئے، سبسکرائب کے لئے ترتیب آئیکٹر منتخب کریں، پھر {em_start} منتخب تاریخ {em_end} کے بعد مواد چھپائیں. سبسکرائب کے لئے گریڈیں گریڈ کی حساب میں شامل ہیں.
zh_cn: 要在分段截止日期后向学习者隐藏分段的内容，请选择分段的配置图标，然后选择{em_start}在截止日期{em_end}后隐藏内容。小节的分数仍包括在分数计算中。

source: Allow Anonymous Discussion Posts to Peers
ar: السماح بمناقشة المناقشة المجهولة للنبلاء
ur: پیروں کے گمنام بحث کے مراسلے کی اجازت دیں
zh_cn: 允许匿名讨论帖子给同伴

source: Please include some written feedback as well.
ar: يرجى تضمين بعض التعليقات المكتوبة كذلك.
ur: براہ مہربانی کچھ تحریری رائے بھی شامل کریں.
zh_cn: 请包括一些书面反馈。

source: What format this module is in (used for deciding which grader to apply, and what to show in the TOC)
ar: ما هو تنسيق هذه الوحدة (المستخدمة في تحديد الصف الذي سيتم تطبيقه ، وما الذي سيتم عرضه في جدول المحتويات)
ur: اس ماڈیول میں کیا فارمیٹ ہے (جس میں گرڈر کا اطلاق کرنے کا فیصلہ کیا جاتا ہے، اور TOC میں کیا دکھایا جاتا ہے)
zh_cn: 该模块的格式是什么（用于决定应用哪个分级器，以及TOC中显示的内容）

source: Termination
ar: نهاية
ur: ختم
zh_cn: 终止

source: revision number
ar: رقم المراجعة
ur: تجزیہ نمبر
zh_cn: 版本号

source: Full Name
ar: الاسم الكامل
ur: پورا نام
zh_cn: 全名

source: Current Library:
ar: المكتبة الحالية:
ur: موجودہ لائبریری:
zh_cn: 当前库：

source: Contact your edX partner manager to update these settings.
ar: اتصل بمدير شريك edX لتحديث هذه الإعدادات.
ur: ان ترتیبات کو اپ ڈیٹ کرنے کیلئے اپنے EDX پارٹنر مینیجر سے رابطہ کریں.
zh_cn: 联系您的edX合作伙伴经理更新这些设置。

source: Right to Charge
ar: الحق في الشحن
ur: چارج کرنے کا حق
zh_cn: 收费权

source: New topic form
ar: شكل موضوع جديد
ur: نیا موضوع فارم
zh_cn: 新的主题形式

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
ar: ما عليك سوى تعيين تاريخ قسم أو قسم فرعي ، وسيقوم {studio_name} بنشره لك طلابك.
ur: بس ایک سیکشن یا سبسیکشن کی تاریخ مقرر کرتے ہیں، اور {سٹوڈیو_ نام} آپ کے لئے اپنے طالب علموں کو شائع کرے گا.
zh_cn: 只需设置一个小节或小节的日期，{studio_name}将其发布给您的学生。

source: Learn more about the course outline
ar: تعرف على المزيد حول مخطط الدورة
ur: کورس کے آؤٹ لائن کے بارے میں مزید جانیں
zh_cn: 详细了解课程大纲

source: Manual (Un)Enrollment Reason
ar: دليل (Un) سبب التسجيل
ur: دستی (غیر) اندراج کی وجہ
zh_cn: 手动（联合国）登记原因

source: Group Community TAs are members of the community who help course teams moderate discussions. Group Community TAs see only posts by learners in their assigned group. They can edit or delete posts, clear flags, close and re-open threads, and endorse responses, but only for posts by learners in their group. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Group Community TAs.
ar: أعضاء TAs التابعين للمجموعة هم أعضاء في المجتمع الذين يساعدون فرق المساق في إجراء مناقشات معتدلة. لا يرى TAs مجموعة المجتمع سوى المشاركات من قبل المتعلمين في المجموعة المخصصة لهم. ويمكنهم تحرير المشاركات أو حذفها ، وإزالة العلامات ، وإغلاق سلاسل المحادثات وإعادة فتحها ، وتأييد الردود ، ولكن فقط للوظائف التي يقدمها المتعلمون في مجموعتهم. يتم وضع علامات على مشاركاتهم كـ &quot;Community TA&quot;. يمكن فقط إضافة المتعلمين المسجلين كأعضاء في مجتمع المجموعة.
ur: گروپ کمیونٹی ٹی اے اس کمیونٹی کے رکن ہیں جو کورسز کے ٹیموں کو اعتدال پسند بات چیت میں مدد فراہم کرتی ہیں. گروپ کمیونٹی ٹی اےز ان کے تفویض گروپ میں سیکھنے والوں کی طرف سے صرف خطوط دیکھتے ہیں. وہ خطوط، صاف جھنگوں، قریبی اور دوبارہ کھولنے کے سلسلے میں ترمیم یا حذف کرسکتے ہیں، اور ردعمل قبول کرتے ہیں، لیکن صرف ان کے گروپ میں سیکھنے والوں کی طرف سے خطوط کے لئے. ان کی اشاعتیں &#39;کمیونٹی ٹی اے&#39; کے طور پر نشان لگا دیا گیا ہے. گروہ کمیونٹی ٹی اے کے طور پر صرف اندراج شدہ سیکھنے کو شامل کیا جاسکتا ہے.
zh_cn: 团体社区助教是社区成员，帮助课程团队进行讨论。小组社区助教只能看到他们分配的小组中的学习者的帖子。他们可以编辑或删除帖子，清除标志，关闭并重新打开主题，并支持回复，但仅限于群组中学员的帖子。他们的帖子被标记为“社区TA”。只有注册的学习者可以添加为小组社区助教。

source: Regenerate for learners who have not received certificates. ({count})
ar: التجديد للمتعلمين الذين لم يتلقوا شهادات. ({} الاعتماد)
ur: سیکھنے والوں کے لئے دوبارہ تخلیق کریں جنہیں سرٹیفکیٹ نہیں ملی ہے. ({شمار})
zh_cn: 为没有收到证书的学习者重新生成。 （{计数}）

source: Course Credit Eligibility
ar: أهلية دورة بالطبع
ur: کورس کریڈٹ اہلیت
zh_cn: 课程学分资格

source: You've successfully logged into your {provider_name} account, but this account isn't linked with an {platform_name} account yet.
ar: لقد سجّلت الدخول بنجاح إلى حسابك {provider_name} ، ولكن هذا الحساب غير مرتبط بحساب {platform_name} حتى الآن.
ur: آپ نے کامیابی سے آپ {provider_name} اکاؤنٹ میں لاگ ان کیا ہے، لیکن یہ اکاؤنٹ ابھی تک نہیں ہے {platform_name} اکاؤنٹ سے.
zh_cn: 您已成功登录到{provider_name}帐户，但该帐户尚未与{platform_name}帐户关联。

source: To view live discussions, click Preview or View Live in Unit Settings.
ar: لعرض مناقشات مباشرة ، انقر فوق معاينة أو عرض مباشر في إعدادات الوحدة.
ur: براہ راست بات چیت دیکھنے کے لئے، یونٹ ترتیبات میں پیش نظارہ یا دیکھیں لائیو پر کلک کریں.
zh_cn: 要查看实时讨论，请在单位设置中单击预览或查看实况。

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
ar: المكتبة يمكن للمستخدمين عرض محتوى المكتبة ويمكنهم الإشارة إلى مكونات المكتبة أو استخدامها في الدورات التدريبية الخاصة بهم ، لكن لا يمكنهم تحرير محتويات المكتبة.
ur: لائبریری صارفین لائبریری کے مواد کو دیکھ سکتے ہیں اور ان کے نصاب میں لائبریری اجزاء کا حوالہ دیتے ہیں یا استعمال کرسکتے ہیں، لیکن وہ کسی لائبریری کے مندرجات میں ترمیم نہیں کرسکتے ہیں.
zh_cn: 图书馆用户可以查看图书馆内容，并可以在他们的课程中引用或使用图书馆组件，但他们不能编辑图书馆的内容。

source: Enrollment codes for Course: {course_name}
ar: أكواد التسجيل للدورة التدريبية: {course_name}
ur: کورس کے لئے اندراج کوڈ: {course_name}
zh_cn: 课程注册码：{course_name}

source: Date that this class ends
ar: التاريخ الذي ينتهي فيه هذا الفصل
ur: تاریخ اس کلاس کو ختم کرتا ہے
zh_cn: 此课程结束的日期

source: This student (%s) is already allowed to skip the entrance exam.
ar: يُسمح بالفعل لهذا الطالب (٪ s) بتخطي امتحان القبول.
ur: اس طالب علم (٪ s) کو پہلے ہی داخلہ امتحان چھوڑنے کی اجازت ہے.
zh_cn: 这名学生（％s）已经被允许跳过入学考试。

source: To read a sent email message, click its subject.
ar: لقراءة رسالة بريد إلكتروني مرسلة ، انقر فوق موضوعها.
ur: بھیجنے والے ای میل پیغام کو پڑھنے کے لئے، اس کے مضمون پر کلک کریں.
zh_cn: 要阅读已发送的电子邮件，请单击其主题。

source: Sub Item 1
ar: البند الفرعي 1
ur: ذیلی آئٹم 1
zh_cn: 子项目1

source: Processor Failure. Possible action: retry the payment
ar: فشل المعالج. الإجراء المحتمل: إعادة محاولة الدفع
ur: پروسیسر ناکامی. ممکنہ عمل: ادائیگی دوبارہ کریں
zh_cn: 处理器故障。可能的操作：重试付款

source: The record is not in the correct format. Please add a valid username or email address.
ar: السجل ليس بالتنسيق الصحيح. الرجاء إضافة اسم مستخدم أو عنوان بريد إلكتروني صالح.
ur: ریکارڈ صحیح شکل میں نہیں ہے. براہ کرم ایک درست صارف کا نام یا ای میل پتہ شامل کریں.
zh_cn: 记录格式不正确。请添加有效的用户名或电子邮件地址。

source: API Access Request Status
ar: حالة طلب الوصول إلى واجهة برمجة التطبيقات
ur: API رسائی درخواست کی حیثیت
zh_cn: API访问请求状态

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
ar: إذا كنت تستخدم عناوين url http ، فيجب عليك تقديم اسم المستخدم وكلمة المرور في عنوان url. على غرار https: // user: pass@github.com/user/course.
ur: اگر http urls استعمال کرتے ہیں، تو آپ کو url میں صارف نام اور پاس ورڈ فراہم کرنا ہوگا. https: // صارف کی طرح: pass@github.com/user/course.
zh_cn: 如果使用http url，则必须在url中提供用户名和密码。类似于https：// user：pass@github.com/user/course。

source: Subsection Data
ar: بيانات فرعية
ur: سبسکرائب ڈیٹا
zh_cn: 小节数据

source: or
ar: أو
ur: یا
zh_cn: 要么

source: Must be more complex ({0})
ar: يجب أن يكون أكثر تعقيدًا ({0})
ur: زیادہ پیچیدہ ہونا چاہیے ({0})
zh_cn: 必须更复杂（{0}）

source: Failed in authenticating {username}, error {error}
ar: فشل في مصادقة {username} ، خطأ {خطأ}
ur: {صارف نام} کی توثیق کرنے میں ناکامی، غلطی {غلطی}
zh_cn: 验证{用户名}失败，错误{错误}

source: Verified
ar: التحقق
ur: تصدیق شدہ
zh_cn: 验证

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
ar: Rescore الردود المقدمة. يقوم خيار &quot;Rescore Only If Scores Improve&quot; بتحديث درجة المتعلم فقط إذا كان يحسن في صالح المتعلم.
ur: ریورس اپ ڈیٹس ردعمل. &#39;ریسورس صرف سکور بہتر بنانے&#39; کے اختیارات سیکھنے کے سکور کو اپ ڈیٹ کرتا ہے صرف اس صورت میں جب وہ سیکھنے والے کے حق میں بہتر ہوتا ہے.
zh_cn: Rescore提交的回复。只有改善学习者的分数才能更新学习者的分数。

source: You're almost there! Use the link to activate your account to access engaging, high-quality {platform_name} courses. Note that you will not be able to log back into your account until you have activated it.
ar: أنت على وشك الانتهاء استخدم الرابط لتنشيط حسابك للوصول إلى دورات تدريبية ذات جودة عالية {platform_name}. لاحظ أنه لن تتمكن من إعادة تسجيل الدخول إلى حسابك حتى تقوم بتنشيطه.
ur: آپ تقریبا وہاں ہیں! منسلک، اعلی معیار {platform_name} کورسز تک رسائی حاصل کرنے کے لئے اپنے اکاؤنٹ کو فعال کرنے کیلئے لنک کا استعمال کریں. نوٹ کریں کہ جب تک آپ نے اسے فعال نہیں کیا آپ تک اپنے اکاؤنٹ میں دوبارہ لاگ ان نہیں کر سکیں گے.
zh_cn: 你快到了！使用该链接激活您的帐户以访问高质量的{platform_name}课程。请注意，只有激活了帐户，才能重新登录您的帐户。

source: Max per-file size: {max_filesize}MB
ar: الحجم الأقصى لكل ملف: {max_filesize} ميغابايت
ur: زیادہ سے زیادہ فی فائل کا سائز: {max_filesize} MB
zh_cn: 每个文件的最大大小：{max_filesize} MB

source: CourseMode price updated successfully
ar: تم تحديث سعر CourseMode بنجاح
ur: کورس موڈ قیمت کامیابی سے اپ ڈیٹ کی گئی
zh_cn: CourseMode价格已成功更新

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
ar: مفتاح وصول لشهادة المثال. يتم استخدام هذا عندما نتلقى استجابة من قائمة الانتظار للتحقق من أن المرسل هو الكيان نفسه الذي طلبنا منه إنشاء الشهادة.
ur: مثال کے سرٹیفکیٹ کے لئے ایک رسائی کی چابی. یہ استعمال کیا جاتا ہے جب ہم قطار سے ایک جواب موصول کرتے ہیں کہ اس بات کو تسلیم کرنے کے لئے کہ یہ بھی وہی ادارہ ہے جو ہم نے سرٹیفکیٹ پیدا کرنے کے لئے کہا تھا.
zh_cn: 示例证书的访问密钥。当我们收到来自队列的响应来验证发件人是我们要求生成证书的同一个实体时，会使用它。

source: Student List Management
ar: إدارة قائمة الطلاب
ur: طالب علم کی فہرست مینجمنٹ
zh_cn: 学生名单管理

source: attachments
ar: مرفقات
ur: منسلکات
zh_cn: 附件

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
ar: إذا قمت بإجراء عملية استيراد أثناء تشغيل الدورة التدريبية الخاصة بك ، وقمت بتغيير أسماء URL (أو عناوين url_name) الخاصة بأية مكونات مشكلة ، فقد يتم فقدان بيانات الطالب المرتبطة بمكونات المشكلة هذه. تتضمن هذه البيانات درجات مشكلة الطلاب.
ur: اگر آپ کا کورس چل رہا ہے تو آپ درآمد کرتے ہیں، اور آپ کسی بھی مسائل کے اجزاء کے یو آر ایل کے نام (یا url_name نوڈس) کو تبدیل کرتے ہیں، ان مسائل کے اجزاء سے منسلک طالب علم کو کھو دیا جا سکتا ہے. اس اعداد و شمار میں طالب علموں کا مسئلہ اسکور شامل ہے.
zh_cn: 如果您的课程正在运行时执行导入，并且您更改了任何问题组件的URL名称（或url_name节点），则与这些问题组件关联的学生数据可能会丢失。这些数据包括学生的问题分数。

source: Discussion Moderators
ar: مشرفو المناقشة
ur: بحث مینیجرز
zh_cn: 讨论版主

source: Unit Cost
ar: تكلفة الوحدة
ur: یونٹ لاگت
zh_cn: 单位成本

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
ar: محدد في ثوان. تمكين التخزين المؤقت عن طريق تعيين هذا إلى قيمة أكبر من 0.
ur: سیکنڈ میں مقرر کردہ 0 سے زائد زیادہ قیمت پر قائم کرکے کیشنگ کو فعال کریں.
zh_cn: 以秒为单位指定。通过将其设置为大于0的值来启用缓存。

source: Bypass Course Home
ar: الالتفافية بالطبع الرئيسية
ur: بائپ کورس کورس
zh_cn: 绕过课程主页

source: Maintenance
ar: اعمال صيانة
ur: بحالی
zh_cn: 保养

source: To cancel or resubmit an invoice, enter the invoice number below.
ar: لإلغاء أو إعادة إرسال فاتورة ، أدخل رقم الفاتورة أدناه.
ur: انوائس کو منسوخ یا دوبارہ بھیجنے کیلئے، ذیل میں انوائس نمبر درج کریں.
zh_cn: 要取消或重新提交发票，请在下面输入发票号码。

source: Image Annotation
ar: التعليق على الصورة
ur: تصویری تشریح
zh_cn: 图像注释

source: Price (USD)
ar: السعر (USD)
ur: قیمت (USD)
zh_cn: 价格（美元）

source: Empty
ar: فارغة
ur: خالی
zh_cn: 空

source: About {platform_name} Accomplishments
ar: حول {platform_name} الإنجازات
ur: کے بارے میں {platform_name} کے مواقع
zh_cn: 关于{platform_name}成就

source: Your browser does not support this video format. Try using a different browser.
ar: متصفحك لا يدعم تنسيق الفيديو هذا. حاول استخدام متصفح مختلف.
ur: آپ کا براؤزر اس ویڈیو کی شکل کی حمایت نہیں کرتی ہے. ایک مختلف براؤزر کا استعمال کرنے کی کوشش کریں.
zh_cn: 您的浏览器不支持这种视频格式。尝试使用不同的浏览器。

source: Staff Debug:
ar: تصحيح الموظفين:
ur: اسٹاف ڈیبگ:
zh_cn: 员工调试：

source: Couldn't find module for url: {0}
ar: تعذر العثور على وحدة نمطية لعنوان url: {0}
ur: url کے لئے ماڈیول نہیں مل سکا: {0}
zh_cn: 无法找到网址的模块：{0}

source: View and regenerate certificates.
ar: عرض وتجديد الشهادات.
ur: سرٹیفکیٹ دیکھیں اور دوبارہ حاصل کریں.
zh_cn: 查看并重新生成证书。

source: Removing user "{username}" from groups {group_names}
ar: إزالة المستخدم &quot;{username}&quot; من المجموعات {group_names}
ur: صارف {group_names} سے &quot;{صارف کا نام}&quot; کو حذف کرنا
zh_cn: 从组{group_names}删除用户“{用户名}”

source: Your enrollment: Honor track
ar: تسجيلك: مسار الشرف
ur: آپ کا اندراج: ٹریک کا اعزاز
zh_cn: 您的注册：荣誉跟踪

source: Remember when you enrolled in %(course_name)s, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: أتذكر عندما قمت بالتسجيل في٪ (course_name) s ، ودورات أخرى على٪ (platform_name) s؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ٪ (course_name) s، اور٪ (platform_name) کے دوسرے کورسز میں داخلا ہو؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 请记住，您何时参加％（course_name）s以及％（platform_name）s上的其他课程？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: Dictionary with the available tags
ar: القاموس مع العلامات المتاحة
ur: دستیاب ٹیگز کے ساتھ ڈکشنری
zh_cn: 带有可用标签的字典

source: Software Secure Review Rules
ar: قواعد مراجعة البرامج الآمنة
ur: سافٹ ویئر محفوظ جائزہ کے قواعد
zh_cn: 软件安全评审规则

source: Cosmetic Course Display Price
ar: سعر عرض مستحضرات التجميل
ur: کاسمیٹک کورس ڈسپلے قیمت
zh_cn: 化妆课程显示价格

source: Invalid course update id.
ar: معرف تحديث دورة غير صالح.
ur: غلط کورس اپ ڈیٹ ID.
zh_cn: 无效的课程更新ID。

source: Rescore Only If Score Improves
ar: Rescore فقط إذا تحسنت النتيجة
ur: ریورس صرف اگر اسکور بہتر ہو
zh_cn: 如果分数提高，仅限Rescore

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
ar: ساعد الطلاب على فهم مفهوم واحد في كل مرة باستخدام الوسائط المتعددة و HTML والتمارين.
ur: اپنے طالب علموں کو ملٹی میڈیا، ایچ ٹی ایم ایل اور مشقوں کے ساتھ ایک وقت میں ایک تصور کو سمجھنے میں مدد کریں.
zh_cn: 通过多媒体，HTML和练习帮助您的学生一次理解一个概念。

source: Technical Requirements
ar: متطلبات تقنية
ur: تکنیکی ضروریات
zh_cn: 技术要求

source: Course has been successfully reindexed.
ar: تم إعادة فهرسة الدورة بنجاح.
ur: کورس کامیابی سے دوبارہ ترمیم کردی گئی ہے.
zh_cn: 课程已成功重新编制索引。

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
ar: عنوان URL لمقطع الفيديو الخاص بك. يمكن أن يكون هذا عنوان URL على YouTube أو رابطًا إلى ملف فيديو .mp4 أو .ogg أو .webm مستضافًا في مكان آخر على الإنترنت.
ur: آپ کے ویڈیو کیلئے یو آر ایل. یہ یو ٹیوب یو آر ایل یا ایک MP4، .ogg، یا .webm ویڈیو فائل کا ایک لنک ہو سکتا ہے جس میں انٹرنیٹ پر دوسری جگہ میزبان ہو.
zh_cn: 您的视频的网址。这可以是YouTube网址或指向Internet上其他地方托管的.mp4，.ogg或.webm视频文件的链接。

source: Page {page_number} of {page_count}
ar: الصفحة {page_number} من {page_count}
ur: صفحہ {page_number} کا {page_count}
zh_cn: {page_count}的页面{page_number}

source: Course Number Display String
ar: عرض سلسلة رقم الدورة
ur: کورس نمبر ڈسپلے سٹرنگ
zh_cn: 课程编号显示字符串

source: Create My Account &amp; Start Authoring Courses
ar: إنشاء حسابي وبدء دورات التأليف
ur: میرا اکاؤنٹ بنائیں اور اکاونٹنگ کے کورسز شروع کریں
zh_cn: 创建我的帐户并开始创作课程

source: This image file type is not supported. Supported file types are {supported_file_formats}.
ar: نوع ملف الصورة هذا غير مدعوم. أنواع الملفات المدعومة هي {supported_file_formats}.
ur: یہ تصویر فائل کی قسم کی حمایت نہیں کی جاتی ہے. معاون فائل کی اقسام {supported_file_formats} ہیں.
zh_cn: 此图像文件类型不受支持。支持的文件类型是{supported_file_formats}。

source: Existing students:
ar: الطلاب الحاليون:
ur: موجودہ طلباء:
zh_cn: 现有的学生：

source: You must agree to the {platform_name} {terms_of_service}
ar: يجب عليك الموافقة على {platform_name} {terms_of_service}
ur: آپ {platform_name} {terms_of_service} سے متفق ہونا ضروری ہے
zh_cn: 您必须同意{platform_name} {terms_of_service}

source: Create User Results
ar: إنشاء نتائج المستخدم
ur: صارف کے نتائج بنائیں
zh_cn: 创建用户结果

source: object ID
ar: معرف الكائن
ur: اعتراض کی شناخت
zh_cn: 对象ID

source: Welcome to {course_display_name}
ar: مرحبًا بك في {course_display_name}
ur: {course_display_name} میں خوش آمدید
zh_cn: 欢迎来到{course_display_name}

source: Couldn't parse formula: {error_msg}
ar: تعذّر تحليل الصيغة: {error_msg}
ur: فارمولا کو پار نہیں کر سکا: {error_msg}
zh_cn: 无法解析公式：{error_msg}

source: You have finished learning to grade, which means that you are now ready to start grading.
ar: لقد انتهيت من تعلم الصف ، مما يعني أنك مستعد الآن لبدء التقدير.
ur: آپ نے گریڈ کو سیکھنے کے لئے تیار کیا ہے، جس کا مطلب یہ ہے کہ آپ اب گورنمنٹ شروع کرنے کے لئے تیار ہیں.
zh_cn: 您已完成学习评分，这意味着您现在可以开始评分了。

source: Experience
ar: تجربة
ur: تجربہ
zh_cn: 经验

source: You still need to verify for this course.
ar: لا تزال بحاجة إلى التحقق من هذه الدورة التدريبية.
ur: آپ اب بھی اس کورس کے لئے تصدیق کرنے کی ضرورت ہے.
zh_cn: 你仍然需要验证这门课程。

source: Huge Header
ar: رأس ضخم
ur: بھاری ہیڈر
zh_cn: 巨大的标题

source: Course Card Image
ar: صورة بطاقة الدورة التدريبية
ur: کورس کارڈ کی تصویر
zh_cn: 课程卡片图像

source: You must submit an answer before you can select Reset.
ar: يجب عليك تقديم إجابة قبل أن تتمكن من تحديد إعادة تعيين.
ur: ری سیٹ کو منتخب کر سکتے ہیں اس سے پہلے آپ کو ایک جواب جمع کرنا ہوگا.
zh_cn: 您必须先提交答案，然后才能选择重置。

source: Error
ar: خطأ
ur: غلطی
zh_cn: 错误
