Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
ar: بإمكان مدراء CCX إنشاء دورات مخصصة خاصة بهم بناءً على هذه الدورة التدريبية ، والتي يمكنهم استخدامها لتقديم تعليمات مخصصة لطلابهم استنادًا إلى مادة الدورة التدريبية هذه.
ur: CCX کوچ اس کورس پر مبنی اپنے اپنی مرضی کے نصاب کو پیدا کرنے میں کامیاب ہیں، جو وہ اس کورس کے مواد میں اپنے اپنے طالب علموں کو ذاتی طور پر ہدایت فراہم کرنے کے لئے استعمال کرسکتے ہیں.
zh_cn: CCX教练可以根据本课程创建自己的定制课程，他们可以根据本课程资料为其自己的学生提供个性化的指导。

source: Course Number
ar: رقم الدورة
ur: کورس نمبر
zh_cn: 课程编号

source: example: Jane Doe
ar: مثال: جين دو
ur: مثال: جین ڈو
zh_cn: 例如：Jane Doe

source: Switch to this version
ar: قم بالتبديل إلى هذا الإصدار
ur: اس ورژن میں سوئچ کریں
zh_cn: 切换到此版本

source: Enter course-specific configuration information here (JSON format)
ar: إدخال معلومات التكوين الخاصة بالدورة هنا (تنسيق JSON)
ur: یہاں کورس کے مخصوص ترتیب کی معلومات درج کریں (JSON کی شکل)
zh_cn: 在此输入课程特定的配置信息（JSON格式）

source: Certificate ID Number
ar: رقم معرف الشهادة
ur: سرٹیفکیٹ ID نمبر
zh_cn: 证书ID号码

source: Certificate Type
ar: نوع الشهادة
ur: سرٹیفکیٹ کی قسم
zh_cn: 证书类别

source: Skip to main content
ar: تخطي إلى المحتوى الرئيسي
ur: مرکزی مواد پر جائیں
zh_cn: 跳到主要内容

source: Facebook
ar: الفيسبوك
ur: فیس بک
zh_cn: Facebook的

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
ar: القاموس الذي يحدد المجموعات التي يمكن أن تظهر هذه الكتلة. المفاتيح هي معرفات تكوين المجموعة والقيم هي قائمة بمعرفات المجموعة. إذا لم يكن هناك مفتاح لتكوين المجموعة أو إذا كانت مجموعة معرفات المجموعة فارغة ، فستعتبر الكتلة مرئية للجميع. لاحظ أنه يتم تجاهل هذا الحقل إذا كانت الكتلة مرئية_ to_staff_only.
ur: ایک لغت جس کے نقشے اس گروپ کو دکھایا جا سکتا ہے. کلید گروپ گروپ ترتیبات ہیں اور اقدار گروپ کی شناخت کی فہرست ہیں. اگر گروپ گروپ کی ترتیب کے لئے کوئی کلیدی نہیں ہے یا اگر گروپ کی شناخت کا سیٹ خالی ہے تو بلاک سب کو نظر آتا ہے. نوٹ کریں کہ اگر یہ ایرر برقرار رہے تو اس فیلڈ کو نظر انداز کردیا جائے گا.
zh_cn: 映射哪些组可以显示此块的字典。密钥是组配置标识，值是组标识列表。如果组配置没有密钥或组标识为空，则认为该块对所有组都是可见的。请注意，如果该块为visible_to_staff_only，则该字段将被忽略。

source: coupon with the coupon id ({coupon_id}) DoesNotExist
ar: قسيمة بمعرف الكوبون ({coupon_id}) DoesNotExist
ur: کوپن کی شناخت کے ساتھ کوپن ({coupon_id}) DoesNotExist
zh_cn: 优惠券ID（{coupon_id}）的优惠券DoesNotExist

source: denied
ar: رفض
ur: انکار کر دیا
zh_cn: 否认

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
ar: يمكنك تصدير المكتبات وتعديلها خارج {studio_name}. الملف الذي تم تصديره هو ملف .tar.gz (أي ، ملف .tar مضغوط مع GNU Zip) يحتوي على بنية المكتبة والمحتوى. يمكنك أيضًا إعادة استيراد المكتبات التي قمت بتصديرها.
ur: آپ لائبریریوں کو برآمد کر سکتے ہیں اور انہیں {سٹوڈیو_ نام} سے باہر لے سکتے ہیں. برآمد شدہ فائل ایک .tt.gz فائل ہے (یہ، جی این یو زپ کے ساتھ ایک .تر فائل کمپریسڈ ہے) جس میں لائبریری کی ساخت اور مواد شامل ہے. آپ لائبریریوں کو بھی دوبارہ درآمد کرسکتے ہیں جو آپ نے برآمد کیا ہے.
zh_cn: 您可以导出库并在{studio_name}之外编辑它们。导出的文件是一个.tar.gz文件（即，用GNU Zip压缩的.tar文件），其中包含库结​​构和内容。您也可以重新导入您导出的库。

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
ar: حقل اسم المستخدم / البريد الإلكتروني للطلاب مطلوب ولا يمكن أن يكون فارغًا. يرجى تعبئة اسم المستخدم / البريد الإلكتروني ثم الضغط على زر &quot;Invalidate Certificate&quot;.
ur: طالب علم کا صارف نام / ای میل فیلڈ کی ضرورت ہے اور خالی نہیں ہوسکتی ہے. برائے مہربانی صارف کا نام / ای میل بھریں اور پھر &quot;غیر قانونی سرٹیفکیٹ&quot; کے بٹن کو دبائیں.
zh_cn: 学生用户名/电子邮件字段是必填字段，不能为空。请填写用户名/电子邮件，然后按“无效证书”按钮。

source: Cannot Find Certificate
ar: لا يمكن العثور على الشهادة
ur: سرٹیفکیٹ نہیں مل سکا
zh_cn: 找不到证书

source: View on Web
ar: عرض على الويب
ur: ویب پر دیکھیں
zh_cn: 在网上查看

source: User Management
ar: إدارةالمستخدم
ur: صارفی انتظام
zh_cn: 用户管理

source: Tell us about your current financial situation. Why do you need assistance?
ar: أخبرنا عن وضعك المالي الحالي. لماذا تحتاج المساعدة؟
ur: ہمیں اپنے موجودہ مالیاتی صورتحال کے بارے میں بتائیں. آپ کو مدد کی ضرورت کیوں ہے؟
zh_cn: 告诉我们您目前的财务状况。你为什么需要帮助？

source: Update Catalog
ar: تحديث الفهرس
ur: اپ ڈیٹ کیٹلوگ
zh_cn: 更新目录

source: The requested amount exceeds the originally authorized amount.
ar: يتجاوز المبلغ المطلوب المبلغ الأصلي المأذون به.
ur: درخواست شدہ رقم اصل طور پر اختیار شدہ رقم سے زیادہ ہے.
zh_cn: 请求金额超过原始授权金额。

source: deleted
ar: تم الحذف
ur: حذف کر دیا گیا
zh_cn: 删除

source: Problem must be reset before it can be submitted again.
ar: يجب إعادة تعيين المشكلة قبل تقديمها مرة أخرى.
ur: دوبارہ دوبارہ پیش کیا جاسکتا ہے اس سے پہلے مسئلہ دوبارہ شروع کرنا ضروری ہے.
zh_cn: 在重新提交之前必须重置问题。

source: of
ar: من
ur: کی
zh_cn: 的

source: Make sure that you are providing a valid username or a URL that contains "
ar: تأكد من أنك تقدم اسم مستخدم صالحًا أو عنوان URL يحتوي على &quot;
ur: اس بات کو یقینی بنائیں کہ آپ ایک درست صارف نام یا یو آر ایل فراہم کر رہے ہیں جس میں &quot;
zh_cn: 确保您提供的有效用户名或URL包含“

source: User {username} has never accessed problem {location}
ar: لم يتمكن المستخدم {username} من الوصول إلى المشكلة أبدًا {location}
ur: صارف {صارف کا نام} نے کبھی {مسئلہ} تک رسائی حاصل نہیں کی ہے
zh_cn: 用户{用户名}从未访问过问题{位置}

source: Birth Year
ar: سنة الميلاد
ur: پیدائشی سال
zh_cn: 出生年

source: {course_key} is not a valid course key
ar: {course_key} ليس مفتاح دورة تدريبية صالحًا
ur: {course_key} درست کورس کی کلید نہیں ہے
zh_cn: {course_key}不是有效的课程键

source: Create Learning Pathways
ar: إنشاء مسارات التعلم
ur: سیکھنے کے راستے بنائیں
zh_cn: 创建学习途径

source: Course Language
ar: لغة الدورة
ur: کورس کی زبان
zh_cn: 课程语言

source: Enter the recipient email address.
ar: أدخل عنوان البريد الإلكتروني للمستلم.
ur: وصول کنندہ ای میل پتہ درج کریں.
zh_cn: 输入收件人电子邮件地址。

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
ar: يجب عليك ربط هذه الدورة التدريبية بمؤسسة من أجل المتابعة. المنظمة التي حددتها غير موجودة في النظام ، ستحتاج إلى إضافتها إلى النظام
ur: جاری رکھنے کے لئے آپ کو اس کورس کو کسی تنظیم سے لنک کرنا ہوگا. آپ نے منتخب کردہ تنظیم نظام میں موجود نہیں ہے، آپ اسے نظام میں شامل کرنے کی ضرورت ہوگی
zh_cn: 您必须将此课程链接到组织才能继续。您选择的组织不存在于系统中，您需要将其添加到系统中

source: Failed in authenticating {username}
ar: فشل في مصادقة {username}
ur: {صارف نام} کی توثیق کرنے میں ناکام
zh_cn: 无法验证{用户名}

source: Account Acknowledgements
ar: شكر وتقدير للحساب
ur: اکاؤنٹ کا اعتراف
zh_cn: 帐户确认

source: Need Help?
ar: تحتاج مساعدة؟
ur: مدد چاہیے؟
zh_cn: 需要帮忙？

source: Enter the secret string for annotation storage. The textannotation, videoannotation, and imageannotation advanced modules require this string.
ar: أدخل السلسلة السرية لتخزين التعليقات التوضيحية. تتطلب النصوص النصية ، و وضوح الفيديو ، والوحدات النمطية المتقدمة لـ imageannotation هذه السلسلة.
ur: نیویگیشن اسٹوریج کے لئے خفیہ سٹرنگ درج کریں. ٹیکسٹنٹیشن، ویڈیو ٹرانسمیشن، اور تصویری تشریح کو جدید ماڈیولز اس تار کی ضرورت ہوتی ہے.
zh_cn: 输入注释存储的秘密字符串。 textannotation，videoannotation和imageannotation高级模块需要此字符串。

source: Organization of template.
ar: تنظيم القالب.
ur: سانچے کی تنظیم
zh_cn: 模板的组织。

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
ar: تقديم معلومات محددة لإعادة تشغيل الدورة التدريبية. لا تتأثر الدورة التدريبية الأصلية بأي طريقة من خلال إعادة التشغيل.
ur: اس کورس کے دوبارہ چلانے کے لئے شناختی معلومات فراہم کریں. اصل کورس کسی بھی طرح سے دوبارہ چلانے سے متاثر نہیں ہوتا ہے.
zh_cn: 为此课程的重新运行提供识别信息。重新运行原始课程不会受到任何影响。

source: Press ESC then TAB or click outside of the code editor to exit
ar: اضغط على ESC ثم TAB أو انقر خارج محرر الرمز للخروج
ur: ای سی ایس تو پھر ٹیبی پر دبائیں یا باہر نکلنے کے لئے کوڈ ایڈیٹر کے باہر کلک کریں
zh_cn: 按ESC然后按TAB或在代码编辑器外单击退出

source: Added a reference to "%(att)s" from "%(art)s".
ar: تمت إضافة مرجع إلى &quot;٪ (att) s&quot; من &quot;٪ (art) s&quot;.
ur: &quot;٪ (آرٹ) کے&quot; سے &quot;٪ (att) s&quot; کا حوالہ دیا گیا.
zh_cn: 从“％（art）s”添加对“％（att）s”的引用。

source: Synchronize user profile data received from the identity provider with the edX user account on each SSO login. The user will be notified if the email address associated with their account is changed as a part of this synchronization.
ar: مزامنة بيانات ملف تعريف المستخدم التي تم استلامها من موفر الهوية مع حساب مستخدم edX على كل تسجيل دخول SSO. سيتم إشعار المستخدم إذا تم تغيير عنوان البريد الإلكتروني المرتبط بحسابه كجزء من هذه المزامنة.
ur: ہر ایس ایس او لاگ ان پر EDX صارف اکاؤنٹ کے ساتھ شناخت فراہم کنندہ سے موصول صارف پروفائل ڈیٹا مطابقت پذیری. اس مطابقت پذیری کے حصے کے طور پر صارف کو ان کے اکاؤنٹ سے منسلک ای میل ایڈریس تبدیل کردیا جائے گا.
zh_cn: 将身份提供者接收的用户个人资料数据与每个SSO登录中的edX用户帐户同步。作为此同步的一部分，如果与其帐户关联的电子邮件地址发生更改，用户将收到通知。

source: Your imported content has now been integrated into this course
ar: تم الآن دمج المحتوى الذي تم استيراده في هذه الدورة التدريبية
ur: آپ کی درآمد شدہ مواد اب اس کورس میں شامل ہو چکی ہے
zh_cn: 您导入的内容现已整合到此课程中

source: Click to add a new section
ar: انقر لإضافة قسم جديد
ur: نیا سیکشن شامل کرنے کے لئے کلک کریں
zh_cn: 点击添加一个新的部分

source: You can change sessions until {entitlement_expiration_date}.
ar: يمكنك تغيير الجلسات حتى {entitlement_expiration_date}.
ur: آپ {entitlement_expiration_date} تک سیشن تبدیل کرسکتے ہیں.
zh_cn: 您可以更改会话，直至{entitlement_expiration_date}。

source: Edit Start Date
ar: تحرير تاريخ البدء
ur: شروع کی تاریخ میں ترمیم کریں
zh_cn: 编辑开始日期

source: Show Percents
ar: عرض النسب المئوية
ur: پیسہ دکھائیں
zh_cn: 显示百分数

source: Don't forget, you have {time_remaining_string} left to upgrade to a Verified Certificate.
ar: لا تنس ، لديك {time_remaining_string} من اليسار للترقية إلى شهادة تم التحقق منها.
ur: مت بھولنا، آپ کے پاس {time_remaining_string} پاس ہے توثیق شدہ سرٹیفکیٹ میں اپ گریڈ کرنے کے لئے.
zh_cn: 别忘了，您还剩下{time_remaining_string}以升级到验证证书。

source: User {email} has registered but has not yet activated his/her account.
ar: سجل المستخدم {email} ولكنه لم يقم بعد بتنشيط حسابه.
ur: یوزر {ای میل} نے رجسٹرڈ کیا ہے لیکن ابھی تک ان کے اکاؤنٹ کو چالو نہیں کیا ہے.
zh_cn: 用户{email}已注册但尚未激活其帐户。

source: Details of the problem you are encountering{asterisk}
ar: تفاصيل المشكلة التي تواجهها {asterisk}
ur: اس مسئلے کی تفصیلات جسے آپ {اشارے)
zh_cn: 您遇到的问题的详细信息{星号}

source: This course is archived, which means you can review course content but it is no longer active.
ar: تمت أرشفة هذه الدورة التدريبية ، مما يعني أنه يمكنك مراجعة محتوى الدورة التدريبية ولكن لم يعد نشطًا.
ur: یہ کورس آرکائیو ہے، جس کا مطلب ہے کہ آپ کورس کے مواد کا جائزہ لے سکتے ہیں لیکن اب یہ فعال نہیں ہے.
zh_cn: 本课程已存档，这意味着您可以查看课程内容，但它不再有效。

source: We hope you are enjoying learning with us so far on <strong>%(platform_name)s</strong>! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable.
ar: نأمل أن تستمتع بالتعلم معنا حتى الآن على <strong>٪ (platform_name) s</strong> ! تتيح لك الشهادة التي تم التحقق منها إبراز معرفتك ومهاراتك الجديدة. شهادة٪ (platform_name) s رسمية ويمكن مشاركتها بسهولة.
ur: ہمیں امید ہے کہ آپ ابھی تک ہمارے ساتھ سیکھنے سے لطف اندوز کر رہے ہیں <strong>٪ (platform_name) s</strong> ! ایک تصدیق شدہ سرٹیفکیٹ آپ کو اپنے نئے علم اور مہارت کو اجاگر کرنے کی اجازت دیتا ہے. ایک٪ (پلیٹ فارم_ نام) سرٹیفکیٹ سرکاری اور آسانی سے مستحکم ہے.
zh_cn: 我们希望您在享受<strong>％（platform_name）的帮助的</strong>同时享受我们的学习！经过验证的证书可让您突出显示您的新知识和技能。 ％（platform_name）的证书是正式的，可以轻松共享。

source: Feb
ar: فبراير
ur: فروری
zh_cn: 二月

source: Calculate
ar: حساب
ur: شمار کریں
zh_cn: 计算

source: Entrance Exam - Subsection
ar: امتحان الدخول - قسم فرعي
ur: داخلہ امتحان - سبسکرائب
zh_cn: 入学考试 - 分部

source: Optional tag (eg "done" or "broken"):
ar: علامة اختيارية (مثل &quot;تم&quot; أو &quot;مكسورة&quot;):
ur: اختیاری ٹیگ (مثال کے طور پر &quot;کیا&quot; یا &quot;ٹوٹا ہوا&quot;):
zh_cn: 可选标签（例如“完成”或“破碎”）：

source: Ended - {date}
ar: انتهى - {date}
ur: ختم ہوگیا - {تاریخ}
zh_cn: 已结束 - {date}

source: Sailthru minutes to wait before sending abandoned cart message. Deprecated.
ar: Sailthru دقائق للانتظار قبل إرسال رسالة سلة المهجورة. إهمال.
ur: سیلوتو منٹ منقطع کی ٹوکری پیغام بھیجنے سے قبل انتظار کرنا. ناپسندی
zh_cn: 在发送放弃的购物车消息之前，等待几分钟。已过时。

source: Rescore
ur: ریورس

source: The following errors occurred while processing your registration:
ar: حدثت الأخطاء التالية أثناء معالجة تسجيلك:
ur: آپ کے رجسٹریشن کی پروسیسنگ کے دوران مندرجہ ذیل غلطیاں ہوئی ہیں:
zh_cn: 处理您的注册时发生以下错误：

source: Latest Update
ar: اخر تحديث
ur: تازہ ترین اپ ڈیٹ
zh_cn: 最新更新

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
ar: اسم المنظمة الراعية للدورة الجديدة. (غالباً ما يكون هذا الاسم هو نفس اسم المؤسسة الأصلي.)
ur: تنظیم کا نام نیا کورس اسپانسر کر رہا ہے. (یہ نام اصل تنظیم کا نام اکثر ہے.)
zh_cn: 赞助新课程的组织的名称。 （该名称通常与原始组织名称相同。）

source: Start Date:
ar: تاريخ البدء:
ur: شروع کرنے کی تاریخ:
zh_cn: 开始日期：

source: Course successfully exported to git repository
ar: تم تصدير الدورة بنجاح إلى مستودع git
ur: کورس کو کامیابی سے گیٹ ذخیرہ میں برآمد کیا گیا
zh_cn: 课程成功导出到git存储库

source: Enter the external login method students can use for the course.
ar: أدخل طريقة تسجيل الدخول الخارجية التي يمكن للطلاب استخدامها في الدورة التدريبية.
ur: بیرونی لاگ ان طریقہ کار درج کریں جن میں طالب علم کورس کے لئے استعمال کرسکتے ہیں.
zh_cn: 输入学生可以用于课程的外部登录方法。

source: Share on Twitter
ar: حصة على التغريد
ur: ٹویٹر پر اشتراک کریں
zh_cn: 分享到Twitter

source: There are three access roles for libraries: User, Staff, and Admin.
ar: هناك ثلاثة أدوار وصول للمكتبات: المستخدم والموظفون والمسؤول.
ur: لائبریریوں کے لئے تین تک رسائی رول ہیں: صارف، اسٹاف، اور ایڈمن.
zh_cn: 库有三种访问角色：用户，工作人员和管理员。

source: Setting {attribute} for user "{username}" to "{new_value}"
ar: تعيين {attribute} للمستخدم &quot;{username}&quot; إلى &quot;{new_value}&quot;
ur: صارف {{صارف کا نام} &quot;کیلئے&quot; {new_value} &quot;پر {خصوصیت} قائم کرنا
zh_cn: 将用户“{用户名}”的{属性}设置为“{新值}”

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
ar: يُعد {studio_name} أي شخص يرغب في إنشاء دورات تدريبية عبر الإنترنت تستفيد من النظام الأساسي {platform_name} على مستوى العالم. غالبًا ما يكون مستخدمونا أعضاء هيئة التدريس ، ومساعدي التدريس ، وموظفي الدورة التدريبية ، وأعضاء مجموعات التكنولوجيا التعليمية.
ur: {سٹوڈیو_ نام} ہر کسی کے لئے ہے جو آن لائن کورسز تخلیق کرنا چاہتا ہے جو عالمی {platform_name} پلیٹ فارم کو فائدہ پہنچاتا ہے. ہمارے صارفین اکثر فیکلٹی کے ارکان ہیں، اساتذہ اور کورس کے عملے، اور انسٹی ٹیوٹ ٹیکنالوجی گروپوں کے ارکان.
zh_cn: {studio_name}适用于任何想要创建利用全球{platform_name}平台的在线课程的人。我们的用户通常是教员，助教和课程人员，以及教学技术团队的成员。

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
ar: معرّفات موقع المكون لكافة مكونات المصدر التي يتم استخدامها لتحديد ما إذا كان المتعلم سيعرض محتوى هذه الوحدة الشرطية. انسخ معرّف موقع المكون لمكون من مربع حوار الإعدادات في Studio.
ur: تمام ذریعہ اجزاء کے اجزاء کی شناختی شناخت جو اس بات کا تعین کرنے کے لئے استعمال کیا جاتا ہے کہ سیکھنے والا اس مشروط ماڈیول کے مواد کو دکھایا جاتا ہے. سٹوڈیو میں اس ترتیبات کے ڈائیلاگ سے ایک جزو کا جزو کی جگہ کی شناخت کاپی کریں.
zh_cn: 所有源组件的组件位置ID用于确定学习者是否显示此条件模块的内容。从Studio的“设置”对话框中复制组件的组件位置标识。

source: Enter the source file name for LaTeX.
ar: أدخل اسم الملف المصدر لـ LaTeX.
ur: لاٹیکس کے لئے ذریعہ فائل کا نام درج کریں.
zh_cn: 输入LaTeX的源文件名称。

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
ar: يشير نظامنا إلى أنك تحاول الوصول إلى هذه الدورة التدريبية {platform_name} من بلد أو منطقة لا تتوفر فيها حاليًا.
ur: ہمارے نظام سے پتہ چلتا ہے کہ آپ کسی ایسے ملک یا علاقے سے اس {platform_name} کورس تک رسائی حاصل کرنے کی کوشش کررہے ہیں جس میں اس وقت دستیاب نہیں ہے.
zh_cn: 我们的系统表示您尝试从当前不可用的国家/地区访问此{platform_name}课程。

source: Must provide full name
ar: يجب توفير الاسم الكامل
ur: مکمل نام دینا ضروری ہے
zh_cn: 必须提供全名

source: Add Moderator
ar: أضف مشرف
ur: ماڈیولٹر شامل کریں
zh_cn: 添加版主

source: EdxNotes Service is unavailable. Please try again in a few minutes.
ar: خدمة EdxNotes غير متوفرة. يرجى المحاولة مرة أخرى في بضع دقائق.
ur: EdxNotes سروس دستیاب نہیں ہے. کچھ منٹ میں دوبارہ کوشش کریں.
zh_cn: EdxNotes服务不可用。请在几分钟后再试一次。

source: Error {err} in evaluating hint function {hintfn}.
ar: خطأ {خطأ} في تقييم وظيفة التلميح {hintfn}.
ur: غلطی {غلط} اشارہ تقریب {hintfn} کی تشخیص میں.
zh_cn: 评估提示函数{hintfn}时出错{err}。

source: Hide sequence content After Due Date
ar: إخفاء محتوى التسلسل بعد تاريخ الاستحقاق
ur: ترتیب تاریخ کے بعد ترتیب مواد چھپائیں
zh_cn: 在到期日后隐藏序列内容

source: Upgrade ({price})
ar: ترقية ({السعر})
ur: اپ گریڈ کریں ({قیمت})
zh_cn: 升级（{价格}）

source: Create Re-run
ar: إنشاء إعادة التشغيل
ur: دوبارہ چلائیں
zh_cn: 创建重新运行

source: {em_start}Caution{em_end}: {platform_name} recommends that you limit the file size to {em_start}10 MB{em_end}. In addition, do not upload video or audio files. You should use a third party service to host multimedia files.
ar: {em_start} تنبيه {em_end}: {platform_name} توصي بأن تحدّ حجم الملف إلى {em_start} 10 ميغابايت {em_end}. بالإضافة إلى ذلك ، لا تقم بتحميل ملفات الفيديو أو الصوت. يجب عليك استخدام خدمة طرف ثالث لاستضافة ملفات الوسائط المتعددة.
ur: {em_start} احتیاط {em_end}: {platform_name} کی تجویز ہے کہ آپ فائل کا سائز {em_start} 10 MB {em_end} پر محدود کریں. اس کے علاوہ، ویڈیو یا آڈیو فائلوں کو اپ لوڈ نہ کریں. ملٹی میڈیا فائلوں کی میزبانی کرنے کیلئے آپ کو تیسری پارٹی کی خدمت کا استعمال کرنا چاہئے.
zh_cn: {em_start}注意{em_end}：{platform_name}建议您将文件大小限制为{em_start} 10 MB {em_end}。另外，请勿上传视频或音频文件。您应该使用第三方服务来托管多媒体文件。

source: Brief summary of your question
ar: ملخص مختصر لسؤالك
ur: آپ کے سوال کا مختصر خلاصہ
zh_cn: 你的问题的小结

source: Enrollment data is now available in {dashboard_link}.
ar: بيانات التسجيل متاحة الآن في {dashboard_link}.
ur: اندراج کا ڈیٹا اب {dashboard_link} میں دستیاب ہے.
zh_cn: 注册数据现在可在{dashboard_link}中找到。

source: Full Name: {realname}
ar: الاسم الكامل: {realname}
ur: مکمل نام: {realname}
zh_cn: 全名：{真实姓名}

source: Delete User Results
ar: حذف نتائج المستخدم
ur: صارف کے نتائج حذف کریں
zh_cn: 删除用户结果

source: Initial title of the article. May be overridden with revision titles.
ar: العنوان الأولي للمقال. قد يتم تجاوز عناوين المراجعة.
ur: مضمون کا ابتدائی عنوان. نظر ثانی شدہ عنوانات کے ساتھ ختم ہوسکتا ہے.
zh_cn: 文章的初始标题。可能会被修订标题覆盖。

source: Disable the dynamic upgrade deadline for this course run.
ar: تعطيل الموعد النهائي للترقية الديناميكية لهذه الدورة التدريبية.
ur: اس کورس کے لئے متحرک اپ گریڈ کی تاریخ کو غیر فعال کریں.
zh_cn: 禁用此课程运行的动态升级截止日期。

source: Enrollment Track Groups
ar: مجموعات مسار التسجيل
ur: اندراج ٹریک گروپ
zh_cn: 注册轨道组

source: January
ar: كانون الثاني
ur: جنوری
zh_cn: 一月

source: Congratulations, you qualified for a certificate!
ar: تهانينا ، لقد تأهلت للحصول على شهادة!
ur: مبارک ہو، آپ ایک سرٹیفکیٹ کے لئے اہل ہیں!
zh_cn: 恭喜，你有资格获得证书！

source: {strong_start}Note{strong_end}: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
ar: {strong_start} ملاحظة {strong_end}: للحفاظ على أمان بيانات الطلاب ، لا يمكنك حفظ هذه الروابط أو إرسالها عبر البريد الإلكتروني للدخول المباشر. تنتهي صلاحية نسخ من الروابط في غضون 5 دقائق.
ur: {strong_start} نوٹ {strong_end}: طالب علم کے اعداد و شمار کو محفوظ رکھنے کے لۓ، آپ ان لنکس کو براہ راست رسائی تک رسائی یا ای میل نہیں کرسکتے ہیں. لنکس کی کاپیاں 5 منٹ کے اندر ختم ہو جاتی ہیں.
zh_cn: {strong_start}注{strong_end}：为保证学生数据安全，您无法保存或通过电子邮件发送这些链接以进行直接访问。链接副本在5分钟内过期。

source: Show Transcript
ar: إظهار النص
ur: ٹرانکرپٹ دکھائیں
zh_cn: 显示成绩单

source: Course Content (all Sections, Sub-sections, and Units)
ar: محتوى المقرر الدراسي (جميع الأقسام والأقسام الفرعية والوحدات)
ur: کورس کے مواد (تمام حصے، ذیلی سیکشن، اور یونٹس)
zh_cn: 课程内容（所有章节，小节和单元）

source: Students:
ar: الطلاب:
ur: طلباء:
zh_cn: 学生们：

source: The price per enrollment purchased
ar: السعر لكل التسجيل شراؤها
ur: فی شمولیت کی قیمت خریدی گئی
zh_cn: 每个注册的价格购买

source: Open Calculator
ar: افتح الحاسبة
ur: کھولیں کیلکولیٹر
zh_cn: 打开计算器

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
ar: القيمة التي يجب أن تطابقها السمة الشرطية لمكونات المصدر قبل أن يظهر المتعلم محتوى هذه الوحدة الشرطية.
ur: اس سیکشن کی ماڈیول کے مواد کو ظاہر کرنے سے پہلے سیکھنے والے اجزاء کی مشروط وصف اس قدر سے ملنے ضروری ہے.
zh_cn: 在学习者显示此条件模块的内容之前，源组件的条件属性必须匹配的值。

source: Additional Personal Information
ar: معلومات شخصية إضافية
ur: اضافی ذاتی معلومات
zh_cn: 额外的个人信息

source: Students rejected:
ar: رفض الطلاب:
ur: طالب علموں کو مسترد
zh_cn: 学生拒绝：

source: Explore courses
ar: استكشاف الدورات
ur: کورسز کا مطالعہ کریں
zh_cn: 探索课程

source: Your account activation is complete!
ar: اكتمل تفعيل حسابك!
ur: آپ کے اکاؤنٹ کی سرگرمی مکمل ہو چکی ہے!
zh_cn: 您的帐户激活已完成！

source: reset
ar: إعادة تعيين
ur: ری سیٹ کریں
zh_cn: 重启

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
ar: أسمح لـ edX باستخدام المعلومات المقدمة في هذا التطبيق (باستثناء المعلومات المالية) لأغراض التسويق عبر الإنترنت.
ur: میں EDX مارکیٹنگ مقاصد کے لئے اس درخواست میں فراہم کردہ معلومات (مالی معلومات کے سوا) استعمال کرنے کی اجازت دیتا ہوں.
zh_cn: 我允许edX使用此应用程序中提供的信息（财务信息除外）用于edX市场营销目的。

source: Preparing to start the export
ar: التحضير لبدء التصدير
ur: برآمد شروع کرنے کی تیاری
zh_cn: 准备开始导出

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
ar: اعمل بصريًا وانظر بالضبط ما سيراه الطلاب. إعادة تنظيم كل المحتوى الخاص بك مع السحب والإسقاط.
ur: بظاہر کام کریں اور اپنے طالب علموں کو دیکھیں گے بالکل وہی کام کریں. ڈریگ اور ڈراپ کے ساتھ آپ کے تمام مواد کو دوبارہ ترتیب دیں.
zh_cn: 直观地工作，看看你的学生会看到什么。通过拖放来重新组织所有内容。

source: Your other courses have not been affected.
ar: دوراتك الأخرى لم تتأثر.
ur: آپ کے دوسرے کورس متاثر نہیں ہوئے ہیں.
zh_cn: 你的其他课程没有受到影响。

source: type
ar: اكتب
ur: قسم
zh_cn: 类型

source: Information about all courses
ar: معلومات حول جميع الدورات
ur: تمام کورسوں کے بارے میں معلومات
zh_cn: 有关所有课程的信息

source: Could not enroll
ar: لا يمكن التسجيل
ur: اندراج نہیں کیا جا سکا
zh_cn: 无法注册

source: Name of the enrollment attribute
ar: اسم سمة التسجيل
ur: اندراج کی خاصیت کا نام
zh_cn: 注册属性的名称

source: Attempts
ar: محاولات
ur: کوششیں
zh_cn: 尝试

source: Dear [[Name]]
ar: عزيزي [[الاسم]]
ur: عزیز [[نام]]
zh_cn: 亲爱的[[姓名]]

source: The {em_start}{studio_name}{em_end} servers encountered an error
ar: واجهت خوادم {em_start} {studio_name} {em_end} خطأً
ur: {em_start} {studio_name} {em_end} سرورز نے ایک غلطی کا سامنا کیا
zh_cn: {em_start} {studio_name} {em_end}服务器遇到错误

source: If you are not redirected within 5 seconds, <a href="%(target)s">click here to go to the home page</a>.
ar: إذا لم تتم إعادة توجيهك خلال 5 ثوانٍ ، <a href="%(target)s">فانقر هنا للانتقال إلى الصفحة الرئيسية</a> .
ur: اگر آپ 5 سیکنڈ کے اندر ری ڈائریکٹ نہیں کر رہے ہیں تو، <a href="%(target)s">یہاں کلک کریں ہوم پیج پر جانے کے لئے</a> .
zh_cn: 如果您未在5秒内重定向， <a href="%(target)s">请点击此处转至主页</a> 。
