Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Export Course to Git
ar: دورة تصدير لجيت
ur: گٹ میں ایکسپورٹ کورس
zh_cn: 将课程导出到Git

source: New Course
ar: دورة جديدة
ur: نیا کورس
zh_cn: 新课程

source: You add sections, subsections, and units directly in the outline.
ar: يمكنك إضافة أقسام وأقسام فرعية ووحدات مباشرة في المخطط التفصيلي.
ur: آپ براہ راست اس لائن میں حصوں، ضمنی حصے اور یونٹس شامل ہیں.
zh_cn: 您可以直接在大纲中添加章节，小节和单位。

source: ^ (raise to a power)
ar: ^ (رفع إلى قوة)
ur: ^ (اقتدار میں اضافہ)
zh_cn: ^（提高权力）

source: Myself
ar: نفسي
ur: خود
zh_cn: 我

source: Could not index item: {}
ar: تعذر فهرسة العنصر: {}
ur: انڈیکس آئٹم نہیں کر سکا: {}
zh_cn: 无法索引项目：{}

source: Added Course
ar: الدورة المضافة
ur: شامل کردہ کورس
zh_cn: 新增课程

source: The course to which this rule applies.
ar: الدورة التي تنطبق عليها هذه القاعدة.
ur: اس اصول پر لاگو ہوتا ہے کورس.
zh_cn: 此规则适用的课程。

source: Welcome {username}! Please set your preferences below
ar: مرحبًا {اسم المستخدم}! يرجى ضبط تفضيلاتك أدناه
ur: خوش آمدید {صارف کا نام}! برائے مہربانی ذیل میں اپنی ترجیحات مقرر کریں
zh_cn: 欢迎{username}！请在下面设置您的偏好

source: Admin
ar: مشرف
ur: ایڈمن
zh_cn: 管理员

source: Enable CCX
ar: تمكين CCX
ur: CCX کو فعال کریں
zh_cn: 启用CCX

source: Thu
ar: جمع
ur: جمعرات
zh_cn: 集

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
ar: تتيح لك مجموعات مسارات التسجيل إمكانية تقديم محتوى الدورة التدريبية المختلفة للمتعلمين في كل مسار تسجيل. يتم تضمين المتعلمين المسجلين في كل مسار تسجيل في الدورة التدريبية الخاصة بك تلقائيًا في مجموعة مسار تسجيل المقابلة.
ur: اندراج ٹریک گروپ آپ کو ہر داخلہ ٹریک میں سیکھنے والوں کے لئے مختلف کورس کے مواد پیش کرنے کی اجازت دیتا ہے. آپ کے کورس میں ہر داخلہ ٹریک میں داخل ہونے والے قارئین نے خود داخلہ کے اندراج ٹریک گروپ میں شامل کیے ہیں.
zh_cn: 注册轨道组允许您为每个注册轨道上的学习者提供不同的课程内容。注册入读课程中的每个注册课程的学员都会自动包含在相应的注册课程组中。

source: Date this schedule went into effect
ar: تاريخ دخل هذا الجدول حيز التنفيذ
ur: اس شیڈول کا اثر اثر میں آیا
zh_cn: 此日程安排生效日期

source: password: {password}
ar: كلمة المرور: {password}
ur: پاس ورڈ: {پاس ورڈ}
zh_cn: 密码：{密码}

source: If this option is {em_start}checked{em_end}, users who have not enrolled in your course will be automatically enrolled.
ar: إذا كان هذا الخيار {em_start} محددًا {em_end} ، فسيتم تلقائيًا تسجيل المستخدمين غير المسجلين في الدورة التدريبية الخاصة بك.
ur: اگر یہ اختیار {em_start} کی جانچ پڑتال {em_end} ہے تو، آپ کے کورس میں داخل ہونے والے صارفین کو خود بخود اندراج کیا جائے گا.
zh_cn: 如果此选项已被{em_start}选中{em_end}，那么尚未注册课程的用户将自动注册。

source: Course Schedule
ar: الجدول الدراسي
ur: کورس شیڈول
zh_cn: 课程时间表

source: {course_number} Progress
ar: {course_number} التقدم
ur: {کورس_ نمبر} پیش رفت
zh_cn: {course_number}进度

source: We're Sorry, {platform_name} accounts are unavailable currently
ar: عذرًا ، حسابات {platform_name} غير متوفرة حاليًا
ur: ہم معذرت کر رہے ہیں، {platform_name} اکاؤنٹس فی الحال دستیاب نہیں ہیں
zh_cn: 很抱歉，{platform_name}帐户目前无法使用

source: Invalid card verification number. Possible fix: retry with another form of payment
ar: رقم التحقق من البطاقة غير صالح. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: غلط کارڈ کی توثیق نمبر. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 无效的卡验证号码。可能的解决方法：使用其他付款方式重试

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
ar: {screen_reader_start} تحذير: {screen_reader_end} تم إخفاء الوحدة التي تحتوي على هذا المكون من المتعلمين. يتجاوز إعداد الوحدة إعدادات الوصول للمكون المعرّفة هنا.
ur: {screen_reader_start} انتباہ: {screen_reader_end} اس اجزاء پر مشتمل ہے جس میں اس سیکشن کو سیکھنے والوں سے پوشیدہ ہے. یونٹ کی ترتیب یہاں وضاحت کی جزو رسائی کی ترتیبات پر قبضہ کرتی ہے.
zh_cn: {screen_reader_start}警告：{screen_reader_end}包含此组件的单位对学习者是隐藏的。单位设置将覆盖此处定义的组件访问设置。

source: Could not interpret '{student_answer}' as a number.
ar: لا يمكن تفسير &quot;{student_answer}&quot; كرقم.
ur: &#39;{student_answer}&#39; کی ایک بڑی تعداد کی تشریح نہیں کر سکی.
zh_cn: 无法将“{student_answer}”解读为数字。

source: Professional education modes are not allowed to have expiration_datetime set.
ar: لا يُسمح باستخدام أوضاع التعليم الاحترافية في تعيين expiration_datetime.
ur: پیشہ ورانہ تعلیم کے طریقوں کو ختم ہونے کا وقت ختم کرنے کی اجازت نہیں ہے.
zh_cn: 专业教育模式不允许设置expiration_datetime。

source: Restore
ar: استعادة
ur: بحال کریں
zh_cn: 恢复

source: Content module identifier (location) of entrance exam.
ar: معرف وحدة المحتوى (الموقع) لامتحان القبول.
ur: داخلی امتحان کے مواد ماڈیول شناخت کنندہ (مقام).
zh_cn: 内容模块标识符（位置）入学考试。

source: Entrance Exam Enabled
ar: امتحان الدخول ممكن
ur: داخلہ امتحان فعال
zh_cn: 入学考试已启用

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
ar: حدد القيمة الافتراضية لمعدل عشوائية قيم المتغير في المشكلة. يجب تعيين هذا الإعداد على &quot;أبدًا&quot; ما لم تكن تخطط لتوفير نص برمجي Python لتعريف القيم بشكل عشوائي في معظم المشاكل في الدورة التدريبية الخاصة بك. القيم الصالحة هي &quot;always&quot; و &quot;onreset&quot; و &quot;never&quot; و &quot;per_student&quot;.
ur: ایک مسئلہ میں متغیر اقدار کتنی بار بے ترتیب ہیں کے لئے ڈیفالٹ کی وضاحت کریں. یہ ترتیب &quot;کبھی نہیں&quot; کے لئے مقرر کیا جاسکتا ہے جب تک کہ آپ اپنے کورس کے زیادہ تر مسائل میں اقدار کی شناخت اور بے ترتیب کرنے کے لئے پطران کی سکرپٹ فراہم کرنے کی منصوبہ بندی نہ کریں. درست اقدار &quot;ہمیشہ&quot;، &quot;آن لائن&quot;، &quot;کبھی نہیں&quot;، اور &quot;per_student&quot; ہیں.
zh_cn: 指定问题中变量值随机化的默认值。除非您计划提供Python脚本以识别课程中大多数问题的值并对其进行随机化，否则应将该设置设置为“从不”。有效值为“始终”，“重置”，“从不”和“per_student”。

source: User:
ar: المستعمل:
ur: صارف:
zh_cn: 用户：

source: partially correct
ar: صحيح جزئيا
ur: جزوی طور پر صحیح
zh_cn: 部分正确

source: Enter the method by which this course is edited ("XML" or "Studio").
ar: أدخل الطريقة التي يتم بها تحرير هذه الدورة التدريبية (&quot;XML&quot; أو &quot;Studio&quot;).
ur: اس طریقہ کو درج کریں جس کے ذریعے یہ کورس ترمیم کیا جاتا ہے (&quot;XML&quot; یا &quot;سٹوڈیو&quot;).
zh_cn: 输入编辑本课程的方法（“XML”或“Studio”）。

source: This component does not support score override.
ar: هذا المكون لا يدعم تجاوز النقاط.
ur: یہ اجزاء سکور اوورائڈ کی حمایت نہیں کرتا.
zh_cn: 该组件不支持分数覆盖。

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day, Monday to Friday. In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
ar: شكرا لاستفسارك أو ملاحظاتك. نستجيب عادةً لطلب ما خلال يوم عمل واحد ، من الاثنين إلى الجمعة. في غضون ذلك ، يرجى مراجعة {link_start} الأسئلة الشائعة المفصلة {link_end} حيث تم الإجابة على معظم الأسئلة.
ur: آپ کی انکوائری یا رائے کے لئے آپ کا شکریہ. ہم عام طور پر ایک کاروباری دن کے اندر پیر سے جمعہ کو ایک درخواست کا جواب دیتے ہیں. اس دوران، براہ کرم ہماری {link_start} تفصیلی سوالات {link_end} کا جائزہ لیں جہاں سب سے زیادہ سوالات پہلے ہی جواب دیا گیا ہے.
zh_cn: 感谢您的询问或反馈。我们通常会在周一至周五的一个工作日内回复请求。与此同时，请查看我们的{link_start}详细常见问题解答{link_end}，其中大部分问题已经得到解答。

source: The external source URL for the video.
ar: عنوان URL المصدر الخارجي للفيديو.
ur: ویڈیو کے لئے بیرونی ذریعہ URL.
zh_cn: 视频的外部来源网址。

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
ar: يمكنك تصدير الدورات التدريبية وتعديلها خارج {studio_name}. الملف الذي تم تصديره هو ملف .tar.gz (أي ، ملف .tar مضغوط مع GNU Zip) يحتوي على بنية الدورة التدريبية والمحتوى. يمكنك أيضًا إعادة استيراد الدورات التي قمت بتصديرها.
ur: آپ کورسز برآمد کر سکتے ہیں اور انہیں {سٹوڈیو_ نام} سے باہر لے سکتے ہیں. برآمد شدہ فائل ایک .tt.gz فائل ہے (یہ، جی این یو زپ کے ساتھ ایک .ٹار فائل کمپریسڈ ہے) جس میں کورس کی ساخت اور مواد شامل ہے. آپ بھی برآمد کردہ کورسوں کو دوبارہ درآمد کرسکتے ہیں.
zh_cn: 您可以导出课程并在{studio_name}之外编辑它们。导出的文件是一个.tar.gz文件（即用GNU Zip压缩的.tar文件），其中包含课程结构和内容。您也可以重新导入您导出的课程。

source: Number of Enrollment Refunds
ar: عدد مرات استرداد التسجيل
ur: اندراج کی واپسی کی تعداد
zh_cn: 登记退款数量

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ar: حقل اسم المستخدم / البريد الإلكتروني للطلاب مطلوب ولا يمكن أن يكون فارغًا. يرجى تعبئة اسم المستخدم / البريد الإلكتروني ثم الضغط على زر &quot;إضافة إلى قائمة الاستثناءات&quot;.
ur: طالب علم کا صارف نام / ای میل فیلڈ کی ضرورت ہے اور خالی نہیں ہوسکتی ہے. برائے مہربانی صارف نام / ای میل درج کریں اور پھر &quot;استثنائی فہرست میں شامل کریں&quot; کے بٹن کو دبائیں.
zh_cn: 学生用户名/电子邮件字段是必填字段，不能为空。请填写用户名/电子邮件，然后按“添加到例外列表”按钮。

source: Enable video auto-advance
ar: تمكين تقدم الفيديو التلقائي
ur: ویڈیو آٹو پیش رفت کو فعال کریں
zh_cn: 启用视频自动前进

source: Go to %(platform_name)s Home Page
ar: انتقل إلى٪ (platform_name) s الصفحة الرئيسية
ur: ٪ (platform_name) کے ہوم پیج پر جائیں
zh_cn: 转到％（platform_name）的主页

source: Course Id
ar: معرف بالطبع
ur: کورس کی شناخت
zh_cn: 课程ID

source: Download CSV Data
ar: تنزيل بيانات CSV
ur: CSV ڈیٹا ڈاؤن لوڈ کریں
zh_cn: 下载CSV数据

source: Problem Type
ar: نوع المشكلة
ur: مسئلہ کی قسم
zh_cn: 问题类型

source: Download video file
ar: تنزيل ملف الفيديو
ur: ویڈیو فائل ڈاؤن لوڈ کریں
zh_cn: 下载视频文件

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
ar: يمكن ربط كل مجموعة محتوى تقوم بإنشائها بفوج واحد أو أكثر. بالإضافة إلى إتاحة محتوى الدورة لجميع المتعلمين ، يمكنك تقييد الوصول إلى بعض المحتوى للمتعلمين في مجموعات محتوى محددة. لا يرى سوى المتعلمين في المجموعات النموذجية المرتبطة بمجموعات المحتوى المحددة المحتوى الإضافي.
ur: ہر مواد کے گروپ جسے آپ تخلیق کرتے ہیں ایک یا زیادہ سے زیادہ کوہٹ سے منسلک کیا جا سکتا ہے. تمام سیکھنے والوں کے لئے دستیاب کورس مواد بنانے کے علاوہ، آپ مخصوص مواد گروپوں میں سیکھنے والوں کو کچھ مواد تک رسائی محدود کرسکتے ہیں. صرف نصاب میں سیکھنے والے ہیں جو مخصوص مواد گروپ کے ساتھ منسلک ہیں اضافی مواد کو دیکھتے ہیں.
zh_cn: 您创建的每个内容组都可以与一个或多个群组相关联。除了为所有学员提供课程内容之外，您还可以限制某些内容向特定内容组中的学习者访问。只有与指定内容组相关的群组中的学习者才能看到额外的内容。

source: Date that this problem is due by
ar: تاريخ هذه المشكلة بسبب
ur: اس مسئلہ کی وجہ سے اس کی تاریخ ہے
zh_cn: 此问题到期的日期

source: all_students and delete_module are mutually exclusive.
ar: all_students و delete_module متبادلان.
ur: all_students اور حذف_module متعدد خصوصی ہیں.
zh_cn: all_students和delete_module是互斥的。

source: API Access
ar: الوصول إلى واجهة برمجة التطبيقات
ur: API رسائی
zh_cn: API访问

source: Photo ID image is required if the user does not have an initial verification attempt.
ar: مطلوب صورة معرف الصورة إذا لم يكن لدى المستخدم محاولة التحقق الأولية.
ur: صارف کی ابتدائی توثیق کی کوشش نہیں ہے تو تصویر کی تصویر کی تصویر کی ضرورت ہوتی ہے.
zh_cn: 如果用户没有初始验证尝试，则需要照片ID图像。

source: Download transcript
ar: تنزيل نسخة
ur: نقل ڈاؤن لوڈ کریں
zh_cn: 下载成绩单

source: Language preference
ar: تفضيل اللغات
ur: زبان کی ترجیحات
zh_cn: 语言首选项

source: Compressing the exported data and preparing it for download
ar: ضغط البيانات المصدرة وإعدادها للتنزيل
ur: برآمد کردہ اعداد و شمار کو کمپریس کرنا اور اسے ڈاؤن لوڈ کرنے کیلئے تیار کرنا
zh_cn: 压缩导出的数据并准备下载

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
ar: إذا تم تمكين المشاركة الاجتماعية في لوحة المعلومات وعناوين URL المخصصة للدورات التدريبية ، يمكنك توفير عنوان URL (مثل عنوان URL لدورة تدريبية حول الصفحة) يمكن لمواقع الشبكات الاجتماعية الارتباط به. يجب أن تكون عناوين URL مؤهلة تمامًا. على سبيل المثال: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
ur: اگر ڈیش بورڈ سماجی اشتراک اور اپنی مرضی کے مطابق کورس کے URL کو فعال کیا جاتا ہے تو، آپ یو آر ایل فراہم کرسکتے ہیں (جیسا کہ صفحہ کے بارے میں کورس کے URL) کہ سوشل میڈیا سائٹس سے رابطہ کرسکتے ہیں. یو آر ایل کو مکمل طور پر قابل ہونا ضروری ہے. مثال کے طور پر: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
zh_cn: 如果启用了仪表板社交分享和自定义课程网址，则可以提供社交媒体网站可以链接到的URL（例如课程关于页面的URL）。网址必须完全合格。例如：http://www.edx.org/course/Introduction-to-MOOCs-ITM001

source: Course Chrome
ar: الدورة التدريبية Chrome
ur: کورس کروم
zh_cn: 课程Chrome

source: Proctored Exam {number}
ar: امتحان بروكتيد {number}
ur: پروجیکٹ کردہ امتحان {نمبر}
zh_cn: 监考考试{编号}

source: The number of text boxes available for learners to add words and sentences.
ar: عدد مربعات النص المتاحة للمتعلمين لإضافة كلمات وجمل.
ur: الفاظ اور جملے کو شامل کرنے کے لئے سیکھنے والوں کے لئے دستیاب متن خانوں کی تعداد.
zh_cn: 可供学习者添加单词和句子的文本框数量。

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
ar: اسمح للطلاب بتنزيل النسخة المحددة من الوقت. يظهر رابط لتنزيل الملف أسفل الفيديو. بشكل افتراضي ، يكون النص هو ملف .srt أو .txt. إذا كنت تريد توفير النص للتنزيل بتنسيق مختلف ، فقم بتحميل ملف باستخدام حقل تحميل البيان.
ur: طالب علموں کو ٹائم ٹرانزیکشن ڈاؤن لوڈ کرنے کی اجازت دیں. فائل ڈاؤن لوڈ کرنے کا ایک لنک ویڈیو کے نیچے ظاہر ہوتا ہے. پہلے سے طے شدہ طور پر، نقل ایک ایس ایس آر یا. TX فائل ہے. اگر آپ مختلف شکل میں ڈاؤن لوڈ کرنے کے لئے ٹرانسمیشن مہیا کرنا چاہتے ہیں، اپ لوڈ ہینڈ آؤٹ فیلڈ کا استعمال کرتے ہوئے ایک فائل اپ لوڈ کریں.
zh_cn: 允许学生下载计时记录。视频下方会显示下载文件的链接。默认情况下，脚本是一个.srt或.txt文件。如果您想以不同的格式提供下载文字，请使用“上传手册”字段上传文件。

source: Library is invalid, corrupt, or has been deleted.
ar: المكتبة غير صالحة أو تالفة أو تم حذفها.
ur: لائبریری غلط ہے، خراب، یا خارج کر دیا گیا ہے.
zh_cn: 库无效，损坏或已被删除。

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: لا تفوت الفرصة لتسليط الضوء على معرفتك ومهاراتك الجديدة من خلال الحصول على شهادة تم التحقق منها. الترقية بواسطة٪ (user_schedule_upgrade_deadline_time) s.
ur: تصدیق شدہ سرٹیفکیٹ حاصل کرکے اپنے نئے علم اور مہارت کو اجاگر کرنے کا موقع مت چھوڑیں. ٪ (user_schedule_upgrade_deadline_time) کی طرف سے اپ گریڈ کریں.
zh_cn: 千万不要错过这个机会，通过获得经过验证的证书来突出您的新知识和技能。通过％（user_schedule_upgrade_deadline_time）进行升级。

source: Optional, for older browsers: the YouTube ID for the normal speed video.
ar: اختياري ، للمتصفحات القديمة: معرف YouTube لفيديو السرعة العادي.
ur: اختیاری، پرانے براؤزرز کیلئے: عام رفتار ویڈیو کیلئے یو ٹیوب ID.
zh_cn: 可选，适用于旧版浏览器：正常速度视频的YouTube ID。

source: You are now eligible for credit from {provider}. Congratulations!
ar: أنت الآن مؤهل للحصول على ائتمان من {provider}. تهانينا!
ur: اب آپ {فراہم کنندہ} سے کریڈٹ کے اہل ہیں. مبارک ہو!
zh_cn: 您现在有资格从{provider}获得信用。恭喜！

source: This group no longer exists. Choose another group or remove the access restriction.
ar: هذه المجموعة لم تعد موجودة. اختر مجموعة أخرى أو قم بإزالة تقييد الوصول.
ur: یہ گروپ اب موجود نہیں ہے. کسی دوسرے گروپ کا انتخاب کریں یا رسائی کی پابندی کو ہٹا دیں.
zh_cn: 该组不再存在。选择另一个组或删除访问限制。

source: Decimals
ar: الكسور العشرية
ur: بیج
zh_cn: 小数点

source: Instructors
ar: المدربين
ur: ہدایات
zh_cn: 教师

source: Change the status of an enrollment code.
ar: تغيير حالة رمز التسجيل.
ur: داخلہ کوڈ کا درجہ تبدیل کریں.
zh_cn: 更改注册码的状态。

source: Details &amp; Schedule
ar: التفاصيل والجدول الزمني
ur: تفصیلات اور شیڈول
zh_cn: 细节和时间表

source: Follow {platform_name} on LinkedIn
ar: اتبع {platform_name} على LinkedIn
ur: LinkedIn پر {platform_name} کو فالو کریں
zh_cn: 关注LinkedIn上的{platform_name}

source: must contain {0} or more digits
ar: يجب أن تحتوي على {0} أو أكثر من الأرقام
ur: {0} یا زیادہ ہندسوں پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多数字

source: Notifications
ar: إخطارات
ur: اطلاعات
zh_cn: 通知

source: Times Used
ar: تايمز المستخدمة
ur: استعمال کیا ٹائمز
zh_cn: 使用次数

source: Upload File
ar: رفع ملف
ur: اپ لوڈ فائل
zh_cn: 上传文件

source: Select True if this component will receive a numerical score from the external LTI system.
ar: حدد True إذا حصل هذا المكون على نتيجة رقمية من نظام LTI الخارجي.
ur: سچ کا انتخاب کریں اگر یہ جزو بیرونی LTI نظام سے عددی سکور حاصل کرے گا.
zh_cn: 如果此组件将从外部LTI系统接收数字分数，请选择True。

source: Name of the credit provider displayed to users
ar: اسم مقدم الائتمان المعروض للمستخدمين
ur: صارفین کو ظاہر کردہ کریڈٹ فراہم کنندہ کا نام
zh_cn: 向用户显示的信用提供商的名称

source: {num_minute} minute
ar: دقائق
ur: {منٹ} منٹ
zh_cn: {分钟}分钟

source: Each revision contains a title field that must be filled out, even if the title has not changed
ar: تحتوي كل مراجعة على حقل عنوان يجب ملؤه ، حتى إذا لم يتغير العنوان
ur: ہر نظر ثانی میں ایک عنوان فیلڈ شامل ہے جو بھرا ہوا ہوگا، یہاں تک کہ اگر عنوان تبدیل نہ ہو
zh_cn: 每个修订包含必须填写的标题字段，即使标题未更改

source: Course Duration
ar: مدة الدورة
ur: کورس دورانیہ
zh_cn: 课程时间

source: Image data is not valid.
ar: بيانات الصورة غير صالحة.
ur: تصویری ڈیٹا درست نہیں ہے.
zh_cn: 图像数据无效。

source: Could not find problem with this location.
ar: لا يمكن العثور على مشكلة مع هذا الموقع.
ur: اس مقام کے ساتھ مسئلہ نہیں مل سکا.
zh_cn: 无法找到此位置的问题。

source: Course Run
ar: دورة تشغيل
ur: کورس چلائیں
zh_cn: 课程运行

source: Grant Access to This Library
ar: منح الوصول إلى هذه المكتبة
ur: اس لائبریری میں رسائی حاصل کریں
zh_cn: 授予对此库的访问权限

source: No parsable task_output information found for instructor_task {0}: {1}
ar: لم يتم العثور على معلومات task_out parsable parsable لـ instructor_task {0}: {1}
ur: {0}: {1} انسٹرکٹر_ٹاس کے لئے پائیدار کام_ آؤٹ پٹ کی معلومات نہیں ملی.
zh_cn: 找不到用于instructor_task {0}的可分析task_output信息：{1}

source: A transcript file is required.
ar: ملف النص مطلوب.
ur: ایک نقل فائل کی ضرورت ہے.
zh_cn: 成绩单文件是必需的。

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
ar: أنت تقر وتوافق على أن واجهات برمجة التطبيقات وكل محتوى واجهة برمجة التطبيقات تحتوي على حقوق ملكية فكرية قيمة لـ {platform_name} وشركائها. إن واجهات برمجة التطبيقات وكل محتوى واجهة برمجة التطبيقات محمية بموجب قوانين حقوق الطبع والنشر والعلامات التجارية والقوانين الأجنبية للولايات المتحدة الأمريكية. جميع الحقوق في واجهات برمجة التطبيقات ومحتوى واجهة برمجة التطبيقات ، إذا لم يتم منحها صراحة ، محجوزة. باستخدام واجهات برمجة التطبيقات أو أي محتوى واجهة برمجة التطبيقات ، لا تحصل على ملكية أي حقوق في واجهات برمجة التطبيقات أو محتوى واجهة برمجة التطبيقات. يجب عدم المطالبة أو محاولة المطالبة بالملكية في واجهات برمجة التطبيقات أو أي محتوى من واجهات برمجة التطبيقات أو تقديم نفسك أو شركتك أو تطبيقك كمصدر لأي محتوى من واجهات برمجة التطبيقات. لا يجوز لك تعديل أو إنشاء أعمال مشتقة من أو محاولة استخدام ، أو بأي شكل من الأشكال استغلال أي من محتوى واجهة برمجة التطبيقات كليًا أو جزئيًا نيابة عنك أو نيابة عن أي جهة خارجية. لا يجوز لك توزيع أو تعديل واجهات برمجة التطبيقات أو أي محتوى لواجهة برمجة التطبيقات (بما في ذلك التكييف أو التحرير أو المقتطفات أو إنشاء أعمال مشتقة).
ur: آپ تسلیم کرتے ہیں اور اس بات سے اتفاق کرتے ہیں کہ اے پی پی اور تمام API کے مواد {platform_name} اور اس کے شراکت داروں کے قیمتی دانشورانہ اثاثے پر مشتمل ہیں. APIs اور تمام API کے مواد کو امریکہ کی طرف سے محفوظ کیا جاتا ہے اور غیر ملکی کاپی رائٹ، ٹریڈ مارک، اور دیگر قوانین. APIs اور API کے مواد میں تمام حقوق، اگر واضح طور پر نہیں دی جاتی ہے تو محفوظ ہیں. APIs یا کسی بھی API کے مواد کو استعمال کرتے ہوئے، آپ APIs یا API مواد میں کسی بھی حقوق کی ملکیت حاصل نہیں کرتے ہیں. آپ کو اے پی پی یا کسی بھی API کے مواد میں مالکیت کا دعوی کرنے یا اپنے آپ کی آپ کی کمپنی یا آپ کے ایپلی کیشنز کو کسی بھی API کے مواد کے ذریعہ غلط کرنے کی دعوی نہیں کرنا چاہئے. آپ ترمیم نہیں کرسکتے ہیں، ڈیوکیٹک کام بنانا، استعمال کرنے، لائسنس، یا کسی بھی طریقے سے کسی بھی API کے مواد کو مکمل طور پر یا آپ کی اپنی جانب سے یا کسی تیسری پارٹی کی طرف سے حصہ لینے کا استحصال کرسکتے ہیں. آپ API یا کسی بھی API کے مواد کو تقسیم یا ترمیم نہیں کرسکتے ہیں (بشمول موافقت، ایڈیٹنگ، اقتباس، یا ڈیویوئیلو کام).
zh_cn: 您承认并同意，API和所有API内容均包含{platform_name}及其合作伙伴的宝贵知识产权。 API和所有API内容受美国和外国版权，商标和其他法律的保护。 API和API内容的所有权利（如果未明确授予的话）都保留。通过使用API​​或任何API内容，您不会获得API或API内容中的任何权利的所有权。您不得声明或试图声明API或任何API内容的所有权，或将您自己或您的公司或您的应用程序歪曲为任何API内容的来源。您不得修改，创建衍生作品或尝试使用许可，或以任何方式全部或部分地以您自己的名义或代表任何第三方利用任何API内容。您不得分发或修改API或任何API内容（包括改编，编辑，摘录或创建衍生作品）。

source: Download a .csv file of all used enrollment codes for this course.
ar: قم بتنزيل ملف .csv لجميع رموز التسجيل المستخدمة لهذه الدورة التدريبية.
ur: اس کورس کے لئے تمام استعمال کردہ اندراج کوڈوں کے ایک .csv فائل کو ڈاؤن لوڈ کریں.
zh_cn: 下载本课程所有使用的注册码的.csv文件。

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
ar: (4) يجب أن تكون قادرًا على النقر على زر &quot;عرض الدورة التدريبية&quot; أو الاطلاع على الدورة التدريبية على لوحة معلومات الطلاب على العنوان {url}
ur: (4) آپ کو &#39;نقطہ نظر&#39; کے بٹن پر کلک کرنے کے قابل ہونا چاہئے یا اپنے کورس کو اپنے طالب علم ڈیش بورڈ پر {url} پر دیکھیں.
zh_cn: （4）您应该可以点击“查看课程”按钮或在{url}的学生信息中心查看您的课程

source: Notes
ar: ملاحظات
ur: نوٹس
zh_cn: 笔记

source: Please Enter the Coupon Discount Value Less than or Equal to 100
ar: الرجاء إدخال قيمة خصم القسيمة أقل من أو تساوي 100
ur: براہ کرم کوپن ڈسکاؤنٹ قیمت کم سے کم یا 100 سے مساوات درج کریں
zh_cn: 请输入优惠券折扣值小于或等于100

source: Value
ar: القيمة
ur: قدر
zh_cn: 值

source: Fulfilled Time:
ar: وقت الوفاء:
ur: مکمل وقت:
zh_cn: 达成时间：

source: The enrollment code ({code}) was not found for the {course_name} course.
ar: لم يتم العثور على رمز التسجيل ({code}) لدورة {course_name}.
ur: {course_name} کورس کے لئے داخلہ کوڈ ({کوڈ}) نہیں ملا.
zh_cn: 找不到{course_name}课程的注册码（{code}）。

source: The file must contain a 'cohort' column containing cohort names.
ar: يجب أن يحتوي الملف على عمود &quot;المجموعة النموذجية&quot; الذي يحتوي على أسماء المجموعات النموذجية.
ur: اس فائل میں &#39;کوہوٹ&#39; کالم پر مشتمل ہونا چاہئے جس میں کوہوٹر کے نام شامل ہیں.
zh_cn: 该文件必须包含包含队列名称的“队列”列。

source: Brief description of your suggestion
ar: وصف موجز لاقتراحك
ur: آپ کی تجویز کا مختصر بیان
zh_cn: 简要说明你的建议

source: Reload Graphs
ar: تحديث الرسوم البيانية
ur: گرافکس دوبارہ لوڈ کریں
zh_cn: 重新载入图表

source: Verification Submitted
ar: التحقق المقدمة
ur: تصدیق کی گئی
zh_cn: 验证已提交

source: Show Email Task History
ar: إظهار سجل مهام البريد الإلكتروني
ur: ای میل ٹاسک تاریخ دکھائیں
zh_cn: 显示电子邮件任务历史

source: Checking this box has no effect if 'Unenroll' is selected.
ar: لا يؤثر تحديد هذا المربع في حالة تحديد &quot;إلغاء التسجيل&quot;.
ur: اگر اس باکس کی جانچ پڑتال کا انتخاب نہیں کیا جاتا ہے تو اس باکس کو کوئی اثر نہیں پڑتا ہے.
zh_cn: 如果选择了“取消注册”，则选中此框无效。

source: Learning Outcomes
ar: نتائج التعلم
ur: تدریسی نتائج
zh_cn: 学习成果
