Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: You agree to comply with all applicable law, regulation, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or yourApplication's identity when using the APIs.
ar: أنت توافق على الامتثال لجميع القوانين واللوائح المعمول بها وحقوق الطرف الثالث (بما في ذلك على سبيل المثال لا الحصر القوانين المتعلقة باستيراد أو تصدير البيانات أو البرامج ، والخصوصية ، وحقوق النشر ، والقوانين المحلية). لن تستخدم واجهات برمجة التطبيقات لتشجيع أو الترويج للنشاط غير القانوني أو الانتهاك لحقوق الطرف الثالث. لن تنتهك أي بنود خدمة أخرى مع {platform_name}. ستتمكن فقط من الوصول (أو محاولة الوصول) إلى واجهة برمجة التطبيقات (API) بالوسائل الموضحة في وثائق API. لن تحرف أو تخفي هويتك أو هوية تطبيقك عند استخدام واجهات برمجة التطبيقات.
ur: آپ تمام قابل اطلاق قانون، ریگولیٹری، اور تیسری پارٹی کے حقوق (بشمول ڈیٹا یا سافٹ ویئر کی درآمد یا برآمد، رازداری، کاپی رائٹ، اور مقامی قوانین) کے بغیر پابندیوں کے قوانین پر عمل کرنے پر متفق ہیں. آپ API کا استعمال غیر قانونی سرگرمی یا تیسری پارٹی کے حقوق کی خلاف ورزی کی حوصلہ افزائی یا فروغ دینے کے لئے نہیں کریں گے. آپ {platform_name} کے ساتھ کسی دوسرے سروس کی شرائط کی خلاف ورزی نہیں کریں گے. آپ اس API کے دستاویزات میں بیان کردہ وسائل کے ذریعہ API تک رسائی حاصل کریں گے (یا اس تک رسائی حاصل کرنے کی کوشش کریں گے). APIs استعمال کرتے وقت آپ غلطی نہیں کریں گے یا آپ کی شناخت یا آپ کی درخواست کی شناخت ماسک کریں گے.
zh_cn: 您同意遵守所有适用法律，法规和第三方权利（包括但不限于有关数据或软件，隐私，版权和当地法律的导入或导出的法律）。您不会使用API​​来鼓励或促进非法活动或侵犯第三方权利。 {platform_name}不会违反任何其他服务条款。您只能通过该API文档中描述的方式访问（或尝试访问）API。在使用API​​时，您不会歪曲或掩盖您的身份或您的应用程序的身份。

source: Enable Timed Exams
ar: تمكين الامتحانات المحددة
ur: وقت کی امتحان کو فعال کریں
zh_cn: 启用定时考试

source: %(platform_name)s Additions:
ar: ٪ (platform_name) s إضافات:
ur: ٪ (platform_name) اضافے:
zh_cn: ％（platform_name）s增加：

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: الرقم الفريد الذي يحدد دورتك داخل مؤسستك. {strong_start} ملاحظة: هذا جزء من عنوان URL للدورة التدريبية ، لذلك لا يُسمح باستخدام أي مسافات أو أحرف خاصة ولا يمكن تغييره. {strong_end}
ur: منفرد نمبر جو آپ کے کورس کے مطابق آپ کی تنظیم کے مطابق ہے. {strong_start} نوٹ: یہ آپ کے کورس کے یو آر ایل کا حصہ ہے، لہذا کوئی جگہ یا خاص حروف کی اجازت نہیں ہے اور اسے تبدیل نہیں کیا جا سکتا. {strong_end}
zh_cn: 在您的组织内识别您的课程的唯一编号。 {strong_start}注意：这是您的课程网址的一部分，因此不允许使用空格或特殊字符，并且无法更改。{strong_end}

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
ar: إذا تم تمكين هذا الخيار ، فلن تتم مطالبة المستخدمين بتأكيد تفاصيلهم (الاسم والبريد الإلكتروني وما إلى ذلك) أثناء عملية التسجيل. فقط حدد هذا الخيار لموفري الخدمة الموثوق بهم المعروفين بتوفير معلومات دقيقة للمستخدم.
ur: اگر یہ اختیار فعال ہوجاتا ہے، تو رجسٹریشن کے عمل کے دوران صارفین کو اپنی تفصیلات (نام، ای میل، وغیرہ) کی تصدیق کرنے کے لئے کہا جائے گا. قابل اعتماد فراہم کرنے والوں کے لئے صرف اس اختیار کو منتخب کریں جو درست صارف کی معلومات فراہم کرنے کے لئے جانا جاتا ہے.
zh_cn: 如果启用此选项，用户在注册过程中不会被要求确认其详细信息（姓名，电子邮件等）。仅为已知可提供准确用户信息的可信提供商选择此选项。

source: Assignment Types
ar: أنواع التعيين
ur: تفویض کی اقسام
zh_cn: 分配类型

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
ar: ما زلت مؤهلاً للترقية إلى شهادة تم التحقق منها! تابعها لتسليط الضوء على المعرفة والمهارات التي تكتسبها في هذه الدورة.
ur: آپ ابھی تک تصدیق شدہ سرٹیفکیٹ میں اپ گریڈ کرنے کے اہل ہیں! اس کورس میں آپ کو حاصل کردہ علم اور مہارت کو اجاگر کرنے کے لئے اس کی پیروی کریں.
zh_cn: 您仍然有资格升级到验证证书！追求它突出你在这门课程中获得的知识和技能。

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
ar: لا يمكن تحليل جواز سفر LTI: {lti_passport}. يجب أن يكون &quot;id: المفتاح: secret&quot; سلسلة.
ur: LTI پاسپورٹ کو پار نہیں کر سکا: {lti_passport}. &quot;id: key: secret&quot; string ہونا چاہئے.
zh_cn: 无法解析LTI护照：{lti_passport}。应该是“id：key：secret”字符串。

source: Enter the unique identifier for your course's video files provided by edX.
ar: أدخل المعرّف الفريد لملفات فيديو الدورة التدريبية التي تقدمها edX.
ur: edX کی طرف سے فراہم کردہ کورس کے ویڈیو فائلوں کیلئے منفرد شناخت کنندہ درج کریں.
zh_cn: 输入由edX提供的课程视频文件的唯一标识符。

source: Create Executive Summary
ar: إنشاء ملخص التنفيذي
ur: ایگزیکٹو خلاصہ بنائیں
zh_cn: 创建执行摘要

source: View Progress Page
ar: عرض صفحة التقدم
ur: پیش رفت پیج دیکھیں
zh_cn: 查看进度页面

source: Search students
ar: بحث الطلاب
ur: طالب علموں کو تلاش کریں
zh_cn: 搜索学生

source: Problem History
ar: تاريخ المشكلة
ur: مسئلہ کی تاریخ
zh_cn: 问题历史

source: Access My Courses
ar: الوصول إلى دوراتي
ur: میرے کورسز تک رسائی حاصل کریں
zh_cn: 访问我的课程

source: New Team Member
ar: عضو فريق جديد
ur: نیا ٹیم کے رکن
zh_cn: 新的团队成员

source: Course Team Management
ar: بالطبع فريق الإدارة
ur: کورس ٹیم مینجمنٹ
zh_cn: 课程团队管理

source: The %(platform_name)s Team
ar: فريق٪ (platform_name)
ur: ٪ (platform_name) کی ٹیم
zh_cn: ％（platform_name）的团队

source: {points} / {total_points} points
ar: {points} / {total_points} نقطة
ur: {پوائنٹس} / {total_points} پوائنٹس
zh_cn: {points} / {total_points}分

source: Tags for Assignments
ar: العلامات لتخصيصات
ur: تفویض کے لئے ٹیگز
zh_cn: 作业标签

source: You requested a capture through the API, but there is no corresponding, unused authorization record.
ar: لقد طلبت التقاطًا من خلال واجهة برمجة التطبيقات ، ولكن لا يوجد سجل تخويل مماثل وغير مستخدم.
ur: آپ نے اے پی پی کے ذریعہ ایک گرفتاری کا مطالبہ کیا، لیکن کوئی مطابقت پذیری، غیر استعمال شدہ اجازت نامہ ریکارڈ نہیں ہے.
zh_cn: 您通过API请求捕获，但没有相应的未使用的授权记录。

source: Real Career Impact
ar: تأثير الوظيفي الحقيقي
ur: اصلی کیریئر اثر
zh_cn: 真正的职业影响

source: Number of attempts taken by the student on this problem
ar: عدد المحاولات التي قام بها الطالب حول هذه المشكلة
ur: اس مسئلہ پر طالب علم کی طرف سے لے جانے والی کوششوں کی تعداد
zh_cn: 学生在此问题上尝试的次数

source: TERMS AND CONDITIONS
ar: الأحكام والشروط
ur: شرائط اور شرائط
zh_cn: 条款和条件

source: What You'll Learn
ar: ما سوف تتعلم
ur: آپ کون سیکھیں گے
zh_cn: 你会学到什么

source: Quick Markdown Syntax Guide
ar: الدليل السريع على بناء الجملة الدليل
ur: فوری مارکڈن سنٹکس گائیڈ
zh_cn: 快速Markdown语法指南

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ar: حدد True إذا كنت تريد استخدام هذا المكون كعنصر نائب للمزامنة مع نظام تصنيف خارجي بدلاً من تشغيل أداة خارجية. يخفي هذا الإعداد زر التشغيل وأي إطار IFrames لهذا المكون.
ur: سچ کا انتخاب کریں اگر آپ اس اجزاء کو بیرونی ہینڈل شروع کرنے کے بجائے ایک بیرونی گریڈنگ سسٹم کے ساتھ مطابقت پذیری کے لئے جگہ ہولڈر کے طور پر استعمال کرنا چاہتے ہیں. یہ ترتیب اس اجزاء کیلئے لانچ بٹن اور کسی بھی IFrames کو چھپاتا ہے.
zh_cn: 如果要将此组件用作占位符与外部分级系统同步而不是启动外部工具，请选择True。此设置隐藏启动按钮和此组件的任何IFrame。

source: Path to order receipt page.
ar: المسار إلى صفحة استلام الطلب.
ur: رسید کا صفحہ آرڈر کرنے کا راستہ
zh_cn: 订购收货页面的路径。

source: Order
ar: طلب
ur: آرڈر
zh_cn: 订购

source: Put your Copyright Text here!
ar: ضع نص حقوق الطبع والنشر هنا!
ur: اپنا کاپی رائٹ متن یہاں رکھیں!
zh_cn: 把你的版权文本放在这里！

source: [Article Name](wiki:ArticleName)
ar: [اسم المقال] (wiki: ArticleName)
ur: [آرٹیکل نام] (wiki: ArticleName)
zh_cn: [文章名称]（wiki：ArticleName）

source: No parsable task_input information found for instructor_task {0}: {1}
ar: لم يتم العثور على معلومات task_intput parsable لـ instructor_task {0}: {1}
ur: {0}: {1} انسٹرکٹر_ٹاس کے لئے کوئی قابل قدر ٹاسکاسٹ معلومات نہیں ملتی ہے.
zh_cn: 找不到用于instructor_task {0}的可分析task_input信息：{1}

source: This image file must have an aspect ratio of {video_image_aspect_ratio_text}.
ar: يجب أن يكون لملف الصورة هذا نسبة عرض إلى ارتفاع {video_image_aspect_ratio_text}.
ur: یہ تصویر فائل میں {video_image_aspect_ratio_text} کا پہلو تناسب ہونا ضروری ہے.
zh_cn: 此图片文件必须具有{video_image_aspect_ratio_text}的宽高比。

source: The email addresses do not match.
ar: عناوين البريد الإلكتروني غير متطابقة.
ur: ای میل پتے مماثل نہیں ہیں.
zh_cn: 电子邮件地址不匹配。

source: Need help?
ar: تحتاج مساعدة؟
ur: مدد چاہیے؟
zh_cn: 需要帮忙？

source: Edit the library configuration.
ar: تحرير تكوين المكتبة.
ur: لائبریری ترتیب میں ترمیم کریں.
zh_cn: 编辑库配置。

source: Enroll In {course_name}
ar: التسجيل في {course_name}
ur: {کورس_ نام} میں اندراج کریں
zh_cn: 注册{course_name}

source: Could not find a course with the ID '{course_id}'
ar: تعذر العثور على دورة تدريبية برقم التعريف &#39;{course_id}&#39;
ur: ID &#39;{course_id}&#39; کے ساتھ کورس نہیں مل سکا
zh_cn: 无法找到ID为“{course_id}”的课程

source: Course Title
ar: عنوان الدورة
ur: کورس کا عنوان
zh_cn: 课程名称

source: {code}
ar: {الشفرة}
ur: {کوڈ}
zh_cn: {码}

source: If you have any questions, you can contact student support at {support_link}.
ar: إذا كانت لديك أي أسئلة ، فيمكنك الاتصال بدعم الطلاب على {support_link}.
ur: اگر آپ کے پاس کوئی سوال ہے تو، آپ {support_link} پر طالب علم کی مدد سے رابطہ کرسکتے ہیں.
zh_cn: 如果您有任何问题，可以通过{support_link}与学生支持部门联系。

source: Language
ar: لغة
ur: زبان
zh_cn: 语言

source: Read the list of courses in which you are an instructor.
ar: اقرأ قائمة الدورات التي تكون فيها مدربًا.
ur: کورسز کی فہرست پڑھیں جس میں آپ ایک انسٹرکٹر ہیں.
zh_cn: 阅读你是一名讲师的课程列表。

source: This answer is being processed.
ar: تتم معالجة هذه الإجابة.
ur: یہ جواب عملدرآمد کیا جا رہا ہے.
zh_cn: 此答案正在处理中。

source: Download Handout
ar: تحميل النشرة
ur: ہینڈ آؤٹ ڈاؤن لوڈ کریں
zh_cn: 下载讲义

source: Learn more about exporting a course
ar: تعرف على المزيد حول تصدير دورة تدريبية
ur: ایک کورس برآمد کرنے کے بارے میں مزید جانیں
zh_cn: 了解更多关于导出课程的信息

source: You have unfulfilled milestones
ar: لديك معالم لم تتحقق
ur: آپ کے پاس ناقابل یقین سنگ میل ہے
zh_cn: 你有未实现的里程碑

source: The card type sent is invalid or does not correlate with the credit card number. Possible action: retry with the same card or another form of payment.
ar: نوع البطاقة المرسلة غير صالح أو لا يرتبط برقم بطاقة الائتمان. الإجراء المحتمل: إعادة المحاولة باستخدام نفس البطاقة أو طريقة أخرى للدفع.
ur: بھیجنے والے کارڈ کی قسم غلط ہے یا کریڈٹ کارڈ نمبر کے ساتھ نہیں ملتی ہے. ممکنہ عمل: اسی کارڈ یا ادائیگی کے دوسرے فارم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 发送的卡片类型无效或与信用卡号码无关。可能的行动：用相同的卡或其他付款方式重试。

source: Verify For {course_name}
ar: تحقق من {course_name}
ur: {course_name} کیلئے تصدیق کریں
zh_cn: 验证{course_name}

source: Order Payment Confirmation
ar: ترتيب تأكيد الدفع
ur: آرڈر ادائیگی کی توثیق
zh_cn: 订单付款确认

source: {span_start}(active){span_end}
ar: {SPAN_START} (نشط) {} SPAN_END
ur: {span_start} (فعال) {span_end}
zh_cn: {SPAN_START}（活性）{SPAN_END}

source: Stolen or lost card.
ar: بطاقة مسروقة أو مفقودة.
ur: چوری یا گمشدہ کارڈ.
zh_cn: 被盗或丢失的卡。

source: Unable to create library '{name}'. {err}
ar: يتعذر إنشاء المكتبة &quot;{name}&quot;. {يخطئ}
ur: لائبریری &#39;{نام}&#39; بنانے میں ناکام. {غلط}
zh_cn: 无法创建库“{name}”。 {呃}

source: First day the course begins
ar: اليوم الأول تبدأ الدورة
ur: پہلا دن شروع ہوتا ہے
zh_cn: 课程开始的第一天

source: Problem
ar: مشكلة
ur: مسئلہ
zh_cn: 问题

source: The amount of the transaction. Use positive amounts for payments and negative amounts for refunds.
ar: مبلغ المعاملة. استخدم المبالغ الإيجابية للدفع والمبالغ السلبية لاسترداد الأموال.
ur: ٹرانزیکشن کی رقم. رقم کی واپسی کے لئے ادائیگی اور منفی مقدار کے لئے مثبت مقدار کا استعمال کریں.
zh_cn: 交易金额。使用正数金额的付款和负数退款。

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
ar: تم رفض طلبك للوصول إلى {platform_name} واجهة برمجة تطبيقات Course Catalog. إذا كنت تعتقد أن هذا خطأ ، أو إذا كانت لديك أسئلة أخرى حول استخدام واجهة برمجة التطبيقات هذه ، فاتصل بـ {api_support_email_link}.
ur: {platform_name} کورس کیٹلوگ API تک رسائی حاصل کرنے کے لئے آپ کی درخواست مسترد کردی گئی ہے. اگر آپ کو لگتا ہے کہ یہ ایک غلطی ہے، یا اس API کا استعمال کرنے کے بارے میں دیگر سوالات کے لئے، {api_support_email_link} سے رابطہ کریں.
zh_cn: 您访问{platform_name}课程目录API的请求已被拒绝。如果您认为这是一个错误，或者有关使用此API的其他问题，请联系{api_support_email_link}。

source: Getting available lists...
ar: الحصول على القوائم المتاحة ...
ur: دستیاب فہرستیں حاصل کر رہے ہیں ...
zh_cn: 获取可用列表...

source: {weeks_to_complete} weeks per course
ar: {weeks_to_complete} من الأسابيع لكل دورة تدريبية
ur: ہر ہفتے {weeks_to_complete} ہفتوں میں
zh_cn: 每周课程{weeks_to_complete}周

source: CCX Connector URL
ar: عنوان CCX Connector
ur: CCX کنیکٹر یو آر ایل
zh_cn: CCX连接器URL

source: original filename
ar: اسم الملف الأصلي
ur: اصل فائل نام
zh_cn: 原始文件名

source: Upgrade ({course_price})
ar: الترقية ({course_price})
ur: اپ گریڈ ({کورس_price})
zh_cn: 升级（{course_price}）

source: CCX Coach Dashboard
ar: CCX مدرب لوحة القيادة
ur: CCX کوچ ڈیش بورڈ
zh_cn: CCX教练仪表板

source: State
ar: حالة
ur: حالت
zh_cn: 州

source: Number of seats purchased individually
ar: عدد المقاعد التي تم شراؤها بشكل فردي
ur: انفرادی طور پر خریداری کی نشستوں کی تعداد
zh_cn: 单独购买的座位数

source: Grading Policy
ar: سياسة التصنيف
ur: گریڈنگ پالیسی
zh_cn: 评分政策

source: Intro
ar: مقدمة
ur: انٹرو
zh_cn: 介绍

source: Decrease
ar: تخفيض
ur: کم کرو
zh_cn: 减少

source: close alert
ar: تنبيه قريب
ur: قریبی انتباہ
zh_cn: 关闭警报

source: Cancel
ar: إلغاء
ur: منسوخ کریں
zh_cn: 取消

source: Section grade has been overridden.
ar: تم تجاوز درجة القسم.
ur: سیکشن گریڈ ختم ہوگیا ہے.
zh_cn: 科级已被覆盖。

source: Welcome to {course_name}
ar: مرحبًا بك في {course_name}
ur: {course_name} میں خوش آمدید
zh_cn: 欢迎来到{course_name}

source: Why upgrade?
ar: لماذا الترقية؟
ur: اپ گریڈ کیوں
zh_cn: 为什么升级？

source: Email cannot be more than %(limit_value)s characters long
ar: لا يمكن أن يكون البريد الإلكتروني أكبر من٪ (limit_value) s حرفًا
ur: ای میل طویل عرصے سے٪ (limit_value) کے حروف سے زیادہ نہیں ہوسکتا ہے
zh_cn: 电子邮件长度不能超过％（limit_value）个字符

source: Thank you for joining {platform_name}. Just a couple steps before you start learning!
ar: شكرًا لك على الانضمام إلى {platform_name}. فقط بضع خطوات قبل البدء في التعلم!
ur: {platform_name} میں شامل ہونے کے لئے آپ کا شکریہ. آپ کو سیکھنے شروع کرنے سے پہلے صرف دو قدم!
zh_cn: 感谢您加入{platform_name}。在你开始学习之前只需要几个步骤！

source: Name of the affiliate cookie
ar: اسم ملف تعريف الارتباط
ur: الحاق کوکی کا نام
zh_cn: 附属cookie的名称

source: {num_second} second
ar: {num_second} الثانية
ur: {num_second} دوسرا
zh_cn: {num_second}秒

source: Click to download a CSV of anonymized student IDs:
ar: انقر لتنزيل ملف CSV لمعرّفات الطلاب المجهولين:
ur: ایک نامزد طالب علم کی شناختی CSV ڈاؤن لوڈ کرنے کے لئے کلک کریں:
zh_cn: 点击下载匿名学生ID的CSV：

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
ar: تشكل الشروط الاتفاقية الكاملة بينك وبين {platform_name} فيما يتعلق باستخدامك لواجهة برمجة التطبيقات ومحتوى واجهة برمجة التطبيقات ، وتحل محل أي اتفاقيات سابقة بينك وبين {platform_name} تتعلق باستخدامك لواجهة برمجة التطبيقات ومحتوى واجهة برمجة التطبيقات. لا يشكل فشل {platform_name} في ممارسة أو تطبيق أي حق أو شرط من الشروط تنازلاً عن هذا الحق أو الحكم. إذا وجدت محكمة مختصة أي بند من الشروط غير صالح ، يتفق الطرفان مع ذلك على أنه ينبغي للمحكمة أن تسعى إلى تنفيذ نوايا الأطراف كما هو موضح في الحكم ، وتبقى الأحكام الأخرى في الشروط سارية المفعول. القوة الكاملة والتأثير. لا تنشئ الشروط أي حقوق لطرف ثالث أو أي وكالة أو شراكة أو مشروع مشترك. بالنسبة لأي إشعار يتم تقديمه لك من خلال {platform_name} بموجب هذه الشروط ، قد {يخطرك {platform_name} عبر عنوان البريد الإلكتروني المرتبط بحسابك {platform_name}.
ur: شرائط API اور API کے مواد کے استعمال کے حوالے سے آپ اور {platform_name} کے درمیان کسی بھی سابقہ ​​معاہدے کو سراہا ہے، APIs اور API کے مواد کے استعمال کے سلسلے میں آپ اور {platform_name} کے درمیان پورے معاہدے کا قیام ہے. {platform_name} کی شرائط کو کسی بھی حق یا شرائط کو نافذ کرنے یا نافذ کرنے کی ناکامی اس طرح کے حق یا فراہمی کا ایک چھوٹا سا وجود نہیں ہے. اگر شرائط کی کسی بھی شق قابل عدلیہ کے کسی عدالت کے ذریعہ غلط ہو تو، جماعتوں کو اس بات پر اتفاق ہے کہ عدالت کو جماعتوں کے ارادے پر اثر انداز کرنے کی کوشش کی جاسکتی ہے کیونکہ شرائط کی عکاس ہوتی ہے اور شرائط کے دیگر احکامات میں رہیں گے. مکمل طاقت اور اثر. شرائط کسی بھی تیسری پارٹی کے منافع بخش حقوق یا کسی بھی ایجنسی، شراکت داری یا مشترکہ منصوبے کی تخلیق نہیں کرتے ہیں. ان شرائط کے تحت {platform_name} کی طرف سے فراہم کردہ کسی بھی نوٹس کے لئے، {platform_name} آپ {platform_name} اکاؤنٹ سے منسلک ای میل ایڈریس کے ذریعہ آپ کو مطلع کرسکتا ہے.
zh_cn: 条款构成您和{platform_name}之间关于您使用API​​和API内容的完整协议，取代您和{platform_name}之间关于您使用API​​和API内容的任何先前协议。 {platform_name}未行使或执行本条款的任何权利或条款不构成对此类权利或条款的放弃。如果具有有效管辖权的法院认为条款的任何条款无效，则双方同意法院应努力落实条款中所反映的双方的意图，并且条款的其他条款应保留在充分的力量和效果。本条款不创建任何第三方受益权或任何机构，合伙或合资企业。对于{platform_name}在这些条款下提供给您的任何通知，{platform_name}可能会通过与您的{platform_name}帐户关联的电子邮件地址通知您。

source: Also receive emails about article edits
ar: تلقي أيضًا رسائل إلكترونية حول تعديلات المقالة
ur: آرٹیکل ترمیم کے بارے میں بھی ای میلز وصول کریں
zh_cn: 还收到有关文章编辑的电子邮件

source: Goal:
ar: هدف:
ur: مقصد:
zh_cn: 目标：

source: Number of Courses
ar: عدد الدورات
ur: کورسز کی تعداد
zh_cn: 课程数量

source: API secret for accessing Sailthru.
ar: سر API للوصول إلى Sailthru.
ur: سیلتیورو تک رسائی حاصل کرنے کے لئے API خفیہ.
zh_cn: 访问Sailthru的API秘密。

source: Enroll in edX101
ar: التسجيل في edX101
ur: edX101 میں داخلہ
zh_cn: 注册edX101

source: Use the {em_start}{studio_name} URL{em_end} value to link to the file or image from a component, a course update, or a course handout.
ar: استخدم {em_start} {studio_name} عنوان URL {em_end} للربط بالملف أو الصورة من أحد المكونات أو تحديث دورة تدريبية أو نشرة دورة تدريبية.
ur: {em_start} {studio_name} یو آر ایل {em_end} کا قدر ایک جزو سے فائل یا تصویر سے رابطہ کرنے کے لئے استعمال کریں، کورس کا اپ ڈیٹ، یا کورس ہینڈ آؤٹ.
zh_cn: 使用{em_start} {studio_name} URL {em_end}值链接到组件，课程更新或课程讲义中的文件或图像。

source: Submission history
ar: سجل التقديم
ur: جمع کرانے کی تاریخ
zh_cn: 提交历史

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
ar: المؤلفون المشاركون لديهم حق الوصول الكامل إلى جميع أدوات التأليف نفسها. اجعل دورتك أفضل من خلال جهد جماعي.
ur: شریک مصنفین کے پاس تمام ہی مصنفین کے اوزار تک مکمل رسائی ہے. ایک ٹیم کی کوشش کے ذریعے اپنا کورس بہتر بنائیں.
zh_cn: 共同作者可以完全访问所有相同的创作工具。通过团队努力让你的课程更好。

source: Enter true or false. If true, the course will not be graded.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فلن يتم تقييم الدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر سچ ہے، کورس درجہ بندی نہیں کیا جائے گا.
zh_cn: 输入true或false。如果属实，该课程不会被评分。

source: The course material was too hard
ar: كانت المادة الدراسية صعبة للغاية
ur: کورس کا مواد بہت مشکل تھا
zh_cn: 课程材料太难了

source: Could not find student matching identifier: {student_identifier}
ar: لا يمكن العثور على معرف مطابقة الطالب: {student_identifier}
ur: طالب علم کے مماثل شناخت کنندہ کو نہیں مل سکا: {student_identifier}
zh_cn: 找不到学生匹配标识符：{student_identifier}

source: others write access
ar: الآخرين الكتابة الوصول
ur: دوسروں تک رسائی لکھتے ہیں
zh_cn: 其他人写访问

source: Current position in the video.
ar: الموقع الحالي في الفيديو.
ur: ویڈیو میں موجودہ پوزیشن.
zh_cn: 视频中的当前位置。

source: Recipient Name
ar: اسم المستلم
ur: وصول کنندہ کا نام
zh_cn: 收件人姓名

source: Users
ar: المستخدمين
ur: صارفین
zh_cn: 用户

source: Transaction Reference Number
ar: رقم مرجع المعاملة
ur: ٹرانزیکشن حوالہ نمبر
zh_cn: 交易参考编号

source: Address 1
ar: العنوان 1
ur: پتہ 1
zh_cn: 地址1

source: Price
ar: السعر
ur: قیمت
zh_cn: 价钱

source: Address 2
ar: العنوان 2
ur: ایڈریس 2
zh_cn: 地址2

source: {html_start}Your account could not be activated{html_end}Something went wrong, please <a href="{support_url}">contact support</a> to resolve this issue.
ar: {html_start} تعذر تنشيط حسابك {html_end} حدث خطأ ما ، يرجى <a href="{support_url}">الاتصال بالدعم</a> لحل هذه المشكلة.
ur: {html_start} آپ کا اکاؤنٹ چالو نہیں کیا جاسکتا {html_end} کچھ غلط ہو گیا، برائے مہربانی اس مسئلے کو حل کرنے کے لئے <a href="{support_url}">تعاون</a> سے <a href="{support_url}">رابطہ کریں</a> .
zh_cn: {html_start}您的帐号无法启动{html_end}出现问题，请<a href="{support_url}">联系支持</a>人员解决此问题。

source: Finished
ar: تم الانتهاء من
ur: ختم
zh_cn: 成品

source: Practice Scores:
ar: درجات الممارسة:
ur: پریکٹس اسکور:
zh_cn: 练习成绩：

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
ar: للوصول إلى واجهات برمجة التطبيقات ، ستحتاج إلى إنشاء حساب مستخدم {platform_name} لتطبيقك (وليس للاستخدام الشخصي). سيوفر لك هذا الحساب إمكانية الوصول إلى صفحة طلب واجهة برمجة التطبيقات على {request_url}. في هذه الصفحة ، يجب عليك إكمال نموذج طلب واجهة برمجة التطبيقات بما في ذلك وصف لاستخداماتك المقترحة لواجهة برمجة التطبيقات. يجب أن تكون معلومات الحساب والتسجيل التي تقدمها إلى {platform_name} دقيقة ومحدثة ، وتوافق على إعلامنا على الفور بأي تغييرات. سوف يقوم {platform_name} بمراجعة نموذج طلب API الخاص بك ، وبناءً على موافقتك حسب تقدير {platform_name} الخاص ، سيزودك بتعليمات للحصول على سر عميل ID المشترك ومعرف العميل.
ur: APIs تک رسائی حاصل کرنے کے لئے، آپ کو اپنی درخواست کے لئے ایک {platform_name} صارف اکاؤنٹ بنانا ہوگا (ذاتی استعمال کے لۓ). یہ اکاؤنٹ آپ {request_url} پر ہمارے API درخواست کے صفحے تک رسائی فراہم کرے گا. اس صفحے پر، آپ API کے لئے آپ کے تجویز کردہ استعمال کی وضاحت سمیت API درخواست فارم کو مکمل کرنا ضروری ہے. کسی بھی اکاؤنٹ اور رجسٹریشن کی معلومات جس میں آپ {platform_name} کو فراہم کرتے ہیں وہ درست اور تازہ ترین ہونا ضروری ہے، اور آپ کو فوری طور پر ہمیں کسی بھی تبدیلی کے بارے میں مطلع کرنے پر اتفاق ہے. {platform_name} آپ کے API درخواست فارم کا جائزہ لیں گے اور {platform_name} کے اختیاری صوابدید میں آپ کے API کو مشترکہ خفیہ اور کلائنٹ کی شناخت کو حاصل کرنے کے لئے ہدایات فراہم کرے گا.
zh_cn: 要访问这些API，您需要为您的应用程序创建一个{platform_name}用户帐户（不能用于个人用途）。此帐户将为您提供对{request_url}的API请求页面的访问权限。在该页面上，您必须完成API请求表单，其中包含对您提议的API使用情况的说明。您提供给{platform_name}的任何帐户和注册信息必须准确且最新，并且您同意及时通知我们任何更改。 {platform_name}将审核您的API请求表单，并在{platform_name}自行决定批准后向您提供获取API共享机密和客户端ID的说明。

source: Classes End
ar: نهاية الفصول
ur: کلاس ختم
zh_cn: 类结束

source: Image Mapped Input
ar: مدخلات الصورة المعينة
ur: تصویر وضع کردہ ان پٹ
zh_cn: 图像映射输入
