Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
ar: في حال توفر لك {platform_name} حق الوصول إلى المعلومات الخاصة بـ {platform_name} و / أو واجهات برمجة التطبيقات التي تم تحديدها إما على أنها &quot;سرية&quot; أو التي يفترض أن يكون الشخص المعقول أنها سرية أو ملكية بموجب شروط الكشف ( &quot;المعلومات السرية&quot;) ، فإنك توافق على استخدام هذه المعلومات فقط لاستخدامها مع واجهات برمجة التطبيقات وإنشائها. لا يجوز لك الكشف عن المعلومات السرية لأي شخص بدون موافقة كتابية مسبقة {platform_name} ، وأنت توافق على حماية المعلومات السرية من الاستخدام غير المصرح به والكشف عنه بنفس الطريقة التي تحمي بها معلوماتك السرية الخاصة. لا تتضمن المعلومات السرية المعلومات التي طورتها بشكل مستقل ، والتي تم إعطاؤها لك من قبل طرف ثالث بدون التزام بالسرية ، أو التي تصبح عامة دون أي خطأ من جانبك. يجوز لك الكشف عن المعلومات السرية عند إرغامك على القيام بذلك بموجب القانون في حالة تقديم {platform_name} مع إشعار مسبق معقول ، ما لم تطلب المحكمة عدم تلقي إشعار {platform_name}.
ur: اس واقعہ میں {platform_name} آپ کو {platform_name} اور / یا APIs جو یا تو &quot;رازداری&quot; کے طور پر نشان زد کیا جاتا ہے یا جس کے مطابق مناسب شخص کو اس کے افشاء کی شرائط دی گئی خفیہ یا مالکیت کا فرض سمجھا جائے گا، &quot;رازداری کی معلومات&quot;)، آپ صرف API کے ساتھ استعمال اور تعمیر کرنے کے لئے اس معلومات کا استعمال کرنے پر اتفاق کرتے ہیں. آپ خفیہ معلومات کو بغیر کسی {platform_name} کی سابق تحریری رضامندی کے بغیر ظاہر نہیں کرسکتے ہیں، اور آپ خفیہ معلومات کو غیر مجاز استعمال اور افشاء سے محفوظ کریں گے اسی طرح آپ اپنے خفیہ معلومات کی حفاظت کریں گے. رازداری کی معلومات میں ان معلومات میں شامل نہیں ہے جو آپ آزادانہ طور پر تیار ہو چکے ہیں، جو آپ کو کسی تیسرے فریق کے بغیر رازداری کے ذمہ داری کے لۓ حقائق فراہم کی گئی تھی، یا وہ آپ کی اپنی کوئی غلطی نہیں کرتے. جب آپ عدالت کے حکم کے مطابق {platform_name} کو نوٹس نہیں ملتا تو آپ خفیہ معلومات کو ظاہر کر سکتے ہیں جب آپ قانون کے ذریعہ ایسا کرنے کے لئے مجبور ہوتے ہیں تو {platform_name} مناسب معقول نوٹس کے ساتھ فراہم کرتے ہیں.
zh_cn: 在{platform_name}为您提供特定于{platform_name}和/或API的特定信息的情况下，这些信息被标记为“机密”，或者根据其披露条款，合理的人将被认为是机密或专有的“机密信息”），您同意仅使用这些信息来使用和使用API​​进行构建。未经{platform_name}事先书面同意，您不得将机密信息透露给任何人，并且您同意保护机密信息免受未经授权的使用和披露，其方式与您保护自己的机密信息的方式相同。保密信息不包括您独立开发的信息，这些信息由第三方在没有保密义务的情况下正确提供给您，或者通过您自己的过错而公开发布。除非法院命令{platform_name}未收到通知，否则如果您在合理的事先通知下提供{platform_name}，您可以在法律强制要求时披露机密信息。

source: Unsupported
ar: غير معتمد
ur: غیر معاون
zh_cn: 不支持

source: Show Earlier Course Updates
ar: عرض تحديثات الدورة السابقة
ur: ابتدائی کورس کی تازہ ترین معلومات دکھائیں
zh_cn: 显示早期课程更新

source: Privacy Policy
ar: سياسة الخصوصية
ur: پرائیویسی پالیسی
zh_cn: 隐私政策

source: I don't have enough support
ar: ليس لدي ما يكفي من الدعم
ur: میرے پاس کافی مدد نہیں ہے
zh_cn: 我没有足够的支持

source: must be {0} characters or more
ar: يجب أن يكون {0} حرفًا أو أكثر
ur: {0} حروف یا زیادہ ہونا لازمی ہے
zh_cn: 必须是{0}个字符或更多

source: Conditional Attribute
ar: السمة الشرطية
ur: مشروط خصوصیات
zh_cn: 条件属性

source: You have been removed from a beta test for {course_name}
ar: لقد تمت إزالتك من اختبار تجريبي لـ {course_name}
ur: آپ {bet_name} کے لئے بیٹا ٹیسٹ سے ہٹا دیا گیا ہے.
zh_cn: 您已从{course_name}的测试版中删除

source: The download URL for the generated certificate.
ar: عنوان URL للتنزيل للشهادة التي تم إنشاؤها.
ur: پیدا کردہ سرٹیفکیٹ کے لئے ڈاؤن لوڈ، اتارنا یو آر ایل.
zh_cn: 生成的证书的下载URL。

source: Files & Uploads
ar: الملفات والتحميلات
ur: فائلیں اور اپ لوڈ
zh_cn: 文件和上传

source: Missed Verification Deadline
ar: انتهت مهلة التحقق
ur: مسدود توثیق کی آخری تاریخ
zh_cn: 错过验证截止日期

source: Refunded {cost} for order id {order_id}
ar: تم رد مبلغ {cost} مرتبط بمعرف الطلب {order_id}
ur: آرڈر کی شناخت {order_id} کے لئے {لاگت} رقم کی واپسی
zh_cn: 为订单ID {order_id}退还{cost}

source: Maximum upload file size is {file_size} bytes.
ar: الحد الأقصى لحجم ملف التحميل هو {file_size} بايت.
ur: زیادہ سے زیادہ اپ لوڈ فائل کا سائز {file_size} بائٹ ہے.
zh_cn: 最大上传文件大小为{file_size}个字节。

source: HTML link from the attached CSV file
ar: رابط HTML من ملف CSV المرفق
ur: منسلک CSV فائل سے HTML لنک
zh_cn: 来自附加CSV文件的HTML链接

source: Requested task is already running
ar: المهمة المطلوبة قيد التشغيل بالفعل
ur: درخواست شدہ کام پہلے ہی چل رہا ہے
zh_cn: 请求的任务已在运行

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
ar: أنشئ {strong_start} أقسام {strong_end} وأعد إطلاقها إلى طلابك بشكل متزايد. ليس عليك أن تفعل كل ذلك في وقت واحد.
ur: اضافی طور پر اپنے طلباء کو {strong_start} حصوں {strong_end} کی تعمیر اور رہائی دیں. آپ کو ایسا کرنے کی ضرورت نہیں ہے کہ ایک ہی وقت میں ہو.
zh_cn: 逐步构建并向您的学生发布{strong_start}部分{strong_end}。您不必一次完成所有工作。

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
ar: أدخل صح أو خطأ. إذا كان الأمر صحيحًا ، فستجد أن المشكلات في الدورة الافتراضية هي عرض زر &quot;إعادة التعيين&quot; دائمًا. يمكنك تجاوز هذا في إعدادات كل مشكلة. تتأثر جميع المشاكل الحالية عند تغيير هذا الإعداد على مستوى الدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال کی اطلاع دیتے ہوئے ایرر آ گیا ہے. براہ مہربانی دوبارہ کوشش کریں. آپ ہر مسئلے کی ترتیبات میں اس کو اوور کرسکتے ہیں. جب یہ کورس وسیع ترتیب تبدیل ہوجائے تو تمام موجودہ مسائل متاثر ہوئیں.
zh_cn: 输入true或false。如果属实，则课程中的问题默认始终显示“重置”按钮。您可以在每个问题的设置中覆盖此内容。当整个课程设置发生变化时，所有现有问题都会受到影响。

source: This page left intentionally blank. Feel free to add your own content.
ar: هذه الصفحة تركت فارغة عن قصد. لا تتردد في إضافة المحتوى الخاص بك.
ur: یہ صفحہ جان بوجھ سے خالی ہے. اپنی اپنی مواد کو شامل کرنے کے لئے آزاد محسوس کریں.
zh_cn: 此页面有意留空白。随意添加您自己的内容。

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
ar: يقر {platform_name} بالإنجازات من خلال الشهادات ، والتي تُمنح لأنشطة الدورة التدريبية التي يكملها الطلاب {platform_name}.
ur: {platform_name} سرٹیفکیٹ کے ذریعہ کامیابیوں کو تسلیم کرتا ہے، جو کورس کے سرگرمیوں کے لئے نوازا جاتا ہے جو {platform_name} طلباء کو مکمل کرتی ہے.
zh_cn: {platform_name}通过证书来确认成绩，这些证书是针对{platform_name}学生完成的课程活动而颁发的。

source: Next page
ar: الصفحة التالية
ur: اگلا صفحہ
zh_cn: 下一页

source: Student Enrollment Form
ar: نموذج انتساب الطلاب
ur: طالب علم داخلہ فارم
zh_cn: 学生注册表格

source: Media Kit
ar: مجموعة الوسائط
ur: میڈیا کٹ
zh_cn: 媒体套件

source: Partition for segmenting users by enrollment track
ar: التقسيم لتقسيم المستخدمين من خلال مسار التسجيل
ur: داخلہ ٹریک کے ذریعے صارفین کو تقسیم کرنے کے لئے تقسیم
zh_cn: 按注册轨道划分用户的分区

source: Provide the email address of the user you want to add as Staff
ar: قدّم عنوان البريد الإلكتروني للمستخدم الذي تريد إضافته كموظفين
ur: اس صارف کا ای میل پتہ فراہم کریں جسے آپ اسٹاف کے طور پر شامل کرنا چاہتے ہیں
zh_cn: 提供您想要添加为员工的用户的电子邮件地址

source: problem distribution graded
ar: توزيع مشكلة متدرج
ur: مسئلہ تقسیم کی گئی
zh_cn: 问题分布分级

source: You are missing the following required fields:
ar: أنت تفتقد الحقول المطلوبة التالية:
ur: آپ مندرجہ ذیل مطلوبہ شعبوں کو غائب کر رہے ہیں:
zh_cn: 您缺少以下必填字段：

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
ar: نص عادي أو محتوى html لعرض رسالة مخصصة داخل محتوى البريد الإلكتروني لاستلام الإيصالات الذي يتم إرساله * بعد * الدفع للحصول على رصيد لدورة الائتمان.
ur: کریڈٹ کورس کے لۓ کریڈٹ رسید ای میل کے مواد کے اندر اپنی مرضی کے مطابق پیغام کو ظاہر کرنے کے لئے سادہ متن یا ایچ ٹی ایم ایل مواد جس کو * بھیجنے کے بعد بھیجا گیا ہے.
zh_cn: 纯文本或html内容，用于在信用收据电子邮件内容中显示自定义邮件，该邮件在*付款后发送*以获得学分课程的学分。

source: Closed
ar: مغلق
ur: بند
zh_cn: 关闭

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
ar: استخدم هذا الإعداد فقط عند إنشاء شهادات PDF. بين علامات الاقتباس ، أدخل الاسم الطويل لنوع الشهادة التي يتلقاها الطلاب عند إكمال الدورة التدريبية. على سبيل المثال ، &quot;شهادة الإنجاز&quot;.
ur: پی ڈی ایف سرٹیفکیٹ پیدا کرنے پر صرف اس ترتیب کا استعمال کریں. کوٹیشن کے نشانوں کے درمیان، سرٹیفکیٹ کی قسم کا طویل نام درج کریں، جس کے دوران وہ طالب علم کو کورس مکمل کرتے ہیں. مثال کے طور پر، &quot;کامیابی کی سند&quot;.
zh_cn: 仅在生成PDF证书时使用此设置。在引号之间，输入学生在完成课程时收到的证书类型的长名称。例如，“成就证书”。

source: View Updated Outline
ar: عرض تحديث مخطط تفصيلي
ur: اپ ڈیٹ آؤٹ لائن دیکھیں
zh_cn: 查看更新大纲

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
ar: أنت تحذف مقالة. هذا يعني أنه سيتم حذف أطفالها أيضًا. إذا اخترت التطهير ، سيتم أيضًا تطهير الأطفال!
ur: آپ ایک مضمون حذف کر رہے ہیں. اس کا مطلب یہ ہے کہ اس کے بچوں کو بھی خارج کردیا جائے گا. اگر آپ کو صاف کرنا ہے تو، بچوں کو بھی برباد کیا جائے گا!
zh_cn: 您正在删除一篇文章。这意味着其子女也将被删除。如果你选择清除，孩子也将被清除！

source: If you haven't verified your identity yet, please start the verification process ({verification_url}).
ar: إذا لم تقم بالتحقق من هويتك بعد ، فيرجى بدء عملية التحقق ({verification_url}).
ur: اگر آپ نے ابھی تک اپنی شناخت کی توثیق نہیں کی ہے تو، براہ کرم توثیقی عمل شروع کریں ({verification_url}).
zh_cn: 如果您尚未验证身份，请开始验证过程（{verification_url}）。

source: When will my course re-run start?
ar: متى سيتم بدء الدورة التدريبية الخاصة بي؟
ur: میرا کورس کب دوبارہ شروع ہوگا؟
zh_cn: 我的课程何时会重新开始？

source: Welcome {username}
ar: مرحبًا {اسم المستخدم}
ur: خوش آمدید {صارف کا نام}
zh_cn: 欢迎使用{username}

source: Financial Assistance Application
ar: تطبيق المساعدات المالية
ur: مالی معاونت کی درخواست
zh_cn: 财务援助申请

source: Theming Administration
ar: إدارة Theming
ur: تھیم ایڈمنسٹریشن
zh_cn: 主题管理

source: Select your specialty.
ar: اختر تخصصك.
ur: اپنی خاصیت کا انتخاب کریں.
zh_cn: 选择你的专业。

source: %(platform_name)s Wiki
ur: ٪ (پلیٹ فارم_ نام) کے وکیپیڈیا

source: New Password
ar: كلمة السر الجديدة
ur: نیا پاس ورڈ
zh_cn: 新密码

source: {platform_name} for Business
ur: کاروبار کیلئے {platform_name}

source: Learn About Verified Certificates
ar: تعرف على حول الشهادات المعتمدة
ur: تصدیق شدہ سرٹیفکیٹس کے بارے میں جانیں
zh_cn: 了解已验证的证书

source: Payment confirmation
ar: تأكيد الدفعة
ur: ادائیگی کی تصدیق
zh_cn: 付款确认

source: Access restricted to: {list_of_groups}
ar: الدخول مقيد إلى: {list_of_groups}
ur: تک رسائی محدود: {list_of_groups}
zh_cn: 访问权限限于：{list_of_groups}

source: Upload Course Card Image
ar: تحميل صورة بطاقة الدورة التدريبية
ur: کورس کارڈ کی تصویر اپ لوڈ کریں
zh_cn: 上传课程卡片图片

source: Email: {email}
ar: البريد الإلكتروني: {email}
ur: ای میل: {ای میل}
zh_cn: 电子邮件地址：{email}

source: {input_type}: unexpected tag {tag_name}
ar: {input_type}: علامة غير متوقعة {tag_name}
ur: {input_type}: غیر متوقع ٹیگ {tag_name}
zh_cn: {input_type}：意外标记{tag_name}

source: Advanced Settings
ar: إعدادات متقدمة
ur: اعلی درجے کی ترتیبات
zh_cn: 高级设置

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
ar: أنت توافق على الامتثال لجميع قوانين وأنظمة الخصوصية المعمول بها وأن تكون شفافة فيما يتعلق بأي جمع واستخدام لبيانات المستخدم النهائي. ستوفر سياسة خصوصية لتطبيقك وتلتزم بها لتوضح بوضوح للمستخدمين النهائيين معلومات المستخدم التي تجمعها وكيفية استخدامك لمثل هذه المعلومات ومشاركتها (بما في ذلك الإعلانات) مع {platform_name} وأطراف ثالثة أخرى.
ur: آپ کو تمام قابل اطلاق رازداری کے قوانین اور قواعد و ضوابط کے مطابق عمل کرنا اور کسی بھی مجموعہ اور اختتامی صارف کے اعداد و شمار کے استعمال کے سلسلے میں شفاف ہونا ہوگا. آپ اپنے ایپلی کیشن کے لئے رازداری کی پالیسی فراہم کرتے ہیں اور اس کے مطابق آپ کے اختتامی صارفین کو جو صارف کی معلومات جمع کرتے ہیں اور آپ کس طرح استعمال کرسکتے ہیں اور اس طرح کے معلومات (پلیٹ فارم کے نام) اور دوسری تیسری جماعتوں کے ساتھ (اشتہارات کے لئے) شامل کرسکتے ہیں وہ واضح طور پر اور درست طریقے سے بیان کرتی ہیں.
zh_cn: 您同意遵守所有适用的隐私法律和法规，并对任何收集和使用最终用户数据保持透明。您将为您的应用程序提供并遵守隐私政策，以清楚准确地向您的最终用户描述您收集哪些用户信息以及如何与{platform_name}和其他第三方共享此类信息（包括用于广告）。

source: Enroll
ar: يتسجل، يلتحق
ur: اندراج کریں
zh_cn: 注册

source: Course Visibility In Catalog
ar: رؤية الدورة في الكتالوج
ur: کورس کی نمائش میں فہرست
zh_cn: 目录中的课程可见性

source: Your Course Creator request is:
ar: طلب المنشور الخاص بالدورة التدريبية هو:
ur: آپ کا کورس خالق کی درخواست ہے:
zh_cn: 您的课程创建者请求是：

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
ar: تحقق من البريد الوارد {email_start} {email} {email_end} الخاص بك للحصول على رابط تنشيط الحساب من {platform_name}. إذا كنت بحاجة إلى المساعدة ، فاتصل {link_start} {platform_name} بالدعم {link_end}.
ur: {platform_name} کے اکاؤنٹ اکاؤنٹنگ کے لنک کیلئے اپنے {email_start} {ای میل} {email_end} ان باکس کو چیک کریں. اگر آپ کی مدد کی ضرورت ہے تو {link_start} {platform_name} سپورٹ {link_end} سے رابطہ کریں.
zh_cn: 从{platform_name}查看您的{email_start} {email} {email_end}收件箱中的帐户激活链接。如果您需要帮助，请联系{link_start} {platform_name}支持{link_end}。

source: proctored exam results
ar: نتائج الامتحانات
ur: امتحان کے نتائج
zh_cn: 监督检查结果

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
ar: إذا لم تطلب هذا ، فلن تحتاج إلى القيام بأي شيء ؛ لن تتلقى أي بريد إلكتروني منا. رجاءا لا ترد على هذا الأيميل؛ إذا كنت بحاجة إلى مساعدة ، فتحقق من القسم الخاص بموقع الويب {platform_name} على الويب.
ur: اگر آپ نے اس کی درخواست نہیں کی، تو آپ کو کچھ کرنے کی ضرورت نہیں ہے. آپ ہمارے پاس مزید ای میل نہیں ملیں گے. براہ مہربانی اس ای میل کا جواب نہ دیں؛ اگر آپ کو مدد کی ضرورت ہو تو، {platform_name} کورسز ویب سائٹ کے بارے میں سیکشن چیک کریں.
zh_cn: 如果你没有要求，你不需要做任何事情;你将不会再收到我们的电子邮件。请不要回复这封邮件;如果您需要帮助，请查看{platform_name}课程网站的关于部分。

source: Your email or password is incorrect
ar: بريدك الإلكتروني او كلمة المرور ليست صحيحة
ur: آپ کا ای میل یا پاس ورڈ غلط ہے
zh_cn: 您的电子邮件或密码不正确

source: Purge
ar: تطهير
ur: مقصد
zh_cn: 清除

source: Name of this user attribute.
ar: اسم سمة المستخدم هذه.
ur: اس صارف کی خصوصیت کا نام.
zh_cn: 此用户属性的名称。

source: Enable Student Notes
ar: تمكين ملاحظات الطلاب
ur: طالب علم کے نوٹس کو فعال کریں
zh_cn: 启用学生笔记

source: Submit
ar: خضع
ur: جمع
zh_cn: 提交

source: Sailthru template to use on welcome send.
ar: قالب Sailthru لاستخدامه على الترحيب إرسال.
ur: خوش آمدید بھیجنے پر استعمال کرنے کے لئے سیلیلورس ٹیمپلیٹ.
zh_cn: Sailthru模板用于欢迎发送。

source: Source Components
ar: مكونات المصدر
ur: ماخذ اجزاء
zh_cn: 源组件

source: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: دمج بين المراجعة #٪ (r1) د ومراجعة #٪ (r2) د
ur: ترمیم #٪ (R1) ڈی اور ترمیم #٪ (R2) کے درمیان ضم
zh_cn: 修订号＃％（r1）d和修订号＃％（r2）之间的合并d

source: Enable LaTeX Compiler
ar: تمكين LaTeX مترجم
ur: LaTeX کمپائلر کو فعال کریں
zh_cn: 启用LaTeX编译器

source: Course Announce Date
ar: تاريخ الاعلان
ur: کورس کا اعلان تاریخ
zh_cn: 课程宣布日期

source: Your certificate will be available when you pass the course.
ar: ستكون شهادتك متاحة عند اجتياز الدورة التدريبية.
ur: جب آپ کورس منتقل کرتے ہیں تو آپ کا سرٹیفکیٹ دستیاب ہوگا.
zh_cn: 通过课程后，您的证书将可用。

source: No email address found.
ar: لم يتم العثور على عنوان بريد إلكتروني.
ur: کوئی ای میل پتہ نہیں ملا.
zh_cn: 未找到电子邮件地址。

source: View gradebook
ar: عرض دفتر التقديرات
ur: گریڈ بک دیکھیں
zh_cn: 查看成绩簿

source: Learn with {platform_name}
ar: تعلم مع {platform_name}
ur: {platform_name} کے ساتھ جانیں
zh_cn: 通过{platform_name}了解

source: Hide Annotations
ar: إخفاء التعليقات التوضيحية
ur: تشریح چھپائیں
zh_cn: 隐藏注释

source: First Name
ar: الاسم الاول
ur: پہلا نام
zh_cn: 名字

source: Receipt
ar: إيصال
ur: رسید
zh_cn: 收据

source: This is a test message
ar: هذه رسالة اختبار
ur: یہ ایک ٹیسٹ پیغام ہے
zh_cn: 这是一条测试消息

source: This field is disabled: this information cannot be changed.
ar: تم تعطيل هذا الحقل: لا يمكن تغيير هذه المعلومات.
ur: یہ فیلڈ غیر فعال ہے: یہ معلومات تبدیل نہیں کی جا سکتی.
zh_cn: 该字段已禁用：此信息无法更改。

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
ar: إذا لم تطلب هذا التغيير ، يمكنك تجاهل هذه الرسالة الإلكترونية - لم نعد بعد إعادة تعيين كلمة المرور.
ur: اگر آپ نے اس تبدیلی کی درخواست نہیں کی ہے، تو آپ اس ای میل کو بے بنیاد کرسکتے ہیں - ہم نے ابھی تک آپ کا پاس ورڈ دوبارہ مقرر نہیں کیا ہے.
zh_cn: 如果您没有申请此更改，则可以忽略此电子邮件 - 我们尚未重置您的密码。

source: Unit Price
ar: سعر الوحدة
ur: اکائی قیمت
zh_cn: 单价

source: This component has no source components configured yet.
ar: لا يحتوي هذا المكون على مكونات المصدر التي تم تكوينها حتى الآن.
ur: اس اجزاء میں کوئی ذریعہ اجزاء موجود نہیں ہے.
zh_cn: 该组件尚未配置源组件。

source: Invoice
ar: فاتورة
ur: انوائس
zh_cn: 发票

source: course-v1:edX+DemoX+Demo_Course
ar: بالطبع-V1: EDX + DemoX + Demo_Course
ur: کورس V1: edX + ڈیمو ایکس + ڈیموکوس
zh_cn: 当然-V1：给予edX + DemoX + Demo_Course

source: Grading policy
ar: سياسة التصنيف
ur: گریڈنگ پالیسی
zh_cn: 评分政策

source: Welcome to {platform_name}
ar: مرحبًا بك في {platform_name}
ur: {platform_name} میں خوش آمدید
zh_cn: 欢迎来到{platform_name}

source: If this error persists, please contact the course staff.
ar: إذا استمر هذا الخطأ ، فيرجى الاتصال بموظفي الدورة التدريبية.
ur: اگر یہ غلطی رہتی ہے، تو براہ کرم کورس کے عملے سے رابطہ کریں.
zh_cn: 如果此错误仍然存​​在，请联系课程人员。

source: Shopping cart
ar: عربة التسوق
ur: خریداری کی ٹوکری
zh_cn: 购物车

source: Correct:
ar: صيح:
ur: درست:
zh_cn: 正确：

source: anonymous (IP logged)
ar: مجهول (IP تسجيل)
ur: گمنام (آئی پی لاگ ان)
zh_cn: 匿名（IP登录）

source: Add Staff
ar: إضافة الموظفين
ur: اسٹاف شامل کریں
zh_cn: 添加员工

source: Group:
ar: مجموعة:
ur: گروپ:
zh_cn: 组：

source: Course Import Status
ar: حالة استيراد دورة تدريبية
ur: کورس درآمد کی حیثیت
zh_cn: 课程导入状态

source: The course does not exist against the given key '{course_key}'
ar: لا توجد الدورة التدريبية مقابل المفتاح المحدد &quot;{course_key}&quot;
ur: دیئے گئے کلی &#39;{course_key} کے خلاف کورس موجود نہیں ہے
zh_cn: 对于给定的键“{course_key}”，该课程不存在

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
ar: عندما يكون ذلك صحيحًا ، فأخبر مزود الائتمان تلقائيًا عندما يطلب مستخدم ائتمانًا. لكي يعمل هذا ، يجب أن يتم تكوين مفتاح سري مشترك لموفر الائتمان في إعدادات مصادقة آمنة.
ur: جب درست ہو، صارف کو کریڈٹ کی درخواست کرتے وقت خود بخود کریڈٹ فراہم کنندہ کو مطلع کریں. کام کرنے کے لئے اس کے لئے، مشترکہ خفیہ کلید کو محفوظ مصنف ترتیبات میں کریڈٹ فراہم کرنے کے لئے تشکیل دیا جائے گا.
zh_cn: 如果为true，则在用户请求信用时自动通知信贷提供商。为了达到此目的，必须在安全验证设置中为信用提供商配置共享密钥。

source: Course Start Time
ar: بالطبع وقت البدء
ur: کورس شروع وقت
zh_cn: 课程开始时间

source: Your {task_name} task has completed with the status '{task_status}'. Sign in to view the details of your task or download any files created.
ar: اكتملت مهمة {task_name} الخاصة بك بالحالة &quot;{task_status}&quot;. قم بتسجيل الدخول لعرض تفاصيل مهمتك أو تنزيل أي ملفات تم إنشاؤها.
ur: آپ {task_name} کے کام نے حیثیت &#39;{task_status}&#39; کے ساتھ مکمل کر لیا ہے. اپنے کام کی تفصیلات دیکھنے کے لئے سائن ان کریں یا پیدا کردہ کسی بھی فائلوں کو ڈاؤن لوڈ کریں.
zh_cn: 您的{task_name}任务已完成状态为“{task_status}”。登录后查看您的任务的详细信息或下载创建的任何文件。

source: Libraries
ar: المكتبات
ur: لائبریری
zh_cn: 图书馆

source: Certificates Available Date
ar: الشهادات المتاحة التاريخ
ur: سرٹیفکیٹ دستیاب تاریخ
zh_cn: 证书可用日期

source: Randomization
ar: العشوائية
ur: بے ترتیب
zh_cn: 随机

source: Sailthru maximum retries.
ar: Sailthru أقصى إعادة المحاولة.
ur: سیلیلیو زیادہ سے زیادہ دوبارہ کوشش کرتا ہے.
zh_cn: Sailthru最大重试次数。

source: You must be a CCX Coach to access this view.
ar: يجب أن تكون مدرب CCX للوصول إلى هذا العرض.
ur: اس قول تک رسائی کیلئے آپ کو CCX کوچ ہونا ضروری ہے.
zh_cn: 您必须是CCX教练才能访问此视图。

source: The message to show when a user is blocked from enrollment.
ar: الرسالة التي يتم عرضها عندما يتم حظر المستخدم من التسجيل.
ur: صارف کو اندراج سے روکنے کے لئے ظاہر کرنے کا پیغام.
zh_cn: 要阻止用户注册时显示的消息。

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
ar: في بعض الأحيان ، قد لا تتم مزامنة مسودة وأقسام مقررات الدورة التدريبية. يقوم أمر فرض نشر الدورة بإعادة تعيين الفرع المنشور للدورة التدريبية للإشارة إلى مسودة الفرع ، مما يجبر فعليًا على نشر الدورة التدريبية. تعمل هذه طريقة العرض الجافة على تشغيل أمر النشر force
ur: کبھی کبھی ایک کورس کے مسودہ اور شائع شاخوں ہم آہنگی سے باہر نکل سکتے ہیں. طاقت کا کورس کمانڈ کمانڈ نے ڈرافٹ شاخ کو اشارہ کرنے کے لئے ایک کورس کی شائع کردہ شاخ کو دوبارہ ترتیب دیتا ہے، مؤثر طریقے سے کورس شائع کرنے پر زور دیا ہے. یہ قول خشک طاقت اشاعت اشاعت کم کرتا ہے
zh_cn: 有时，课程的草稿和发布的分支可能会不同步。强制发布课程命令重置课程的已发布分支以指向草稿分支，从而有效地强制发布课程。该视图干运行force publish命令

source: Visit your {link_start}dashboard{link_end} to see your courses.
ar: تفضل بزيارة {link_start} لوحة المعلومات {link_end} لمشاهدة الدورات التدريبية الخاصة بك.
ur: اپنے کورسوں کو دیکھنے کے لئے اپنے {link_start} ڈیش بورڈ {link_end} پر جائیں.
zh_cn: 访问您的{link_start}信息中心{link_end}查看您的课程。

source: The email associated with your {platform_name} account has changed from {old_email} to {new_email}.
ar: تم تغيير البريد الإلكتروني المرتبط بحساب {platform_name} من {old_email} إلى {new_email}.
ur: آپ {platform_name} کے اکاؤنٹ سے منسلک ای میل {old_email} سے {new_email} پر بدل گیا ہے.
zh_cn: 与{platform_name}帐户关联的电子邮件已从{old_email}更改为{new_email}。

source: Confirmation
ar: التأكيد
ur: تصدیق
zh_cn: 确认

source: You must delete or replace the following components.
ar: يجب عليك حذف أو استبدال المكونات التالية.
ur: آپ کو مندرجہ ذیل اجزاء کو حذف یا تبدیل کرنا ضروری ہے.
zh_cn: 您必须删除或替换以下组件。

source: The following content is imported.
ar: يتم استيراد المحتوى التالي.
ur: مندرجہ ذیل مواد درآمد کی جاتی ہے.
zh_cn: 以下内容被导入。

source: The course mode for this template.
ar: وضع الدورة لهذا القالب.
ur: اس سانچے کے لئے کورس کے موڈ.
zh_cn: 该模板的课程模式。

source: Edit your course goal:
ar: تعديل هدف الدورة التدريبية الخاصة بك:
ur: اپنے کورس کا مقصد میں ترمیم کریں:
zh_cn: 编辑您的课程目标：

source: coupon with the coupon id ({coupon_id}) is already inactive
ar: الكوبون بمعرف الكوبون ({coupon_id}) غير نشط
ur: کوپن ID ({coupon_id}) کے ساتھ کوپن پہلے سے ہی غیر فعال ہے
zh_cn: 优惠券ID（{coupon_id}）优惠券已经无效

source: Invalid `role` specified.
ar: &quot;دور&quot; غير صالح محدد.
ur: غلط `رول` مخصوص.
zh_cn: 指定了无效的“角色”。

source: Smaller Header
ar: أصغر رأس
ur: چھوٹے ہیڈر
zh_cn: 较小的标题
