Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: For functions, type the name of the function, then the expression in parentheses.
ar: بالنسبة للوظائف ، اكتب اسم الدالة ، ثم التعبير بين قوسين.
ur: افعال کے لئے، اس تقریب کا نام ٹائپ کریں، پھر قارئین میں اظہار.
zh_cn: 对于函数，输入函数的名称，然后在括号中输入表达式。

source: Your Platform Studio
ar: ستوديو النظام الأساسي الخاص بك
ur: آپ کے پلیٹ فارم سٹوڈیو
zh_cn: 您的Platform Studio

source: Student (username/email={user}) already in certificate exception list.
ar: الطالب (اسم المستخدم / البريد الإلكتروني = {المستخدم}) موجود بالفعل في قائمة استثناءات الشهادة.
ur: طالب علم (صارف کا نام / ای میل = {صارف}) پہلے ہی سرٹیفکیٹ استثنی کی فہرست میں.
zh_cn: 学生（用户名/电子邮件= {用户}）已经在证书例外列表中。

source: We are sorry, you are not authorized to access {platform_name} via this channel. Please contact your learning administrator or manager in order to access {platform_name}.{line_break}{line_break}Error Details:{line_break}{error_message}
ar: نأسف ، غير مصرح لك بالدخول إلى {platform_name} عبر هذه القناة. يرجى الاتصال بمسؤول أو مدير التعلم من أجل الوصول إلى {platform_name}. {line_break} {line_break} تفاصيل الخطأ: {line_break} {error_message}
ur: ہمیں افسوس ہے، آپ کو اس چینل کے ذریعہ {platform_name} تک رسائی حاصل کرنے کا اختیار نہیں ہے. {platform_name} تک رسائی حاصل کرنے کیلئے اپنے سیکھنے والے منتظم یا مینیجر سے رابطہ کریں. {line_break} {line_break} غلطی کی تفصیلات: {line_break} {error_message} {error_message}
zh_cn: 很抱歉，您无权通过此频道访问{platform_name}。请联系您的学习管理员或经理以访问{platform_name}。{line_break} {line_break}错误详细信息：{line_break} {error_message}

source: Go to each individual course's Instructor dashboard to manage course enrollment.
ar: انتقل إلى لوحة معلومات المدرب لكل دورة تدريبية فردية لإدارة التسجيل في الدورة التدريبية.
ur: کورس کے اندراج کو منظم کرنے کے لئے انفرادی کورس کے انسٹرکٹر ڈش بورڈ پر جائیں.
zh_cn: 转到每个课程的讲师仪表板来管理课程注册。

source: Sign In to {studio_name}
ar: تسجيل الدخول إلى {studio_name}
ur: {سٹوڈیو_ نام} میں سائن ان کریں
zh_cn: 登录{studio_name}

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
ar: قد ترغب في تعديل XML في الدورة التدريبية الخاصة بك مباشرةً ، خارج {studio_name}. قد ترغب في إنشاء نسخة احتياطية من الدورة التدريبية الخاصة بك. أو قد ترغب في إنشاء نسخة من الدورة التدريبية التي يمكنك استيرادها لاحقًا إلى مثيل دورة تدريبية أخرى وتخصيصها.
ur: آپ {studio_name} کے باہر براہ راست، اپنے کورس میں XML میں ترمیم کرنا چاہتے ہیں. آپ اپنے کورس کا ایک بیک اپ کاپی بنانا چاہتے ہیں. یا، آپ اپنے کورس کی ایک نقل بنانا چاہتے ہیں کہ آپ بعد میں کسی اور کورس کی مثال میں درآمد کرسکتے ہیں اور اپنی مرضی کے مطابق کرسکتے ہیں.
zh_cn: 您可能想直接在{studio_name}之外编辑课程中的XML。您可能想要创建课程的备份副本。或者，您可能希望创建课程的副本，以便以后可以将其导入到其他课程实例中并进行自定义。

source: Learn more about importing a library
ar: تعرف على المزيد حول استيراد مكتبة
ur: ایک لائبریری درآمد کرنے کے بارے میں مزید جانیں
zh_cn: 了解有关导入库的更多信息

source: This account has been temporarily locked due to excessive login failures. Try again later.
ar: تم قفل هذا الحساب مؤقتًا بسبب حالات فشل تسجيل الدخول الزائدة. حاول مرة أخرى في وقت لاحق.
ur: زیادہ تر لاگ ان ناکامیوں کے سبب یہ اکاؤنٹ عارضی طور پر بند کردیا گیا ہے. بعد میں دوبارہ کوشش کریں.
zh_cn: 此帐户由于过度登录失败而被暂时锁定。稍后再试。

source: Administrator
ar: مدير
ur: منتظم
zh_cn: 管理员

source: Integrating your imported content into this course. This process might take longer with larger courses.
ar: تكامل المحتوى المستورد الخاص بك في هذه الدورة. هذه العملية قد تستغرق وقتا أطول مع دورات أكبر.
ur: اس کورس میں اپنی درآمد کردہ مواد کو ضم. یہ عمل بڑے کورسز کے ساتھ طویل عرصے تک لے جا سکتا ہے.
zh_cn: 将导入的内容整合到本课程中。大型课程可能需要更长的时间。

source: For smaller courses, click to list profile information for enrolled students directly on this page:
ar: بالنسبة للدورات التدريبية الأصغر حجمًا ، انقر لإدراج معلومات الملف الشخصي للطلاب المسجلين مباشرة في هذه الصفحة:
ur: چھوٹے کورسوں کے لئے، براہ راست اس صفحے پر درج شدہ طلباء کیلئے پروفائل کی معلومات کی فہرست پر کلک کریں:
zh_cn: 对于较小的课程，请单击以直接在此页面列出已登记学生的个人资料信息：

source: Please {link_start}send us e-mail{link_end}.
ar: يرجى {link_start} إرسال إلينا عبر البريد الإلكتروني {link_end}.
ur: براہ کرم {link_start} ہمیں ای میل بھیجیں {link_end}.
zh_cn: 请{link_start}向我们发送电子邮件{link_end}。

source: I completed the {course_title} course on {platform_name}.
ar: أكملت دورة {course_title} على {platform_name}.
ur: میں نے {course_title} کورس {platform_name} پر کورس مکمل کیا.
zh_cn: 我完成了{platform_name}上的{course_title}课程。

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
ar: قدمت. حالما يتم إرجاع استجابة ، سيتم استبدال هذه الرسالة بهذه التعليقات.
ur: پیش کردہ. جیسے ہی جواب واپس آ گیا ہے، اس پیغام کو اس رائے کی طرف سے تبدیل کیا جائے گا.
zh_cn: 提交。一旦返回响应，该消息将被该反馈取代。

source: Links
ar: الروابط
ur: روابط
zh_cn: 链接

source: Your verification is pending
ar: التحقق الخاص بك معلق
ur: آپ کی توثیق زیر التواء ہے
zh_cn: 您的验证正在处理中

source: Metrics
ar: المقاييس
ur: میٹرکس
zh_cn: 度量

source: Opens in a new browser window
ar: يفتح في نافذة متصفح جديدة
ur: ایک نیا براؤزر ونڈو میں کھولتا ہے
zh_cn: 在新的浏览器窗口中打开

source: A city is required
ar: المدينة مطلوبة
ur: شہر کی ضرورت ہے
zh_cn: 一个城市是必需的

source: discount or activation code
ar: الخصم أو رمز التفعيل
ur: ڈسکاؤنٹ یا چالو کرنے کا کوڈ
zh_cn: 折扣或激活码

source: Invalid user preference key '{preference_key}'.
ar: مفتاح تفضيل المستخدم غير صالح &#39;{preference_key}&#39;.
ur: غلط صارف کی ترجیح کلیدی &#39;{ترجیح_key}&#39;.
zh_cn: 无效的用户偏好键&#39;{preference_key}&#39;。

source: What content is imported?
ar: ما المحتوى الذي تم استيراده؟
ur: کیا مواد درآمد کی جاتی ہے؟
zh_cn: 什么内容被导入？

source: Your {task_name} task has completed with the status '{task_status}'. Use this URL to view task details or download any files created: {detail_url}
ar: اكتملت مهمة {task_name} الخاصة بك بالحالة &quot;{task_status}&quot;. استخدم عنوان URL هذا لعرض تفاصيل المهمة أو تنزيل أي ملفات تم إنشاؤها: {detail_url}
ur: آپ {task_name} کے کام نے حیثیت &#39;{task_status}&#39; کے ساتھ مکمل کر لیا ہے. کام کی تفصیلات دیکھنے کے لئے یا اس فائلوں کو پیدا کرنے کیلئے اس URL کو استعمال کریں: {detail_url}
zh_cn: 您的{task_name}任务已完成状态为“{task_status}”。使用此URL查看任务详细信息或下载创建的任何文件：{detail_url}

source: About edX
ar: حول edX
ur: EDX کے بارے میں
zh_cn: 关于edX

source: If the problem persists, please email us at {email_link}.
ar: إذا استمرت المشكلة ، فيُرجى مراسلتنا عبر البريد الإلكتروني على العنوان {email_link}.
ur: اگر مسئلہ جاری ہے تو، براہ مہربانی ہمیں {email_link} پر ای میل کریں.
zh_cn: 如果问题仍然存在，请发送电子邮件至{email_link}。

source: We only support uploading a .tar.gz file.
ar: نحن ندعم فقط تحميل ملف .tar.gz.
ur: ہم صرف ایک .tt.gz فائل اپ لوڈ کرنے کی حمایت کرتے ہیں.
zh_cn: 我们只支持上传.tar.gz文件。

source: Payment processing occurs on a separate secure site.
ar: تتم معالجة الدفع في موقع آمن منفصل.
ur: علیحدہ محفوظ سائٹ پر ادائیگی کی پروسیسنگ ہوتی ہے.
zh_cn: 付款处理发生在一个单独的安全站点上。

source: Send a note to students via email
ar: إرسال ملاحظة للطلاب عبر البريد الإلكتروني
ur: ای میل کے ذریعے طالب علموں کو ایک نوٹ بھیجیں
zh_cn: 通过电子邮件向学生发送一个笔记

source: General indexing error occurred
ar: حدث خطأ عام في الفهرسة
ur: عمومی اشاریہ خرابی واقع ہوئی
zh_cn: 发生一般索引错误

source: Invalid prerequisite course key
ar: مفتاح دورة أساسية غير صالح
ur: غلط شرط کورس کی کلید
zh_cn: 无效的必备课程密钥

source: Community TA
ar: مجتمع TA
ur: کمیونٹی ٹی اے
zh_cn: 社区TA

source: Enrollment action is invalid
ar: إجراء التسجيل غير صالح
ur: اندراج کی کارروائی غلط ہے
zh_cn: 注册操作无效

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. Only enrolled users can be added as Discussion Moderators.
ar: يمكن لمشرفي المناقشة تعديل أي مشاركة أو حذفها ، ومسح إشارات إساءة الاستخدام ، وإغلاق سلاسل المحادثات وإعادة فتحها ، وتأييد الردود ، ومشاهدة المشاركات من جميع المجموعات. يتم وضع علامة على وظائفهم بأنها &quot;الموظفين&quot;. لا يمكنهم إدارة عضوية فريق الدورة التدريبية عن طريق إضافة أو إزالة أدوار الإشراف على المناقشة. يمكن فقط إضافة المستخدمين المسجلين كمسائلين للمناقشة.
ur: بحث مینیجر کسی بھی اشاعت میں ترمیم یا حذف کرسکتے ہیں، غلط استعمال کے جھنڈے کو صاف کریں، قریبی اور دوبارہ کھولنے والے موضوعات، ردعمل قبول کریں اور تمام گروہوں سے خطوط دیکھ سکیں. ان کی اشاعتیں &#39;عملے&#39; کے طور پر نشان لگا دیا گیا ہے. بحث بحث اعتدال پسند کرداروں کو شامل کرنے یا ہٹانے کے ذریعے کورس ٹیم کی رکنیت کا انتظام نہیں کرسکتا ہے. صرف اندراج کردہ صارفین کو بحث مینیجرز کے طور پر شامل کیا جا سکتا ہے.
zh_cn: 讨论版主可以编辑或删除任何帖子，清除误用标志，关闭并重新打开主题，认可回复并查看所有群组的帖子。他们的帖子被标记为“员工”。他们无法通过添加或删除讨论审核角色来管理课程团队成员资格。只有注册用户可以添加为讨论版主。

source: Official proof of completion
ar: دليل رسمي على الانتهاء
ur: مکمل کرنے کا سرکاری ثبوت
zh_cn: 官方完成证明

source: The due date has passed, and peer grading for this problem is closed at this time.
ar: لقد انتهى تاريخ الاستحقاق ، وتم إغلاق تصنيف الزملاء لهذه المشكلة في هذا الوقت.
ur: متوقع تاریخ منظور ہوگئی ہے، اور اس مسئلے کے ہمراہ اس مرحلے کو ہم اس وقت بند کردیئے گئے ہیں.
zh_cn: 截止日期已过，此问题的同级评级已关闭。

source: Team id is required.
ar: معرف الفريق مطلوب.
ur: ٹیم کی شناخت کی ضرورت ہے.
zh_cn: 团队ID是必需的。

source: Already have a {studio_name} Account? Sign in
ar: هل لديك بالفعل حساب في {studio_name}؟ تسجيل الدخول
ur: پہلے سے ہی {studio_name} اکاؤنٹ ہے؟ داخلہ
zh_cn: 已经有{studio_name}帐户？签到

source: Mode
ar: الوضع
ur: موڈ
zh_cn: 模式

source: Manual Policy Definition
ar: تعريف السياسة اليدوي
ur: دستی پالیسی کی تعریف
zh_cn: 手动策略定义

source: {first_provider} and {second_provider}
ar: {first_provider} و {second_provider}
ur: {first_provider} اور {second_provider}
zh_cn: {first_provider}和{second_provider}

source: Discussion unavailable
ar: المناقشة غير متوفرة
ur: بحث دستیاب نہیں ہے
zh_cn: 讨论不可用

source: Add article
ar: إضافة المادة
ur: مضمون شامل کریں
zh_cn: 添加文章

source: List Price per item
ar: قائمة السعر لكل بند
ur: فی قیمت قیمت فہرست
zh_cn: 每件商品的价格

source: News - MITx 6.002x
ar: الأخبار - MITx 6،002x
ur: نیوز - MITX 6،002x
zh_cn: 新闻 - MITx 6,002x

source: Classes Start
ar: بدء الدروس
ur: کلاس شروع
zh_cn: 开课

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
ar: {studio_name} هو حل مستضاف لشركائنا في xConsortium والضيوف المحددين. تظهر الدورات التي أنت عضو في فريق لك أعلاه لتعديلها ، بينما تمنح امتيازات منشئي الدورة التدريبية من خلال {platform_name}. لقد أكمل فريقنا تقييم طلبك.
ur: {سٹوڈیو_ نام} ہمارے XConsortium شراکت داروں اور منتخب مہمانوں کے لئے ایک میزبان حل ہے. کورسز جن کے لئے آپ ٹیم ٹیم کا رکن آپ کے پاس ترمیم کرنے کے لئے مندرجہ بالا ظاہر ہوتا ہے، جبکہ کورس تخلیقی استحقاق {platform_name} کی طرف سے دی جاتی ہیں. ہماری ٹیم نے آپ کی درخواست کا اندازہ مکمل کیا ہے.
zh_cn: {studio_name}是我们的xConsortium合作伙伴和选定访客的托管解决方案。您作为团队成员的课程出现在上面供您编辑，而课程创建者权限由{platform_name}授予。我们的团队已完成评估您的请求。

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
ar: حمّل نشرة لمرافقة هذا الفيديو. يمكن للطلاب تنزيل النشرة من خلال النقر على تنزيل البيان ضمن الفيديو.
ur: اس ویڈیو کے ساتھ ایک ہینڈ آؤٹ اپ لوڈ کریں. طلباء کو ویڈیو کے تحت ہینڈ آؤٹ ڈاؤن لوڈ پر کلک کرکے ہینڈ آؤٹ ڈاؤن لوڈ کرسکتے ہیں.
zh_cn: 上传讲义以伴随此视频。学生可以点击视频下方的下载讲义下载讲义。

source: Enroll in edX101: Overview of Creating an edX Course
ar: التسجيل في edX101: نظرة عامة على إنشاء دورة EDX
ur: edX101 میں داخلہ: ایک EDX کورس تخلیق کرنے کا جائزہ
zh_cn: 注册edX101：创建edX课程概述

source: There was a problem with the staff answer to this problem: empty boundary.
ar: كانت هناك مشكلة في استجابة الموظفين لهذه المشكلة: الحدود الفارغة.
ur: عملے کے ساتھ اس مسئلہ کا جواب تھا: خالی حد.
zh_cn: 员工对这个问题的回答存在问题：空白的边界。

source: Invalid data
ar: بيانات غير صالحة
ur: غلط ڈیٹا
zh_cn: 无效数据

source: Learn more about importing a course
ar: تعرف على المزيد حول استيراد دورة تدريبية
ur: کورس درآمد کرنے کے بارے میں مزید جانیں
zh_cn: 了解更多关于导入课程的信息

source: Actions
ar: أفعال
ur: ایکشنز
zh_cn: 操作

source: Resetting extensions
ar: إعادة ضبط الامتدادات
ur: توسیع کی توسیع
zh_cn: 重置扩展程序

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
ar: لم نتمكن من التحقق من هويتك من أجل تقييم {assessment} في الدورة التدريبية {course_name}. لقد استخدمت {used_attempts} من {allowed_attempts} محاولات التحقق من هويتك ، ولم يعد التحقق ممكنًا.
ur: ہم {course_name} کورس میں {تشخیص} تشخیص کے لئے آپ کی شناخت کی توثیق نہیں کر سکے. آپ نے اپنی شناخت کی توثیق کرنے کے لئے {اجازت_ٹیمپس} کی کوششوں سے {استعمال شدہ امتیاز} استعمال کیے ہیں، اور توثیق اب ممکن نہیں ہے.
zh_cn: 我们无法验证您在{course_name}课程中的{assessment}评估的身份。您尝试使用{allowed_attempts}中的{used_attempts}来验证您的身份，并且验证不再可行。

source: Export
ar: تصدير
ur: برآمد کریں
zh_cn: 出口

source: Inquiry Type: {inquiry_type}
ar: نوع الاستفسار: {inquiry_type}
ur: انکوائری کی قسم: {انکوائری_ٹائپ}
zh_cn: 查询类型：{inquiry_type}

source: Total Payments Collected
ar: مجموع المدفوعات المجمعة
ur: مجموعی ادائیگی جمع کی گئی
zh_cn: 收取的总付款

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
ar: يعمل موظفونا حاليًا على إعادة الموقع في أسرع وقت ممكن. يرجى مراسلتنا عبر البريد الإلكتروني على {tech_support_email} للإبلاغ عن أي مشكلات أو تعطل.
ur: ہمارا اسٹاف فی الحال اس سائٹ کو جلد از جلد واپس لینے کے لئے کام کر رہا ہے. کسی بھی دشواری یا ٹائم ٹائم کی اطلاع دینے کیلئے براہ کرم ہمیں {tech_support_email} پر ای میل کریں.
zh_cn: 我们的工作人员正在努力尽快恢复网站。请发送电子邮件至{tech_support_email}，报告任何问题或停机时间。

source: Video ID
ar: معرف الفيديو
ur: ویڈیو ID
zh_cn: 视频ID

source: Saturday
ar: يوم السبت
ur: ہفتہ
zh_cn: 星期六

source: Schools & Partners
ar: المدارس والشركاء
ur: اسکولوں اور شراکت داروں
zh_cn: 学校和合作伙伴

source: Please select certificate statuses from the list only.
ar: يرجى تحديد حالات الشهادة من القائمة فقط.
ur: صرف فہرست سے سرٹیفکیٹ کی حیثیت کو منتخب کریں.
zh_cn: 请仅从列表中选择证书状态。

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
ar: عرض كل محتوى مطابق مؤهل للإضافة إلى {display_name}. سيخصص لكل طالب {max_count} عنصرًا عشوائيًا من هذه القائمة.
ur: {display_name} میں شامل کرنے کے قابل ہونے والی تمام مماثلت کا مواد دکھا رہا ہے. ہر طالب علم {list_count} اجزاء کو اس فہرست سے بے ترتیب طور پر تیار کیا جائے گا.
zh_cn: 显示所有可以添加到{display_name}的匹配内容。每个学生将被分配从此列表中随机抽取的{max_count}组件。

source: Preview this revision
ar: معاينة هذه المراجعة
ur: اس نظر ثانی کا جائزہ لیں
zh_cn: 预览此版本

source: e.g. Introduction to Computer Science
ar: على سبيل المثال مقدمة في علوم الكمبيوتر
ur: مثال کے طور پر کمپیوٹر سائنس کا تعارف
zh_cn: 例如计算机科学导论

source: Results:
ar: النتائج:
ur: نتائج:
zh_cn: 结果：

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
ar: ضع علامة على وحدة الدورة التدريبية هذه كاختبار دخول. لاحظ أنه يجب عليك تمكين امتحانات الدخول حتى يصبح إعداد الدورة التدريبية ساري المفعول.
ur: داخلہ امتحان کے طور پر اس کورس ماڈیول کو ٹیگ کریں. نوٹ، آپ کو اس کورس ترتیب کے اثرات کے لۓ داخلہ امتحان کو فعال کرنا ہوگا.
zh_cn: 将此课程模块标记为入学考试。请注意，您必须为此课程设置启用入学考试才能生效。

source: Got it!
ar: فهمتك!
ur: یہ مل گیا!
zh_cn: 得到它了！

source: Grading Settings
ar: إعدادات التقدير
ur: گریڈنگ کی ترتیبات
zh_cn: 评分设置

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
ar: اختر وحدة متدرجة وانقر على الزر للحصول على قائمة بجميع الطلاب الذين لديهم امتدادات للوحدة المعنية.
ur: ایک درجہ بندی یونٹ منتخب کریں اور تمام طالب علموں کی ایک فہرست حاصل کرنے کیلئے بٹن پر کلک کریں جن کو دیئے گئے یونٹ کے لئے ملانے کی ضرورت ہے.
zh_cn: 选择一个评分单元，然后点击按钮以获得所有给定单元扩展名的学生列表。

source: Course Details
ar: تفاصيل الدورة
ur: کورس کی تفصیلات
zh_cn: 课程详情

source: Show Answer
ar: اظهر الاجابة
ur: جواب دکھاو
zh_cn: 显示答案

source: Show the status for the tasks that you submitted for this problem.
ar: إظهار حالة المهام التي قمت بتقديمها لهذه المشكلة.
ur: اس مسئلے کے لئے پیش کردہ کاموں کے لئے حیثیت دکھائیں.
zh_cn: 显示您针对此问题提交的任务的状态。

source: [{course_key}] is not a valid course key.
ar: [{course_key}] ليس مفتاح دورة تدريبية صالحًا.
ur: [{course_key}] ایک درست کورس کی کلید نہیں ہے.
zh_cn: [{course_key}]不是有效的课程密钥。

source: Preferred Language
ar: اللغة المفضلة
ur: پسندیدہ زبان
zh_cn: 首选语言

source: Supplemental Links
ar: روابط تكميلية
ur: ضمنی لنکس
zh_cn: 补充链接

source: IP address
ar: عنوان IP
ur: IP پتہ
zh_cn: IP地址

source: Return To %s
ar: العودة إلى٪ s
ur: ٪ s پر واپس جائیں
zh_cn: 返回到％s

source: All Students
ar: كل الطلاب
ur: تمام طلباء
zh_cn: 全体学生

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
ar: يرجى التأكد من تحديث متصفحك إلى {strong_start} {a_start} أحدث إصدار ممكن {a_end} {strong_end}. يُرجى أيضًا التأكد من توصيل كاميرا الويب {strong_start} وتشغيلها ، والسماح لها بالعمل في متصفح الويب (عادةً ما تكون قابلة للتعديل في إعدادات المتصفح). {strong_end}
ur: براہ کرم یقینی بنائیں کہ آپ کا براؤزر {strong_start} {a_start} سب سے حالیہ ورژن ممکن {a_end} {strong_end} پر اپ ڈیٹ کیا جاتا ہے. اس کے علاوہ، براہ کرم یقینی بنائیں کہ آپ {strong_start} ویب کیم پلگ ان میں پلگ ان کی گئی ہے، اور آپ کے ویب براؤزر میں کام کرنے کی اجازت (آپ کے براؤزر ترتیبات میں عام طور پر سایڈست). {strong_end}
zh_cn: 请确保您的浏览器已更新至{strong_start} {a_start}最新版本{a_end} {strong_end}。另外，请确保您的{strong_start}网络摄像头已插入，打开并允许在您的网络浏览器中正常运行（通常可在浏览器设置中进行调整）。{strong_end}

source: General Legal Terms
ar: الشروط القانونية العامة
ur: عمومی قانونی شرائط
zh_cn: 一般法律条款

source: Required Information to Create a New Library
ar: المعلومات المطلوبة لإنشاء مكتبة جديدة
ur: نئی لائبریری بنانے کے لئے ضروری معلومات
zh_cn: 创建新库所需的信息

source: We just need a little more information before you start learning with {platform_name}.
ar: نحتاج فقط إلى المزيد من المعلومات قبل البدء في التعلم باستخدام {platform_name}.
ur: {platform_name} کے ساتھ سیکھنے شروع کرنے سے پہلے ہمیں صرف تھوڑی زیادہ معلومات کی ضرورت ہے.
zh_cn: 在开始使用{platform_name}进行学习之前，我们只需要更多信息。

source: Country or Region of Residence
ar: البلد أو منطقة الإقامة
ur: ملک یا رہائش کا علاقہ
zh_cn: 居住国家或地区

source: Generate Survey Results Report
ar: توليد تقرير نتائج المسح
ur: سروے کے نتائج رپورٹ بنائیں
zh_cn: 生成调查结果报告

source: Path to single course checkout page hosted by the E-Commerce service.
ar: المسار إلى صفحة الخروج من الدورة التدريبية الواحدة التي تستضيفها خدمة التجارة الإلكترونية.
ur: ای کامرس سروس کی میزبانی واحد کورس چیک آؤٹ صفحے پر ہے.
zh_cn: 由电子商务服务托管的单一课程结帐页面的路径。

source: Issuing bank unavailable. Possible action: retry again after a few minutes.
ar: إصدار البنك غير متوفر. الإجراء المحتمل: أعد المحاولة بعد بضع دقائق.
ur: جاری بینک دستیاب نہیں ہے. ممکنہ عمل: چند منٹ کے بعد دوبارہ کوشش کریں.
zh_cn: 发行银行不可用。可能的操作：几分钟后再次重试。

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
ar: منح أعضاء آخرين من فريق الدورة التدريبية الخاص بك الوصول إلى هذه المكتبة. يجب أن يكون لدى مستخدمي المكتبة الجدد حساب {studio_name} نشط.
ur: آپ کے کورس کی ٹیم کے دوسرے اراکین کو اس لائبریری تک رسائی حاصل ہے. نئی لائبریری صارفین کو ایک فعال {سٹوڈیو_ نام} اکاؤنٹ ہونا لازمی ہے.
zh_cn: 授予您的课程团队其他成员访问此库。新图书馆用户必须拥有一个有效的{studio_name}帐户。

source: Invalid course key
ar: مفتاح دورة غير صالح
ur: غلط کورس کی چابی
zh_cn: 无效的课程密钥

source: Let Learner Skip Entrance Exam
ar: اسمحوا المتعلم اقفز دخول امتحان
ur: سیکھنے کے لے جانے والے داخلہ امتحان دیں
zh_cn: 让学习者跳过入学考试

source: Git Commit
ar: جايت كومت
ur: گیٹ کمیٹی

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
ar: محتوى عادي أو محتوى html لعرض رسالة مخصصة داخل محتوى البريد الإلكتروني لأهلية الائتمان التي يتم إرسالها عندما يستوفي المستخدم جميع متطلبات الأهلية الائتمانية.
ur: کریڈٹ اہلیت ای میل کے مواد کے اندر اپنی مرضی کے مطابق پیغام کو ظاہر کرنے کے لئے سادہ متن یا ایچ ٹی ایم ایل مواد جو صارف کو تمام کریڈٹ کی اہلیت کی ضروریات سے پورا کرنے کے بعد بھیجا جاتا ہے.
zh_cn: 用于在用户满足所有信用资格要求时发送的信用资格电子邮件内容中显示自定义消息的纯文本或html内容。

source: By %(filter_title)s
ar: بواسطة٪ (filter_title) s
ur: ٪ (filter_title) کے ذریعہ
zh_cn: 由％（filter_title）s

source: text_search and order_by cannot be provided together
ar: لا يمكن توفير text_search و order_by معًا
ur: text_search اور آرڈر کے ساتھ ساتھ فراہم نہیں کیا جا سکتا
zh_cn: text_search和order_by不能一起提供

source: Tag this module as part of an Entrance Exam section
ar: ضع علامة على هذه الوحدة كجزء من قسم اختبار الدخول
ur: اس ماڈیول کو داخلہ امتحان سیکشن کے حصے کے طور پر ٹیگ کریں
zh_cn: 将此模块标记为入学考试部分的一部分

source: I've never authored a course online before. Is there help?
ar: لم أقم بتأليف دورة عبر الإنترنت من قبل. هل هناك مساعدة؟
ur: میں نے پہلے کبھی بھی آن لائن کورس کا تحریر نہیں کیا. کیا مدد ہے؟
zh_cn: 我以前从未在线撰写过一门课程。有帮助吗？

source: We hope you enjoy the course.
ar: نأمل أن تستمتع بالدورة.
ur: ہم امید کرتے ہیں کہ آپ کورس سے لطف اندوز کرتے ہیں.
zh_cn: 我们希望你喜欢这门课程。

source: {section_type} Average = {percent:.0%}
ar: {section_type} المتوسط ​​= {percent: .0٪}
ur: {سیکشن_ٹائپ} اوسط = {فیصد: .0٪}
zh_cn: {section_type}平均值= {百分比：.0％}

source: Select a course team role:
ar: حدد دور فريق الدورة التدريبية:
ur: ایک کورس ٹیم کا کردار منتخب کریں:
zh_cn: 选择课程团队角色：

source: Your account is already active
ar: حسابك نشط بالفعل
ur: آپ کا اکاؤنٹ پہلے ہی فعال ہے
zh_cn: 您的帐户已处于活动状态

source: This answer is incorrect.
ar: هذه الإجابة غير صحيحة.
ur: یہ جواب غلط ہے.
zh_cn: 这个答案是不正确的。

source: Read your email address
ar: قراءة عنوان بريدك الإلكتروني
ur: اپنا ای میل ایڈریس پڑھیں
zh_cn: 阅读你的电邮地址

source: Request to change {platform_name} account e-mail
ar: طلب لتغيير البريد الإلكتروني للحساب {platform_name}
ur: {platform_name} اکاؤنٹ ای میل کو تبدیل کرنے کی درخواست
zh_cn: 请求更改{platform_name}帐户电子邮件

source: Sailthru template to use on abandoned cart reminder. Deprecated.
ar: قالب Sailthru لاستخدامه في تذكير سلة المهجورة. إهمال.
ur: چھوڑ دیا ٹوکری یاد دہانی پر استعمال کرنے کے لئے سیلیلیو سانچے. ناپسندی
zh_cn: Sailthru模板使用废弃的车提醒。已过时。

source: Git Logs
ar: سجلات جيت
ur: گیٹ لاگز
zh_cn: Git日志

source: The nuts and bolts of your course
ar: المكسرات والمسامير من دراستك
ur: آپ کے کورس کے گری دار میوے اور بولٹ
zh_cn: 你的课程的坚果和螺栓

source: Mobile phone number
ar: رقم الهاتف الجوال
ur: موبائل فون نمبر
zh_cn: 手机号码

source: Welcome to the {platform_name} Wiki
ar: مرحبًا بك في {platform_name} Wiki
ur: {platform_name} ویکیپیڈیا میں خوش آمدید
zh_cn: 欢迎来到{platform_name} Wiki

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
ar: تم وضع علامة على المقالة &quot;٪ s&quot; كمحذوفة الآن! شكرا لحفظ الموقع خالية من المواد غير المرغوب فيها!
ur: آرٹیکل &quot;٪ s&quot; اب حذف کر دیا گیا ہے! ناپسندیدہ مواد سے سائٹ کو برقرار رکھنے کے لئے شکریہ!
zh_cn: 文章“％s”现在被标记为已删除！感谢您保持网站免受不需要的材料！

source: Percentage of seats purchased in bulk
ar: نسبة المقاعد المشتراة بالجملة
ur: بڑے پیمانے پر خریدنے والی سیٹوں کا فیصد
zh_cn: 批量购买的座位的百分比

source: Rescore All Learners' Submissions
ar: إعادة تقديم جميع المتعلمين
ur: ریورس سب سیکھنے والے ذیلی نشستیں
zh_cn: 重新提交所有学员提交的内容

source: View discussion
ar: عرض المناقشة
ur: بحث دیکھیں
zh_cn: 查看讨论

source: Customer Name
ar: اسم الزبون
ur: گاہک کا نام
zh_cn: 顾客姓名
