Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Course Advertised Start
ar: بالطبع أعلن عنها
ur: کورس کی تشہیر شروع
zh_cn: 课程通告开始

source: UNKNOWN REASON
ar: سبب غير معلوم
ur: غلط استعمال رپورٹ نہیں کیا جا سکا
zh_cn: 未知原因

source: Name of SurveyForm to display as a pre-course survey to the user.
ar: اسم SurveyForm لعرضه كاستبيان ما قبل الدورة التدريبية للمستخدم.
ur: صارف کو پری کورس سروے کے طور پر ظاہر کرنے کے لئے سروے فارم کا نام.
zh_cn: SurveyForm的名称作为课前调查显示给用户。

source: Video Pre-Roll
ar: فيديو ما قبل التشغيل
ur: ویڈیو پری رول
zh_cn: 视频预览

source: This answer is partially correct.
ar: هذه الإجابة صحيحة جزئيا.
ur: یہ جواب جزوی طور پر درست ہے.
zh_cn: 这个答案是部分正确的。

source: Unit {0} has no due date to extend.
ar: الوحدة {0} ليس لها تاريخ محدد لتمديدها.
ur: یونٹ {0} کی توسیع کی کوئی تاریخ نہیں ہے.
zh_cn: 单位{0}没有延期的到期日期。

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
ar: لتجديد الشهادات الخاصة بالدورة التدريبية الخاصة بك ، اختر المتعلمين الذين سيحصلون على شهادات تم تجديدها وانقر فوق &quot;إعادة إنشاء الشهادات&quot;.
ur: اپنے کورس کے سرٹیفکیٹ کو دوبارہ حاصل کرنے کے لئے، سیکھنے والوں کو منتخب کریں جو دوبارہ سرٹیفکیٹ سرٹیفکیٹس وصول کریں گے اور سرٹیفکیٹ دوبارہ تشکیل دیں پر کلک کریں.
zh_cn: 要重新生成课程证书，请选择将接收重新生成的证书的学习者，然后单击重新生成证书。

source: The status of the example certificate.
ar: حالة شهادة المثال.
ur: مثال کے طور پر سرٹیفکیٹ کی حیثیت.
zh_cn: 示例证书的状态。

source: Customer Reference
ar: إشارة العملاء
ur: گاہک کا حوالہ
zh_cn: 客户参考

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: حدد درجة مئوية مئوية كحد أدنى لاختبار القبول قبل أن يتمكن الطلاب من عرض محتوى الدورة التدريبية الخاصة بك. لاحظ أنه يجب عليك تمكين امتحانات الدخول حتى يصبح إعداد الدورة التدريبية ساري المفعول.
ur: طالب علم اپنے کورس کے مواد کو دیکھ سکتے ہیں اس سے قبل داخلہ امتحان کے لئے کم سے کم فی صد سکور کی وضاحت کریں. نوٹ، آپ کو اس کورس ترتیب کے اثرات کے لۓ داخلہ امتحان کو فعال کرنا ہوگا.
zh_cn: 在学生可以查看课程内容之前，为入学考试指定最低百分比分数。请注意，您必须为此课程设置启用入学考试才能生效。

source: Share your certificate with friends, employers, and others
ar: شارك شهادتك مع الأصدقاء وأصحاب العمل وغيرهم
ur: اپنے سرٹیفکیٹ دوستوں، نرسوں، اور دیگر کے ساتھ اشتراک کریں
zh_cn: 与朋友，雇主和其他人分享您的证书

source: The card has reached the credit limit. Possible fix: retry with another form of payment
ar: وصلت البطاقة إلى حد الائتمان. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: کارڈ کریڈٹ کی حد تک پہنچ گئی ہے. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 该卡已达到信用额度。可能的解决方法：使用其他付款方式重试

source: Why import a course?
ar: لماذا استيراد دورة تدريبية؟
ur: کورس کیوں درآمد
zh_cn: 为什么要导入课程？

source: Enroll in StudioX
ar: التسجيل في StudioX
ur: StudioX میں اندراج کریں
zh_cn: 注册StudioX

source: Cancelled
ar: ألغيت
ur: منسوخ
zh_cn: 取消

source: Allows all learners to work on the problem again.
ar: يسمح لجميع المتعلمين بالعمل على المشكلة مرة أخرى.
ur: تمام سیکھنے والوں کو دوبارہ پریشان کرنے کی اجازت دیتا ہے.
zh_cn: 允许所有学习者再次处理这个问题。

source: - Select -
ar: - تحديد -
ur: منتخب کریں -
zh_cn: - 选择 -

source: Could not read uploaded file.
ar: لا يمكن قراءة الملف الذي تم تحميله.
ur: اپ لوڈ کی فائل نہیں پڑ سکی.
zh_cn: 无法读取上传的文件。

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
ar: حدد مقطع فيديو ، طوله 5-10 ثوانٍ ، لتشغيله قبل مقاطع فيديو الدورة التدريبية. أدخل معرف الفيديو من صفحة تحميلات الفيديو وملف نسخ واحد أو أكثر بالتنسيق التالي: {format}. على سبيل المثال ، يبدو الإدخال لأحد مقاطع الفيديو التي تحتوي على نصين كالتالي: {example}
ur: کورس کی ویڈیوز سے پہلے کھیلنے کے لئے، ایک ویڈیو، لمبائی 5-10 سیکنڈ میں، کی شناخت کریں. ویڈیو اپ لوڈ کے صفحے سے ویڈیو ID درج کریں اور مندرجہ ذیل شکل میں ایک یا زیادہ ٹرانسپٹ فائلیں درج کریں: {فارمیٹ}. مثال کے طور پر، دو ٹرانسمیشن کے ساتھ ایک ویڈیو کے لئے ایک اندراج ایسا لگتا ہے: {مثال}
zh_cn: 确定一段长度为5-10秒的视频，以播放课程视频。从“视频上传”页面输入视频ID，并使用以下格式输入一个或多个副本文件：{格式}。例如，具有两个转录本的视频条目如下所示：{example}

source: format four digit year dash two digit month dash two digit day
ar: تنسيق أربعة أرقام سنة شرطة اثنين من رقم الشهر داش يومين رقم
ur: چار ہندسوں کا ڈیش فارم دو ڈیجیٹل ماہ ڈیش دو دن کے دن ڈایا
zh_cn: 格式四位数年份短划线两位数月份短划线两位数字日期

source: Remember when you enrolled in %(course_name)s, and other courses on edX.org? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تتذكر متى التحقت بـ٪ (course_name) s ، وغيرها من الدورات التدريبية على edX.org؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ٪ (course_name) s، اور EDX.org پر دوسرے کورسز میں داخلا ہو؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 记得你在％ed（course_name）上注册时，以及edX.org上的其他课程？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: Site statistics
ar: إحصائيات الموقع
ur: سائٹ کے اعداد و شمار
zh_cn: 网站统计

source: Create
ar: خلق
ur: بنانا
zh_cn: 创建

source: Problem scores are hidden until the due date.
ar: يتم إخفاء نقاط المشكلة حتى تاريخ الاستحقاق.
ur: مسئلے کا اسکور تاریخ کے مطابق پوشیدہ ہے.
zh_cn: 问题分数在截止日期之前是隐藏的。

source: Show Sent Email History
ar: إظهار سجل إرسال البريد الإلكتروني
ur: بھیجیں ای میل کی سرگزشت
zh_cn: 显示发送的电子邮件历史

source: Unable to find submission to be {action} for student '{student}'
ar: يتعذر العثور على المشاركة لتكون {فعل} للطالب &#39;{student}&#39;
ur: طالب علم &#39;{طالب علم}&#39; کیلئے {کارروائی} ہونے کے لئے جمع کرنے میں ناکام
zh_cn: 无法为学生&#39;{student}&#39;找到{{}作为提交内容

source: These reports are delimited by start and end dates.
ar: يتم تحديد هذه التقارير حسب تواريخ البدء والانتهاء.
ur: یہ رپورٹ شروع اور اختتامی تاریخوں کی طرف سے محدود ہیں.
zh_cn: 这些报告由开始和结束日期分隔。

source: After this, it's important to do a manual review.
ar: بعد ذلك ، من المهم إجراء مراجعة يدوية.
ur: اس کے بعد، دستی جائزہ لینے کے لئے ضروری ہے.
zh_cn: 在此之后，进行手动审查很重要。

source: Authentication with {} is currently unavailable.
ar: المصادقة مع {} غير متاحة حاليًا.
ur: {} کے ساتھ توثیق فی الحال دستیاب نہیں ہے.
zh_cn: 使用{}进行身份验证当前不可用。

source: Discount per item
ar: الخصم لكل عنصر
ur: فی شے ڈسکاؤنٹ
zh_cn: 每件商品折扣

source: Weight
ar: وزن
ur: وزن
zh_cn: 重量

source: About edX Verified Certificates
ar: حول شهادات التحقق من edX
ur: EDX تصدیق شدہ سرٹیفکیٹ کے بارے میں
zh_cn: 关于edX已验证的证书

source: December
ar: ديسمبر
ur: دسمبر
zh_cn: 十二月

source: Problem {action} for {succeeded} of {attempted} students
ar: حدثت مشكلة {action} لـ {succeeded} من {tried} الطلاب
ur: {کوشش} کے طلباء {کامیاب} کیلئے {کارروائی}
zh_cn: {尝试}学生的{成功}问题{行动}

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
ar: يحدد ما إذا كان زر &quot;إعادة التعيين&quot; معروضًا حتى يتمكن المستخدم من إعادة تعيين إجابته. يمكن ضبط القيمة الافتراضية في الإعدادات المتقدمة.
ur: یہ تعین کرتا ہے کہ ایک &#39;ری سیٹ&#39; کے بٹن کو دکھایا گیا ہے تاکہ صارف اپنے جواب کو دوبارہ ترتیب دے سکیں. ایک ڈیفالٹ قدر اعلی درجے کی ترتیبات میں مقرر کیا جا سکتا ہے.
zh_cn: 确定是否显示“重置”按钮，以便用户可以重置他们的答案。可以在高级设置中设置默认值。

source: Unknown reason
ar: سبب غير معلوم
ur: نامعلوم وجہ
zh_cn: 未知的原因

source: Rescore All Problems Only If Score Improves
ur: ریسرچ صرف تمام مسائل صرف اسکور بہتر بنانے کے
zh_cn: 如果分数提高，只重新解决所有问题

source: Learn More
ar: أعرف أكثر
ur: اورجانیے
zh_cn: 学到更多

source: Which child module students in a particular group_id should see
ar: أي من طلاب الوحدات النمطية في group_id معين يجب أن يراه
ur: کسی خاص گروہ میں کون سا بچے ماڈیول طالب علم دیکھنا چاہئے
zh_cn: 哪个子模块的学生应该看到特定的group_id

source: Invalid task_output information found for instructor_task {0}: {1}
ar: تم العثور على معلومات task_output غير صالحة لـ instructor_task {0}: {1}
ur: انسٹرکٹر_ٹاس {0}: {1} کے لئے مل گیا غلط کام_ آؤٹ پٹ کی معلومات
zh_cn: 为instructor_task {0}找到无效的task_output信息：{1}

source: Discussion ID: {discussion_id}
ar: معرّف المناقشة: {discussion_id}
ur: بحث ID: {discussion_id}
zh_cn: 讨论ID：{discussion_id}

source: You have been invited to a beta test for {course_name}
ar: لقد تمت دعوتك إلى اختبار تجريبي لـ {course_name}
ur: آپ کو {bet_name} کے لئے بیٹا امتحان میں مدعو کیا گیا ہے
zh_cn: 您已受邀参加{course_name}的测试版测试

source: email address required (not username)
ar: عنوان البريد الإلكتروني مطلوب (وليس اسم المستخدم)
ur: ای میل ایڈریس کی ضرورت (صارف نام نہیں ہے)
zh_cn: 需要电子邮件地址（不是用户名

source: Previous
ar: سابق
ur: پچھلا
zh_cn: 以前

source: email: {email}
ar: البريد الإلكتروني: {email}
ur: ای میل: {ای میل}
zh_cn: 电子邮件：{email}

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
ar: عذرًا ، ولكن هذا الإصدار من متصفحك غير مدعوم. حاول مرة أخرى باستخدام متصفح مختلف أو إصدارًا أحدث من متصفحك.
ur: ہمیں افسوس ہے، لیکن آپ کے براؤزر کا یہ ورژن معاون نہیں ہے. ایک مختلف براؤزر یا اپنے براؤزر کا نیا ورژن استعمال کرکے دوبارہ کوشش کریں.
zh_cn: 很抱歉，您的浏览器版本不受支持。请尝试使用其他浏览器或较新版本的浏览器。

source: More Information About {user_name}'s Certificate:
ar: مزيد من المعلومات حول شهادة {user_name}:
ur: {user_name} کے سرٹیفکیٹ کے بارے میں مزید معلومات:
zh_cn: 有关{user_name}的证书的更多信息：

source: Effective Date: April 12th, 2016
ar: تاريخ السريان: 12 أبريل 2016
ur: مؤثر تاریخ: 12 اپریل، 2016
zh_cn: 生效日期：2016年4月12日

source: Message {action} for {succeeded} of {attempted} recipients
ar: رسالة {action} لـ {succeeded} من {recippted} المستلمين
ur: {کامیاب} {کوشش} وصول کرنے والوں کیلئے {کارروائی} پیغام
zh_cn: {尝试}收件人{成功}的消息{action}

source: Enrollment Successful
ar: التسجيل ناجح
ur: اندراج کامیاب
zh_cn: 注册成功

source: Welcome to {org}'s {course_name}!
ar: مرحبًا بك في {org} لاعب {course_name}!
ur: {org} کے {course_name} میں خوش آمدید!
zh_cn: 欢迎来到{org}的{course_name}！

source: Reviewing semantics, syntax, and required data
ar: مراجعة الدلالات والبناء والبيانات المطلوبة
ur: سیمانکس، نحو، اور ضروری اعداد و شمار کا جائزہ لیں
zh_cn: 查看语义，语法和所需数据

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
ar: تم حفظ إجاباتك ولكن لم يتم تقييمها. انقر فوق &quot;{button_name}&quot; لتصنيفها.
ur: آپ کے جوابات محفوظ کیے گئے ہیں لیکن درجہ بندی نہیں کیے گئے ہیں. انہیں گریڈ کرنے کیلئے &#39;{button_name}&#39; پر کلک کریں.
zh_cn: 您的答案已保存但未分级。点击“{button_name}”为它们打分。

source: TIME_FORMAT
ar: تنسيق الوقت
ur: وقت کی ترتیب
zh_cn: 时间格式

source: Start time format two digit hours colon two digit minutes
ar: تنسيق وقت البدء من رقمين ساعة القولون رقمين من الدقائق
ur: دو ہندسوں کا حساب دو پوائنٹس منٹ کا آغاز وقت کی شکل شروع کریں
zh_cn: 开始时间格式两位数小时冒号两位数分钟

source: Unable to get git log
ar: غير قادر على الحصول على سجل بوابة
ur: گٹ لاگ حاصل کرنے میں ناکام
zh_cn: 无法获得git日志

source: {studio_name} Server Error
ar: {studio_name} خطأ في الخادم
ur: {سٹوڈیو_ نام} سرور کی خرابی
zh_cn: {studio_name}服务器错误

source: The URL of your company's website.
ar: عنوان URL الخاص بموقع شركتك على الويب.
ur: آپ کی کمپنی کی ویب سائٹ کا یو آر ایل.
zh_cn: 您公司网站的网址。

source: This won't help me reach my goals
ar: هذا لن يساعدني في الوصول إلى أهدافي
ur: یہ میرے مقاصد تک پہنچنے میں میری مدد نہیں کرے گا
zh_cn: 这不会帮助我达到目标

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
ar: أنت مسجل في مسار التدقيق لهذه الدورة. لا يتضمن مسار التدقيق شهادة.
ur: آپ اس کورس کے لئے آڈٹ ٹریک میں داخل ہوئے ہیں. آڈٹ ٹریک میں ایک سرٹیفکیٹ شامل نہیں ہے.
zh_cn: 您已加入本课程的审核跟踪。审计跟踪不包括证书。

source: %(file)s has been saved.
ar: تم حفظ٪ (file) s.
ur: ٪ (فائل) کو بچایا گیا ہے.
zh_cn: ％（文件）已保存。

source: Upgrade Now
ar: تحديث الآن
ur: اب اپ گریڈ کریں
zh_cn: 现在升级

source: Back to editor
ar: العودة إلى المحرر
ur: ایڈیٹر پر واپس
zh_cn: 回到编辑

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resume, or post it directly on LinkedIn
ar: {b_start} المشاركة بسهولة: {b_end} إضافة الشهادة إلى سيرتك الذاتية أو السيرة الذاتية ، أو نشرها مباشرة على LinkedIn
ur: {b_start} آسانی سے قابل حصول: {b_end} سرٹیفکیٹ آپ کے CV میں شامل کریں یا دوبارہ شروع کریں، یا اسے براہ راست لنکڈ پر بھیجیں
zh_cn: {b_start}轻松分享：{b_end}将证书添加到您的简历或简历中，或直接在LinkedIn上发布

source: You must enter and confirm your new password.
ar: يجب عليك إدخال كلمة المرور الجديدة وتأكيدها.
ur: آپ کو اپنے نئے پاس ورڈ درج کریں اور تصدیق کرنا ضروری ہے.
zh_cn: 您必须输入并确认您的新密码。

source: Sailthru send template to use on upgrading a course. Deprecated
ar: إرسال Sailthru قالب لاستخدامه في ترقية دورة تدريبية. إهمال
ur: سیلیلیو ایک کورس کو اپ گریڈ کرنے پر استعمال کرنے کے لئے ٹیمپلیٹ بھیجتا ہے. ناپسندی
zh_cn: Sailthru发送模板用于升级课程。弃用

source: New Update
ar: تحديث جديد
ur: نیا اپ ڈیٹ
zh_cn: 新的更新

source: Back to history view
ar: العودة إلى عرض التاريخ
ur: تاریخ کے منظر پر واپس جائیں
zh_cn: 回到历史视图

source: Settings for plugin
ar: إعدادات البرنامج المساعد
ur: پلگ ان کے لئے ترتیبات
zh_cn: 插件的设置

source: Help adding Files and Uploads
ar: مساعدة في إضافة الملفات والتحميلات
ur: فائلیں اور اپ لوڈ شامل کرنے میں مدد کریں
zh_cn: 帮助添加文件和上传

source: detailed enrollment
ar: التسجيل مفصل
ur: تفصیلی اندراج
zh_cn: 详细报名

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
ar: قم باستيراد مخزن git المحدد والفرع الاختياري في الدليل modulestore المحدد بشكل اختياري.
ur: ماڈیولسٹور میں مخصوص گیٹ ذخیرہ اور اختیاری برانچ درآمد کریں اور اختیاری مخصوص ڈائریکٹری.
zh_cn: 将指定的git存储库和可选分支导入到模块库和可选的指定目录中。

source: We need to verify your email address
ar: نحن بحاجة إلى التحقق من عنوان بريدك الإلكتروني
ur: ہمیں آپ کا ای میل ایڈریس کی توثیق کرنے کی ضرورت ہے
zh_cn: 我们需要验证您的电子邮件地址

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
ar: لم يوافق {provider_name} على طلبك للحصول على رصيد الدورة التدريبية. لمزيد من المعلومات ، اتصل {link_to_provider_site} مباشرة.
ur: {provider_name} نے کورس کریڈٹ کے لئے آپ کی درخواست منظور نہیں کی. مزید معلومات کے لئے براہ راست {link_to_provider_site} سے رابطہ کریں.
zh_cn: {provider_name}不会批准您的课程学分请求。有关更多信息，请直接联系{link_to_provider_site}。

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
ar: {em_start} لا تُحذف {em_end} الشهادات بعد بدء الدورة التدريبية ؛ لن يتمكن المتعلمون الذين حصلوا على شهادات بالفعل من الوصول إليهم.
ur: {em_start} کورس کا آغاز کرنے کے بعد سرٹیفیکیٹ حذف نہیں کریں {em_end}؛ سیکھنے والوں نے جو پہلے سے ہی سرٹیفکیٹ حاصل کیے ہیں انہیں اب تک رسائی حاصل نہیں ہو گی.
zh_cn: {em_start}在课程开始后不要{em_end}删除证书;已经获得证书的学习者将不再能够访问它们。

source: I agree to the {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}
ar: أوافق على {platform_name} {terms_of_service_link_start} {terms_of_service} {terms_of_service_link_end}
ur: میں {platform_name} {terms_of_service_link_start} {terms_of_service} {terms_of_service_link_end} سے اتفاق کرتا ہوں.
zh_cn: 我同意{platform_name} {terms_of_service_link_start} {terms_of_service} {terms_of_service_link_end}

source: Add Group Community TA
ar: أضف مجتمع المجموعة TA
ur: گروپ کمیونٹی ٹی اے شامل کریں
zh_cn: 添加组社区TA

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
ar: هناك خطأ ما. تقسم برامج البريد الإلكتروني أحيانًا عناوين URL إلى سطرين ، لذا تأكد من تنسيق عنوان URL الذي تستخدمه بشكل صحيح. إذا كنت لا تزال تواجه مشكلات ، فأرسل إلينا رسالة بريد إلكتروني على {email_start} {email} {email_end}.
ur: کچھ غلط ہو گیا. ای میل پروگرام کبھی کبھی دو لائنوں میں یو آر ایل کو تقسیم کرتی ہیں، لہذا اس بات کو یقینی بنائیں کہ آپ جو استعمال کرتے ہوئے یو آر ایل درست طریقے سے فارمیٹ کیا گیا ہے. اگر آپ اب بھی مسائل ہیں تو ہمیں {email_start} {ای میل} {email_end} پر ایک ای میل پیغام بھیجیں.
zh_cn: 出了些问题。电子邮件程序有时会将网址分成两行，因此请确保您使用的网址格式正确。如果您仍有问题，请发送电子邮件至{email_start} {email} {email_end}。

source: If you don't have an {platform_name} account yet, click <strong>Register</strong> at the top of the page.
ar: إذا لم يكن لديك حساب {platform_name} حتى الآن ، فانقر فوق <strong>تسجيل</strong> في أعلى الصفحة.
ur: اگر آپ کے پاس ابھی {platform_name} اکاؤنٹ نہیں ہے، تو صفحے کے سب سے اوپر <strong>رجسٹر</strong> پر کلک کریں.
zh_cn: 如果您还没有{platform_name}帐户，请点击页面顶部的<strong>注册</strong> 。

source: Gross Revenue over the Minimum
ar: الإيرادات الإجمالية على الحد الأدنى
ur: کم از کم زیادہ مجموعی آمدنی
zh_cn: 总收入超过最低限额

source: November
ar: شهر نوفمبر
ur: نومبر
zh_cn: 十一月

source: Reindex current course
ar: دورة ريندكس الحالية
ur: موجودہ کورس کا حوالہ دیتے ہیں
zh_cn: Reindex当前课程

source: Print Receipt
ar: اطبع الايصال
ur: پرنٹ رسيد
zh_cn: 打印收据

source: You are enrolled in this course
ar: أنت مسجل في هذه الدورة
ur: آپ اس کورس میں داخل ہوئے ہیں
zh_cn: 你参加了这门课程

source: The provided access_token is not valid.
ar: و access_token المقدمة غير صالحة.
ur: فراہم کردہ access_token درست نہیں ہے.
zh_cn: 提供的access_token无效。

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
ar: يساعدك أعضاء فريق الدورة التدريبية الذين لديهم دور المشرف في إدارة الدورة التدريبية. ويمكنهم تنفيذ جميع المهام التي يمكن أن يقوم بها الموظفون ، ويمكنهم أيضًا إضافة وإزالة الأدوار الخاصة بالموظفين والمسؤولين ، وأدوار الإشراف على المناقشة ، ودور الاختبار التجريبي لإدارة عضوية فريق الدورة التدريبية. يمكنك فقط إعطاء أدوار فريق المقرر للمستخدمين المسجلين.
ur: ایڈمن رول کے ساتھ کورس کے ٹیم کے ارکان آپ کے کورس کا انتظام کرنے میں مدد کرتے ہیں. وہ تمام کاموں کو کرسکتے ہیں جو اسٹاف کر سکتے ہیں، اور اسٹاف اور ایڈمن کے کرداروں، بحث مباحثے کے کرداروں، اور بیٹا ٹیم کی رکنیت کو منظم کرنے کے لئے بیٹا ٹیسر رول بھی شامل کرسکتے ہیں. آپ کورسز ٹیم کے رول کو صارفین کو اندراج کرنے کے لئے صرف دے سکتے ہیں.
zh_cn: 具有管理员角色的课程团队成员可以帮助您管理课程。他们可以完成员工可以完成的所有任务，还可以添加和删除员工和管理员角色，讨论审核角色以及测试人员角色，以管理课程团队成员资格。您只能将课程团队角色授予注册用户。

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
ar: ملاحظة: يجب أن يكون لدى المستخدمين حساب مُنشّط {platform_name} قبل أن يتم تسجيلهم كمختبرين لإصدار بيتا.
ur: نوٹ: بیٹا امتحان کے طور پر اندراج کیا جا سکتا ہے اس سے پہلے کہ صارفین کو ایک فعال {platform_name} اکاؤنٹ ہونا لازمی ہے.
zh_cn: 注意：用户必须先拥有激活的{platform_name}帐户，然后才能将其作为Beta版测试人员注册。

source: edX Email
ar: EDX البريد الإلكتروني
ur: ایڈی ایکس ای میل
zh_cn: edX电子邮件

source: Learner
ar: متعلم
ur: سیکھنے والا
zh_cn: 学习者

source: Frequently Used Coupon Codes
ar: رموز القسيمة المستخدمة بشكل متكرر
ur: اکثر استعمال کردہ کوپن کوڈز
zh_cn: 常用的优惠券代码

source: Search and add file
ar: بحث وإضافة ملف
ur: فائل تلاش کریں اور شامل کریں
zh_cn: 搜索并添加文件

source: Preview Language Setting
ar: معاينة إعدادات اللغة
ur: پیش نظارہ زبان کی ترتیب
zh_cn: 预览语言设置

source: The merchantReferenceCode sent with this authorization request matches the merchantReferenceCode of another authorization request that you sent in the last 15 minutes. Possible fix: retry the payment after 15 minutes.
ar: يتطابق التاجر RecuerCode الذي تم إرساله مع طلب التفويض هذا مع merchantReferenceCode لطلب تفويض آخر أرسلته في آخر 15 دقيقة. إصلاح محتمل: أعد محاولة الدفع بعد مرور 15 دقيقة.
ur: اس مجاز کی درخواست کے ساتھ بھیجے جانے والا سوداگرس کوڈ کوڈ جس سے آپ نے گزشتہ 15 منٹ میں بھیجے جانے والی دوسری اجازت نامے کے مرچنٹ ریزانس کوڈ سے ملتی ہے. ممکنہ طے: 15 منٹ کے بعد ادائیگی دوبارہ کریں.
zh_cn: 通过此授权请求发送的merchantReferenceCode与您在过去15分钟内发送的另一个授权请求的merchantReferenceCode相匹配。可能的解决方法：15分钟后重试付款。

source: Incorrect data received from notes api.
ar: بيانات غير صحيحة وردت من الملاحظات api.
ur: نوٹس api سے وصول کردہ غلط ڈیٹا.
zh_cn: 从笔记api收到不正确的数据。

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
ar: انقر على كل مراجعة للاطلاع على قائمة بالأسطر المعدلة. انقر على زر معاينة لرؤية كيف بدا المقال في هذه المرحلة. في أسفل هذه الصفحة ، يمكنك التغيير إلى مراجعة معينة أو دمج نسخة قديمة مع النسخة الحالية.
ur: ترمیم شدہ لائنوں کی فہرست دیکھنے کے لئے ہر ترمیم پر کلک کریں. اسٹیج کو دیکھنے کے لئے ملاحظہ کریں کے بٹن پر کلک کریں اس مرحلے پر کیا مضمون دیکھا. اس صفحے کے نچلے حصے میں، آپ کسی خاص نظر ثانی میں تبدیل کرسکتے ہیں یا موجودہ ایک کے ساتھ ایک پرانے نظر ثانی کو ضم کرسکتے ہیں.
zh_cn: 单击每个修订版以查看已编辑行的列表。点击预览按钮查看文章是如何看待这个阶段的。在此页面的底部，您可以更改为特定修订版本，或者将旧版本与当前修订版本合并。

source: No message provided
ar: لا توجد رسالة المقدمة
ur: کوئی پیغام فراہم نہیں کیا گیا
zh_cn: 没有提供信息

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate.
ar: لا تفوت الفرصة لتسليط الضوء على معرفتك ومهاراتك الجديدة من خلال الحصول على شهادة تم التحقق منها.
ur: تصدیق شدہ سرٹیفکیٹ حاصل کرکے اپنے نئے علم اور مہارت کو اجاگر کرنے کا موقع مت چھوڑیں.
zh_cn: 千万不要错过这个机会，通过获得经过验证的证书来突出您的新知识和技能。

source: View {name} certificate
ar: عرض شهادة {name}
ur: دیکھیں {نام} سرٹیفکیٹ
zh_cn: 查看{name}证书

source: e.g. Your Name (for certificates)
ar: على سبيل المثال اسمك (للشهادات)
ur: مثال کے طور پر آپ کا نام (سرٹیفکیٹ کے لئے)
zh_cn: 例如您的姓名（用于证书）

source: Dec
ar: ديسمبر
ur: دسمبر
zh_cn: 十二月

source: {currency_symbol}{price} {currency_abbr}
ur: {currency_symbol} {قیمت} {currency_abbr}

source: Group Community TA
ar: مجتمع المجموعة TA
ur: گروپ کمیونٹی ٹی اے
zh_cn: 团体社区TA

source: You are re-using a password that you have used recently. You must have {num} distinct password before reusing a previous password.
ar: أنت تعيد استخدام كلمة مرور استخدمتها مؤخرًا. يجب أن يكون لديك {num} كلمة مرور مميزة قبل إعادة استخدام كلمة المرور السابقة.
ur: آپ ایک پاسورڈ دوبارہ دوبارہ استعمال کر رہے ہیں جس نے آپ نے حال ہی میں استعمال کیا ہے. پچھلے پاس ورڈ دوبارہ استعمال کرنے سے پہلے آپ کو {نوم} مختلف پاس ورڈ ہونا ضروری ہے.
zh_cn: 您正在重新使用您最近使用过的密码。在重新使用以前的密码之前，您必须拥有{num}不同的密码。

source: Directory/ID
ar: دليل / ID
ur: ڈائریکٹری / شناخت
zh_cn: 目录/ ID

source: A file was changed: %s
ar: تم تغيير الملف:٪ s
ur: ایک فائل تبدیل کردی گئی:٪ s
zh_cn: 文件已更改：％s

source: Add All Units
ar: إضافة جميع الوحدات
ur: تمام یونٹس شامل کریں
zh_cn: 添加所有单位

source: Becoming a Course Creator in {studio_name}
ar: أن تصبح مُنشئ دورة تدريبية في {studio_name}
ur: {سٹوڈیو_ نام} میں کورس خالق بننا
zh_cn: 成为{studio_name}中的课程创建者

source: You can not move an item directly into content experiment.
ar: لا يمكنك نقل عنصر مباشرةً إلى تجربة المحتوى.
ur: آپ آئٹم کو براہ راست مواد کے استعمال میں منتقل نہیں کر سکتے ہیں.
zh_cn: 您无法直接将项目移动到内容实验中。

source: Library Version
ar: نسخة المكتبة
ur: لائبریری ورژن
zh_cn: 库版本

source: Catalog Search
ar: البحث في الكتالوج
ur: کیٹلوگ تلاش
zh_cn: 目录搜索

source: The course for which this deadline applies
ar: الدورة التي ينطبق عليها هذا الموعد النهائي
ur: اس کورس کے لئے یہ آخری وقت ہوتا ہے
zh_cn: 本截止日期适用的课程

source: Registration Code Used
ar: رمز التسجيل المستخدمة
ur: رجسٹری کوڈ استعمال کیا جاتا ہے
zh_cn: 使用注册码

source: Billing Address
ar: عنوان وصول الفواتير
ur: بل کا پتہ
zh_cn: 帐单地址

source: You are now sign up... and now you can sign in!
ar: أنت الآن تسجل ... والآن يمكنك تسجيل الدخول!
ur: اب آپ سائن اپ کر رہے ہیں ... اور اب آپ سائن ان کر سکتے ہیں!
zh_cn: 您现在注册...现在您可以登录了！

source: Expectations of the students taking this course
ar: توقعات الطلاب أخذ هذه الدورة
ur: طالب علموں کی توقعات اس کورس کو لے رہی ہیں
zh_cn: 期望学生参加这门课程

source: Expand or Collapse
ar: توسيع أو تصغير
ur: توسیع یا ختم کریں
zh_cn: 展开或折叠
