Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Order Id:
ar: رقم التعريف الخاص بالطلب:
ur: آرڈر کی شناخت:
zh_cn: 订单编号：

source: Unread posts
ar: المشاركات غير المقروءة
ur: ناپسندیدہ مراسلہ
zh_cn: 未读帖子

source: Average Price per Seat
ar: متوسط ​​السعر لكل مقعد
ur: سیٹ فی اوسط قیمت
zh_cn: 每座座位的平均价格

source: Example of a verified certificate
ar: مثال على شهادة تم التحقق منها
ur: تصدیق شدہ سرٹیفکیٹ کی مثال
zh_cn: 已验证证书的示例

source: Math Expression Input
ar: مدخل تعبير الرياضيات
ur: ریاضی اظہار ان پٹ
zh_cn: 数学表达式输入

source: Accessibility Accommodation Request
ar: طلب سكن إمكانية الوصول
ur: رسائی کی رہائش کی درخواست
zh_cn: 无障碍住宿要求

source: This value is invalid.
ar: هذه القيمة غير صالحة.
ur: یہ قیمت غلط ہے.
zh_cn: 此值无效。

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
ar: استخدم تكوينات مجموعة التجربة إذا كنت تجري تجارب المحتوى ، والتي تعرف أيضًا باسم اختبار A / B ، في الدورة التدريبية الخاصة بك. تحدد تهيئات مجموعة التجارب عدد مجموعات المتعلمين في تجربة المحتوى. عندما تقوم بإنشاء تجربة محتوى لدورة تدريبية ، فإنك تحدد تكوين المجموعة المراد استخدامه.
ur: اگر آپ کے تجربے میں مواد کے تجربات چل رہے ہیں، جو بھی A / B ٹیسٹنگ کے طور پر جانا جاتا ہے تو استعمال کے گروپ ترتیب استعمال کریں. تجرباتی گروپ کی ترتیبات یہ بتاتے ہیں کہ سیکھنے والے کتنے گروپوں میں مواد استعمال میں ہیں. جب آپ کورس کے لئے ایک مواد تجربہ بناتے ہیں، تو آپ کو استعمال کرنے کیلئے گروپ ترتیب کو منتخب کریں.
zh_cn: 如果您在课程中进行内容实验（也称为A / B测试），请使用实验组配置。实验组配置定义了内容实验中有多少个学习者组。为课程创建内容实验时，请选择要使用的组配置。

source: Task Status
ar: حالة المهمة
ur: ٹاسک اسٹیٹ
zh_cn: 任务状态

source: Automatically approve valid refund requests, without manual processing
ar: الموافقة تلقائيًا على طلبات رد الأموال الصالحة ، دون معالجة يدوية
ur: بغیر دستی پراسیسنگ کے بغیر خود بخود درست رقم کی واپسی کی درخواستیں منظور کریں
zh_cn: 自动批准有效的退款请求，无需手动处理

source: You can now {link_start}sign in{link_end}.
ar: يمكنك الآن {link_start} تسجيل الدخول {link_end}.
ur: آپ {link_start} سائن ان {link_end} کرسکتے ہیں.
zh_cn: 您现在可以{link_start}登录{link_end}。

source: New Library
ar: مكتبة جديدة
ur: نئی لائبریری
zh_cn: 新图书馆

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
ar: أدخل المسار المطلوب استخدامه للملفات الموجودة في صفحة الملفات والتحميلات. تتجاوز هذه القيمة الافتراضي Studio ، c4x: //.
ur: فائلوں پر فائلوں کے لئے استعمال کرنے کا راستہ درج کریں اور صفحہ اپ لوڈ کریں. اس قدر سٹوڈیو ڈیفالٹ، c4x: //.
zh_cn: 在“文件和上传”页面上输入用于文件的路径。此值将覆盖Studio默认值c4x：//。

source: Thank you for signing up for {platform_name}.
ar: شكرًا لك على التسجيل في {platform_name}.
ur: {platform_name} کے لئے سائن اپ کرنے کے لئے آپ کا شکریہ.
zh_cn: 感谢您注册{platform_name}。

source: Page Not Found
ar: الصفحة غير موجودة
ur: صفحہ نہیں ملا
zh_cn: 找不到网页

source: Schedule
ar: جدول
ur: شیڈول
zh_cn: 时间表

source: Send Email
ar: ارسل بريد الكتروني
ur: ای میل بھیجیں
zh_cn: 发电子邮件

source: Add Missing Groups
ar: إضافة مجموعات مفقودة
ur: لاپتہ گروپ شامل کریں
zh_cn: 添加缺少的组

source: Dismiss
ar: رفض
ur: خطرہ
zh_cn: 解雇

source: Please correct the highlighted fields below.
ar: يرجى تصحيح الحقول الموضحة أدناه.
ur: ذیل میں نمایاں فیلڈز کو درست کریں.
zh_cn: 请纠正下面突出显示的字段。

source: Log into My {platform_name} Account
ar: سجِّل الدخول إلى حسابي على {platform_name}
ur: میرا {platform_name} اکاؤنٹ میں لاگ ان کریں
zh_cn: 登录到我的{platform_name}帐户

source: Badge images must be square PNG files. The file size should be under 250KB.
ar: يجب أن تكون صور الشارات ملفات PNG مربعة. يجب أن يكون حجم الملف أقل من 250 كيلوبايت.
ur: بیج تصاویر کو مربع PNG فائلوں میں ہونا چاہئے. فائل کا سائز 250KB سے کم ہونا چاہئے.
zh_cn: 徽章图片必须是方形的PNG文件。文件大小应该在250KB以下。

source: Thanks,
ar: شكر،
ur: شکریہ،
zh_cn: 谢谢，

source: Course Handouts
ar: بالطبع النشرات
ur: کورس ہینڈ آؤٹ
zh_cn: 课程讲义

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
ar: نحن اسفون. لم يوافق طاقم الدورة التدريبية على طلبك لتغيير اسمك من {old_name} إلى {new_name}. إذا كنت بحاجة إلى مزيد من المساعدة ، يرجى إرسال بريد إلكتروني إلى موظفي الدورة التدريبية على البريد الإلكتروني {email}.
ur: ہم معافی چاہتے ہیں. ہمارے کورس کے عملے نے آپ کا نام {old_name} سے {new_name} پر تبدیل کرنے کی منظوری نہیں دی. اگر آپ کو مزید مدد کی ضرورت ہے، تو براہ مہربانی {ای میل} کے کورس کے عملے کو ای میل کریں.
zh_cn: 我们很抱歉。我们的课程人员未批准您将您的姓名从{old_name}更改为{new_name}的请求。如果您需要进一步的帮助，请通过{email}向课程工作人员发送电子邮件。

source: My Courses
ar: دوراتي
ur: میرے کورسز
zh_cn: 我的课程

source: Get Student Anonymized IDs CSV
ar: احصل على هوية مجهولة الهوية. CSV
ur: طالب علم نامزد کردہ شناخت CSV حاصل کریں
zh_cn: 获取学生匿名ID CSV

source: image
ar: صورة
ur: تصویر
zh_cn: 图片

source: pending
ar: قيد الانتظار
ur: زیر التواء
zh_cn: 有待

source: I wanted to include a verified certificate on my resume and my profile to illustrate that I am working towards this goal I have and that I have achieved something while I was unemployed.
ar: أردت تضمين شهادة تم التحقق منها على سيرتي الذاتية وملف التعريف الخاص بي لتوضيح أنني أعمل من أجل تحقيق هذا الهدف وأنني حققت شيئًا بينما كنت عاطلاً عن العمل.
ur: میں اپنے دوبارہ شروع اور میری پروفائل پر تصدیق شدہ سرٹیفکیٹ شامل کرنا چاہتا ہوں کہ اس مقصد کے لۓ میں کام کر رہا ہوں، اور میں نے بے روزگار ہونے پر کچھ حاصل کیا ہے.
zh_cn: 我希望在我的简历和个人资料中包含经过验证的证书，以说明我正在为实现这一目标而努力，并在失业期间取得了一些成就。

source: Due Date
ar: تاريخ الاستحقاق
ur: اخری تاریخ
zh_cn: 截止日期

source: Welcome to {studio_name}
ar: مرحبًا بك في {studio_name}
ur: {studio_name} میں خوش آمدید
zh_cn: 欢迎来到{studio_name}

source: This block contains multiple components.
ar: هذه الكتلة تحتوي على مكونات متعددة.
ur: یہ بلاک ایک سے زیادہ اجزاء پر مشتمل ہے.
zh_cn: 该块包含多个组件。

source: Invoice Recipient
ar: مستلم الفاتورة
ur: انوائس وصول کنندہ
zh_cn: 发票收件人

source: Register
ar: تسجيل
ur: رجسٹر کریں
zh_cn: 寄存器

source: Your payment was successful.
ar: كانت دفعتك ناجحة.
ur: آپ کی ادائیگی کامیاب ہوگئی تھی.
zh_cn: 您的付款已成功。

source: Congratulations! You are now enrolled in {course_name}
ar: تهانينا! أنت الآن مسجل في {course_name}
ur: مبارک ہو! آپ اب {کورس_ نام} میں داخلہ کر رہے ہیں
zh_cn: 恭喜！您现在已加入{course_name}

source: needs attention
ar: بحاجة للاهتمام
ur: توجہ کی ضرورت ہے
zh_cn: 需要注意

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
ar: يرجى التحلي بالصبر وعدم النقر فوق هذه الأزرار عدة مرات. يؤدي النقر فوق هذه الأزرار عدة مرات إلى إبطاء عملية الإنشاء بشكل ملحوظ.
ur: براہ کرم مریض رہیں اور ان بٹنوں کو کئی بار کلک نہ کریں. ان بٹنوں پر کلک کرنے سے زیادہ بار بار نسل کے عمل کو بہت سست ہو جائے گا.
zh_cn: 请耐心等待，不要多次点击这些按钮。多次单击这些按钮将显着减慢生成过程。

source: Download Student Opened as a CSV
ar: تنزيل طالب تم فتحه بتنسيق CSV
ur: CSV کے طور پر طالب علم کھول دیا ڈاؤن لوڈ کریں
zh_cn: 下载作为CSV打开的学生

source: Hint ({hint_num} of {hints_count}):
ar: تلميح ({hint_num} من {hints_count}):
ur: {hints_count} کا اشارہ ({hint_num}:
zh_cn: 提示（{hints_count}的{hint_num}）：

source: Extensions
ar: ملحقات
ur: توسیع
zh_cn: 扩展

source: pdf download unavailable right now, please contact support.
ar: لا يتوفر تنزيل pdf الآن ، يرجى الاتصال بالدعم.
ur: پی ڈی ایف ڈاؤن لوڈ، اتارنا ابھی دستیاب نہیں، براہ کرم حمایت سے رابطہ کریں.
zh_cn: pdf立即下载，请联系技术支持。

source: must be {0} characters or fewer
ar: يجب أن يكون {0} حرفًا أو أقل
ur: {0} حروف یا کم ہونا لازمی ہے
zh_cn: 必须为{0}个字符或更少

source: Show Deprecated Settings
ar: إظهار الإعدادات المتوقفة
ur: بے ترتیب ترتیبات دکھائیں
zh_cn: 显示不推荐的设置

source: Welcome to week %(week_num)s
ar: مرحبًا بك في الأسبوع٪ (week_num) s
ur: ہفتے میں٪ (ہفتہ_وموم) ایس میں خوش آمدید
zh_cn: 欢迎来到％week（week_num）s

source: Git Action
ar: بوابة العمل
ur: گیٹ ایکشن

source: We're working on it...
ar: نحن نعمل على ذلك...
ur: ہم اس پر کام کر رہے ہیں ...
zh_cn: 我们正在努力...

source: {platform_name} Home Page
ar: {platform_name} الصفحة الرئيسية
ur: {platform_name} ہوم پیج
zh_cn: {platform_name}主页

source: Course team user does not exist
ar: مستخدم فريق الدورة التدريبية غير موجود
ur: کورس ٹیم کا صارف موجود نہیں ہے
zh_cn: 课程团队用户不存在

source: {num_emails} failed
ar: فشل {num_emails}
ur: {num_emails} ناکام ہوگیا
zh_cn: {num_emails}失败

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
ar: للمشكلة المحددة ، احذف بشكل دائم وبشكل كامل إجابات الدارس ونقاطه من قاعدة البيانات.
ur: مخصوص مسئلہ کے لئے، مستقل طور پر اور مکمل طور پر سیکھنے والے کے جوابات اور ڈیٹا بیس سے اسکور کو خارج کر دیں.
zh_cn: 对于指定的问题，从数据库中永久并完全删除学习者的答案和分数。

source: Studio user
ar: مستخدم الاستوديو
ur: سٹوڈیو صارف
zh_cn: Studio用户

source: Service Fees (if any)
ar: رسوم الخدمة (إن وجدت)
ur: سروس فیس (اگر کوئی ہے)
zh_cn: 服务费（如有）

source: Written Feedback
ar: ملاحظات مكتوبة
ur: لکھا ہوا تاثر
zh_cn: 书面反馈

source: Payment
ar: دفع
ur: ادائیگی
zh_cn: 付款

source: You cannot delete a root article.
ar: لا يمكنك حذف مقالة الجذر.
ur: آپ کو جڑ آرٹیکل حذف نہیں کر سکتے ہیں.
zh_cn: 您无法删除根文章。

source: Contextual Online Help
ar: Contextual تعليمات عبر الإنترنت
ur: متضاد آن لائن مدد
zh_cn: 上下文联机帮助

source: Problem location:
ar: موقع المشكلة:
ur: مسئلہ کی جگہ:
zh_cn: 问题地点：

source: Course options for {courseName}
ar: خيارات الدورة التدريبية لـ {courseName}
ur: کورس کے اختیارات {کورس نام}
zh_cn: {courseName}的课程选项

source: Pursue a Verified Certificate
ar: متابعة شهادة التحقق
ur: ایک تصدیق شدہ سرٹیفکیٹ پر عمل کریں
zh_cn: 追求认证证书

source: Please enter a username
ar: الرجاء ادخال اسم المستخدم
ur: براہ مہربانی ایک صارف کا نام درج کریں
zh_cn: 请填入一个用户名

source: Course Subtitle
ar: عنوان الدورة
ur: کورس ذیلی ٹائٹل
zh_cn: 课程小标题

source: Sat
ar: جلسنا
ur: سات
zh_cn: 星期六

source: You can no longer access this course because payment has not yet been received. You can {contact_link_start}contact the account holder{contact_link_end} to request payment, or you can {unenroll_link_start}unenroll{unenroll_link_end} from this course
ar: لم يعد بإمكانك الوصول إلى هذه الدورة لأن الدفع لم يتم استلامه بعد. يمكنك {contact_link_start} الاتصال بمالك الحساب {contact_link_end} لطلب الدفع ، أو يمكنك {unenroll_link_start} إلغاء التسجيل {unenroll_link_end} من هذه الدورة التدريبية
ur: آپ اس کورس تک رسائی حاصل نہیں کر سکتے ہیں کیونکہ ادائیگی ابھی تک موصول نہیں ہوئی ہے. آپ {contact_link_start} اکاؤنٹ ہولڈر {contact_link_end} سے رابطہ کرنے کے لئے رابطہ کرسکتے ہیں، یا آپ {unenroll_link_start} اس کورس سے {unenroll_link_end} غیر اندراج کر سکتے ہیں.
zh_cn: 由于尚未收到付款，您将无法再访问此课程。您可以{contact_link_start}联系帐户持有者{contact_link_end}申请付款，或者您可以从此课程中{unnroll_link_start}取消注册{unenroll_link_end}

source: Two character ISO country code.
ar: رمز بلد ISO مكون من حرفين.
ur: دو کردار ISO ملک کوڈ.
zh_cn: 两个字符的ISO国家代码。

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
ar: لإنشاء رابط لهذه الوحدة من أحد مكونات HTML في هذه الدورة التدريبية ، أدخل &quot;/ jump_to_id / <location ID> &quot;كقيمة عنوان URL.
ur: اس کورس میں اس یونٹ میں ایک HTML جزو سے ایک لنک بنانا، &quot;/ jump_to_id / enter&quot; درج کریں. <location ID> &quot;یو آر ایل کی قیمت کے طور پر.
zh_cn: 要在本课程中通过HTML组件创建到本单元的链接，请输入“/ jump_to_id / <location ID> “作为URL值。

source: Enable Student-Generated Certificates
ar: تمكين الشهادات التي يتم إنشاؤها للطلاب
ur: طالب علم کی تخلیق کردہ سرٹیفکیٹ کو فعال کریں
zh_cn: 启用学生生成的证书

source: bytes
ar: بايت
ur: بٹس
zh_cn: 字节

source: There is a problem with this image file. Try to upload a different file.
ar: هناك مشكلة في ملف الصورة هذا. حاول تحميل ملف مختلف.
ur: اس تصویر فائل کے ساتھ ایک مسئلہ ہے. ایک مختلف فائل اپ لوڈ کرنے کی کوشش کریں.
zh_cn: 这个图像文件有问题。尝试上传不同的文件。

source: CustomResponse: check function returned an invalid dictionary!
ar: CustomResponse: وظيفة الاختيار ترجع قاموس غير صحيح!
ur: CustomResponse: چیک چیک ایک غلط لغت واپس!
zh_cn: CustomResponse：检查函数返回无效的字典！

source: Next
ar: التالى
ur: اگلے
zh_cn: 下一个

source: Enrollment information for all courses
ar: معلومات التسجيل لجميع الدورات
ur: تمام کورسوں کے لئے اندراج کی معلومات
zh_cn: 所有课程的注册信息

source: {mode_name} for course {course}
ar: {mode_name} للطبقة {course}
ur: {mode_name} کورس {کورس} کیلئے
zh_cn: {mode_name}当然{course}

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
ar: لا يمكنك تعديل مجموعات تتبع التسجيل ، ولكن يمكنك توسيع كل مجموعة لعرض تفاصيل محتوى الدورة التدريبية الذي تم تعيينه للمتعلمين في المجموعة.
ur: آپ اندراج ٹریک گروپوں میں ترمیم نہیں کرسکتے ہیں، لیکن آپ گروپ کے سیکھنے کے لئے نامزد ہونے والے کورس کے مواد کی تفصیلات کو دیکھنے کے لئے ہر گروہ کو بڑھا سکتے ہیں.
zh_cn: 您无法编辑注册跟踪组，但可以扩展每个组以查看为该组中的学员指定的课程内容的详细信息。

source: Enter the names of the advanced modules to use in your course.
ar: أدخل أسماء الوحدات المتقدمة لاستخدامها في الدورة التدريبية الخاصة بك.
ur: اپنے کورس میں استعمال کرنے کے لئے جدید ماڈیولز کے نام درج کریں.
zh_cn: 输入在课程中使用的高级模块的名称。

source: full_name
ar: الاسم الكامل
ur: پورا نام
zh_cn: 全名

source: The following reports are available for download. Reports are not deleted. A link to every report remains available on this page, identified by the date and time (in UTC) that the report was generated.
ar: التقارير التالية متاحة للتنزيل. لا يتم حذف التقارير. يبقى رابط إلى كل تقرير متاحًا في هذه الصفحة ، يتم تحديده من قبل التاريخ والوقت (بالتوقيت العالمي المنسق (UTC)) الذي تم إنشاء التقرير به.
ur: مندرجہ ذیل رپورٹیں ڈاؤن لوڈ کیلئے دستیاب ہیں. رپورٹیں حذف نہیں ہوئیں. ہر رپورٹ کا لنک اس صفحے پر موجود ہے، جو تاریخ اور وقت (UTC میں) کی طرف سے شناخت کیا گیا ہے جس کی رپورٹ اس سے پیدا ہوئی تھی.
zh_cn: 以下报告可供下载。报告不会被删除。每个报告的链接在该页面上保持可用，由报告生成的日期和时间（UTC）标识。

source: Print
ar: طباعة
ur: پرنٹ کریں
zh_cn: 打印

source: Are you sure?
ar: هل أنت واثق؟
ur: کیا تمہیں یقین ہے؟
zh_cn: 你确定？

source: An account with the new e-mail address already exists.
ar: يوجد بالفعل حساب بعنوان البريد الإلكتروني الجديد.
ur: نئے ای میل ایڈریس کے ساتھ ایک اکاؤنٹ پہلے ہی موجود ہے.
zh_cn: 新电子邮件地址的帐户已存在。

source: Search notes for:
ar: ملاحظات البحث عن:
ur: کے لئے نوٹ تلاش کریں:
zh_cn: 搜索说明：

source: Debug:
ar: التصحيح:
ur: ڈیبگ:
zh_cn: 调试：

source: Save Settings
ar: احفظ التغييرات
ur: ترتیبات محفوظ کریں
zh_cn: 保存设置

source: Sysadmin Dashboard
ar: Sysadmin لوحة القيادة
ur: سیسڈمن ڈیش بورڈ
zh_cn: 系统管理员仪表板

source: The text in both password fields must match.
ar: يجب أن يتطابق النص في حقلي كلمة المرور.
ur: دونوں پاسورڈ کے شعبوں میں متن لازمی ہے.
zh_cn: 两个密码字段中的文本必须匹配。

source: As part of joining {platform_name}, you will receive an email message with instructions for activating your account. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
ar: كجزء من الانضمام إلى {platform_name} ، ستتلقى رسالة بريد إلكتروني تحتوي على تعليمات لتنشيط حسابك. لا ترى البريد الإلكتروني؟ تحقق من مجلد الرسائل غير المرغوب فيها وعلّم رسائل البريد الإلكتروني {platform_name} على أنها &quot;ليست رسائل غير مرغوب فيها&quot;. في {platform_name} ، نتواصل في الغالب عبر البريد الإلكتروني.
ur: {platform_name} میں شامل ہونے کا ایک حصہ کے طور پر، آپ کو اپنے اکاؤنٹ کو چالو کرنے کیلئے ہدایات کے ساتھ ایک ای میل پیغام مل جائے گا. ای میل نہیں دیکھا؟ اپنا سپیم فولڈر چیک کریں اور {platform_name} ای میلز کو &#39;سپیم نہیں&#39; کے طور پر نشان زد کریں. {platform_name} میں، ہم زیادہ سے زیادہ ای میل کے ذریعے بات چیت کرتے ہیں.
zh_cn: 作为加入{platform_name}的一部分，您将收到一封电子邮件，其中包含激活您的帐户的说明。没有看到电子邮件？检查您的垃圾邮件文件夹并将{platform_name}电子邮件标记为“不是垃圾邮件”。在{platform_name}，我们主要通过电子邮件进行交流。

source: Grace Period on Deadline:
ar: فترة سماح في الموعد النهائي:
ur: آخری وقت پر فضل کا دورہ:
zh_cn: 宽限期截止日期：

source: Select which tab will be the default in the annotations table: myNotes, Instructor, or Public.
ar: حدد علامة التبويب التي ستكون الافتراضي في جدول التعليقات التوضيحية: myNotes أو Instructor أو Public.
ur: منتخب کریں کہ ٹیب کونسل ٹیبل میں ڈیفالٹ ہوں گے: myNotes، Instructor، or Public.
zh_cn: 选择注释表中默认的选项卡：myNotes，Instructor或Public。

source: There is no data available to display at this time.
ar: لا توجد بيانات متاحة للعرض في هذا الوقت.
ur: اس وقت ظاہر کرنے کے لئے کوئی ڈیٹا دستیاب نہیں ہے.
zh_cn: 目前没有可供显示的数据。

source: Whitelist {country} for {course}
ar: القائمة البيضاء {country} لـ {course}
ur: whitelist {country} کے لئے {کورس}
zh_cn: {课程}的白名单{country}

source: Enrollment in this course is by invitation only
ar: التسجيل في هذه الدورة يكون عن طريق الدعوة فقط
ur: اس کورس میں اندراج صرف مدعو کی طرف سے ہے
zh_cn: 本课程招生仅限受邀

source: Visit a course wiki to add an article.
ar: زيارة ويكي دورة لإضافة مقال.
ur: ایک مضمون شامل کرنے کے لئے کورس کے وکٹ ملاحظہ کریں.
zh_cn: 访问课程wiki以添加文章。

source: Tue
ar: ك
ur: آپ
zh_cn: 您的

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم العرض العام للدورة التدريبية الخاصة بك. لا يمكن تغيير هذا ، ولكن يمكنك تعيين اسم عرض مختلف في &quot;الإعدادات المتقدمة&quot; لاحقًا.
ur: آپ کے کورس کے لئے عوامی ڈسپلے کا نام. یہ تبدیل نہیں کیا جاسکتا ہے، لیکن آپ بعد میں اعلی درجے کی ترتیبات میں مختلف ڈسپلے کا نام مقرر کرسکتے ہیں.
zh_cn: 公开显示您课程的名称。这不能更改，但您可以稍后在“高级设置”中设置不同的显示名称。

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
ar: حدد ما إذا كان الدخول إلى هذا الفيديو يقتصر على المتصفحات فقط ، أو يمكن الوصول إليه من تطبيقات أخرى بما في ذلك تطبيقات الجوال.
ur: اس بات کا اشارہ کریں کہ آیا اس ویڈیو تک رسائی صرف براؤزرز تک محدود ہے، یا اگر یہ موبائل اطلاقات سمیت دیگر ایپلی کیشنز سے رسائی حاصل کی جا سکتی ہے.
zh_cn: 指定对此视频的访问权限是仅限于浏览器，还是可以通过其他应用程序（包括移动应用程序）访问。

source: Options Menu
ar: قائمة الخيارات
ur: اختیارات مینو
zh_cn: 选项菜单

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
ar: الرمز الفريد الذي يحدد هذه المكتبة. {strong_start} ملاحظة: هذا جزء من عنوان URL لمكتبتك ، لذلك لا يُسمح بوجود مسافات أو أحرف خاصة. {strong_end} لا يمكن تغيير هذا.
ur: منفرد کوڈ جو اس لائبریری کی شناخت کرتا ہے. {strong_start} نوٹ: یہ آپ کی لائبریری یو آر ایل کا حصہ ہے، لہذا کوئی جگہ یا خاص حروف کی اجازت نہیں ہے. {strong_end} یہ تبدیل نہیں کیا جا سکتا.
zh_cn: 识别此库的唯一代码。 {strong_start}注意：这是您的图书馆网址的一部分，因此不允许使用空格或特殊字符。{strong_end}这不能更改。

source: Highlights Enabled for Messaging
ar: يسلط الضوء على تمكين للمراسلة
ur: مینیجنگ کیلئے نمایاں کردہ نمایاںات
zh_cn: 突出显示启用了消息

source: Transferring Ownership
ar: نقل الملكية
ur: مالک کی منتقلی
zh_cn: 转让所有权

source: Verify your identity with a webcam and government-issued ID
ar: تحقق من هويتك باستخدام كاميرا ويب ومُعرّف صادر من الحكومة
ur: ایک ویب کیم اور حکومتی ادارہ ID کے ساتھ اپنی شناخت کی توثیق کریں
zh_cn: 使用网络摄像头和政府颁发的身份证验证您的身份

source: Return To Dashboard
ar: العودة إلى لوحة القيادة
ur: ڈیش بورڈ پر واپس جائیں
zh_cn: 返回仪表板

source: You are now viewing the course as {i_start}{user_name}{i_end}.
ar: أنت الآن تستعرض الدورة التدريبية كـ {i_start} {user_name} {i_end}.
ur: آپ اب کورس {i_start} {user_name} {i_end} کے طور پر دیکھ رہے ہیں.
zh_cn: 您现在将课程视为{i_start} {用户名} {i_end}。

source: Symbolic Math Input
ar: إدخال رمزي للرياضيات
ur: علامتی ریاضی ان پٹ
zh_cn: 符号数学输入

source: Problem is closed.
ar: المشكلة مغلقة.
ur: مسئلہ بند ہے.
zh_cn: 问题已关闭。

source: Enable course home page improvements.
ar: تمكين تحسينات الصفحة الرئيسية للدورة التدريبية.
ur: کورس ہوم پیج کی اصلاحات کو فعال کریں.
zh_cn: 启用课程主页改进。

source: Preferred language for transcript
ar: اللغة المفضلة للنسخة
ur: ٹرانسپٹ کے لئے پسندیدہ زبان
zh_cn: 成绩单的首选语言

source: There must be one cohort to which students can automatically be assigned.
ar: يجب أن يكون هناك مجموعة واحدة يمكن تعيين الطلاب تلقائيًا إليها.
ur: وہاں ایک کوور ہونا لازمی ہے جس سے طالب علم خود کار طریقے سے تفویض کر سکیں.
zh_cn: 必须有一个队列可以自动分配给学生。

source: The {platform_name} Team
ar: فريق {platform_name}
ur: {platform_name} ٹیم
zh_cn: {platform_name}团队

source: Log in
ar: تسجيل الدخول
ur: میں لاگ ان کریں
zh_cn: 登录

source: Visit {site_name} to enroll in the course and begin the beta test.
ar: تفضل بزيارة {site_name} للتسجيل في الدورة التدريبية وبدء الاختبار التجريبي.
ur: کورس میں داخل ہونے کے لئے {site_name} ملاحظہ کریں اور بیٹا ٹیسٹ شروع کریں.
zh_cn: 访问{site_name}注册课程并开始测试。

source: Grade required to pass this course:
ar: الدرجة المطلوبة لاجتياز هذه الدورة التدريبية:
ur: اس کورس کو منظور کرنے کیلئے گریڈ کی ضرورت ہے:
zh_cn: 通过本课程所需等级：

source: Short identifier for the LinkedIn partner used in the tracking code. (Example: 'edx') If no value is provided, tracking codes will not be sent to LinkedIn.
ar: معرف قصير لشريك LinkedIn المستخدم في شفرة التتبع. (مثال: &quot;edx&quot;) إذا لم يتم تقديم أي قيمة ، فلن يتم إرسال شفرات التتبع إلى LinkedIn.
ur: لنکڈین پارٹنر کے لئے ٹریکنگ کوڈ میں استعمال کیا جاتا ہے. (مثال: &#39;edx&#39;) اگر کوئی قیمت فراہم نہیں کی جاتی ہے تو، ٹریکنگ کوڈز کو لنکڈ میں نہیں بھیجے جائیں گے.
zh_cn: 跟踪代码中使用的LinkedIn合作伙伴的简短标识符。 （例如：&#39;edx&#39;）如果未提供任何值，则跟踪代码将不会发送至LinkedIn。

source: Put your Privacy Policy here!
ar: ضع سياسة الخصوصية هنا!
ur: اپنی رازداری کی پالیسی یہاں رکھیں!
zh_cn: 把你的隐私政策放在这里！

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
ar: هذا لتأكيد أنك قمت بتغيير البريد الإلكتروني المرتبط بـ {platform_name} من {old_email} إلى {new_email}. إذا لم تكن قد قدمت هذا الطلب ، فيرجى الاتصال بنا على
ur: یہ اس بات کی تصدیق کرنا ہے کہ آپ نے {platform_name} سے {old_email} سے {new_email} پر منسلک ای میل کو تبدیل کردیا. اگر آپ نے یہ درخواست نہیں کی ہے، تو براہ مہربانی ہم سے رابطہ کریں
zh_cn: 这是为了确认您是否已将{platform_name}的电子邮件从{old_email}更改为{new_email}。如果您没有提出此要求，请与我们联系

source: Delete the selected configuration
ar: احذف التكوين المحدد
ur: منتخب کردہ ترتیب کو حذف کریں
zh_cn: 删除选定的配置

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
ar: تغيير أو إزالة أية علامة تجارية أو حقوق نشر أو أي إشعارات ملكية أو قانونية أخرى موجودة في أو تظهر على واجهات برمجة التطبيقات أو أي محتوى API ؛
ur: کسی بھی ٹریڈ مارک، کاپی رائٹ یا دیگر ملکیت یا قانونی نوٹسوں کو تبدیل یا ان میں سے کسی بھی API کے مواد میں شامل، یا ان پر ظاہر کرنے کے لۓ؛
zh_cn: 更改或删除API或任何API内容中包含或出现的任何商标，版权或其他专有或法律声明;

source: This course uses features that are no longer supported.
ar: تستخدم هذه الدورة التدريبية ميزات لم تعد مدعومة.
ur: یہ کورس ایسے خصوصیات کا استعمال کرتی ہے جو اب مزید تعاون نہیں کر رہے ہیں.
zh_cn: 本课程使用不再支持的功能。

source: {course}_video_urls
ar: {بالطبع} _video_urls
ur: {کورس} _video_urls
zh_cn: {}当然_video_urls

source: Grade
ar: درجة
ur: گریڈ
zh_cn: 年级

source: It's official. It's easily shareable. It's a proven motivator to complete the course. {line_break}{link_start}Learn more about the verified {cert_name_long}{link_end}.
ar: إنه رسمي يمكن مشاركته بسهولة. إنه حافز أكيد لإكمال الدورة. {line_break} {link_start} مزيد من المعلومات حول {cert_name_long} {link_end} الذي تم التحقق منه.
ur: یہ سرکاری ہے. یہ آسانی سے مشترکہ ہے. یہ کورس مکمل کرنے کے لئے ایک ثابت حوصلہ افزائی ہے. {line_break} {link_start} تصدیق {cert_name_long} {link_end} کے بارے میں مزید جانیں.
zh_cn: 这是官方的。它很容易分享。这是完成课程的证明激励因素。 {line_break} {link_start}详细了解已验证的{cert_name_long} {link_end}。

source: (1) Register for an account at {site_name}
ar: (1) التسجيل للحصول على حساب في {site_name}
ur: (1) {site_name} پر ایک اکاؤنٹ کے لئے رجسٹر کریں
zh_cn: （1）在{site_name}注册一个帐户
