Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Allow a learner who has used up all attempts to work on the problem again.
ar: اسمح للمتعلم الذي استخدم كل محاولات العمل على المشكلة مرة أخرى.
ur: سیکھنے والے کو اجازت دیں جو اس مسئلے پر کام کرنے کے تمام کوششوں کو استعمال کرتے ہیں.
zh_cn: 让一个已经用完了所有尝试再次解决问题的学习者。

source: Please provide launch_url. Click "Edit", and fill in the required fields.
ar: يرجى تقديم launch_url. انقر فوق &quot;تحرير&quot; ، وملء الحقول المطلوبة.
ur: براہ کرم لانچ فراہم کریں. &quot;ترمیم کریں&quot; پر کلک کریں، اور مطلوبہ شعبوں کو بھریں.
zh_cn: 请提供launch_url。点击“编辑”，然后填写必填字段。

source: Getting Started with {studio_name}
ar: البدء مع {studio_name}
ur: {سٹوڈیو_ نام} کے ساتھ شروع کرنا
zh_cn: {studio_name}入门

source: You do not have access to this course
ar: لا يمكنك الوصول إلى هذه الدورة
ur: آپ کو اس کورس تک رسائی نہیں ہے
zh_cn: 您无权访问此课程

source: Problem's definition does not support rescoring.
ar: تعريف المشكلة لا يدعم إعادة التسجيل.
ur: مسئلہ کی تعریف کو بچانے کی حمایت نہیں کرتا.
zh_cn: 问题的定义不支持rescoring。

source: Removing user: "{}"
ar: إزالة المستخدم: &quot;{}&quot;
ur: صارف کو ہٹانا: &quot;{}&quot;
zh_cn: 删除用户：“{}”

source: next
ar: التالى
ur: اگلے
zh_cn: 下一个

source: For help, contact {payment_support_link}.
ar: للحصول على مساعدة ، اتصل {payment_support_link}.
ur: مدد کیلئے، {payment_support_link} سے رابطہ کریں.
zh_cn: 如需帮助，请联系{payment_support_link}。

source: Membership
ar: عضوية
ur: رکنیت
zh_cn: 籍

source: Group Configuration
ar: تكوين المجموعة
ur: گروپ کی ترتیب
zh_cn: 组配置

source: I just wanted to browse the material
ar: أردت فقط تصفح المادة
ur: میں صرف مواد کو براؤز کرنا چاہتا ہوں
zh_cn: 我只是想浏览材料

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
ar: يرجى تقديم اسم ومسار صالحين لصورة البانر (ملاحظة: يدعم فقط تنسيق JPEG أو PNG)
ur: براہ کرم اپنے بینر کی تصویر پر درست راستہ اور نام فراہم کریں (نوٹ: صرف JPEG یا PNG فارمیٹ کی حمایت کی ہے)
zh_cn: 请为横幅图片提供有效的路径和名称（注意：仅支持JPEG或PNG格式）

source: Internal API URL
ar: عنوان API الداخلي
ur: اندرونی API یو آر ایل
zh_cn: 内部API网址

source: Count
ar: عد
ur: شمار
zh_cn: 计数

source: Integers
ar: الأعداد الصحيحة
ur: اشارے
zh_cn: 整型

source: Select a Library.
ar: اختر مكتبة.
ur: ایک لائبریری منتخب کریں.
zh_cn: 选择一个图书馆。

source: Billing Details
ar: تفاصيل الفاتورة
ur: بل کی تفصیلات
zh_cn: 结算明细

source: Course added to cart.
ar: تمت إضافة الدورة إلى السلة.
ur: کورس کی ٹوکری میں شامل
zh_cn: 课程添加到购物车。

source: and
ar: و
ur: اور
zh_cn: 和

source: Courseware
ar: المناهج التعليمية
ur: کورسز
zh_cn: 课件

source: Recipient Name:
ar: اسم المستلم:
ur: وصول کنندہ کا نام:
zh_cn: 收件人姓名：

source: Wednesday
ar: الأربعاء
ur: بدھ
zh_cn: 星期三

source: Schedule a Unit
ar: جدولة وحدة
ur: یونٹ کا شیڈول کریں
zh_cn: 安排一个单位

source: must have name of the certificate
ar: يجب أن يكون اسم الشهادة
ur: سرٹیفکیٹ کا نام ہونا ضروری ہے
zh_cn: 必须有证书的名称

source: A short summary of what the file contains
ar: ملخص قصير لما يحتويه الملف
ur: فائل پر مشتمل ایک مختصر خلاصہ ہے
zh_cn: 文件包含的简短摘要

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: حدد ما إذا كان يجب على الطلاب إكمال اختبار القبول قبل أن يتمكنوا من عرض محتوى الدورة التدريبية الخاصة بك. لاحظ أنه يجب عليك تمكين امتحانات الدخول حتى يصبح إعداد الدورة التدريبية ساري المفعول.
ur: اس بات کی وضاحت کریں کہ آیا آپ کے کورس کے مواد کو دیکھنے سے قبل طالب علموں کو داخلہ امتحان مکمل کرنا ضروری ہے. نوٹ، آپ کو اس کورس ترتیب کے اثرات کے لۓ داخلہ امتحان کو فعال کرنا ہوگا.
zh_cn: 指定学生是否必须先完成入学考试才能查看课程内容。请注意，您必须为此课程设置启用入学考试才能生效。

source: Welcome to week %(week_num)s of %(course_name)s!
ar: مرحبًا بك في أسبوع٪ (week_num) s من٪ (course_name) s!
ur: ٪ (ہفتہ_ نام) s٪ (course_name) s کے ہفتے میں خوش آمدید!
zh_cn: 欢迎来到％（course_name）s的星期％（week_num）s！

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
ar: إذا كنت تستخدم شاشة عرض منخفضة الدقة ، فيمكن إخفاء شريط التنقل الأيسر بالنقر فوق مجموعة الأسهم الثلاثة المجاورة بجواره.
ur: اگر آپ کم قرارداد کے ڈسپلے پر ہیں تو بائیں نیویگیشن بار اس کے پیچھے تین بائیں تیروں کی سیٹ پر کلک کرکے پوشیدہ ہوسکتی ہے.
zh_cn: 如果您使用的是低分辨率显示器，则可以通过单击左侧导航栏旁边的三个左侧箭头来隐藏左侧导航栏。

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
ar: السمة الخاصة بمكونات المصدر التي تحدد ما إذا كان المتعلم يعرض محتوى هذه الوحدة الشرطية.
ur: ذریعہ اجزاء کی خاصیت یہ بتاتی ہے کہ سیکھنے والا اس مشروط ماڈیول کے مواد کو دکھایا جاتا ہے.
zh_cn: 确定是否向学习者显示此条件模块的内容的源组件的属性。

source: The full name that will appear on the certificate.
ar: الاسم الكامل الذي سيظهر على الشهادة.
ur: سرٹیفکیٹ پر مکمل نام دکھایا جائے گا.
zh_cn: 将显示在证书上的全名。

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
ar: عند تحديد &quot;إرسال البريد الإلكتروني&quot; ، تتم إضافة رسالة البريد الإلكتروني إلى قائمة الانتظار لإرسالها ، ولا يمكن إلغاؤها.
ur: جب آپ ای میل بھیجیں تو، آپ کے ای میل پیغام کو بھیجنے کے لئے قطار میں شامل کیا جاتا ہے، اور منسوخ نہیں کیا جا سکتا.
zh_cn: 当您选择发送电子邮件时，您的电子邮件消息将被添加到发送队列中，并且无法取消。

source: user '{user}' does not exist
ar: المستخدم &quot;{user}&quot; غير موجود
ur: صارف &#39;{صارف}&#39; موجود نہیں ہے
zh_cn: 用户“{user}”不存在

source: Comment
ar: تعليق
ur: تبصرہ
zh_cn: 评论

source: Delete Learner's State
ar: حذف دولة المتعلم
ur: لیڈرر کی ریاست کو حذف کریں
zh_cn: 删除学习者的州

source: Library Access Roles
ar: أدوار الوصول إلى المكتبة
ur: لائبریری رسائی رولز
zh_cn: 图书馆访问角色

source: You can not move an item into it's child.
ar: لا يمكنك نقل عنصر داخل الطفل.
ur: آپ اس کے بچے کو کسی چیز کو منتقل نہیں کر سکتے ہیں.
zh_cn: 你不能移动一个项目到它的孩子。

source: Bill to:
ar: فاتورة الى:
ur: کا بل:
zh_cn: 记账到：

source: Video File URLs
ar: عناوين URL لملف الفيديو
ur: ویڈیو فائل URLs
zh_cn: 视频文件URL

source: Issuing Certificates to Learners
ar: إصدار شهادات للمتعلمين
ur: سیکھنے کے لئے سرٹیفیکیٹ جاری
zh_cn: 向学习者颁发证书

source: Unusable
ar: غير صالح للإستعمال
ur: ناقابل استعمال
zh_cn: 不可用

source: Library
ar: مكتبة
ur: لائبریری
zh_cn: 图书馆

source: HTML for the additional pages
ar: HTML للصفحات الإضافية
ur: اضافی صفحات کے لئے ایچ ٹی ایم ایل
zh_cn: HTML用于其他页面

source: Generate Problem Grade Report
ar: توليد تقرير تقدير المشكلة
ur: مسئلہ گریڈ کی رپورٹ بنائیں
zh_cn: 生成问题等级报告

source: Other Course Settings
ar: إعدادات الدورة التدريبية الأخرى
ur: دیگر کورس کی ترتیبات
zh_cn: 其他课程设置

source: To resolve the problem, your partner manager should verify that the following information is correct.
ar: لحل المشكلة ، يجب على مدير الشركاء التحقق من صحة المعلومات التالية.
ur: اس مسئلے کو حل کرنے کے لئے، آپ کے ساتھی مینیجر کی تصدیق کرنا چاہئے کہ مندرجہ ذیل معلومات درست ہے.
zh_cn: 要解决该问题，您的合作伙伴经理应验证以下信息是否正确。

source: tag
ar: بطاقة
ur: ٹیگ
zh_cn: 标签

source: Video
ar: فيديو
ur: ویڈیو
zh_cn: 视频

source: Course Run:
ar: تشغيل الدورة التدريبية:
ur: کورس چلائیں:
zh_cn: 课程运行：

source: Not Linked
ar: غير مرتبط
ur: لنک نہیں ہے
zh_cn: 未链接

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitation of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accrusing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
ar: عند أي إنهاء للبنود أو إيقاف وصولك إلى أي واجهة برمجة تطبيقات لأي سبب ، سيتم إيقاف حقك في استخدام أي واجهة برمجة التطبيقات ومحتوى واجهة برمجة التطبيقات على الفور. ستتوقف فورًا عن استخدام واجهات برمجة التطبيقات وحذف أي محتوى لواجهة برمجة التطبيقات مخزّن مؤقتًا أو مخزّنًا. يجب أن تظل جميع أحكام البنود التي تنتهي بطبيعتها للبقاء قيد الإنهاء ، بما في ذلك على سبيل المثال لا الحصر ، أحكام الملكية ، وإخلاء المسؤولية عن الضمان ، والحد من المسؤولية. لن يؤدي إنهاء وصولك إلى APIs ومحتوى واجهة برمجة التطبيقات واستخدامك إلى إعفائك من أي التزامات ناشئة أو ترافق قبل إنهاء هذه الاتفاقية أو الحد من أي مسؤولية قد تكون لديك بخلاف ذلك إلى {platform_name} ، بما في ذلك على سبيل المثال لا الحصر أي التزامات بالتعويض الواردة في هذه الوثيقة.
ur: کسی بھی وجہ سے کسی بھی وجہ سے API تک آپ کی رسائی کی شرائط یا کسی بھی ایپلی کیشنز کو ختم کرنے کے کسی بھی وقت، کسی بھی API اور API کے مواد کا استعمال کرنے کا حق فوری طور پر ختم ہوجائے گا. آپ فوری طور پر API کا استعمال کرتے ہوئے روک دیں گے اور کسی بھی کیش یا محفوظ کردہ API مواد کو حذف کریں گے. ان شرائط کے تمام شرائط جو ان کی فطرت کی طرف سے ختم ہونا چاہتی ہیں، ان کی حد تک محدود رہیں گے، بشمول بغیر، محدودیت، ملکیت کے احکامات، وارنٹی اعلانات، اور ذمہ داری کی حد. API اور API کے مواد کے استعمال اور استعمال کے خاتمے سے آپ کو کسی بھی ذمہ داری سے پہلے کسی بھی ذمے داری سے قبل پیدا کرنے یا جمع کرنے سے متعلق کسی بھی ذمہ داریوں سے نجات نہیں ملتی ہے یا آپ کو دوسری صورت میں {platform_name} ہونا چاہیے، بشمول بغیر کسی حد تک کسی بھی معاوضہ کے ذمہ داریاں موجود ہیں.
zh_cn: 在任何条款终止或因任何原因终止您访问API时，您使用任何API和API内容的权利将立即停止。您将立即停止使用API​​并删除任何缓存或存储的API内容。本条款的所有条款在其终止后仍能继续存在，包括但不限于所有权条款，保修免责条款和责任限制。终止您对API和API内容的访问和使用不会免除您在此类终止前产生或产生的任何义务或限制您可能{{名}}所承担的任何责任，包括但不限于此处包含的任何赔偿义务。

source: The company contact name cannot be a number.
ar: لا يمكن أن يكون اسم جهة الاتصال للشركة رقمًا.
ur: کمپنی کا رابطہ نام ایک نمبر نہیں ہوسکتا ہے.
zh_cn: 公司联系人姓名不能是数字。

source: Start Learning
ar: ابدا بالتعلم
ur: سیکھنے شروع کریں
zh_cn: 开始学习

source: Your permission settings were unchanged, so nothing saved.
ar: لم تتغير إعدادات الإذن ، لذا لم يتم حفظ أي شيء.
ur: آپ کی اجازت کی ترتیبات بے ترتیب نہیں تھیں، تو کچھ بھی نہیں بچا.
zh_cn: 您的权限设置保持不变，因此没有保存。

source: Create a new Custom Course for edX
ar: قم بإنشاء دورة تدريبية مخصصة جديدة لـ edX
ur: edX کے لئے ایک نیا کسٹم کورس بنائیں
zh_cn: 为edX创建一个新的自定义课程

source: Login via OpenID
ar: تسجيل الدخول عبر OpenID
ur: OpenID کے ذریعے لاگ ان
zh_cn: 通过OpenID登录

source: The authorization has already been captured
ar: تم التقاط الترخيص بالفعل
ur: اجازت نامہ پہلے ہی قبضہ کر لیا گیا ہے
zh_cn: 授权已被捕获

source: Elementary/primary school
ar: المدرسة الابتدائية / الابتدائية
ur: ابتدائی / پرائمری اسکول
zh_cn: 小学/小学

source: Select True to request the user's username.
ar: حدد True لطلب اسم مستخدم المستخدم.
ur: صارف کے صارف نام کی درخواست کرنے کے لئے سچ منتخب کریں.
zh_cn: 选择True以请求用户的用户名。

source: Original Price
ar: السعر الأصلي
ur: اصل قیمت
zh_cn: 原价

source: Please select one or more certificate statuses that require certificate regeneration.
ar: يرجى تحديد واحد أو أكثر من حالات الشهادة التي تتطلب إعادة تجديد الشهادة.
ur: براہ کرم ایک یا زیادہ سرٹیفکیٹ کی حیثیت کو منتخب کریں جو سرٹیفکیٹ کی بازیابی کی ضرورت ہوتی ہے.
zh_cn: 请选择一个或多个需要证书重新生成的证书状态。

source: You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: سترى رسالة على لوحة المعلومات عندما تكتمل عملية التحقق (عادةً في غضون يوم أو يومين).
ur: جب آپ تصدیق شدہ عمل مکمل ہوجاتا ہے تو آپ اپنے ڈیش بورڈ پر ایک پیغام دیکھیں گے (عام طور پر 1-2 دن کے اندر اندر).
zh_cn: 验证过程完成后（通常在1-2天内），您将在仪表板上看到一条消息。

source: Answered
ar: أجاب
ur: جواب دیا
zh_cn: 回答

source: General decline of the card. No other information provided by the issuing bank. Possible fix: retry with another form of payment
ar: الانخفاض العام للبطاقة. لا توجد معلومات أخرى مقدمة من البنك المصدر. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: کارڈ کی عمومی کمی. جاری بینک کے ذریعہ کوئی دوسری معلومات نہیں. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 卡的普遍下降。没有其他信息由开证行提供。可能的解决方法：使用其他付款方式重试

source: Password:
ar: كلمه السر:
ur: پاس ورڈ:
zh_cn: 密码：

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
ar: يمكن تعيين المجموعات في هذا التكوين إلى مجموعات نموذجية في لوحة معلومات المعلم.
ur: اس ترتیب میں گروپوں کو انسٹرکٹر ڈیش بورڈ میں کوٹ کرنے کے لئے نقشہ لگایا جا سکتا ہے.
zh_cn: 此配置中的组可映射到教师仪表板中的组群。

source: Details
ar: تفاصيل
ur: تفصیلات
zh_cn: 细节

source: Your notification settings were unchanged, so nothing saved.
ar: لم تتغير إعدادات الإشعارات ، لذا لم يتم حفظ أي شيء.
ur: آپ کی نوٹیفکیشن کی ترتیبات بے ترتیب نہیں تھیں، لہذا کچھ بھی نہیں بچا.
zh_cn: 您的通知设置保持不变，因此没有保存。

source: Sign Up for {platform_name}
ar: اشترك في {platform_name}
ur: {platform_name} کے لئے سائن اپ کریں
zh_cn: 注册{platform_name}

source: Replace
ar: يحل محل
ur: تبدیل کریں
zh_cn: 更换

source: Unable to determine branch, repo in detached HEAD mode
ar: غير قادر على تحديد الفرع ، الريبو في وضع HEAD منفصل
ur: برانچ کا تعین کرنے میں ناکام، الگ الگ ہیڈ موڈ میں ریپو
zh_cn: 无法确定分支，分离HEAD模式下的回购

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
ar: شيء خاطئ في ملف نص SubRip أثناء التحليل. الرسالة الداخلية هي {error_message}
ur: غلطی کے دوران سب رئپ ٹرانسمیشن فائل کے ساتھ کچھ غلط. اندرونی پیغام {error_message} ہے
zh_cn: 解析期间SubRip转录文件有问题。内部消息是{error_message}

source: The time period before a course ends in which a course mode will expire
ar: الفترة الزمنية قبل انتهاء الدورة التدريبية التي سينتهي فيها وضع الدورة التدريبية
ur: اس کورس سے قبل وقت کی مدت ختم ہوجاتی ہے جس میں کورس کا دورہ ختم ہوجائے گا
zh_cn: 课程结束之前的课程模式将到期的时间段

source: Upload completed
ar: اكتمل التحميل
ur: اپ لوڈ مکمل
zh_cn: 上传完成

source: Textbook Navigation
ar: الملاحة الكتاب المدرسي
ur: متن کتاب نیویگیشن
zh_cn: 教科书导航

source: Number of seats purchased using coupon codes
ar: عدد المقاعد التي تم شراؤها باستخدام أكواد القسيمة
ur: کوپن کوڈ کا استعمال کرتے ہوئے خریدا سیٹوں کی تعداد
zh_cn: 使用优惠券代码购买的座位数

source: edX Learner Stories
ar: قصص EDX المتعلم
ur: edX سیکرٹری کہانیاں
zh_cn: edX学习者故事

source: Notify users by email
ar: إخطار المستخدمين عن طريق البريد الإلكتروني
ur: ای میل کے ذریعے صارف کو مطلع کریں
zh_cn: 通过电子邮件通知用户

source: Download student grades
ar: تنزيل درجات الطلاب
ur: طالب علم گریڈ ڈاؤن لوڈ کریں
zh_cn: 下载学生成绩

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
ar: إذا تم تعيين معرف فيديو لك بواسطة edX لتشغيل الفيديو في هذا المكون ، فأدخل المعرّف هنا. في هذه الحالة ، لا تدخل قيمًا في عنوان URL الافتراضي للفيديو ، وعناوين URL لملف الفيديو ، وحقول معرف YouTube. إذا لم يتم تعيين معرف فيديو لك ، فأدخل القيم في تلك الحقول الأخرى وتجاهل هذا الحقل.
ur: اگر آپ کو اس اجزاء میں ویڈیو کھیلنے کیلئے EDX کی طرف سے ایک ویڈیو ID کو تفویض کیا گیا تو، یہاں ID درج کریں. اس صورت میں، ڈیفالٹ ویڈیو URL، ویڈیو فائل یو آر ایل، اور یو ٹیوب ID کے شعبوں میں اقدار درج نہ کریں. اگر آپ ویڈیو ID کو تفویض نہیں کر رہے تھے تو، ان دیگر شعبوں میں اقدار درج کریں اور اس فیلڈ کو نظر انداز کریں.
zh_cn: 如果您通过edX为视频分配了视频ID，请在此处输入ID。在这种情况下，请勿在默认视频网址，视频文件网址和YouTube ID字段中输入值。如果您未分配视频ID，请在其他字段中输入值并忽略此字段。

source: Enrollment Information
ar: معلومات التسجيل
ur: اندراج کی معلومات
zh_cn: 注册信息

source: Total: {currency_symbol}{sale_price}
ar: الإجمالي: {currency_symbol} {sale_price}
ur: کل: {currency_symbol} {sale_price}
zh_cn: 总计：{currency_symbol} {sale_price}

source: Generate example certificates for the course.
ar: قم بتوليد شهادات المثال للدورة التدريبية.
ur: کورس کے لئے مثال کے سرٹیفکیٹ بنائیں.
zh_cn: 为课程生成示例证书。

source: attachment
ar: المرفق
ur: منسلکہ
zh_cn: 附件

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
ar: تأكد من أنك تريد استيراد مكتبة قبل المتابعة. ستحل محتويات المكتبة المستوردة محل محتويات المكتبة الحالية. {em_start} لا يمكنك التراجع عن استيراد مكتبة {em_end}. قبل المتابعة ، نوصي بتصدير المكتبة الحالية ، بحيث يكون لديك نسخة احتياطية منها.
ur: اس بات کا یقین رکھنا کہ آپ جاری رکھنے سے پہلے لائبریری درآمد کرنا چاہتے ہیں. درآمد کردہ لائبریری کے مواد موجودہ لائبریری کے مواد کی جگہ لے لے گی. {em_start} آپ لائبریری درآمد {em_end} کو واپس نہیں کر سکتے ہیں. آگے بڑھنے سے پہلے، ہم آپ کی سفارش کرتے ہیں کہ آپ موجودہ لائبریری کو برآمد کریں، تاکہ آپ کے پاس اس کا بیک اپ کاپی ہے.
zh_cn: 确保您想要在继续​​之前导入库。导入的库的内容将替换现有库的内容。 {em_start}您无法撤消库导入{em_end}。在继续之前，我们建议您导出当前库，以便备份它。

source: {student_name}, you have not yet met the requirements for credit.
ar: {student_name} ، لم تستوفِ بعد متطلبات الرصيد.
ur: {student_name}، آپ نے کریڈٹ کی ضروریات کو ابھی تک نہیں ملا.
zh_cn: {student_name}，您尚未达到授信要求。

source: Enable Authoring of Credential in Studio
ar: تمكين تأليف بيانات الاعتماد في الاستوديو
ur: اسٹوڈیو میں کریڈٹنیشن کی فعالی کو فعال کریں
zh_cn: 在Studio中启用Credential的创作

source: Current Verification Status: Pending
ar: حالة التحقق الحالية: معلق
ur: موجودہ توثیق کی حیثیت: منتقلی
zh_cn: 当前验证状态：待定

source: Introducing Your Course
ar: تقديم الدورة التدريبية الخاصة بك
ur: آپ کا کورس متعارف کرایا
zh_cn: 介绍您的课程

source: Your Course Creator Request Status:
ar: حالة طلب منشئي الدورة التدريبية الخاصة بك:
ur: آپ کا کورس خالق درخواست کی حیثیت:
zh_cn: 您的课程创建者请求状态：

source: Using File URLs
ar: استخدام عناوين URL للملفات
ur: فائل URL استعمال کرتے ہوئے
zh_cn: 使用文件URL

source: Number of seats purchased in bulk
ar: عدد المقاعد التي تم شراؤها بكميات كبيرة
ur: بڑی تعداد میں خریدنے والے نشستوں کی تعداد
zh_cn: 批量购买的座位数量

source: overridden
ar: تجاوز
ur: ختم ہوا
zh_cn: 覆盖

source: Course id not specified
ar: معرف الدورة التدريبية غير محدد
ur: کورس کی شناخت نہیں کی گئی
zh_cn: 没有指定课程编号

source: No due date
ar: لا تاريخ استحقاق
ur: کوئی تاریخ نہیں
zh_cn: 没有到期日

source: Sub Item 2
ar: البند الفرعي 2
ur: ذیلی آئٹم 2
zh_cn: 小项2

source: Message:
ar: رسالة:
ur: پیغام:
zh_cn: 信息：

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
ar: يرجى إدخال عنوان بريدك الإلكتروني أدناه ، وسنرسل إليك تعليمات بالبريد الإلكتروني لإعداد كلمة مرور جديدة.
ur: براہ کرم ذیل میں اپنا ای میل پتہ درج کریں، اور ہم ایک نیا پاس ورڈ قائم کرنے کے لئے ہدایات کو ای میل کریں گے.
zh_cn: 请在下面输入您的电子邮件地址，我们将通过电子邮件发送设置新密码的说明。

source: Retry Verification
ar: إعادة محاولة التحقق
ur: تصدیق دوبارہ کریں
zh_cn: 重试验证

source: Images
ar: صور
ur: تصاویر
zh_cn: 图片

source: Usermenu dropdown
ar: القائمة المنسدلة Usermenu
ur: Usermenu ڈراپ ڈاؤن
zh_cn: 用户菜单下拉菜单

source: Text Input
ar: إدخال النص
ur: ٹیکسٹ ان پٹ
zh_cn: 文本输入

source: Set date
ar: ضبط التاريخ
ur: مقرر کی تاریخ
zh_cn: 设置日期

source: {user} is not enrolled in this course. Please check your spelling and retry.
ar: {user} غير مسجل في هذه الدورة التدريبية. الرجاء التحقق من التهجئة وإعادة المحاولة.
ur: {صارف} اس کورس میں داخلہ نہیں ہے. براہ کرم اپنا ہجے چیک کریں اور دوبارہ کوشش کریں.
zh_cn: {user}没有参加这门课程。请检查您的拼写并重试。

source: Allow
ar: السماح
ur: اجازت دیں
zh_cn: 允许

source: Page Footer
ar: تذييل الصفحة
ur: صفحہ فوٹر
zh_cn: 页脚

source: Enter the price per course seat.
ar: أدخل السعر لكل مقعد بالطبع.
ur: فی کورس فی سیٹ کی قیمت درج کریں.
zh_cn: 输入每个课程座位的价格。

source: Invalid input: Could not parse '{bad_input}' as a formula
ar: إدخال غير صالح: تعذّر تحليل &quot;{bad_input}&quot; كصيغة
ur: غلط اندراج: &#39;bad_input}&#39; کو ایک فارمولہ کے طور پر پار نہیں کر سکا
zh_cn: 输入无效：无法将“{bad_input}”解析为公式

source: Please provide course id.
ar: يرجى تقديم معرف الدورة.
ur: براہ کرم کورس کی شناخت فراہم کریں.
zh_cn: 请提供课程编号。

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
ar: يرجى تقديم اسم ومسار صالحين لصورة الدورة التدريبية الخاصة بك (ملاحظة: يدعم فقط تنسيق JPEG أو PNG)
ur: براہ کرم اپنے کورس کی تصویر پر درست راستے اور نام فراہم کریں (نوٹ: صرف JPEG یا PNG فارمیٹ کی حمایت کی ہے)
zh_cn: 请为您的课程图片提供有效的路径和名称（注意：仅支持JPEG或PNG格式）

source: This group configuration is in use and cannot be deleted.
ar: تكون تهيئة المجموعة قيد الاستخدام ولا يمكن حذفها.
ur: یہ گروپ ترتیب استعمال میں ہے اور خارج نہیں کیا جاسکتا ہے.
zh_cn: 此组配置正在使用中，无法删除。

source: Permissible Use
ar: الاستخدام المسموح به
ur: جائز استعمال
zh_cn: 允许使用

source: No inactive user with this e-mail exists
ar: لا يوجد مستخدم غير نشط مع هذه البريد الإلكتروني موجود
ur: اس ای میل کے ساتھ کوئی غیر فعال صارف موجود نہیں ہے
zh_cn: 不存在具有此电子邮件的非活动用户

source: This enrollment code ({enrollment_code}) is no longer valid.
ar: لم يعد رمز التسجيل هذا ({enrollment_code}) صالحًا.
ur: اس اندراج کوڈ ({اندراج_code}) اب قابل اعتبار نہیں ہے.
zh_cn: 此注册码（{enrollment_code}）不再有效。

source: Password cannot be the same as the username.
ar: لا يمكن أن تكون كلمة المرور هي نفس اسم المستخدم.
ur: صارف نام کے طور پر پاس ورڈ اسی طرح نہیں ہوسکتا ہے.
zh_cn: 密码不能与用户名相同。

source: Percent of Students
ar: نسبة الطلاب
ur: طالب علموں کا فیصد
zh_cn: 学生的百分比

source: The {provider_name} account you selected is already linked to another {platform_name} account.
ar: حساب {provider_name} الذي حددته مرتبط بالفعل بحساب {platform_name} آخر.
ur: {provider_name} آپ کا منتخب کردہ اکاؤنٹ پہلے ہی دوسرے {platform_name} اکاؤنٹ سے منسلک ہے.
zh_cn: 您选择的{provider_name}帐户已经链接到另一个{platform_name}帐户。

source: This component cannot be rescored.
ar: لا يمكن أن يتم حفظ هذا المكون.
ur: یہ جزو محفوظ نہیں کیا جا سکتا.
zh_cn: 该组件不能被重新分配。

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
ar: تشير شهادة {cert_type} إلى أن المتعلم قد وافق على الالتزام بقانون الشرف الذي وضعته {platform_name} وأنه أكمل جميع المهام المطلوبة لهذه الدورة بموجب إرشاداتها.
ur: ایک {cert_type} سرٹیفکیٹ اس بات کی نشاندہی کرتی ہے کہ سیکھنے والے نے {platform_name} کی طرف سے قائم کردہ اعزاز کوڈ کے مطابق اس پر اتفاق کیا ہے اور اس کورس کے لئے تمام ضروری کاموں کو اس کے رہنماؤں کے تحت مکمل کیا ہے.
zh_cn: {cert_type}证书表示学习者已同意遵守{platform_name}所建立的荣誉代码，并已根据其指导原则完成了本课程的所有必需任务。

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكن للطلاب إنشاء مشاركات مناقشة غير معروفة للطلاب الآخرين. لا يجعل هذا الإعداد المشاركات مجهولة بالنسبة لموظفي الدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، طالب علموں کو بحث خطوط بنا سکتے ہیں جو دیگر طالب علموں کے نام سے گمنام ہیں. یہ ترتیب عملے کو کورس کرنے کے لئے گمنام نہیں بناتا.
zh_cn: 输入true或false。如果属实，学生可以创建对其他学生匿名的讨论帖子。此设置不会使课程员工匿名发表。

source: Site theme reverted to the default
ar: تم إرجاع مظهر الموقع إلى الوضع الافتراضي
ur: سائٹ مرکزی خیال، موضوع کو پہلے سے طے شدہ پر منتقل کر دیا گیا
zh_cn: 网站主题已恢复为默认值

source: Forgot password?
ar: هل نسيت كلمة المرور؟
ur: پاسورڈ بھول گے؟
zh_cn: 忘记密码？

source: Course Navigation
ar: بالطبع بالطبع
ur: کورس نیوی گیشن
zh_cn: 课程导航

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
ar: بدأت مهمة إنشاء الشهادة لجميع الطلاب من هذه الدورة. يمكنك عرض حالة مهمة التوليد في قسم &quot;المهام المعلقة&quot;.
ur: اس کورس کے تمام طلبا کے لئے سرٹیفکیٹ نسل کا کام شروع کیا گیا ہے. آپ &quot;موصول شدہ ٹاسکس&quot; سیکشن میں نسل کے کام کی حیثیت کو دیکھ سکتے ہیں.
zh_cn: 所有本课程学生的证书生成任务已经开始。您可以在“待处理任务”部分查看生成任务的状态。

source: ID photo not provided
ar: صورة الهوية غير متوفرة
ur: ID تصویر فراہم نہیں کی
zh_cn: 没有提供身份证照片

source: Grade required for a {cert_name_short}:
ar: الدرجة المطلوبة لـ {cert_name_short}:
ur: {cert_name_short} کیلئے گریڈ کی ضرورت ہے:
zh_cn: {cert_name_short}所需的等级：

source: Validate this certificate for yourself
ar: التحقق من صحة هذه الشهادة لنفسك
ur: اپنے لئے اس سرٹیفکیٹ کو درست کریں
zh_cn: 为自己验证此证书
