Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: The new course is set to start on January 1, 2030 at midnight (UTC).
ar: من المقرر أن تبدأ الدورة التدريبية الجديدة في 1 يناير 2030 في منتصف الليل (UTC).
ur: یہ نیا کورس 1 جنوری 2030 ء کو آدھی رات (UTC) پر شروع کرنے کا ہے.
zh_cn: 新课程将于2030年1月1日午夜（UTC）开始。

source: All learners
ar: جميع المتعلمين
ur: تمام سیکھنے والے
zh_cn: 所有学习者

source: Sign in with {provider_name}
ar: تسجيل الدخول باستخدام {provider_name}
ur: {provider_name} کے ساتھ سائن ان کریں
zh_cn: 用{provider_name}登录

source: Download Your Certificate
ar: قم بتنزيل شهادتك
ur: اپنا سرٹیفکیٹ ڈاؤن لوڈ کریں
zh_cn: 下载您的证书

source: Change due date for student
ar: تغيير تاريخ الاستحقاق للطالب
ur: طالب علم کے لئے مناسب تاریخ تبدیل کریں
zh_cn: 更改学生的到期日期

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
ar: تظهر معلومات أخرى من هذه الصفحة في صفحة &quot;حول&quot; للدورة التدريبية الخاصة بك. تتضمن هذه المعلومات نظرة عامة على الدورة التدريبية ، وصورة الدورة التدريبية ، والفيديو التقديمي ، ومتطلبات الوقت المقدرة. يستخدم الطلاب حول الصفحات لاختيار الدورات التدريبية الجديدة التي يجب اتخاذها.
ur: اس صفحے سے دیگر معلومات آپ کے کورس کے بارے میں صفحہ پر ظاہر ہوتا ہے. اس معلومات میں کورس کا جائزہ، کورس کی تصویر، تعارف ویڈیو، اور متوقع وقت کی ضروریات شامل ہیں. طالب علموں کو لینے کے لۓ نئے کورسز منتخب کرنے کے لئے صفحات کے بارے میں استعمال کرتے ہیں.
zh_cn: 此页面上的其他信息显示在课程的关于页面上。这些信息包括课程概述，课程图片，介绍视频以及估计的时间要求。学生使用关于页面来选择要参加的新课程。

source: This course doesn't support paid certificates
ar: لا تدعم هذه الدورة الشهادات المدفوعة
ur: یہ کورس ادا کردہ سرٹیفکیٹ کی حمایت نہیں کرتا
zh_cn: 本课程不支持付费证书

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
ar: أنت العضو الوحيد في فريق الدورة التدريبية الجديد. لا يتم تسجيل أي طالب في الدورة التدريبية ، ولا توجد بيانات للطلاب. لا يوجد محتوى في مواضيع المناقشة أو الويكي.
ur: آپ نئے کورس کے عملے کا واحد رکن ہیں. کوئی طالب علم اس کورس میں داخل نہیں ہوا ہے، اور طالب علم کے اعداد و شمار موجود نہیں ہیں. بحث کے موضوعات یا ویکیپیڈیا میں کوئی مواد نہیں ہے.
zh_cn: 你是新课程员工中唯一的成员。没有学生参加课程，也没有学生数据。讨论主题或维基中没有内容。

source: Full Name cannot contain the following characters: < >
ar: لا يمكن أن يحتوي الاسم الكامل على الأحرف التالية: &lt;&gt;
ur: مکمل نام میں مندرجہ ذیل حروف شامل نہیں ہوسکتا: &lt;&gt;
zh_cn: 全名不能包含以下字符：&lt;&gt;

source: Dear edX Learner,
ar: عزيزي المتعلم ،
ur: عزیز EDX سیکرٹری،
zh_cn: 亲爱的edX Learner，

source: Because the due date has passed, this assignment is hidden from the learner.
ar: نظرًا لأن تاريخ الاستحقاق قد انقضى ، يتم إخفاء هذا الواجب من المتعلم.
ur: کیونکہ تاریخ کی تاریخ منظور ہو گئی ہے، اس تفویض سیکھنے سے پوشیدہ ہے.
zh_cn: 由于截止日期已过，因此该作业对学习者是隐藏的。

source: Note: Library content is not automatically updated in courses
ar: ملاحظة: لا يتم تحديث محتوى المكتبة تلقائيًا في الدورات التدريبية
ur: نوٹ: لائبریری کا مواد خود کار طریقے سے نصاب میں نہیں ہے
zh_cn: 注意：课程中不会自动更新图书馆内容

source: {course_id} is not a valid course key.
ar: {course_id} ليس مفتاح دورة تدريبية صالحًا.
ur: {course_id} درست کورس کی کلید نہیں ہے.
zh_cn: {course_id}不是有效的课程键。

source: Total
ar: مجموع
ur: کل
zh_cn: 总

source: Download a .csv file of all coupon codes for this course.
ar: قم بتنزيل ملف .csv لجميع أكواد القسيمة لهذه الدورة التدريبية.
ur: اس کورس کے لئے تمام کوپن کوڈوں کی ایک .csv فائل ڈاؤن لوڈ کریں.
zh_cn: 下载本课程所有优惠券代码的.csv文件。

source: You must successfully generate example certificates before you enable student-generated certificates.
ar: يجب أن تقوم بإنشاء نماذج شهادات بنجاح قبل تمكين الشهادات التي ينشئها الطالب.
ur: طالب علم کے سرٹیفکیٹ کو فعال کرنے سے پہلے آپ کو مثال کے سرٹیفکیٹ کامیابی سے پیدا کرنا ضروری ہے.
zh_cn: 在启用学生生成的证书之前，您必须成功生成示例证书。

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
ar: يمنحك {studio_name} النشر بشكل بسيط وسريع وإضافي. مع الأصدقاء.
ur: {سٹوڈیو_ نام} آپ کو سادہ، تیز، اور بڑھنے والی اشاعت دیتا ہے. دوستوں کے ساتھ.
zh_cn: {studio_name}为您提供简单，快速和增量发布。和朋友。

source: {course_names} has been removed because the enrollment period has closed.
ar: تمت إزالة {course_names} نظرًا لإغلاق فترة التسجيل.
ur: {course_names} کو ہٹا دیا گیا ہے کیونکہ اندراج کی مدت بند ہوئی ہے.
zh_cn: {course_names}已被删除，因为登记期已关闭。

source: Past Due
ar: الماضي بسبب
ur: بقایاجات
zh_cn: 逾期

source: The above application requests the following permissions from your account:
ar: يطلب التطبيق أعلاه الأذونات التالية من حسابك:
ur: مندرجہ بالا درخواست آپ کے اکاؤنٹ سے درج ذیل اجازتوں کی درخواست کرتا ہے:
zh_cn: 上述应用程序会从您的帐户请求以下权限：

source: Either the capture or credit is not voidable because the capture or credit information has already been submitted to your processor, or you requested a void for a type of transaction that cannot be voided.
ar: إما أن يكون الالتقاط أو الائتمان غير قابل للإبطال لأن معلومات الالتقاط أو الائتمان قد تم إرسالها بالفعل إلى المعالج الخاص بك ، أو طلبت فراغًا لنوع من المعاملات لا يمكن إلغاءه.
ur: یا تو قبضہ یا کریڈٹ ناقابل اعتماد نہیں ہے کیونکہ قبضہ یا کریڈٹ کی معلومات آپ کے پروسیسر میں پہلے ہی پیش کی گئی ہے، یا آپ نے ٹرانزیکشن کی قسم کے لئے باطل کرنے کا مطالبہ کیا ہے جس سے آواز نہیں مل سکی.
zh_cn: 由于捕获或信用信息已经提交给您的处理器，或者您要求对无法作废的交易类型请求无效，捕获或信用不可撤销。

source: External Discussion
ar: مناقشة خارجية
ur: بیرونی بحث
zh_cn: 外部讨论

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
ar: إذا قمت بتغيير واستيراد مكتبة يتم الرجوع إليها بواسطة كتل محتوى عشوائية في دورة واحدة أو أكثر ، فإن هذه الدورات لا تستخدم المحتوى الذي تم تحديثه تلقائيًا. يجب أن تقوم يدويًا بتحديث كتل المحتوى العشوائية لجعلها حديثة مع أحدث محتوى للمكتبة.
ur: اگر آپ ایک لائبریری کو تبدیل کرتے ہیں اور درآمد کرتے ہیں جو بے ترتیب کردہ مواد کے بلاکس میں ایک یا زیادہ کورسز میں حوالہ دیتے ہیں، وہ ان کورسز کو خود کار طریقے سے اپ ڈیٹ کردہ مواد کا استعمال نہیں کرتے ہیں. آپ کو تازہ ترین لائبریری مواد کے ساتھ تازہ ترین مواد کے بلاکس کو دستی طور پر تازہ کاری کرنا ضروری ہے.
zh_cn: 如果您更改并导入由一个或多个课程中的随机内容块引用的图书馆，这些课程不会自动使用更新的内容。您必须手动刷新随机化内容块，以使其与最新的库内容保持同步。

source: Year of birth
ar: سنة الميلاد
ur: پیدائش کا سال
zh_cn: 出生年份

source: Unable to parse date:
ar: غير قادر على تحليل التاريخ:
ur: تاریخ پیرس کرنے میں ناکام
zh_cn: 无法解析日期：

source: Download list of all users (csv file)
ar: تنزيل قائمة بجميع المستخدمين (ملف CSV)
ur: تمام صارفین (csv فائل) کی فہرست ڈاؤن لوڈ کریں
zh_cn: 下载所有用户列表（csv文件）

source: Request Certificate
ar: طلب الشهادة
ur: درخواست سند
zh_cn: 申请证书

source: Unable to find entrance exam submission to be {action} for student '{student}'
ar: يتعذر العثور على إرسال امتحان القبول ليكون {فعل} للطالب &#39;{student}&#39;
ur: طالب علم کے &#39;{طالب علم}&#39; کے لئے داخلہ کے امتحان جمع کرنے کے لئے {action} ہونے کی اجازت نہیں ہے.
zh_cn: 无法为学生“{student}”找到入学考试提交{action}

source: Sunday
ar: الأحد
ur: اتوار
zh_cn: 星期日

source: The primary contact at the organization
ar: جهة الاتصال الرئيسية في المنظمة
ur: تنظیم میں بنیادی رابطہ
zh_cn: 组织中的主要联系人

source: This course was created as a re-run. Some manual configuration is needed.
ar: تم إنشاء هذه الدورة التدريبية كإعادة التشغيل. هناك حاجة إلى بعض التكوين اليدوي.
ur: یہ کورس دوبارہ چلانے کے طور پر تشکیل دیا گیا تھا. کچھ دستی ترتیب کی ضرورت ہے.
zh_cn: 本课程是作为重新创建的。需要一些手动配置。

source: View Certificate
ar: عرض الشهادة
ur: سرٹیفکیٹ دیکھیں
zh_cn: 查看证书

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
ar: هذا هو SKU (وحدة حفظ المخزون) لهذا الوضع في خدمة التجارة الإلكترونية الخارجية.
ur: خارجہ ای کامرس سروس میں اس موڈ کا بڑا SKU (اسٹاک رکھنا یونٹ) ہے.
zh_cn: 这是外部电子商务服务中此模式的批量SKU（库存单位）。

source: Insert a text response
ar: إدراج استجابة نصية
ur: ایک متن کے جواب داخل کریں
zh_cn: 插入文字回复

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
ar: الترخيص الفرعي أو إعادة توزيع أو تأجير أو بيع أو تأجير الوصول إلى واجهات برمجة التطبيقات أو سر عميلك لأي طرف ثالث ؛
ur: کسی بھی تیسری پارٹی کو اے پی پی یا آپ کے کلائنٹ کے خفیہ تک رسائی حاصل کرنے، ریپبلنگ، کرایہ دینے، فروخت یا لیزنگ؛
zh_cn: 转让，再分发，出租，出售或出租API或您的客户秘密给任何第三方;

source: Show all posts
ar: عرض كل المشاركات
ur: تمام پوسٹس دکھائیں
zh_cn: 显示所有帖子

source: Refine Your Search
ar: حدد بحثك
ur: آپ کی تلاش کو بہتر بنائیں
zh_cn: 优化您的搜索

source: Math Expression
ar: تعبير الرياضيات
ur: ریاضی اظہار
zh_cn: 数学表达式

source: Company
ar: شركة
ur: کمپنی
zh_cn: 公司

source: Friday
ar: يوم الجمعة
ur: جمعہ
zh_cn: 星期五

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
ar: تم إكماله بنجاح ، وحصل على درجة النجاح ، وحصل على شهادة النجاح هذه {platform_name} {certificate_type}
ur: کامیابی سے مکمل ہوگیا، گزر گریڈ موصول ہوئی، اور اسے {platform_name} {سرٹیفکیٹ_ٹائپ} میں مکمل کرنے کے سرٹیفکیٹ سے نوازا گیا
zh_cn: 成功完成，获得了及格分数，并获得了{platform_name} {certificate_type}完成证书

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
ar: يجب أن تكون الدورة التدريبية التي تقوم باستيرادها في ملف .tar.gz (أي ، ملف .tar مضغوط باستخدام GNU Zip). يجب أن يحتوي ملف .tar.gz هذا على ملف course.xml. قد تحتوي أيضًا على ملفات أخرى.
ur: آپ جس چیز کا درآمد کرتے ہیں وہ ایک .tt.gz فائل میں ہونا ضروری ہے (یہ، جی این یو زپ سے مطابقت رکھتا ہے .تر فائل ہے). یہ .tar.gz فائل میں ایک کورس. xml فائل ہونا ضروری ہے. اس میں دیگر فائلیں بھی شامل ہوسکتی ہیں.
zh_cn: 您导入的课程必须在.tar.gz文件中（即，使用GNU Zip压缩的.tar文件）。这个.tar.gz文件必须包含一个course.xml文件。它也可能包含其他文件。

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
ar: {strong_start} تحذير {strong_end}: لا تعدّل هذه السياسات ما لم تكن على دراية بغرضها.
ur: {strong_start} انتباہ {strong_end}: ان پالیسیوں میں ترمیم نہ کریں جب تک کہ آپ ان کے مقصد سے واقف نہیں ہیں.
zh_cn: {strong_start}警告{strong_end}：除非您熟悉其目的，否则请勿修改这些策略。

source: Reason
ar: السبب
ur: وجہ
zh_cn: 原因

source: Course details
ar: تفاصيل الدورة
ur: کورس کے تفصیلات
zh_cn: 课程详情

source: The supplied topic id {topic_id} is not valid
ar: معرف الموضوع الموفر {topic_id} غير صالح
ur: فراہم شدہ موضوع id {topic_id} درست نہیں ہے
zh_cn: 提供的主题ID {topic_id}无效

source: You have already created an account using an external login like WebAuth or Shibboleth. Please contact {tech_support_email} for support.
ar: لقد قمت بالفعل بإنشاء حساب باستخدام تسجيل دخول خارجي مثل WebAuth أو Shibboleth. يرجى الاتصال بـ {tech_support_email} للحصول على الدعم.
ur: آپ نے پہلے سے ہی بیرونی لاگ ان جیسے WebAuth یا Shibboleth کا استعمال کرتے ہوئے ایک اکاؤنٹ بنایا ہے. تعاون کیلئے {tech_support_email} سے رابطہ کریں.
zh_cn: 您已经使用WebAuth或Shibboleth等外部登录帐户创建了一个帐户。请联系{tech_support_email}获取支持。

source: Keep Flag
ar: الحفاظ على العلم
ur: پرچم رکھیں
zh_cn: 保持标志

source: Could not find a group named "{}" - skipping.
ar: تعذر العثور على مجموعة باسم &quot;{}&quot; - تخطي.
ur: &quot;{}&quot; کا نام ایک گروپ نہیں مل سکا.
zh_cn: 无法找到名为“{}”的组 - 跳过。

source: This content experiment has issues that affect content visibility.
ar: تحتوي تجربة المحتوى هذه على مشكلات تؤثر على مستوى رؤية المحتوى.
ur: اس مواد کے تجربات میں ایسے مسائل موجود ہیں جو مواد کی نمائش کو متاثر کرتی ہیں.
zh_cn: 此内容实验具有影响内容可见性的问题。

source: Support
ar: الدعم
ur: سپورٹ
zh_cn: 支持

source: Start Letter:
ar: رسالة البداية:
ur: شروع خط:
zh_cn: 开始信：

source: Discussion
ar: نقاش
ur: بحث
zh_cn: 讨论

source: Your order number is: {order_number}
ar: رقم طلبك هو: {order_number}
ur: آپ کا آرڈر نمبر یہ ہے: {آرڈر_نمبر}
zh_cn: 您的订单号码是：{order_number}

source: The company identifier for the LinkedIn Add-to-Profile button e.g 0_0dPSPyS070e0HsE9HNz_13_d11_
ar: معرف الشركة للزر إضافة Add-to-Profile على سبيل المثال 0_0dPSPyS070e0HsE9HNz_13_d11_
ur: لنکڈ ان اضافی پروفائل کے بٹن کے لئے کمپنی کے شناخت کنندہ جیسے 0_0dPSPyS070e0HsE9HNz_13_d11_
zh_cn: LinkedIn添加到配置文件按钮的公司标识符，例如0_0dPSPyS070e0HsE9HNz_13_d11_

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
ar: تتحكم الإعدادات المتقدمة في وظائف الدورة التدريبية المحددة. في هذه الصفحة ، يمكنك تعديل السياسات اليدوية ، وهي الأزواج التي تستند إلى JSON وأزواج القيم التي تتحكم في إعدادات الدورة التدريبية المحددة.
ur: اعلی درجے کی ترتیبات مخصوص کورس فعالیت کو کنٹرول کرتی ہیں. اس صفحے پر، آپ دستی پالیسیوں میں ترمیم کرسکتے ہیں، جو JSON کی بنیاد پر کلیدی اور قدر کے جوڑوں ہیں جو مخصوص کورس ترتیبات کو کنٹرول کرتی ہیں.
zh_cn: 高级设置控制特定的课程功能。在此页面上，您可以编辑手动策略，这些策略是基于JSON的键和值对来控制特定的课程设置。

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
ar: شهادة الطالب {user} غير صالحة من قبل ، يُرجى التحقق من إنشاء الشهادة لهذا الطالب ثم المتابعة.
ur: طالب علم {صارف} کیلئے سرٹیفکیٹ پہلے سے ہی غلط ہے، براہ کرم تصدیق کریں کہ اس طالب علم کو اس طالب علم کے لئے پیدا کیا گیا اور پھر آگے بڑھایا گیا.
zh_cn: 学生{用户}的证书已无效，请确认已为此学生生成证书，然后继续。

source: The payment processor did not return a required parameter: {parameter}
ar: لم يُرجع معالج الدفع معلمة مطلوبة: {parameter}
ur: ادائیگی کے پروسیسر نے مطلوبہ پیرامیٹر واپس نہیں کیا: {پیرامیٹر}
zh_cn: 付款处理器没有返回所需的参数：{参数}

source: Programs
ar: برامج
ur: پروگرام
zh_cn: 程式

source: We support only SubRip (*.srt) transcripts format.
ar: نحن ندعم فقط تنسيق النصوص (* .srt) SubRip.
ur: ہم صرف SubRip (* .rt) ٹرانپٹیٹ فارمیٹ کی حمایت کرتے ہیں.
zh_cn: 我们只支持SubRip（* .srt）成绩单格式。

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
ar: {exception_message}: لا يمكن العثور على ملفات نصية تم تحميلها: {user_filename}
ur: {exception_message}: اپ لوڈ ٹرانزیکٹس نہیں مل سکا: {user_filename}
zh_cn: {exception_message}：无法找到上传的成绩单：{user_filename}

source: Show Reset Button
ar: إظهار زر إعادة الضبط
ur: ری سیٹ بٹن دکھائیں
zh_cn: 显示重置按钮

source: There is no user with the username or email address {user_name} enrolled in this course.
ar: لا يوجد مستخدم باسم المستخدم أو عنوان البريد الإلكتروني {user_name} مسجل في هذه الدورة التدريبية.
ur: اس کورس میں درج کردہ صارف نام یا ای میل پتہ {user_name} کے ساتھ کوئی صارف نہیں ہے.
zh_cn: 没有用户在本课程中注册了用户名或电子邮件地址{user_name}。

source: A level of education is required
ar: مستوى التعليم مطلوب
ur: تعلیمی سطح کی ضرورت ہے
zh_cn: 一个教育水平是必需的

source: Required Information to Sign In to {studio_name}
ar: المعلومات المطلوبة لتسجيل الدخول إلى {studio_name}
ur: {سٹوڈیو_ نام} میں سائن ان کرنے کے لئے ضروری معلومات
zh_cn: 登录{studio_name}所需的信息

source: A Note to Learners
ar: ملاحظة للمتعلمين
ur: سیکھنے کے لئے ایک نوٹ
zh_cn: 学习者注意事项

source: Enter your YouTube video's ID (along with any restriction parameters)
ar: أدخل معرف الفيديو الخاص بك على YouTube (إلى جانب أي معلمات قيود)
ur: اپنی YouTube ویڈیو کی شناخت (کسی بھی پابندی کے پیرامیٹرز کے ساتھ) درج کریں
zh_cn: 输入您的YouTube视频ID（以及任何限制参数）

source: Grade Distribution Data
ar: بيانات توزيع الصف
ur: گریڈ تقسیم ڈیٹا
zh_cn: 成绩分布数据

source: To access this course, you must first consent to share your learning achievements with {enterprise_customer_name}.
ar: للوصول إلى هذه الدورة التدريبية ، يجب عليك أولاً الموافقة على مشاركة إنجازاتك التعليمية مع {enterprise_customer_name}.
ur: اس کورس تک رسائی حاصل کرنے کے لئے، آپ کو {enterprise_customer_name} کے ساتھ اپنی سیکھنے کی کامیابیوں کو اشتراک کرنے کیلئے سب سے پہلے رضامند ہونا ضروری ہے.
zh_cn: 要访问此课程，您必须首先同意与{enterprise_customer_name}分享您的学习成绩。

source: Welcome to {platform_name}.
ar: مرحبًا بك في {platform_name}.
ur: {platform_name} میں خوش آمدید.
zh_cn: 欢迎来到{platform_name}。

source: Verified modes cannot be free.
ar: لا يمكن أن تكون أوضاع التحقق مجانية.
ur: تصدیق شدہ طریقوں کو مفت نہیں بنایا جا سکتا.
zh_cn: 验证模式不能免费。

source: Last submission time
ar: آخر موعد للتقديم
ur: آخری جمع کرانے کا وقت
zh_cn: 最后提交时间

source: Coupon Codes Used
ar: رموز القسيمة المستخدمة
ur: کوپن کوڈز استعمال کیا جاتا ہے
zh_cn: 使用优惠券代码

source: success
ar: نجاح
ur: کامیابی
zh_cn: 成功

source: Unenrolled {user} from {course_id}
ar: غير مُسجل {user} من {course_id}
ur: {کورس_ڈ} سے نام نہاد {صارف}
zh_cn: {course_id}未登记{user}

source: The recipient name cannot be a number.
ar: لا يمكن أن يكون اسم المستلم رقماً.
ur: وصول کنندہ کا نام ایک نمبر نہیں ہوسکتا ہے.
zh_cn: 收件人姓名不能是数字。

source: Profession
ar: مهنة
ur: پیشہ
zh_cn: 职业

source: Wiki Cheatsheet
ur: وکیپیڈیا دھوکہ دہی

source: Give a short reason for your edit, which will be stated in the revision log.
ar: حدد سببًا قصيريًا لتعديلك ، والذي سيتم ذكره في سجل المراجعة.
ur: آپ کی ترمیم کے لئے ایک مختصر وجہ، جو ترمیم لاگ میں بیان کیا جائے گا.
zh_cn: 为编辑提供一个简短的理由，这将在修订日志中说明。

source: Progress: {action} {succeeded} of {attempted} so far
ar: التقدم: {action} {succeeded} من {حاولت} حتى الآن
ur: پیش رفت: {کارروائی} {کامیاب} {کوشش کی} اب تک
zh_cn: 进展：迄今{尝试}的{action} {成功}

source: Warning
ar: تحذير
ur: انتباہ
zh_cn: 警告

source: Enter the company name.
ar: أدخل اسم الشركة.
ur: کمپنی کے نام درج کریں.
zh_cn: 输入公司名称。

source: Confirm Email
ar: .تأكيد عنوان البريد الإلكتروني
ur: ای میل کی توثیق کریں
zh_cn: 确认邮件

source: Specify whether to show an auto-advance button in videos. If the student clicks it, when the last video in a unit finishes it will automatically move to the next unit and autoplay the first video.
ar: حدد ما إذا كنت تريد إظهار زر التقدم التلقائي في مقاطع الفيديو. إذا نقر الطالب عليها ، فعند انتهاء آخر فيديو في الوحدة ، سينتقل تلقائيًا إلى الوحدة التالية وسيعمل تلقائيًا على تشغيل الفيديو الأول.
ur: وضاحت کریں کہ ویڈیوز میں آٹو پیشگی بٹن ظاہر کرنے کے لئے. اگر طالب علم اس پر کلک کرتا ہے، جب ایک یونٹ میں آخری ویڈیو ختم ہوجاتا ہے تو یہ خود بخود اگلے یونٹ میں منتقل ہوجاتا ہے اور پہلے ویڈیو کو خودکار کرے گا.
zh_cn: 指定是否在视频中显示自动前进按钮。如果学生点击它，当单元中的最后一个视频结束时，它将自动移动到下一个单元并自动播放第一个视频。

source: The public organization name for your library.
ar: اسم المنظمة العامة لمكتبتك.
ur: آپ کی لائبریری کے لئے عوامی تنظیم کا نام.
zh_cn: 您的图书馆的公共组织名称。

source: User Data
ar: بيانات المستخدم
ur: یوزر ڈیٹا
zh_cn: 用户数据

source: %(file)s has been changed to revision #%(revision)d
ar: تم تغيير٪ (file) s إلى المراجعة #٪ (المراجعة) d
ur: ٪ (فائل) کو ترمیم #٪ (تجزیہ) ڈی میں تبدیل کر دیا گیا ہے
zh_cn: ％（文件）s已更改为修订版＃％（修订版）d

source: Unauthorized email address.
ar: عنوان بريد إلكتروني غير مصرح به.
ur: غیر مجاز ای میل ایڈریس.
zh_cn: 未经授权的电子邮件地址。

source: Comment as returned from grader, LTI2.0 spec
ar: التعليق كما عاد من الصف ، مواصفات LTI2.0
ur: grader سے واپس آنے کے طور پر تبصرہ، LTI2.0 کی نمائش
zh_cn: 评论从平地机，LTI2.0规格返回

source: View Grading in studio
ar: عرض الدرجات في الاستوديو
ur: سٹوڈیو میں گریڈنگ دیکھیں
zh_cn: 视图在工作室中评分

source: Add new students
ar: أضف طلاب جدد
ur: نئے طالب علموں کو شامل کریں
zh_cn: 添加新学生

source: Date of Refund
ar: تاريخ الاسترداد
ur: رقم کی واپسی کی تاریخ
zh_cn: 退款日期

source: Sun
ar: شمس
ur: سورج
zh_cn: 太阳

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
ar: إضافة نصوص بلغات مختلفة. انقر أدناه لتحديد لغة وتحميل ملف النص .srt لتلك اللغة.
ur: مختلف زبانوں میں ٹرانسمیشن شامل کریں. زبان کی وضاحت کرنے کے لئے ذیل میں کلک کریں اور اس زبان کے لئے ایک ایس ایس آر ٹرانسپٹ فائل کو اپ لوڈ کریں.
zh_cn: 添加不同语言的成绩单。点击下方指定一种语言并上传该语言的.srt脚本文件。

source: Enlarge image
ar: تكبير الصورة
ur: تصویر بڑھو
zh_cn: 放大图像

source: Course has no valid entrance exam section.
ar: بالطبع لا يوجد لديه قسم امتحان دخول صحيح.
ur: کورس میں کوئی درست داخلہ امتحان نہیں ہے.
zh_cn: 课程没有有效的入学考试部分。

source: The course you are enrolling for is full.
ar: الدورة التي تسجلها ممتلئة.
ur: آپ کے لئے داخلہ کورس مکمل ہے.
zh_cn: 您报名的课程已满。

source: Enter the location of the annotation storage server. The textannotation, videoannotation, and imageannotation advanced modules require this setting.
ar: أدخل موقع خادم تخزين التعليقات التوضيحية. تتطلب وحدات النص المتقدمة textannotation و videoannotation و imageannotation هذا الإعداد.
ur: تشریح سٹوریج سرور کا مقام درج کریں. ٹیکسٹنٹیشن، ویڈیو ٹرانسمیشن، اور تصویری تشریحات ماڈیولز اس ترتیب کی ضرورت ہوتی ہے.
zh_cn: 输入注释存储服务器的位置。 textannotation，videoannotation和imageannotation高级模块需要此设置。

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
ar: اختياري ، للمتصفحات القديمة: معرف YouTube لمقطع الفيديو بسرعة 75x.
ur: اختلاط، پرانے براؤزرز کیلئے: 75x رفتار ویڈیو کیلئے یو ٹیوب ID.
zh_cn: 可选，适用于旧版浏览器：.75x速度视频的YouTube ID。

source: Annual Household Income
ar: الدخل السنوي المنزلية
ur: سالانہ گھریلو آمدنی
zh_cn: 家庭年收入

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
ar: حدد رمز التهيئة لقسم أو قسم فرعي لتعيين تاريخ إصداره. عندما تقوم بتكوين قسم فرعي ، يمكنك أيضًا تعيين سياسة التقدير وتاريخ الاستحقاق.
ur: اس کی رہائی کی تاریخ مقرر کرنے کے لئے ایک سیکشن یا سبسکرائب کے لئے ترتیب آئیکٹر منتخب کریں. جب آپ سبسکرائب کرتے ہیں تو، آپ گریڈنگ کی پالیسی اور اس کی تاریخ بھی مقرر کر سکتے ہیں.
zh_cn: 选择部分或子部分的配置图标以设置其发布日期。当您配置小节时，您还可以设置评分政策和截止日期。

source: Could not interpret '{given_answer}' as a number.
ar: لا يمكن تفسير &quot;{given_answer}&quot; كرقم.
ur: ایک نمبر کے طور پر &#39;given given&#39; &#39;کی تفسیر نہیں کی جا سکتی.
zh_cn: 无法将“{given_answer}”解释为数字。

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
ar: عذرًا ، حدث خطأ في معالجة طلبك. الرجاء محاولة إعادة تحميل صفحتك وإعادة المحاولة.
ur: ہمیں افسوس ہے، آپ کی درخواست پر عملدرآمد کرنے میں ایک غلطی تھی. براہ کرم اپنا صفحہ دوبارہ لوڈ کرنے کی کوشش کریں اور دوبارہ کوشش کریں.
zh_cn: 很抱歉，处理您的请求时发生错误。请尝试重新加载您的网页并重试。

source: Editor
ar: محرر
ur: ایڈیٹر
zh_cn: 编辑

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
ar: أخبرنا عن خططك لهذه الدورة. ما الخطوات التي ستتخذها لمساعدتك في إكمال العمل بالدورة التدريبية والحصول على شهادة؟
ur: ہمیں اس کورس کے منصوبوں کے بارے میں بتائیں. کورس کے کام کو مکمل کرنے اور ایک سرٹیفکیٹ حاصل کرنے میں آپ کی مدد کے لئے کیا اقدامات کریں گے؟
zh_cn: 请告诉我们您的课程计划。您将采取哪些步骤来帮助您完成课程并获得证书？

source: Accept grades past deadline
ar: اقبل التقديرات النهائية للدرجات
ur: ماضی کی گریڈوں کو گریڈ قبول کریں
zh_cn: 接受截止日期前的成绩

source: Certificate Validation
ar: التحقق من صحة الشهادة
ur: سرٹیفکیٹ کی توثیق
zh_cn: 证书验证

source: Create Your First Course
ar: إنشاء أول دورة لك
ur: اپنا پہلا کورس بنائیں
zh_cn: 创建你的第一门课程

source: Organization Name
ar: اسم المنظمة
ur: تنظیم کا نام
zh_cn: 机构名称

source: Almost there!
ar: اوشكت على الوصول!
ur: تقریبا وہاں!
zh_cn: 差不多了！

source: Rescore Only If Scores Improve
ar: Rescore فقط إذا تحسنت النتائج
ur: ریسورس صرف سکور صرف بہتر ہے
zh_cn: 仅当分数改善时重新分配

source: API Terms of Service
ar: شروط الخدمة API
ur: API کی شرائط
zh_cn: API服务条款

source: Scientific notation
ar: الترميز العلمي
ur: سائنسی اطلاع
zh_cn: 科学计数法

source: Discussion topics list
ar: قائمة مواضيع المناقشة
ur: بحث کی فہرست کی فہرست
zh_cn: 讨论主题列表

source: Search files and articles
ar: البحث عن الملفات والمقالات
ur: فائلوں اور مضامین تلاش کریں
zh_cn: 搜索文件和文章

source: Details & Schedule
ar: التفاصيل والجدول الزمني
ur: تفصیلات اور شیڈول
zh_cn: 细节和时间表

source: You are not enrolled in this course
ar: أنت غير مسجل في هذه الدورة
ur: آپ اس کورس میں داخل نہیں ہوئے ہیں
zh_cn: 你没有参加这门课程

source: Add Instructor
ar: إضافة مدرس
ur: انسٹریکٹر شامل کریں
zh_cn: 添加讲师

source: Unordered List
ar: قائمة غير مرتبة
ur: بے ترتیب فہرست
zh_cn: 无序列表

source: You can also download this data as a CSV file.
ar: يمكنك أيضًا تنزيل هذه البيانات كملف CSV.
ur: آپ اس ڈیٹا کو CSV فائل کے طور پر بھی ڈاؤن لوڈ کرسکتے ہیں.
zh_cn: 您也可以将这些数据作为CSV文件下载。

source: Show Results
ar: أظهر النتائج
ur: نتائج دکھاو
zh_cn: 显示结果
