Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: This content experiment uses group configuration '{group_configuration_name}'.
ar: تستخدم تجربة المحتوى هذه تكوين المجموعة &#39;{group_configuration_name}&#39;.
ur: یہ مواد استعمال گروپ کی ترتیب &#39;{group_configuration_name}&#39; کا استعمال کرتا ہے.
zh_cn: 此内容实验使用组配置“{group_configuration_name}”。

source: Used Registration Code
ar: رمز التسجيل المستخدم
ur: استعمال کردہ رجسٹریشن کوڈ
zh_cn: 使用的注册码

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. Only enrolled users can be added as Discussion Admins.
ar: يمكن لمسؤولي المناقشة تعديل أي مشاركة أو حذفها ، ومسح إشارات إساءة الاستخدام ، وإغلاق سلاسل المحادثات وإعادة فتحها ، وتأييد الردود ، ومشاهدة المشاركات من جميع المجموعات. يتم وضع علامة على وظائفهم بأنها &quot;الموظفين&quot;. يمكنهم أيضًا إضافة وإزالة أدوار الإشراف على المناقشة لإدارة عضوية فريق الدورة التدريبية. يمكن فقط إضافة المستخدمين المسجلين كمسؤولين للمناقشة.
ur: بحث ایڈمنز کسی بھی اشاعت میں ترمیم یا حذف کرسکتے ہیں، غلط استعمال کے جھنڈے کو صاف کریں، قریبی اور دوبارہ کھولنے والے موضوعات، ردعمل قبول کریں اور تمام گروہوں سے خطوط دیکھیں. ان کی اشاعتیں &#39;عملے&#39; کے طور پر نشان لگا دیا گیا ہے. وہ کورس ٹیم کی رکنیت کو منظم کرنے کے لئے بحث اعتدال پسند کرداروں کو بھی شامل اور ہٹ سکتے ہیں. صرف اندراج شدہ صارفین کو بحث ایڈمنز کے طور پر شامل کیا جا سکتا ہے.
zh_cn: 讨论管理员可以编辑或删除任何帖子，清除误用标志，关闭并重新打开主题，认可回复并查看所有组的帖子。他们的帖子被标记为“员工”。他们还可以添加和删除讨论审核角色以管理课程团队成员资格。只有注册用户可以添加为讨论管理员。

source: Please enter a valid CCX name.
ar: يرجى إدخال اسم CCX صالح.
ur: براہ کرم ایک درست CCX نام درج کریں.
zh_cn: 请输入有效的CCX名称。

source: Username:
ar: اسم المستخدم:
ur: صارف نام:
zh_cn: 用户名：

source: Working with Certificates
ar: العمل مع الشهادات
ur: سرٹیفکیٹ کے ساتھ کام کرنا
zh_cn: 使用证书

source: In the Press
ar: في الصحافة
ur: پریس میں
zh_cn: 在新闻中

source: Select the library from which you want to draw content.
ar: حدد المكتبة التي تريد رسم محتوى منها.
ur: اس لائبریری کو منتخب کریں جس سے آپ مواد کو ڈھونڈنا چاہتے ہیں.
zh_cn: 选择要从中绘制内容的库。

source: Record thoughts about a specific passage or concept.
ar: تسجيل الأفكار حول ممر أو مفهوم معين.
ur: ایک مخصوص منظوری یا تصور کے بارے میں ریکارڈ خیالات.
zh_cn: 记录关于特定段落或概念的想法。

source: Select a group type
ar: حدد نوع المجموعة
ur: ایک گروپ کی قسم منتخب کریں
zh_cn: 选择一个组类型

source: Click to download file
ar: انقر لتنزيل الملف
ur: فائل ڈاؤن لوڈ کرنے کے لئے کلک کریں
zh_cn: 点击下载文件

source: Add this certificate to your LinkedIn profile (opens a new tab/window)
ar: أضف هذه الشهادة إلى ملفك الشخصي على LinkedIn (يفتح علامة تبويب / نافذة جديدة)
ur: اس سرٹیفکیٹ کو اپنے لنکڈ پروفائل میں شامل کریں (نیا ٹیب / ونڈو کھولتا ہے)
zh_cn: 将此证书添加到您的LinkedIn个人资料中（打开一个新标签页/窗口）

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
ar: ستتم إضافة الدورة التدريبية الجديدة إلى قائمة الدورة التدريبية الخاصة بك خلال 5-10 دقائق. ارجع إلى هذه الصفحة أو {link_start} قم بتحديثها {link_end} لتحديث قائمة الدورة التدريبية. سوف تحتاج الدورة التدريبية الجديدة إلى بعض التكوين اليدوي.
ur: نیا کورس 5-10 منٹ میں آپ کے کورس کی فہرست میں شامل کیا جائے گا. اس صفحہ پر واپس جائیں یا کورس کی فہرست کو اپ ڈیٹ کرنے کیلئے {link_start} اسے {link_end} تازہ کریں. نیا کورس کچھ دستی ترتیب کی ضرورت ہوگی.
zh_cn: 新课程将在5-10分钟内添加到您的课程列表中。返回此页面或{link_start}刷新它{link_end}以更新课程列表。新课程将需要一些手动配置。

source: Provisionally Supported
ar: معتمد مؤقتا
ur: فراہم کی جاتی ہے
zh_cn: 暂时支持

source: Payment Received
ar: الدفعة المستلمة
ur: ادائیگی موصول
zh_cn: 已收到付款

source: ${newPrice}{htmlEnd} for entire program
ar: $ {newPrice} {htmlEnd} للبرنامج بأكمله
ur: پورے پروگرام کے لئے $ {newPrice} {htmlEnd}
zh_cn: $ {newPrice} {htmlEnd}为整个程序

source: The payment processor accepted an order whose number is not in our system.
ar: قبل معالج الدفع طلبًا غير موجود في نظامنا.
ur: ادائیگی کے پروسیسر نے ایک حکم قبول کیا جس کی تعداد ہمارے نظام میں نہیں ہے.
zh_cn: 付款处理器接受了一个订单，其号码不在我们的系统中。

source: but there is only {actual} matching problem.
ar: ولكن لا يوجد سوى مشكلة {actual} متطابقة.
ur: لیکن صرف {اصل} ملازمت کا مسئلہ ہے.
zh_cn: 但只有{实际}匹配问题。

source: Studio Administration
ar: إدارة الاستوديو
ur: سٹوڈیو ایڈمنسٹریشن
zh_cn: 工作室管理

source: All
ar: الكل
ur: سب
zh_cn: 所有

source: Content Groups
ar: مجموعات المحتوى
ur: مواد کے گروپ
zh_cn: 内容组

source: Password must be supplied if not using certificates
ar: يجب توفير كلمة المرور في حالة عدم استخدام الشهادات
ur: اگر سرٹیفکیٹس استعمال نہیں کرتے تو پاسورڈ کو فراہم کیا جانا چاہئے
zh_cn: 如果不使用证书，必须提供密码

source: On Reset
ar: على إعادة تعيين
ur: ری سیٹ پر
zh_cn: 在重置

source: Certificate Name (Short)
ar: اسم الشهادة (قصير)
ur: سرٹیفکیٹ کا نام (مختصر)
zh_cn: 证书名称（短）

source: The following content is not imported.
ar: لا يتم استيراد المحتوى التالي.
ur: مندرجہ ذیل مواد درآمد نہیں کی جاتی ہے.
zh_cn: 以下内容未导入。

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
ar: بمجرد التسجيل ، يمكن الإجابة على معظم الأسئلة في منتديات المناقشة الخاصة بالدورة أو من خلال الأسئلة الشائعة.
ur: رجسٹر ہونے کے بعد، اکثر مخصوص بحث کے فورموں میں یا سوالات کے ذریعہ جواب میں اکثر سوالات کا جواب دیا جا سکتا ہے.
zh_cn: 一旦注册，大多数问题都可以在课程特定讨论论坛或通过常见问题回答。

source: {month} {day}, {year}
ar: {شهر يوم سنه}
ur: {مہینہ دن سال}
zh_cn: {月日年}

source: Amount
ar: كمية
ur: رقم
zh_cn: 量

source: Linked
ar: مرتبط
ur: لنک
zh_cn: 关联

source: Sysadmin
ar: مسؤول النظام
ur: سیسڈمن
zh_cn: 系统管理员

source: If you need help, please use our web form at {support_url} or email {support_email}.
ar: إذا كنت بحاجة إلى المساعدة ، فالرجاء استخدام نموذج الويب الخاص بنا على {support_url} أو البريد الإلكتروني {support_email}.
ur: اگر آپ کی ضرورت ہو تو، براہ کرم {support_url} یا ای میل {support_email} پر اپنے ویب فارم کا استعمال کریں.
zh_cn: 如果您需要帮助，请使用我们的网络表单{support_url}或电子邮件{support_email}。

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
ar: عندما تنتهي من {strong_start} القسم {strong_end} ، اختر عندما تريد أن يبدأ البث المباشر ، وسيتولى {studio_name} الاعتناء بالباقي. بناء دورتك تدريجيا.
ur: جب آپ {strong_start} سیکشن {strong_end} مکمل کر لیتے ہیں تو، چنیں جب آپ زندہ رہنے کے لئے چاہتے ہیں اور {سٹوڈیو_ نام} آرام کا خیال رکھتا ہے. اپنے کورس کو اضافی طور پر بنائیں.
zh_cn: 当您完成{strong_start}部分{strong_end}时，请选择何时启用，{studio_name}负责其余部分。逐步建立您的课程。

source: Refund Request Time:
ar: وقت طلب رد الأموال:
ur: واپسی کی درخواست کا وقت:
zh_cn: 退款请求时间：

source: ID verification pending
ar: التحقق من الهوية معلقة
ur: ID کی توثیق زیر التواء ہے
zh_cn: 身份验证未决

source: CCX Coaches
ar: المدربين CCX
ur: CCX کوچ
zh_cn: CCX教练

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
ar: الرسالة التي يتم عرضها للمتعلمين في حالة عدم استيفاء جميع الشروط لعرض محتوى هذه الوحدة الشرطية. قم بتضمين {link} في نص رسالتك لمنح المتعلمين رابطًا مباشرًا للوحدات المطلوبة. على سبيل المثال ، &quot;يجب إكمال {link} قبل أن تتمكن من الوصول إلى هذه الوحدة&quot;.
ur: اس پیغام کو جو سیکھنے والوں کو دکھایا گیا ہے جب اس شرط کے مطابق کوئی شرط نہیں ہوتی ہے تو اس مشروط ماڈیول کے مواد کو دکھانے کے لۓ. {link} شامل کرنے کے لئے اپنے پیغام کے متن میں سیکھنے والوں کو براہ راست یونٹس سے منسلک کریں. مثال کے طور پر، &#39;آپ کو اس یونٹ تک رسائی حاصل کرنے سے قبل {لنک} مکمل کرنا ضروری ہے&#39;.
zh_cn: 当不是所有条件都满足时，向学习者显示的消息显示这个条件模块的内容。在信息文本中加入{link}，以便学员直接链接到所需的单元。例如，&#39;您必须完成{link}才能访问此设备&#39;。

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: يرجى تقديم المعلومات التالية لتسجيل الدخول إلى حساب {platform_name} الخاص بك. تتم ملاحظة الحقول المطلوبة <strong class="indicator">بنص غامق وعلامة نجمية (*)</strong> .
ur: آپ {platform_name} اکاؤنٹ میں لاگ ان کرنے کیلئے مندرجہ ذیل معلومات فراہم کریں. مطلوبہ فیلڈ <strong class="indicator">بولڈ متن اور ایک ستارے (*) کی</strong> طرف سے نوٹ کیا جاتا ہے.
zh_cn: 请提供以下信息以登录您的{platform_name}帐户。必填字段以<strong class="indicator">粗体文本和星号（*）标注</strong> 。

source: Asset file. It could be an image or css file.
ar: ملف الأصول. يمكن أن يكون صورة أو ملف CSS.
ur: اثاثہ فائل. یہ ایک تصویر یا سی ایس ایس فائل ہوسکتی ہے.
zh_cn: 资产文件。它可能是一个图像或CSS文件。

source: FAQ
ar: التعليمات
ur: عمومی سوالات
zh_cn: 常问问题

source: Please go to the following page and choose a new password:
ar: يرجى الانتقال إلى الصفحة التالية واختيار كلمة مرور جديدة:
ur: براہ کرم درج ذیل صفحہ پر جائیں اور ایک نیا پاس ورڈ منتخب کریں:
zh_cn: 请转到以下页面并选择一个新密码：

source: user "{user}" in row# {row}
ar: المستخدم &quot;{user}&quot; في الصف # {row}
ur: صارف &quot;{صارف}&quot; قطار میں # {قطار}
zh_cn: 行＃{row}中的用户“{user}”

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
ar: أدخل تخطيط دفتر التقديرات عن بعد. استخدم هذا الإعداد فقط عند تحديد REMOTE_GRADEBOOK_URL.
ur: دور دراز گریڈ بک نقشہ کاری درج کریں. REMOTE_GRADEBOOK_URL کو مقرر کیا گیا ہے صرف اس ترتیب کا استعمال کریں.
zh_cn: 输入远程成绩簿映射。只有在指定REMOTE_GRADEBOOK_URL时才使用此设置。

source: It is recommended that you change your password.
ar: يوصى بتغيير كلمة المرور الخاصة بك.
ur: یہ سفارش کی جاتی ہے کہ آپ اپنا پاس ورڈ تبدیل کریں.
zh_cn: 建议您更改密码。

source: {currency_symbol}{price}
ar: {CURRENCY_SYMBOL} {سعر}
ur: {currency_symbol} {قیمت}
zh_cn: {CURRENCY_SYMBOL} {}价格

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
ar: تلقى {provider_name} طلب الائتمان الخاص بالدورة التدريبية الخاصة بك. سنقوم بتحديثك عند اكتمال معالجة الائتمان.
ur: {provider_name} نے آپ کا کورس کریڈٹ کی درخواست حاصل کی ہے. کریڈٹ پراسیسنگ مکمل ہونے پر ہم آپ کو اپ ڈیٹ کریں گے.
zh_cn: {provider_name}已收到您的课程学分请求。我们将在信用处理完成时更新您的信息。

source: Student Support: Enrollment
ar: دعم الطلاب: التسجيل
ur: طالب علم کی حمایت: اندراج
zh_cn: 学生支持：注册

source: Generate Registration Code Modal
ar: توليد رمز التسجيل مشروط
ur: رجسٹریشن کوڈ موڈل بنائیں
zh_cn: 生成注册码模态

source: This course does not have any updates.
ar: هذه الدورة ليس لديها أي تحديثات.
ur: اس کورس میں کوئی اپ ڈیٹ نہیں ہے.
zh_cn: 本课程没有任何更新。

source: close modal
ar: إغلاق الوسائط
ur: قریبی موڈل
zh_cn: 关闭模式

source: Sign Up for {studio_name} Today!
ar: اشترك في {studio_name} اليوم!
ur: {سٹوڈیو_ نام} آج کے لئے سائن اپ کریں!
zh_cn: 立即注册{studio_name}！

source: View Courses
ar: عرض الدورات
ur: کورسز دیکھیں
zh_cn: 查看课程

source: Tips
ar: نصائح
ur: تجاویز
zh_cn: 提示

source: An error has occurred.
ar: حدث خطأ.
ur: ایک خرابی آگئی ہے.
zh_cn: 发生了错误。

source: Donation for {course}
ar: التبرع لـ {course}
ur: {کورس} کے لئے عطیہ
zh_cn: 为{课程}捐款

source: {course_number} {course_title} Cover Image
ar: {course_number} {course_title} صورة الغلاف
ur: {کورس_ نمبر} {کورس_ٹitle} کور کی تصویر
zh_cn: {course_number} {course_title}封面图片

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
ar: موظفو المكتبة هم المؤلفون المشاركون في المحتوى. لديهم امتيازات تحرير كاملة على محتويات المكتبة.
ur: لائبریری اسٹاف مواد شریک مصنفین ہیں. انہوں نے ایک لائبریری کے مواد پر مکمل تدوین کا استقبال کیا ہے.
zh_cn: 图书馆工作人员是内容共同作者。他们对库的内容拥有完全的编辑权限。

source: Account frozen. Possible action: retry with another form of payment.
ar: حساب مجمدة. الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: اکاؤنٹ منجمد ہے. ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 帐户被冻结。可能的行动：以另一种形式的付款重试。

source: This is a test warning
ar: هذا هو اختبار اختبار
ur: یہ ایک ٹیسٹ انتباہ ہے
zh_cn: 这是一个测试警告

source: Setting release dates and grading policies
ar: تحديد تواريخ الافراج وسياسات التقدير
ur: رہائی کی تاریخوں اور گریڈنگ پالیسیوں کی ترتیب
zh_cn: 设置发布日期和评分政策

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
ar: لتسجيل قائمة المستخدمين في هذه الدورة التدريبية وتسجيلها ، اختر ملف CSV يحتوي على الأعمدة التالية بالترتيب نفسه: البريد الإلكتروني واسم المستخدم والاسم والبلد. الرجاء تضمين طالب واحد لكل صف ولا تتضمن أي رؤوس أو تذييلات أو خطوط فارغة.
ur: اس کورس میں صارفین کی فہرست رجسٹر کرنے اور اندراج کرنے کے لئے، ایک CSV فائل کا انتخاب کریں جس میں مندرجہ ذیل کالم اس عین مطابق حکم میں شامل ہیں: ای میل، صارف نام، نام، اور ملک. براہ کرم ایک قطع نظر فی طالب علم شامل کریں اور کسی ہیڈر، فوٹر، یا خالی لائنوں میں شامل نہ کریں.
zh_cn: 要注册和注册本课程中的用户列表，请选择一个CSV文件，其中包含以下列的顺序：电子邮件，用户名，姓名和国家/地区。请每行包括一名学生，不要包含任何页眉，页脚或空白行。

source: Problem must be answered before it can be graded again.
ar: يجب الإجابة على المشكلة قبل أن يتم تقييمها مرة أخرى.
ur: اس سے قبل اس کی درجہ بندی کی جا سکتی ہے اس سے پہلے اس مسئلے کو جواب دینا ضروری ہے.
zh_cn: 必须先回答问题，然后再进行分级。

source: This enrollment code ({enrollment_code}) is not valid.
ar: رمز التسجيل هذا ({enrollment_code}) غير صالح.
ur: اس اندراج کوڈ ({اندراج_code}) درست نہیں ہے.
zh_cn: 此注册码（{enrollment_code}）无效。

source: Reset due date for student
ar: إعادة تعيين تاريخ الاستحقاق للطالب
ur: طالب علم کے لئے مقررہ تاریخ دوبارہ کریں
zh_cn: 重置学生的截止日期

source: Previous page
ar: الصفحة السابقة
ur: سابقہ ​​صفحہ
zh_cn: 上一页

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
ar: نحن بصدد إنشاء شهادتك. يمكنك الاستمرار في العمل في دوراتك وسيظهر رابط لها هنا وعلى لوحة التحكم الخاصة بك عندما تكون جاهزة.
ur: ہم آپ کا سرٹیفکیٹ بن رہے ہیں. آپ اپنے کورسوں میں کام کر سکتے ہیں اور اس کے لئے ایک لنک یہاں اور آپ کے ڈیش بورڈ پر جب یہ تیار ہو جائے گا وہاں دکھایا جائے گا.
zh_cn: 我们正在创建您的证书。你可以继续在你的课程中工作，并且一旦它准备就绪，它的链接将出现在这里和仪表板上。

source: Displayed as subtitle on the course details page. Limit to 150 characters.
ar: يتم عرضها كعنوان فرعي في صفحة تفاصيل الدورة التدريبية. الحد الى 150 حرفا.
ur: کورس کے تفصیلات کے صفحے پر ذیلی عنوان کے طور پر ڈسپلے. 150 حروف تک محدود
zh_cn: 在课程详细信息页面显示为字幕。限制为150个字符。

source: Learning to Grade
ar: تعلم الصف
ur: گریڈ سیکھنا
zh_cn: 学会分级

source: Last Editor
ar: محرر آخر
ur: آخری ایڈیٹر
zh_cn: 上次编辑

source: Time format two digit hours colon two digit minutes
ar: تنسيق الوقت من رقمين ساعات القولون رقمين من الدقائق
ur: ٹائم فارمیٹ دو پوائنٹس کے حساب سے دو پوائنٹس منٹ
zh_cn: 时间格式两位数小时冒号两位数分钟

source: Subject:
ar: موضوع:
ur: مضمون:
zh_cn: 学科：

source: Unsafe tar file. Aborting import.
ar: ملف tar غير آمن. إحباط الاستيراد.
ur: غیر محفوظ ٹار فائل. درآمد درآمد
zh_cn: 不安全的tar文件。中止导入。

source: course_id must be provided
ar: يجب توفير course_id
ur: کورس_ڈ کو فراہم کرنا لازمی ہے
zh_cn: course_id必须提供

source: Total Cost
ar: التكلفة الإجمالية
ur: کل لاگت
zh_cn: 总成本

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
ar: قم بتحرير اسم ملف صورة الشعارات. يمكنك ضبط صورة البانر على صفحة الإعدادات والتفاصيل.
ur: بینر کی تصویر فائل کے نام میں ترمیم کریں. آپ بینر کی تصویر ترتیبات اور تفصیلات کے صفحے پر مقرر کرسکتے ہیں.
zh_cn: 编辑横幅图像文件的名称。您可以在设置和详细信息页面上设置横幅图像。

source: Provide useful information about your course
ar: تقديم معلومات مفيدة حول دورتك
ur: اپنے کورس کے بارے میں مفید معلومات فراہم کریں
zh_cn: 提供有关您课程的有用信息

source: Module does not exist.
ar: الوحدة غير موجودة.
ur: ماڈیول موجود نہیں ہے.
zh_cn: 模块不存在。

source: Follow {platform_name} on Twitter
ar: اتبع {platform_name} على Twitter
ur: ٹویٹر پر {platform_name} کو فالو کریں
zh_cn: 关注Twitter上的{platform_name}

source: Invalid usage_id: {usage_id}.
ar: Invalid_id غير صالح: {usage_id}.
ur: غلط استعمال_ڈ: {use_id}.
zh_cn: 无效的usage_id：{usage_id}。

source: Upgrade Your Enrollment For {course_name}.
ar: قم بترقية التسجيل الخاص بك للحصول على {course_name}.
ur: {course_name} کے لئے اپنے اندراج کو اپ گریڈ کریں.
zh_cn: 升级您的注册{course_name}。

source: Back to dashboard
ar: العودة إلى لوحة القيادة
ur: واپس ڈیش بورڈ پر
zh_cn: 返回仪表板

source: You can unenroll in the course and receive a full refund for 14 days after the course start date.
ar: يمكنك إلغاء التسجيل في الدورة التدريبية واسترداد الأموال بالكامل لمدة 14 يومًا بعد تاريخ بدء الدورة التدريبية.
ur: آپ اس کورس میں نالہال کرسکتے ہیں اور کورس کے آغاز کی تاریخ کے بعد 14 دن کے لئے ایک مکمل واپسی حاصل کرسکتے ہیں.
zh_cn: 您可以取消注册课程并在课程开始日期后的14天内获得全额退款。

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
ar: يمكنك إعادة استخدام الملفات من المقالات الأخرى. تخضع هذه الملفات للتحديثات في المقالات الأخرى التي قد تكون أو لا تكون شيئًا جيدًا.
ur: آپ دیگر مضامین سے فائلوں کو دوبارہ استعمال کرسکتے ہیں. یہ فائل دیگر مضامین پر اپ ڈیٹس کے تابع ہیں جو شاید اچھی بات نہیں ہوسکتی.
zh_cn: 您可以重复使用其他文章中的文件。这些文件受到其他文章的更新，这些文章可能会或可能不会是一件好事。

source: Dictionary with the correctness of current student answers
ar: القاموس مع صحة إجابات الطالب الحالية
ur: موجودہ طالب علم کے جوابات کی درستی کے ساتھ لغت
zh_cn: 字典与当前学生答案的正确性

source: Upgrade now at
ar: الترقية الآن في
ur: اب اپ گریڈ کریں
zh_cn: 现在升级

source: Amount of Refund
ar: مبلغ الاسترداد
ur: رقم کی واپسی کی رقم
zh_cn: 退款金额

source: View Profile
ar: عرض الصفحة الشخصية
ur: پروفائل کا مشاھدہ کریں
zh_cn: 查看资料

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
ar: قم بمراجعة هذه الدورة مجانًا والحصول على إمكانية الوصول الكامل إلى جميع مواد الدورة التدريبية والأنشطة والاختبارات والمنتديات.
ur: آڈٹ اس کورس کو مفت کے لئے اور تمام کورس کے مواد، سرگرمیوں، ٹیسٹ اور فورموں تک مکمل رسائی حاصل ہے.
zh_cn: 免费审核本课程，并可完全访问所有课程材料，活动，测试和论坛。

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you try to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than the {platform_name} website at {platform_url}.
ar: أنت توافق على استخدام واجهات برمجة التطبيقات فقط لغرض تقديم المحتوى الذي يتم الوصول إليه من خلال واجهات برمجة التطبيقات (&quot;محتوى واجهة برمجة التطبيقات&quot;) إلى موقعك على الويب أو موقع جوالك أو تطبيقك أو مدونتك أو قائمة توزيع البريد الإلكتروني أو خاصية الشبكات الاجتماعية أو لأغراض تجارية أخرى استخدامك الذي وصفته في طلبك للوصول إليه وتمت الموافقة على {platform_name} على أساس كل حالة على حدة. قد يراقب {platform_name} استخدامك لواجهة برمجة التطبيقات (APIs) للامتثال للبنود ويجوز رفض وصولك أو إغلاق تكاملك إذا حاولت التنقل أو تجاوزت المتطلبات والقيود التي حددتها {platform_name}. يجب ألا يدفع تطبيقك أو الاستخدام المعتمد الآخر لواجهة برمجة التطبيقات أو محتوى واجهة برمجة التطبيقات المستخدمين النهائيين إلى تقديم اسم المستخدم أو كلمة المرور أو بيانات أخرى لـ {platform_name} للمستخدم في أي مكان آخر بخلاف موقع الويب {platform_name} على {platform_url}.
ur: آپ API کے ذریعہ صرف ان مواد کو فراہم کرنے کے لئے API سے استعمال کرنے پر اتفاق کرتے ہیں جو APIs (&quot;API Content&quot;) کے ذریعہ آپ کی اپنی ویب سائٹ، موبائل سائٹ، اے پی پی، بلاگ، ای میل کی تقسیم کی فہرست، یا سوشل میڈیا کی جائیداد کے لئے یا کسی اور تجارتی سے آپ کے پاس رسائی کے لئے آپ کی درخواست میں بیان کیا گیا ہے اور {platform_name} نے مقدمہ کی بنیاد پر بنیاد پر منظور کیا ہے. {platform_name} شرائط کے مطابق تعمیل کے لئے APIs کے استعمال کا نگرانی کرسکتے ہیں اور آپ کو {platform_name} کی طرف سے مقرر کردہ ضروریات اور حدود کے ارد گرد جانے یا اس سے زیادہ کرنے کی کوشش کرتے ہیں تو آپ کو ان کی انضمام کا ردعمل یا بند کر دیا جا سکتا ہے. آپ کی درخواست یا API یا API مواد کے دوسرے منظور شدہ استعمال کو آپ کے اختتامی صارفین کو {platform_name} صارف {platform_name} ویب سائٹ پر {platform_name} کی ویب سائٹ کے علاوہ کہیں بھی اپنے {platform_name} صارف نام، پاسورڈ یا دیگر {platform_name} صارف کی اسناد فراہم نہیں کرنا چاہئے.
zh_cn: 您同意仅将API用于将通过API访问的内容（“API内容”）传送到您自己的网站，移动网站，应用程序，博客，电子邮件分发列表或社交媒体媒体资源或其他商业广告使用您在访问请求中描述的内容，并且{platform_name}已根据具体情况批准。 {platform_name}可能会监控您对API使用是否符合条款，并可能会拒绝您的访问或关闭您的集成，如果您试图绕过或超过{platform_name}设置的要求和限制。您的应用程序或其他批准的API或API内容使用不得提示最终用户在{platform_url}的{platform_name}网站以外的任何地方提供{platform_name}用户名，密码或其他{platform_name}用户凭据。

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
ar: يتم إدراج الصفحات أفقيًا في الجزء العلوي من الدورة التدريبية الخاصة بك. الصفحات الافتراضية (الصفحة الرئيسية ، الدورة التدريبية ، المناقشة ، ويكي ، والتقدم) تتبعها الكتب المدرسية والصفحات المخصصة التي تقوم بإنشائها.
ur: صفحات آپ کے کورس کے اوپر افقی طور پر درج کی جاتی ہیں. پہلے سے طے شدہ صفحات (ہوم، کورس، بحث، وکیپیڈیا اور ترقی) اس کے بعد درکار کتابیں اور اپنی مرضی کے مطابق صفحات ہیں جنہیں آپ تخلیق کرتے ہیں.
zh_cn: 页面在课程顶部水平列出。默认页面（主页，课程，讨论，Wiki和进度）后面跟着您创建的教科书和自定义页面。

source: This link will open/download a PDF document of your verified {cert_name_long}.
ar: سيفتح هذا الرابط / ينزِّل مستندًا بتنسيق PDF من إثبات هويتك {cert_name_long}.
ur: یہ لنک آپ کے تصدیق {cert_name_long} کے پی ڈی ایف دستاویز کو کھول / ڈاؤن لوڈ کریں گے.
zh_cn: 此链接将打开/下载已验证的{cert_name_long}的PDF文档。

source: Multiple Choice
ar: متعدد الخيارات
ur: کثیر الانتخاب
zh_cn: 多项选择

source: Dear Student,
ar: عزيزي الطالب،
ur: عزیز طالب علم،
zh_cn: 亲爱的学生，

source: The request was received, but there was a timeout at the payment processor.
ar: تم استلام الطلب ، ولكن كان هناك مهلة في معالج الدفع.
ur: درخواست موصول ہوئی تھی، لیکن ادائیگی کے پروسیسر میں ایک ٹائم آؤٹ تھا.
zh_cn: 该请求已收到，但付款处理器发生超时。

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
ar: يحدد متى يتم توضيح ما إذا كان إجابة المتعلم للمشكلة صحيحة. تكوين على القسم الفرعي.
ur: جب اس بات کو ظاہر کرنے کی وضاحت کرتا ہے کہ مسئلہ کے سیکھنے کا جواب درست ہے یا نہیں. سبسکرائب پر ترتیب.
zh_cn: 定义何时显示学习者对问题的回答是否正确。在子部分配置。

source: A file was deleted: %s
ar: تم حذف الملف:٪ s
ur: ایک فائل حذف کردی گئی:٪ s
zh_cn: 文件被删除：％s

source: Your exported library can now be downloaded
ar: يمكن الآن تنزيل المكتبة المصدرة الخاصة بك
ur: آپ کی برآمد کردہ لائبریری اب ڈاؤن لوڈ کی جا سکتی ہے
zh_cn: 您的导出库现在可以下载

source: Need help in registering with {platform_name}?
ar: هل تحتاج إلى المساعدة في التسجيل مع {platform_name}؟
ur: {platform_name} کے ساتھ رجسٹریشن میں مدد کی ضرورت ہے؟
zh_cn: 需要帮助注册{platform_name}？
