Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Try using a different browser, such as Google Chrome.
ur: ایک مختلف براؤزر کا استعمال کرتے ہوئے کوشش کریں، جیسے Google Chrome.

source: {seconds} {unit}
ur: {سیکنڈ} {یونٹ}

source: Earned Certificates
ur: مستند سرٹیفکیٹس

source: Paste as text
ur: متن کے طور پر چسپاں کریں

source: An error occurred. Please reload the page.
ur: ایک خرابی آگئی. براہ کرم صفحہ دوبارہ لوڈ کریں.

source: Show transcripts ({transcriptCount})
ur: ٹرانپٹپٹ دکھائیں ({transcriptCount})

source: Current enrollment mode:
ur: موجودہ اندراج موڈ:

source: Student email or username
ur: طالب علم کا ای میل یا صارف نام

source: Successfully unlinked.
ur: کامیابی سے غیر منقطع

source: Error sending email.
ur: ای میل بھیجنے میں خرابی

source: Before you upgrade to a certificate track, you must activate your account.
ur: ایک سرٹیفکیٹ ٹریک اپ گریڈ کرنے سے پہلے، آپ کو اپنا اکاؤنٹ چالو کرنا ضروری ہے.

source: Photo of %(fullName)s's ID
ur: تصویر کا٪ (FullName) کی شناخت

source: Warnings
ur: انتباہات

source: Show blocks
ur: بلاکس دکھائیں

source: {numPreassigned} learner was pre-assigned for this cohort. This learner will automatically be added to the cohort when they enroll in the course.
ur: {ناممکن} سیکھنے اس کوہٹ کے لئے پہلے سے مقرر کیا گیا تھا. جب اس کورس میں داخل ہوجاتا ہے تو یہ سیکھنے خود کوہور میں شامل کیا جائے گا.

source: You did not select a content group
ur: آپ نے مواد گروپ کا انتخاب نہیں کیا

source: dropped in slider
ur: سلائیڈر میں گر گیا

source: The topic "{topic}" could not be found.
ur: موضوع &quot;{موضوع}&quot; نہیں مل سکا.

source: Error changing user's permissions.
ur: صارف کی اجازتوں کو تبدیل کرنے میں خرابی.

source: Press change to change selected transcript provider.
ur: منتخب شدہ ٹرانسکرٹر فراہم کرنے میں تبدیلی کیلئے تبدیلی دبائیں.

source: Deleted Content Group
ur: حذف کردہ مواد گروپ

source: a day
ur: ایک دن

source: Heading (Ctrl+H)
ur: سرخی (Ctrl + H)

source: The weight of all assignments of this type as a percentage of the total grade, for example, 40. Do not include the percent symbol.
ur: اس قسم کے تمام کاموں کا وزن کل گریڈ کے فی صد کے طور پر، مثال کے طور پر، 40. فیصد علامت شامل نہ کریں.

source: Overall Score
ur: مجموعی اسکور

source: Successfully rescored problem for user {user}
ur: صارف {صارف} کیلئے کامیابی سے کامیابی سے بچایا

source: This post could not be reopened. Refresh the page and try again.
ur: یہ پوسٹ دوبارہ نہیں کیا جا سکتا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Drag to reorder
ur: دوبارہ ترتیب دینے کے لئے ڈریگ کریں

source: Automatic
ur: خود کار طریقے سے

source: Are you sure you want to remove this video from the list?
ur: کیا آپ واقعی یہ ویڈیو فہرست سے ہٹانا چاہتے ہیں؟

source: An error occurred. Try again.
ur: ایک خرابی آگئی. دوبارہ کوشش کریں.

source: {screen_reader_start}Warning:{screen_reader_end} No content groups exist.
ur: {screen_reader_start} انتباہ: {screen_reader_end} کوئی مواد گروپ موجود نہیں ہیں.

source: The name that identifies you on {platform_name}. You cannot change your username.
ur: جو نام آپ {platform_name} پر شناخت کرتا ہے. آپ اپنا صارف نام تبدیل نہیں کرسکتے.

source: <%= user %> has been successfully added to the exception list. Click Generate Exception Certificate below to send the certificate.
ur: &lt;٪ = صارف٪&gt; کامیابی سے استثنائی فہرست میں شامل کردی گئی ہے. سرٹیفکیٹ بھیجنے کے لئے ذیل میں استثنی سرٹیفکیٹ پر کلک کریں.

source: Upload instructor image.
ur: انسٹریکٹر تصویر اپ لوڈ کریں.

source: Team Description (Required) *
ur: ٹیم کی تفصیل (ضروری) *

source: New Address
ur: نیا پتہ

source: Delete “<%= name %>”?
ur: حذف کریں &lt;&lt;٪ = name٪&gt; &quot;؟

source: Paste your embed code below:
ur: ذیل میں اپنے ای میل کو پیسٹ کریں

source: Upload failed for video {fileName}
ur: ویڈیو {fileName} کیلئے اپ لوڈ ناکام ہوگئی

source: You will be refunded the amount you paid.
ur: آپ کو رقم کی ادائیگی کی رقم واپس کی جائے گی.

source: %(num_points)s point possible (ungraded, results hidden)
ur: ٪ (num_points) کے نقطہ ممکن (ناقابل یقین، نتائج چھپے ہوئے)

source: %(num_points)s point possible (ungraded)
ur: ٪ (num_points) کے نقطہ ممکن (ناراض)

source: Last activity %(date)s
ur: آخری سرگرمی٪ (تاریخ) s

source: Name of the certificate
ur: سرٹیفیکیشن کا نام

source: Duplicating
ur: ڈپلیکیٹنگ

source: second
ur: دوسرا

source: Version
ur: ورژن

source: Your face is well-lit.
ur: تمہارا چہرہ اچھی طرح سے روشن ہے.

source: What's Your Next Accomplishment?
ur: آپ کی اگلی سازش کیا ہے؟

source: Session Selection Dropdown for {courseName}
ur: {کورس نام} کیلئے سیشن کا انتخاب ڈراپ ڈاؤن

source: Your changes will not take effect until you save your progress. Take care with key and value formatting, as validation is not implemented.
ur: جب تک آپ اپنی ترقی کو بچانے کے لۓ آپ کی تبدیلیوں کو اثر انداز نہیں ہوگا. کلید اور قیمت فارمیٹنگ کا خیال رکھنا، جیسا کہ توثیق نافذ نہیں ہوئی ہے.

source: Live view of webcam
ur: ویب کیم کے لائیو منظر

source: Load next {numResponses} responses
ur: اگلے {numResponses} جوابات لوڈ کریں

source: The course end date must be later than the course start date.
ur: کورس کے اختتام تاریخ کورس کے آغاز کی تاریخ کے بعد بعد میں ہونا ضروری ہے.

source: Are you sure you want to delete this post?
ur: کیا آپ واقعی یہ پوسٹ حذف کرنا چاہتے ہیں؟

source: Create a New Team
ur: نئی ٹیم بنائیں

source: Invalidate Certificate
ur: غلط سرٹیفکیٹ

source: There's already another assignment type with this name.
ur: اس نام سے پہلے ہی ایک ہی تفویض کی قسم ہے.

source: %(team_count)s Team
ur: ٪ (team_count) کی ٹیم

source: Uploading
ur: اپ لوڈ کرنا

source: marked as answer %(time_ago)s
ur: جواب٪ (time_ago) کے طور پر نشان لگا دیا گیا ہے

source: Course Number Override
ur: کورس کی تعداد پر قابو پانے

source: Select a chapter
ur: ایک باب کا انتخاب کریں

source: {display_name} Settings
ur: {display_name} ترتیبات

source: Nonbreaking space
ur: غیر برداشت جگہ

source: Bookmarked on
ur: بک مارک پر

source: There must be one cohort to which students can automatically be assigned.
ur: وہاں ایک کوور ہونا لازمی ہے جس سے طالب علم خود کار طریقے سے تفویض کر سکیں.

source: Your export has failed.
ur: آپ کی برآمد ناکام ہوگئی ہے.

source: An unexpected error occurred. Please try again.
ur: ایک غیر متوقع غلطی ہوئی. دوبارہ کوشش کریں.

source: Change Enrollment
ur: اندراج تبدیل کریں

source: About me
ur: میرے بارے میں

source: Your changes have been saved.
ur: آپ کی تبدیلیاں محفوظ ہوگئی ہیں.

source: Unlink This Account
ur: اس اکاؤنٹ کو غیر فعال کریں

source: Certificate Purchased
ur: سرٹیفکیٹ خریدا

source: Group
ur: گروپ

source: Certificate Signatories
ur: سرٹیفکیٹ دستخط

source: Deactivate
ur: غیر فعال

source: Basic
ur: بنیادی

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s account does not have a linked %(platformName)s account. To link your accounts, sign in now using your %(platformName)s password.
ur: آپ کامیابی سے٪ (currentProvider) میں دستخط کر چکے ہیں، لیکن آپ کا٪ (currentProvider) کے اکاؤنٹ میں منسلک٪ (پلیٹ فارم نام) کا اکاؤنٹ نہیں ہے. اپنے اکاؤنٹس کو لنک کرنے کے لئے، اب آپ٪ (پلیٹ فارم نام) کے پاس ورڈ کا استعمال کرتے ہوئے سائن ان کریں.

source: unit
ur: یونٹ

source: A name that identifies your team (maximum 255 characters).
ur: ایک نام جو آپ کی ٹیم کی شناخت کرتا ہے (زیادہ سے زیادہ 255 حروف).

source: Successfully started task to rescore problem '<%- problem_id %>' for all students. Click the 'Show Task Status' button to see the status of the task.
ur: تمام طالب علموں کے لئے &#39;٪٪ - problem_id٪&gt;&#39; کا مسئلہ دوبارہ شروع کرنے کیلئے کام شروع کر دیا. کام کی حیثیت کو دیکھنے کے لئے &#39;ٹاسک اسٹیٹ دکھائیں&#39; کے بٹن پر کلک کریں.

source: Configure
ur: ترتیب دیں

source: %(earned)s/%(possible)s point (ungraded)
ur: ٪ (کمائی) s /٪ (ممکنہ) کے نقطہ (ناراض)

source: Reported
ur: اطلاع دی

source: Video duration is {humanizeDuration}
ur: ویڈیو کی مدت {انسانیت کی تقسیم} ہے

source: Error adding user
ur: صارف کو شامل کرنے میں خرابی

source: Last published {lastPublishedStart}{publishedOn}{lastPublishedEnd} by {publishedByStart}{publishedBy}{publishedByEnd}
ur: آخری اشاعت {آخری اشاعت شدہ آغاز} {publishedOn} {lastPublishedEnd} کی طرف سے {شائع شدہ اسٹائلٹ}} شائع شدہ {شائع شدہ}} شائع ہوا.

source: Save changes
ur: تبدیلیاں محفوظ کرو

source: {minutes} {unit}
ur: {منٹ} {یونٹ}

source: All users on the Exception list
ur: استقبال کی فہرست پر تمام صارفین

source: Exam Type
ur: امتحان کی قسم

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
ur: ایک کوما علیحدہ اقدار (.csv) فائل میں اپ لوڈ کریں جو سیکھنے والوں کے صارف نام یا ای میل ایڈریس پر مشتمل ہے جو استثنی دے دی گئی ہیں. پہلے کوما علیحدہ فیلڈ میں اسم رکنیت یا ای میل پتہ شامل کریں. آپ کو ایک کمانڈ علیحدہ فیلڈ میں استثنا کی وجہ سے بیان کی ایک اختیاری نوٹ شامل ہوسکتا ہے.

source: You submitted {filename}; only {allowedFiles} are allowed.
ur: آپ نے {فائل نام} پیش کیا؛ صرف {اجازت فولائل} کی اجازت ہے.

source: Remove this video
ur: اس ویڈیو کو ہٹا دیں

source: Enable Cohorts
ur: کوورٹس کو فعال کریں

source: Yes, replace the edX transcript with the YouTube transcript
ur: جی ہاں، YouTube ٹرانسپٹ کے ساتھ EDX ٹرانسمیشن کو تبدیل کریں

source: Failed to delete student state for user.
ur: صارف کیلئے طالب علم کی حیثیت کو خارج کرنے میں ناکام

source: Create a %(link_start)sMozilla Backpack%(link_end)s account, or log in to your existing account
ur: اپنے اکاؤنٹ میں ایک٪ (link_start) sozozilla backpack٪ (link_end) کے اکاؤنٹ بنائیں، یا لاگ ان کریں

source: Account Not Activated
ur: اکاؤنٹ چالو نہیں

source: Upgrade Deadline
ur: آخری تاریخ کو اپ گریڈ کریں

source: Text
ur: متن

source: Remove subsection %(subsectionDisplayName)s
ur: سبسکرائب٪ (سبسکرائب ڈسپلے نام) کو ہٹا دیں

source: Header
ur: ہیڈر

source: Upload File and Assign Students
ur: فائل کو اپ لوڈ کریں اور طلباء کو تفویض کریں

source: Update response
ur: اپ ڈیٹ جواب دیں

source: In Progress
ur: کام جاری ہے

source: Error: Replacing failed.
ur: خرابی: ناکام ہوگیا.

source: Your email message was successfully queued for sending. In courses with a large number of learners, email messages to learners might take up to an hour to be sent.
ur: آپ کے ای میل پیغام کو بھیجنے کے لئے کامیابی سے قطار ہے. سیکھنے والوں کی بڑی تعداد کے ساتھ کورسز، سیکھنے والوں کو ای میل پیغامات بھیجنے کے لئے ایک گھنٹے تک لگ سکتا ہے.

source: Password reset email sent. Follow the link in the email to change your password.
ur: پاس ورڈ دوبارہ ترتیب ای میل بھیج دیا اپنا پاس ورڈ تبدیل کرنے کے لئے ای میل میں لنک پر عمل کریں.

source: Default Timed Transcript
ur: پہلے سے طے شدہ ٹرانسمیشن

source: The language that team members primarily use to communicate with each other.
ur: اس زبان کی ٹیم جس میں بنیادی طور پر ایک دوسرے کے ساتھ بات چیت کرنے کے لئے استعمال کرتا ہے.

source: An email has been sent to {userEmail} with a link for you to activate your account.
ur: {ای میل ای میل} کو ایک ای میل بھیج دیا گیا ہے جو آپ کے اکاؤنٹ کو چالو کرنے کیلئے آپ کے لئے ایک لنک ہے.

source: Add
ur: شامل کریں

source: This response could not be marked as an answer. Refresh the page and try again.
ur: یہ جواب جواب کے طور پر نشان لگا دیا جا سکتا ہے. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Photo ID
ur: تصویر کی شناخت

source: Format
ur: شکل

source: Lower Greek
ur: لوئر یونانی

source: username or email
ur: اسم رکنیت یا ای میل

source: Enable Now
ur: اب فعال کریں

source: Insert/edit video
ur: ویڈیو داخل کریں / ترمیم کریں

source: answer
ur: جواب دیں

source: Cut row
ur: قطار کٹ

source: [no tags]
ur: [کوئی ٹیگ]

source: Take Photo
ur: تصویر لو

source: Saving your email preference
ur: آپ کے ای میل کی ترجیحات محفوظ کرنا

source: Task Progress
ur: ٹاسک ترقی

source: Select a group type
ur: ایک گروپ کی قسم منتخب کریں

source: We weren't able to send you a password reset email.
ur: ہم آپ کو پاسورڈ ری سیٹ ای میل بھیجنے کے قابل نہیں تھے.

source: Upload failed
ur: اپ لوڈناکام

source: Allow others to copy, distribute, display and perform your copyrighted work but only if they give credit the way you request. Currently, this option is required.
ur: دوسروں کو اپنے کاپی رائٹ شدہ کام کاپی کرنے، تقسیم، ڈسپلے کرنے اور انجام دینے کی اجازت دیتے ہیں لیکن صرف اگر وہ کریڈٹ کے راستے سے آپ کی درخواست کرتے ہیں. فی الحال، یہ اختیار کی ضرورت ہے.

source: Unpublished changes to content that will release in the future
ur: مستقبل میں رہائی والے مواد میں غیر شائع شدہ تبدیلییں

source: Are you sure you want to unenroll from the verified %(certNameLong)s track of %(courseName)s (%(courseNumber)s)?
ur: کیا آپ واقعی٪ (courseName) s (٪ (کورس نمبر) کی تصدیق شدہ٪ (certNameLong) کے ٹریک سے انعقاد کرنا چاہتے ہیں؟

source: File Name
ur: فائل کا نام

source: learners do not exist in LMS and not added to the exception list
ur: سیکھنے والے LMS میں موجود نہیں ہیں اور استثنی کی فہرست میں شامل نہیں ہیں

source: Send push notification to mobile apps
ur: موبائل اطلاقات پر پش نوٹیفیکیشن بھیجیں

source: Find discussions
ur: بات چیت کریں

source: This post could not be closed. Refresh the page and try again.
ur: یہ پوسٹ بند نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Delete student '<%- student_id %>'s state on problem '<%- problem_id %>'?
ur: &lt;٪ - problem_id٪&gt; &#39;مسئلہ پر طالب علم&#39; &lt;٪ - student_id٪&gt; کی حیثیت کو حذف کریں؟

source: (Self-paced) Started {start}
ur: (خود پیڈ) شروع ہوا {آغاز}

source: Account Settings
ur: اکاؤنٹ کی ترتیبات

source: Assignment Type Name
ur: تفویض کی قسم کا نام

source: Unable to determine whether we should give you a refund because of System Error. Please try again later.
ur: اس بات کا تعین کرنے سے قاصر ہے کہ ہمیں سسٹم کی خرابی کی وجہ سے آپ کو رقم کی واپسی دینی چاہئے. براہ کرم کچھ دیر بعد کوشش کریں.

source: Number of Students
ur: طلباء کی تعداد

source: Short explanation
ur: مختصر وضاحت

source: View all errors
ur: تمام غلطیاں دیکھیں

source: To be sure all students can access the video, we recommend providing both an .mp4 and a .webm version of your video. Click below to add a URL for another version. These URLs cannot be YouTube URLs. The first listed video that's compatible with the student's computer will play.
ur: اس بات کا یقین کرنے کے لئے کہ تمام طالب علموں کو ویڈیو تک رسائی حاصل ہوسکتی ہے، ہم آپ کے ویڈیو کے ایک .mp4 اور ایک. ویب ورژن فراہم کرتے ہیں. ایک اور ورژن کیلئے یو آر ایل شامل کرنے کیلئے ذیل میں کلک کریں. یہ یو آر ایل YouTube یو آر ایل نہیں ہوسکتے ہیں. طالب علم کے کمپیوٹر کے ساتھ مطابقت رکھتا ہے جو پہلے درج کردہ ویڈیو کھیلے گی.

source: Please verify that your webcam is connected and that you have allowed your browser to access it.
ur: براہ کرم اس بات کی توثیق کریں کہ آپ کا ویب کیم منسلک ہے اور آپ نے اپنے براؤزر کو اس تک رسائی حاصل کرنے کی اجازت دی ہے.

source: Delete this team?
ur: اس ٹیم کو حذف کریں؟

source: Related to: %(courseware_title_linked)s
ur: سے متعلق:٪ (courseware_title_linked) s

source: Finish
ur: ختم

source: There was an error while importing the new course to our database.
ur: ہمارے ڈیٹا بیس میں نیا کورس درآمد کرتے وقت ایک خرابی تھی.

source: A highlight to look forward to this week.
ur: اس ہفتے کو دیکھنے کے لئے ایک خاصیت.

source: %(num_students)s student
ur: ٪ (num_students) کے طالب علم

source: Publishing Status
ur: اشاعت کی حیثیت

source: All Time Zones
ur: تمام وقت زون

source: Are you sure that you want to leave this session?
ur: کیا آپ واقعی یہ سیشن چھوڑنا چاہتے ہیں؟

source: Clear All
ur: تمام کو صاف کریں

source: This response could not be unendorsed. Refresh the page and try again.
ur: یہ ردعمل غیر منحصر نہیں ہوسکتا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Complete courses on your schedule to ensure you stand out in your field!
ur: آپ کے میدان میں کھڑے ہونے کے یقینی بنانے کے لئے اپنے شیڈول پر مکمل کورسز!

source: You can pay now even if you don't have the following items available, but you will need to have these to qualify to earn a Verified Certificate.
ur: آپ اب ادائیگی کر سکتے ہیں یہاں تک کہ اگر آپ کے پاس مندرجہ ذیل آئٹم موجود نہیں ہیں، لیکن آپ کو ان کو تصدیق شدہ سرٹیفکیٹ حاصل کرنے کے لۓ قابلیت حاصل کرنے کی ضرورت ہوگی.

source: The name that is used for ID verification and that appears on your certificates.
ur: اس کا نام ID کی توثیق کے لئے استعمال کیا جاتا ہے اور یہ آپ کے سرٹیفکیٹ پر ظاہر ہوتا ہے.

source: Error: Connection with server failed.
ur: خرابی: سرور کے ساتھ کنکشن ناکام ہوگیا.

source: If you do not yet have an account, use the button below to register.
ur: اگر آپ ابھی تک کوئی اکاؤنٹ نہیں ہے، تو رجسٹر کرنے کیلئے ذیل میں بٹن کا استعمال کریں.

source: %(comments_count)s %(span_sr_open)scomments (%(unread_comments_count)s unread comments)%(span_close)s
ur: ٪ (comment_count) s٪ (span_sr_open) scomments (٪ (unread_comments_count) کی بے ترتیب تبصرے)٪ (span_close) s

source: Submit Application
ur: درخواست جمع کرائیں

source: File {filename} exceeds maximum size of {maxFileSizeInMBs} MB
ur: فائل {فائل نام} {maxFileSizeInMBs} MB کے زیادہ سے زیادہ سائز سے زیادہ ہے

source: List item
ur: فہرست کی فہرست

source: Less
ur: کم

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email.
ur: کورسز میں داخل ہونے سے پہلے آپ کو اپنے اکاؤنٹ کو چالو کرنے کی ضرورت ہے. ایک فعال ای میل کے لئے اپنے ان باکس کو چیک کریں.

source: Please follow the instructions here to upload a file elsewhere and link to it: {maxFileSizeRedirectUrl}
ur: کسی دوسری جگہ کو اپ لوڈ کرنے اور اس سے منسلک کرنے کیلئے براہ کرم ہدایات پر عمل کریں: {maxFileSizeRedirectUrl}

source: Hide Discussion
ur: چھپائیں بحث

source: Group Configuration ID
ur: گروپ ترتیب کی شناخت

source: You can change sessions until {expiration_date}.
ur: آپ {expiration_date} تک سیشن تبدیل کرسکتے ہیں.

source: License Display
ur: لائسنس ڈسپلے

source: Code Sample (Ctrl+K)
ur: کوڈ نمونہ (Ctrl + K)

source: Upload New Transcript
ur: نیا ٹرانسپٹ اپ لوڈ کریں

source: Weight of Total Grade
ur: کل گریڈ کا وزن

source: Adding
ur: شامل کرنا

source: {currentCountOpeningTag}{currentCharacterCount}{currentCountClosingTag} of {maxCharacters}
ur: {currentCountOpeningTag} {currentCharacterCount} {currentCountClosingTag} کا {maxCharacters}

source: Path to Signature Image
ur: دستخط کی تصویر پر راہ

source: Start regenerating certificates for students in this course?
ur: اس کورس کے طالب علموں کے لئے سرٹیفیکیٹ دوبارہ شروع کرنا شروع کریں؟

source: There has been an error with your export.
ur: آپ کے برآمد کے ساتھ ایک غلطی ہوئی ہے.

source: Undo (Ctrl+Z)
ur: واپس کریں (Ctrl + Z)

source: Type
ur: ٹائپ کریں

source: learner is not enrolled in course and not added to the exception list
ur: سیکھنے کورس میں داخل نہیں کیا جاسکتا ہے اور استثنا کی فہرست میں شامل نہیں ہے

source: Username
ur: صارف کا نام

source: Hide Timer
ur: ٹائمر چھپائیں

source: Your message cannot be blank.
ur: آپ کا پیغام خالی نہیں ہوسکتا ہے.

source: Change Manually
ur: دستی طور پر تبدیل کریں

source: {filename} exceeds maximum size of {maxFileSizeInGB} GB.
ur: {فائل نام} {maxFileSizeInGB} GB کے زیادہ سے زیادہ سائز سے زیادہ ہے.

source: Numbered list
ur: شمار شدہ فہرست

source: Are you sure you want to unenroll from {courseName} ({courseNumber})? You will be refunded the amount you paid.
ur: کیا آپ واقعی {courseName} ({courseNumber}) سے غیر اندراج کرنا چاہتے ہیں؟ آپ کو رقم کی ادائیگی کی رقم واپس کی جائے گی.

source: Enter the username or email address of each learner that you want to add as an exception.
ur: ہر سیکھنے کا صارف نام یا ای میل پتہ داخل کریں جسے آپ کسی استثناء کے طور پر شامل کرنا چاہتے ہیں.

source: Additional responses could not be loaded. Refresh the page and try again.
ur: اضافی ردعمل لوڈ نہیں کی جا سکتی. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Choose File
ur: فائل منتخب کریں

source: provide the title/name of the text book as you would like your students to see it
ur: عنوان کتاب کا عنوان / نام فراہم کریں جیسا کہ آپ اپنے طالب علموں کو اسے دیکھنا چاہتے ہیں

source: Browse recently launched courses and see what\'s new in your favorite subjects
ur: حال ہی میں شروع شدہ کورس براؤز کریں اور دیکھیں کہ آپ کے پسندیدہ مضامین میں کیا نیا ہے

source: Insert table
ur: میز ڈالیں

source: Showing all responses
ur: تمام جوابات دکھائیں

source: Justify
ur: توثیق کریں

source: Choose one
ur: ایک کا انتخاب کریں

source: Add Component:
ur: اجزاء شامل کریں:

source: Headings
ur: عنوانات

source: Alignment
ur: سیدھ

source: Your file has been deleted.
ur: آپ کی فائل حذف کردی گئی ہے.

source: Cell
ur: سیل

source: Profile image for {username}
ur: {صارف نام} کیلئے پروفائل تصویر

source: Congratulations!
ur: مبارک ہو!

source: Commentary
ur: تفسیر

source: Your entire face fits inside the frame.
ur: آپ کا پورا چہرہ فریم کے اندر اندر فٹ بیٹھتا ہے.

source: Please enter an integer between %(min)s and %(max)s.
ur: براہ کرم٪ (منٹ) اور٪ (زیادہ سے زیادہ) کے درمیان ایک انٹری درج کریں.

source: Last Edited:
ur: آخری ترمیم:

source: Anchors
ur: لنگر

source: Already a library team member
ur: پہلے ہی ایک لائبریری ٹیم کے رکن

source: Adjust video speed
ur: ویڈیو کی رفتار کو ایڈجسٹ کریں

source: You did not select any files to submit.
ur: آپ جمع کرنے کے لئے کسی بھی فائلوں کا انتخاب نہیں کیا.

source: Are you sure you want to delete this response?
ur: کیا آپ واقعی یہ جواب حذف کرنا چاہتے ہیں؟

source: discussion
ur: بحث

source: Search
ur: تلاش کریں

source: Entrance exam attempts is being reset for student '{student_id}'.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ امتحان کی کوششوں کو دوبارہ ترتیب دیا جا رہا ہے.

source: See all teams in your course, organized by topic. Join a team to collaborate with other learners who are interested in the same topic as you are.
ur: آپ کے کورس میں تمام ٹیموں کو دیکھو، موضوع کی طرف سے منظم. دوسرے سیکھنے والوں کے ساتھ تعاون کرنے کے لئے ایک ٹیم میں شمولیت اختیار کریں جو آپ جیسے ہی موضوع میں دلچسپی رکھتے ہیں.

source: Zoom Out
ur: دور کرنا

source: This post could not be pinned. Refresh the page and try again.
ur: اس پوسٹ کو پن نہیں کیا جا سکتا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Links should be unique.
ur: روابط منفرد ہونا چاہئے.

source: A short description of the team to help other learners understand the goals or direction of the team (maximum 300 characters).
ur: دوسرے سیکھنے والوں کو ٹیم کے مقاصد یا سمت کو سمجھنے میں مدد کے لئے ٹیم کی مختصر وضاحت (زیادہ سے زیادہ 300 حروف).

source: This role requires a divided discussions scheme.
ur: یہ کردار تقسیم شدہ بات چیت کی منصوبہ بندی کی ضرورت ہے.

source: Some Rights Reserved
ur: کچھ حقوق محفوظ ہیں

source: Code
ur: کوڈ

source: Your team could not be created.
ur: آپ کی ٹیم پیدا نہیں کی جا سکتی.

source: Module state successfully deleted.
ur: ماڈیول ریاست کو کامیابی سے خارج کر دیا گیا

source: Sign in using %(providerName)s
ur: ٪ (providerName) کا استعمال کرتے ہوئے سائن ان کریں

source: The minimum score percentage must be a whole number between 0 and 100.
ur: کم از کم سکور فی صد 0 اور 100 کے درمیان مکمل نمبر ہونا ضروری ہے.

source: Unit
ur: یونٹ

source: records are not in correct format and not added to the exception list
ur: ریکارڈ صحیح شکل میں نہیں ہیں اور استثنا کی فہرست میں شامل نہیں ہیں

source: The following warnings were generated:
ur: مندرجہ ذیل انتباہ پیدا کی گئی:

source: Time Sent
ur: وقت بھیجا گیا

source: All flags have been removed. To undo, uncheck the box.
ur: تمام پرچم ہٹا دیا گیا ہے. واپس کرنے کیلئے، باکس کو چالو کریں.

source: Chapter Asset
ur: باب اثاثہ

source: Redo (Ctrl+Shift+Z)
ur: ریڈ (Ctrl + Shift + Z)

source: Page break
ur: صفحہ وقفے

source: To complete the program, you must earn a verified certificate for each course.
ur: پروگرام مکمل کرنے کے لئے، آپ کو ہر کورس کے لئے ایک تصدیق شدہ سرٹیفکیٹ حاصل کرنا ضروری ہے.

source: Set Access
ur: رسائی سیٹ کریں

source: The certificate for this learner has been re-validated and the system is re-running the grade for this learner.
ur: اس سیکھنے کے لئے سرٹیفیکیشن دوبارہ معطل کر دیا گیا ہے اور نظام اس سیکھنے کے لئے گریڈ چل رہا ہے.

source: Success
ur: کامیابی

source: Course Start
ur: کورس شروع

source: Component
ur: اجزاء
