Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: You could not be unsubscribed from this post. Refresh the page and try again.
ur: آپ کو اس پوسٹ سے سبسکرائب نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Leave this team?
ur: اس ٹیم کو چھوڑ دو

source: These users were not added as beta testers:
ur: یہ صارفین بیٹا امتحان کے طور پر شامل نہیں ہوئے تھے:

source: The email address you've provided isn't formatted correctly.
ur: آپ کے فراہم کردہ ای میل ایڈریس درست طریقے سے فارمیٹ نہیں کیا گیا ہے.

source: seconds
ur: سیکنڈ

source: The combined length of the organization, course number, and course run fields cannot be more than <%=limit%> characters.
ur: تنظیم، کورس نمبر، اور کورس کے میدانوں کی مشترکہ لمبائی &lt;٪ = حد٪&gt; حروف سے زیادہ نہیں ہوسکتی ہے.

source: Instructor Title
ur: انسٹرکٹر عنوان

source: Add your post to a relevant topic to help others find it. (Required)
ur: دوسروں کو تلاش کرنے میں مدد کیلئے اپنی پوسٹ کو متعلقہ موضوع میں شامل کریں. (ضروری ہے)

source: Full Name
ur: پورا نام

source: on
ur: پر

source: {numResponses} response
ur: {numResponses} جواب

source: ORDER NAME
ur: آرڈر NAME

source: This post will be visible to everyone.
ur: یہ اشاعت ہر کسی کو نظر آئے گی.

source: Account Information
ur: اکاؤنٹ کی معلومات

source: Your library could not be exported to XML. There is not enough information to identify the failed component. Inspect your library to identify any problematic components and try again.
ur: آپ کی لائبریری ایکس ایم ایل کو برآمد نہیں کیا جاسکتا. ناکام جزو کی شناخت کے لئے کافی معلومات نہیں ہے. کسی بھی دشواری اجزاء کی شناخت کے لئے اپنی لائبریری کا معائنہ کریں اور دوبارہ کوشش کریں.

source: Draft saved on {lastSavedStart}{editedOn}{lastSavedEnd} by {editedByStart}{editedBy}{editedByEnd}
ur: ڈرافٹ {lastSavedStart} {editedOn} {lastSavedEnd} پر محفوظ کیا گیا {ترمیمByStart} {editedBy} {editedByEnd}

source: Upload signature image.
ur: دستخط تصویر اپ لوڈ کریں.

source: or
ur: یا

source: Search Results
ur: تلاش کے نتائج

source: You did not submit the required files: {requiredFiles}.
ur: آپ نے مطلوبہ فائلوں کو جمع نہیں کیا: {requiredFiles}.

source: Update comment
ur: تبصرہ اپ ڈیٹ کریں

source: Dimensions
ur: ابعاد

source: Prerequisite:
ur: شرط:

source: The organization that this signatory belongs to, as it should appear on certificates.
ur: تنظیم جس کا یہ دستخط اس سے تعلق رکھتا ہے، جیسا کہ یہ سرٹیفکیٹ پر نظر آنا چاہئے.

source: This action cannot be undone.
ur: یہ عمل غیر مستحکم نہیں ہوسکتی ہے.

source: View Cohort
ur: کوہوٹ دیکھیں

source: Are you sure you want to delete {email} from the library “{container}”?
ur: کیا آپ واقعی &quot;{کنٹینر}&quot; لائبریری سے {ای میل} حذف کرنا چاہتے ہیں؟

source: Photos don't meet the requirements?
ur: تصاویر ضروریات کو پورا نہیں کرتے؟

source: Show entire subsection
ur: پوری سبسکرائب کریں

source: The page "{route}" could not be found.
ur: صفحہ &quot;{راستہ}&quot; نہیں مل سکا.

source: Upload your course image.
ur: اپنے کورس کی تصویر اپ لوڈ کریں.

source: Column group
ur: کالم گروپ

source: To receive credit for problems, you must select "Submit" for each problem before you select "End My Exam".
ur: مسائل کے لۓ کریڈٹ حاصل کرنے کے لۓ، &quot;میری امتحان ختم کریں&quot; کو منتخب کرنے سے پہلے آپ کو ہر مسئلے کے لئے &quot;جمع کرائیں&quot; منتخب کرنا لازمی ہے.

source: Insert/edit link
ur: لنک داخل کریں / ترمیم کریں

source: Community TA
ur: کمیونٹی ٹی اے

source: Retake Photo
ur: تصویر دوبارہ لیں

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
ur: اس باکس کو چیک کرنے کے لئے جس دن آپ کو مندرجہ ذیل اشاعتوں سے نئی اور غیر منحصر سرگرمی کے بارے میں مطلع کرنے کے بعد آپ کو مطلع کرنے کے بعد ای میل ڈیجیٹل مل جائے.

source: Clear Release Date/Time
ur: واضح رہائی کی تاریخ / وقت

source: Hide closed captions
ur: بند کیپشنز چھپائیں

source: Error
ur: غلطی

source: Share on Mozilla Backpack
ur: موزیلا بیگ پر اشتراک کریں

source: You have not bookmarked any courseware pages yet
ur: آپ نے ابھی تک کسی بھی مضامین کو بک مارک نہیں کیا ہے

source: Basic Account Information
ur: بنیادی اکاؤنٹ کی معلومات

source: This comment could not be deleted. Refresh the page and try again.
ur: یہ تبصرہ حذف نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Upgrade to Verified
ur: تصدیق شدہ پر اپ گریڈ کریں

source: Cohorts Enabled
ur: کوہٹس فعال

source: Close
ur: بند کریں

source: Delete this asset
ur: اس اثاثے کو حذف کریں

source: Enter your
ur: اپنا داخل کرے

source: %s ago
ur: ٪ s پہلے

source: Timed Exam
ur: ٹائم کی جانچ

source: Questions raise issues that need answers. Discussions share ideas and start conversations. (Required)
ur: سوالات اس مسئلے کو بلند کرتی ہیں جو جوابات کی ضرورت ہوتی ہیں. بحثات کے خیالات کا اشتراک کرتے ہیں اور بات چیت شروع کرتے ہیں. (ضروری ہے)

source: incorrect
ur: غلط

source: Replace all
ur: سب کو بدل دیں

source: Read More
ur: مزید پڑھ

source: Thumbnail
ur: تھمب نیل

source: Heading 3
ur: سرخی 3

source: Heading 2
ur: سرخی 2

source: Heading 1
ur: سرخی 1

source: Your profile settings are managed by {enterprise_name}. Contact your administrator or {link_start}edX Support{link_end} for help.
ur: آپ کی پروفائل کی ترتیبات {enterprise_name} کی طرف سے منظم ہیں. مدد کیلئے اپنے منتظم یا {link_start} edX کی حمایت {link_end} سے رابطہ کریں.

source: A driver's license, passport, or other government-issued ID with your name and photo
ur: آپ کے نام اور تصویر کے ساتھ ڈرائیور کا لائسنس، پاسپورٹ، یا دوسری حکومت سے جاری کردہ ID

source: Uploaded file issues. Click on "+" to view.
ur: اپ لوڈ شدہ فائل کے مسائل. دیکھنے کے لئے &quot;+&quot; پر کلک کریں.

source: Heading 5
ur: سرخی 5

source: Error adding learners.
ur: سیکھنے والے کو شامل کرنے میں خرابی

source: The following message will be displayed at the bottom of the courseware pages within your course:
ur: مندرجہ ذیل پیغام آپ کے کورس کے اندر درج ذیل صفحات کے نیچے دکھایا جائے گا:

source: Password
ur: پاس ورڈ

source: Placeholder
ur: پلیس ہولڈر

source: Order Number
ur: آرڈر نمبر

source: Change or Leave Session
ur: سیشن تبدیل یا چھوڑ دیں

source: Verification checkpoint to be completed
ur: مکمل کرنے کیلئے توثیق چیک پوائنٹ

source: Country
ur: ملک

source: To review learner cohort assignments or see the results of uploading a CSV file, download course profile information or cohort results on the {link_start}Data Download{link_end} page.
ur: سیکھنے والے کوہوٹ تفویض کا جائزہ لیں یا CSV فائل اپ لوڈ کرنے کے نتائج دیکھیں، کورس پروفائل کی معلومات ڈاؤن لوڈ کریں یا کوورٹ کے نتائج {link_start} ڈیٹا ڈاؤن لوڈ {link_end} کے صفحے پر دیکھیں.

source: Congratulations! You are now verified on %(platformName)s!
ur: مبارک ہو! آپ ابھی٪ (پلیٹ فارم نام) پر تصدیق کر چکے ہیں!

source: Error while generating certificates. Please try again.
ur: سرٹیفکیٹ پیدا کرنے میں خرابی. دوبارہ کوشش کریں.

source: No description available
ur: کوئی تفصیل موجود نہیں ہے

source: A list of courses you have just enrolled in as a verified student
ur: ایک تصدیق شدہ طالب علم کے طور پر آپ نے صرف اس کورس میں شامل ہونے والے کورسوں کی فہرست

source: Create an Account
ur: کھاتا کھولیں

source: Group Configuration name is required.
ur: گروپ ترتیب نام کی ضرورت ہے.

source: Error: User '<%- username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
ur: خرابی: صارف &#39;&lt;٪ - صارف کا نام٪&gt;&#39; نے ابھی تک ان کے اکاؤنٹ کو چالو نہیں کیا ہے. صارفین کو اپنے کردار کو تفویض کرنے سے پہلے ان کے اکاؤنٹس تخلیق اور فعال کرنا ضروری ہے.

source: %(errorCount)s error found in form.
ur: ٪ (errorCount) کی غلطی فارم میں مل گئی.

source: Clear search results
ur: تلاش کے نتائج صاف کریں

source: The file must be at least {size} in size.
ur: فائل میں کم از کم {سائز} ہونا لازمی ہے.

source: Download URL
ur: یو آر ایل ڈاؤن لوڈ کریں

source: Please provide a description of the link destination.
ur: براہ مہربانی لنک کی منزل کی وضاحت فراہم کریں.

source: You already have an edX account with your {enterprise_name} email address.
ur: آپ کے پاس پہلے ہی آپ کے {enterprise_name} ای میل پتہ کے ساتھ ایک EDX اکاؤنٹ ہے.

source: After the course\'s end date has passed, learners can no longer access subsection content. The subsection remains included in grade calculations.
ur: کورس کے اختتام کی تاریخ منظور ہونے کے بعد، سیکھنے کو مزید سبسکرائب مواد تک رسائی حاصل نہیں ہوسکتی ہے. سبسینٹیشن گریڈ کی حساب میں شامل ہے.

source: Verified Certificate upgrade
ur: تصدیق شدہ سرٹیفکیٹ اپ گریڈ

source: Enrollment Mode
ur: اندراج موڈ

source: Remove {video_name} video
ur: {video_name} ویڈیو کو ہٹا دیں

source: Unknown
ur: نامعلوم

source: End My Exam
ur: میری امتحان ختم کریں

source: (Add signatories for a certificate)
ur: (ایک سرٹیفکیٹ کے لئے دستخط شامل کریں)

source: Current location
ur: موجودہ مقام

source: Please enter a username or email.
ur: براہ کرم صارف کا نام یا ای میل درج کریں.

source: An error has occurred. Refresh the page, and then try again.
ur: ایک خرابی آگئی ہے. صفحہ تازہ کریں، اور پھر دوبارہ کوشش کریں.

source: Insert image
ur: تصویر داخل کریں

source: Return to team listing
ur: ٹیم کی لسٹنگ پر واپس جائیں

source: Select a session:
ur: ایک سیشن منتخب کریں:

source: Please Note
ur: براہ مہربانی نوٹ کریں

source: Could not upload the video image file
ur: ویڈیو تصویر فائل کو اپ لوڈ نہیں کیا جا سکا

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} descending
ur: {totalItemsCount} سے {currentItemRange} دکھا رہا ہے، sorted by {sortName} descending

source: Creative Commons licensed content, with terms as follow:
ur: تخلیقی العام لائسنس یافتہ مواد، پیروی کے طور پر شرائط کے ساتھ:

source: EdX doesn't have a timed transcript for this video in Studio, but we found a transcript on YouTube. You can import the YouTube transcript or upload your own .srt transcript file.
ur: اس ویڈیو کے لئے ایڈ وی سٹوڈیو میں ٹائڈ ٹریک نہیں ہے، لیکن ہمیں یو ٹیوب پر ایک ٹرانسمیشن مل گیا. آپ یو ٹیوب ٹرانس درآمد کرسکتے ہیں یا اپنا اپنا ایس ایس آر ٹرانسپٹ فائل اپ لوڈ کرسکتے ہیں.

source: image omitted
ur: تصویر اتار دی گئی

source: These users were successfully removed as beta testers:
ur: یہ صارفین کو بیٹا ٹیسرز کے طور پر کامیابی سے ہٹا دیا گیا تھا:

source: Check your email account for instructions to reset your password.
ur: اپنا پاس ورڈ دوبارہ ترتیب دینے کیلئے ہدایات کے لئے اپنا ای میل اکاؤنٹ چیک کریں.

source: Bullet list
ur: بلٹ کی فہرست

source: Is this OK?
ur: کیا یہ ٹھیک ہے؟

source: Error generating ORA data report. Please try again.
ur: ORA ڈیٹا کی رپورٹ پیدا کرنے میں خرابی دوبارہ کوشش کریں.

source: Headers
ur: ہیڈر

source: Amount
ur: رقم

source: Certificate Signatory Configuration
ur: سرٹیفکیٹ سائنسی ترتیب

source: Image upload failed
ur: تصویری اپ لوڈ ناکام ہوگئی

source: Course
ur: کورس

source: Group name is required
ur: گروپ کا نام لازمی ہے

source: You commented...
ur: آپ نے تبصرہ کیا ...

source: Start search
ur: تلاش شروع کریں

source: Browse
ur: براؤز کریں

source: The following users are no longer enrolled in the course:
ur: مندرجہ ذیل صارفین اب کورس میں داخل نہیں ہوئے ہیں:

source: Choose your institution from the list below:
ur: مندرجہ ذیل فہرست سے اپنے ادارے کو منتخب کریں:

source: Endorse
ur: یقین ہے

source: Circle
ur: سرکل

source: You will not receive notification for emails that bounce, so double-check your spelling.
ur: آپ کو ای میلز کے لئے نوٹیفیکیشن موصول نہیں ہوگی جسے اچھالنا ہے، لہذا آپ کی ہجے چیک کریں.

source: Last modified by
ur: آخری ترمیم کردہ

source: Take Your Photo
ur: اپنی تصویر لے لو

source: section
ur: سیکشن

source: Practice proctored Exam
ur: پریکٹس نے امتحان کی پیشکش کی

source: New document
ur: نیا دستاویز

source: Are you having trouble finding a team to join?
ur: کیا آپ کو کسی ٹیم میں شامل ہونے میں دشواری کا سامنا ہے؟

source: Course Index
ur: کورس انڈیکس

source: Enter the account information for your organization.
ur: اپنی تنظیم کے لئے اکاؤنٹ کی معلومات درج کریں.

source: component
ur: جزو

source: Ungraded
ur: ناجائز

source: Any divided discussion topics are divided based on cohort.
ur: کسی بھی تقسیم شدہ بحث کے موضوعات کوہٹ پر مبنی تقسیم کیا جاتا ہے.

source: New %(item_type)s
ur: نیا٪ (item_type) s

source: COMPLETED COURSES
ur: مکمل کورسز

source: Reset Your Password
ur: آپ کا پاس ورڈ دوبارہ ترتیب دیں

source: Release:
ur: رہائی:

source: Notes hidden
ur: پوشیدہ نوٹس

source: Accomplishments
ur: تعطیلات

source: To access the course, select a session.
ur: کورس تک پہنچنے کے لئے، ایک سیشن کا انتخاب کریں.

source: Border
ur: سرحد

source: Find and replace
ur: تلاش کریں اور تبدیل کریں

source: Style
ur: انداز

source: Never published
ur: کبھی شائع نہیں

source: Team Details
ur: ٹیم کی تفصیلات

source: Top
ur: اوپر

source: Upload completed for video {fileName}
ur: ویڈیو {fileName} کے لئے مکمل اپ لوڈ

source: Restore last draft
ur: آخری مسودہ بحال کریں

source: Preformatted
ur: پیش وضاحتی

source: Upload Photo
ur: تصویر اپلوڈ کریں

source: This content group is used in one or more units.
ur: یہ مواد گروپ ایک یا ایک سے زیادہ یونٹس میں استعمال کیا جاتا ہے.

source: enter link description here
ur: یہاں لنک کی تفصیل درج کریں

source: Select the course-wide discussion topics that you want to divide.
ur: کورس کے وسیع بحث کے موضوعات کو منتخب کریں جو آپ تقسیم کرنا چاہتے ہیں.

source: New enrollment mode:
ur: نیا داخلہ موڈ:

source: You!
ur: تم!

source: Cell type
ur: سیل کی قسم

source: or sign in with
ur: یا سائن ان کریں

source: Engage with posts
ur: خطوط کے ساتھ مشغول

source: Delete
ur: حذف کریں

source: You are a member of this team.
ur: آپ اس ٹیم کا رکن ہیں.

source: There are invalid keywords in your email. Check the following keywords and try again.
ur: آپ کے ای میل میں غلط مطلوبہ الفاظ ہیں. مندرجہ ذیل مطلوبہ الفاظ کو چیک کریں اور دوبارہ کوشش کریں.

source: Number of Droppable
ur: Droppable کی تعداد

source: Preview Certificate
ur: پیش نظارہ سرٹیفکیٹ

source: Add a New Cohort
ur: نیا کوہٹ شامل کریں

source: Deleting this %(item_display_name)s is permanent and cannot be undone.
ur: اس٪ (item_display_name) کو حذف کرنا مستقل ہے اور اسے واپس نہیں کیا جاسکتا ہے.

source: An error occurred. Make sure that the student's username or email address is correct and try again.
ur: ایک خرابی آگئی. اس بات کو یقینی بنائیں کہ طالب علم کے صارف کا نام یا ای میل پتہ درست ہے اور دوبارہ کوشش کریں.

source: The course must have an assigned start date.
ur: اس کورس میں ایک تفویض شروع کی تاریخ ہونا ضروری ہے.

source: Add another group
ur: ایک اور گروپ شامل کریں

source: Edit Thumbnail
ur: تھمب نیل ترمیم کریں

source: Certificate name is required.
ur: سرٹیفکیٹ کا نام لازمی ہے.

source: Responses could not be loaded. Refresh the page and try again.
ur: جوابات لوڈ نہیں کی جا سکتی. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Year of Birth
ur: پیدائش کا سال

source: This vote could not be processed. Refresh the page and try again.
ur: یہ ووٹ عملدرآمد نہیں کیا جا سکا. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Take a Photo of Your ID
ur: اپنی شناخت کی تصویر لیں

source: Photo
ur: تصویر

source: Press the UP arrow key to enter the language menu then use UP and DOWN arrow keys to navigate language options. Press ENTER to change to the selected language.
ur: زبان مینو میں داخل ہونے کیلئے UP تیر کی چابی پریس کریں تو زبان کے اختیارات کو نیویگیشن کے لۓ UP اور DOWN تیر کی چابیاں استعمال کریں. منتخب زبان میں تبدیل کرنے کیلئے ENTER دبائیں.

source: Auto-advance
ur: آٹو پیشگی

source: Change My Email Address
ur: میرا ای میل ایڈریس تبدیل کریں

source: Border color
ur: سرحدی رنگ

source: Webcam
ur: ویب کمیرہ

source: This group no longer exists. Choose another group or do not restrict access to this unit.
ur: یہ گروپ اب موجود نہیں ہے. کسی دوسرے گروپ کو منتخب کریں یا اس یونٹ تک رسائی کو محدود نہ کریں.

source: toggle chapter %(displayName)s
ur: ٹگول باب٪ (ڈسپلے نام) s

source: All groups must have a unique name.
ur: تمام گروپوں کو ایک منفرد نام ہونا چاہئے.

source: Unmark as Answer
ur: جواب کے طور پر نشان زد کریں

source: All accounts were created successfully.
ur: تمام اکاؤنٹس کامیابی سے بنائے گئے تھے.

source: Would you like to sign in using your %(providerName)s credentials?
ur: کیا آپ اپنے٪ (providerName) کے اعتبار سے سائن ان کرنا چاہیں گے؟

source: Add language
ur: زبان شامل کریں

source: About You
ur: اپ کے بارے میں

source: Contains staff only content
ur: اسٹاف صرف مواد پر مشتمل ہے

source: Reply to Annotation
ur: تشریح کا جواب دیں

source: Date Joined
ur: تاریخ میں شامل

source: Next Step: Confirm your identity
ur: اگلا قدم: اپنی شناخت کی تصدیق کریں

source: Please specify a reason.
ur: براہ مہربانی ایک وجہ کی وضاحت کریں.

source: Course-Wide Discussion Topics
ur: کورس کے وسیع بحث موضوعات

source: Video position
ur: ویڈیو پوزیشن

source: We ask you to activate your account to ensure it is really you creating the account and to prevent fraud.
ur: ہم آپ سے اپنے اکاؤنٹ کو چالو کرنے کے لۓ اس بات کو یقینی بنانا چاہتے ہیں کہ یہ واقعی آپ اکاؤنٹ بنائے اور دھوکہ دہی سے بچنے کے لۓ.

source: Discussion Home
ur: بحث گھر

source: File
ur: فائل

source: You can remove members from this team, especially if they have not participated in the team's activity.
ur: آپ اس ٹیم سے ممبران کو ہٹا سکتے ہیں، خاص طور پر اگر ٹیم ٹیم کی سرگرمیوں میں حصہ نہیں لیا گیا ہے.

source: This feature is currently in testing. Course teams can enter highlights, but learners will not receive email messages.
ur: اس خصوصیت کی جانچ پڑتال میں ہے. کورس کے ٹیموں میں روشنی ڈالی جا سکتی ہے، لیکن سیکھنے والے ای میل پیغامات وصول نہیں کریں گے.

source: Already a course team member
ur: پہلے سے ہی ایک ٹیم ٹیم کا رکن

source: Certificate Information
ur: سرٹیفکیٹ کی معلومات

source: %d day
ur: ٪ d دن

source: You are not currently a member of any team.
ur: آپ فی الحال کسی ٹیم کا رکن نہیں ہیں.

source: Bottom
ur: نیچے

source: The name of this signatory as it should appear on certificates.
ur: اس دستخط کا نام جیسا کہ سرٹیفکیٹ پر ہونا چاہئے.

source: Editing access for: %(title)s
ur: کے لئے رسائی میں ترمیم:٪ (عنوان) s

source: This learner will be removed from the team, allowing another learner to take the available spot.
ur: اس سیکھنے کو ٹیم سے ہٹا دیا جائے گا، جس سے دوسرا سیکھنے دستیاب جگہ لے لے.

source: View child items
ur: بچے کی اشیاء دیکھیں

source: Open language menu
ur: کھولیں زبان مینو

source: Teaching Assistant
ur: اساتذہ اسسٹنٹ

source: All chapters must have a name and asset
ur: تمام بابوں کے پاس ایک نام اور اثاثہ ہونا لازمی ہے

source: Action required: Enter a valid date.
ur: ایکشن ضروری ہے: ایک درست تاریخ درج کریں.

source: No tasks currently running.
ur: کوئی کام ابھی چل رہا ہے.

source: {type} Progress
ur: {قسم} پیش رفت

source: Numbered List (Ctrl+O)
ur: شمار شدہ فہرست (Ctrl + O)

source: Thank you for submitting your financial assistance application for {course_name}! You can expect a response in 2-4 business days.
ur: {course_name} کے لئے آپ کی مالی امداد کی درخواست جمع کرنے کے لئے آپ کا شکریہ! آپ 2-4 کاروباری دنوں میں جواب کی توقع کر سکتے ہیں.

source: Specify whether content-specific discussion topics are divided.
ur: اس بات کی وضاحت کریں کہ آیا متصف مخصوص بحث کے موضوعات تقسیم کیے گئے ہیں.

source: URL
ur: یو آر ایل

source: Clear Grading Due Date
ur: واضح گریڈنگ کی وجہ سے تاریخ صاف کریں

source: Import YouTube Transcript
ur: YouTube ٹرانزٹ درآمد کریں

source: Does the photo of you show your whole face?
ur: کیا آپ کی تصویر آپ کا پورا چہرہ دکھاتا ہے؟

source: Add a response:
ur: ایک جواب شامل کریں:

source: Start working toward your next learning goal.
ur: اپنے اگلے سیکھنے کے مقصد پر کام کرنا شروع کرو.

source: Any content that has listed this content as a prerequisite will also have access limitations removed.
ur: کوئی بھی مواد جس نے اس مواد کو شرط کے طور پر درج کیا ہے اس میں بھی رسائی کی حدود کو ہٹا دیا جائے گا.

source: Inline
ur: ترتیب سے

source: Password Status
ur: پاس ورڈ کی حیثیت

source: Add a learning outcome here
ur: یہاں سیکھنے کا نتیجہ شامل کریں

source: Saving
ur: بچت

source: Verified Status
ur: تصدیق شدہ حیثیت

source: Abbreviation
ur: مخفف

source: Disc
ur: ڈسک

source: Back to {platform} FAQs
ur: واپس جائیں {پلیٹ فارم} سوالات

source: You can now enter your payment information and complete your enrollment.
ur: اب آپ اپنی ادائیگی کی معلومات درج کر سکتے ہیں اور اپنے اندراج کو مکمل کرسکتے ہیں.

source: Error starting a task to rescore entrance exam for student '{student_id}'. Make sure that entrance exam has problems in it and student identifier is correct.
ur: طالب علم &#39;{student_id}&#39; کے لئے داخلہ امتحان کو دوبارہ بحال کرنے کے لئے کام شروع کرنے میں خرابی. اس بات کو یقینی بنائیں کہ داخلہ کے امتحان میں اس کی دشواری ہوتی ہے اور طالب علم کی شناخت درست ہے.

source: Your donation could not be submitted.
ur: آپ کے عطیہ جمع نہیں کیا جا سکتا.

source: Link Your Account
ur: اپنے اکاؤنٹ سے رابطہ کریں

source: End
ur: اختتام

source: Move: {displayName}
ur: منتقل کریں: {displayName}

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email. After you complete activation you can return and refresh this page.
ur: کورسز میں داخل ہونے سے پہلے آپ کو اپنے اکاؤنٹ کو چالو کرنے کی ضرورت ہے. ایک فعال ای میل کے لئے اپنے ان باکس کو چیک کریں. آپ کو چالو کرنے کے بعد آپ اس صفحے کو واپس لے سکتے ہیں اور تازہ کر سکتے ہیں.

source: Hide Deprecated Settings
ur: ناپسندیدہ ترتیبات چھپائیں

source: Video transcript
ur: ویڈیو ٹریک

source: There are no posts in this topic yet.
ur: اس موضوع میں ابھی تک کوئی اشاعت نہیں ہیں.

source: Enable
ur: فعال

source: Are you sure you want to delete this page? This action cannot be undone.
ur: کیا آپ واقعی یہ صفحہ حذف کرنا چاہتے ہیں؟ یہ عمل غیر مستحکم نہیں ہوسکتی ہے.

source: group configuration
ur: گروپ ترتیب

source: Report
ur: رپورٹ

source: Course End
ur: کورس اختتام

source: None
ur: کوئی بھی نہیں

source: about a month
ur: تقریبا ایک ماہ

source: Section Highlights
ur: سیکشن ہائی لائٹس

source: Font Sizes
ur: فونٹ سائز

source: Ignore
ur: نظر انداز کریں

source: Remove unit %(unitName)s
ur: یونٹ٪ (یونٹ نام) s ہٹا دیں

source: Going forward, your account information will be updated and maintained by {enterprise_name}.
ur: آگے بڑھنا، آپ کا اکاؤنٹ کی معلومات {enterprise_name} کی طرف سے اپ ڈیٹ اور برقرار رکھا جائے گا.

source: View Archived Course
ur: آرکائیوڈ کورس دیکھیں

source: Upload a new PDF to “<%= name %>”
ur: &quot;&lt;٪ = نام٪&gt;&quot; پر ایک نیا PDF اپ لوڈ کریں &quot;

source: Learners never see whether their answers to assessments are correct or incorrect, nor the score received.
ur: اساتذہ کبھی نہیں دیکھتے ہیں کہ ان کے جوابات درست ہیں یا غلط ہیں، نہ ہی سکور وصول ہوتے ہیں.

source: Last published %(last_published_date)s by %(publish_username)s
ur: گزشتہ اشاعت٪ (last_published_date) s٪ (publish_username) کے ذریعہ ہے

source: Exam Name
ur: امتحان کے نام

source: When your face is in position, use the camera button {icon} below to take your photo.
ur: جب آپ کا چہرہ پوزیشن میں ہے تو، آپ کی تصویر لینے کے لۓ کیمرے کے بٹن {icon} کو استعمال کریں.

source: Your message must have at least one target.
ur: آپ کا پیغام کم از کم ایک ہدف ہونا ضروری ہے.

source: asset_path is required
ur: اثاثہ_path کی ضرورت ہے

source: You haven't added any assets to this course yet.
ur: آپ نے اس کورس میں ابھی تک کوئی اثاثہ شامل نہیں کیا ہے.

source: Any divided discussion topics are divided based on enrollment track.
ur: کسی بھی تقسیم شدہ بحث کے موضوعات اندراج کے ٹریک پر مبنی تقسیم ہوتے ہیں.

source: API Key
ur: API کلید

source: Once in position, use the camera button {icon} to capture your ID
ur: ایک بار پوزیشن میں، اپنی شناخت پر قبضہ کرنے کیلئے کیمرے کے بٹن {icon} کا استعمال کریں

source: Choose a .csv file
ur: ایک سی ایس وی فائل منتخب کریں

source: ${price} {currency} )
ur: $ {قیمت} {کرنسی})

source: Your changes will not take effect until you save your progress.
ur: جب تک آپ اپنی ترقی کو بچانے کے لۓ آپ کی تبدیلیوں کو اثر انداز نہیں ہوگا.

source: Learn more about {license_name}
ur: {license_name} کے بارے میں مزید جانیں

source: Error generating survey results. Please try again.
ur: سروے کے نتائج پیدا کرنے میں خرابی دوبارہ کوشش کریں.

source: Language
ur: زبان
