Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
ar: توزيع أي فيروس أو حصان طروادة أو برامج تجسس أو برامج إعلانية أو برامج ضارة أو بوت أو قنبلة زمنية أو دودة أو غير ذلك من العناصر الضارة أو الضارة ؛ أو
ur: کسی بھی وائرس، ٹروجن گھوڑے، سپائیویئر، ایڈویئر، میلویئر، بوٹ، ٹائم بم، کیڑا، یا دیگر نقصان دہ یا بدسورتانہ جزو تقسیم؛ یا
zh_cn: 分发任何病毒，特洛伊木马，间谍软件，广告软件，恶意软件，机器人，定时炸弹，蠕虫或其他有害或恶意组件;要么

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in week %(week_num)s:
ar: نأمل أن تستمتع٪ (course_name) s! نريد أن نخبرك بما يمكنك التطلع إليه في الأسبوع٪ (week_num) s:
ur: ہمیں امید ہے کہ آپ٪ (کورس_ نام) کی لطف اندوز ہو رہے ہیں! ہم آپ کو یہ بتانا چاہتے ہیں کہ آپ ہفتے میں٪ (ہفتہ_وموم) کے لۓ کیا دیکھ سکتے ہیں:
zh_cn: 我们希望你喜欢％（course_name）！我们想让你知道你可以期待在星期％（week_num）s：

source: The following users do not exist: {usernames}.
ar: المستخدمون التاليون غير موجودون: {usernames}.
ur: مندرجہ ذیل صارفین موجود نہیں ہیں: {صارف نام}.
zh_cn: 以下用户不存在：{用户名}。

source: Sign In
ar: تسجيل الدخول
ur: داخلہ
zh_cn: 签到

source: Export Failed
ar: فشل التصدير
ur: برآمد ناکام ہوگئی
zh_cn: 导出失败

source: Add the learning outcomes for this course
ar: أضف نتائج التعلم لهذه الدورة
ur: اس کورس کے لئے سیکھنے کا نتیجہ شامل کریں
zh_cn: 添加本课程的学习成果

source: Username and password fields cannot match
ar: لا يمكن أن تتطابق حقول اسم المستخدم وكلمة المرور
ur: صارف کا نام اور پاسورڈ فیلڈ مل سکتے ہیں
zh_cn: 用户名和密码字段不能匹配

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
ar: سيكون هذا هو العنوان الذي يمكن العثور فيه على مقالك. استخدم فقط الأحرف الأبجدية الرقمية و - أو _. لاحظ أنه لا يمكنك تغيير المقدار بعد إنشاء المقالة.
ur: یہ وہ پتہ ہو گا جہاں آپ کا مضمون پایا جا سکتا ہے. صرف حروف تہجی حروف اور - یا _ استعمال کریں. نوٹ کریں کہ آپ مضمون بنانے کے بعد سلگ تبدیل نہیں کرسکتے ہیں.
zh_cn: 这将是您的文章可以找到的地址。仅使用字母数字字符和 - 或_。请注意，创建文章后不能更改slu g。

source: Your Location
ar: موقعك
ur: آپ کی جگہ
zh_cn: 你的地点

source: Review your info
ar: مراجعة المعلومات الخاصة بك
ur: اپنی معلومات کا جائزہ لیں
zh_cn: 查看您的信息

source: course_id
ar: معرف بالطبع
ur: کورس_ڈ

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
ar: تؤدي إعادة تعيين تاريخ استحقاق المشكلة إلى إلغاء تمديد تاريخ الاستحقاق للطالب في وحدة معينة. سيؤدي هذا إلى إرجاع تاريخ الاستحقاق للطالب إلى تاريخ الاستحقاق الأصلي للمشكلة.
ur: ایک مسئلہ کا تعین کرنے کی وجہ سے تاریخ ایک مخصوص یونٹ پر ایک طالب علم کے لئے ایک تاریخ کی تاریخ کی توسیع کا اعادہ کرتا ہے. یہ طالب علم کے لئے اصل تاریخ کی تاریخ کی اصل تاریخ کو واپس لے جائے گا.
zh_cn: 重置问题的截止日期会取消特定单元上学生的截止日期延期。这会将学生的截止日期恢复到问题的原始截止日期。

source: Verification not yet complete.
ar: التحقق لم يكتمل بعد.
ur: توثیق ابھی تک مکمل نہیں ہے.
zh_cn: 验证尚未完成。

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
ar: حدث خطأ في إدخال التاريخ. يجب تنسيقه كـ YYYY-MM-DD
ur: آپ کی تاریخ ان پٹ میں ایک خرابی تھی. یہ YYYY-MM-DD کے طور پر فارمیٹ کیا جانا چاہئے
zh_cn: 您的日期输入中有错误。它应该被格式化为YYYY-MM-DD

source: Any group configurations
ar: أي تكوينات المجموعة
ur: کسی بھی گروپ ترتیب
zh_cn: 任何组配置

source: Enter the configurations that govern how students are grouped together.
ar: أدخل التكوينات التي تحكم كيفية تجميع الطلاب معًا.
ur: ترتیبات درج کریں جو طالب علموں کو ایک دوسرے کے ساتھ گروہ کیا جاتا ہے.
zh_cn: 输入管理学生分组在一起的配置。

source: Enter the recipient name.
ar: أدخل اسم المستلم.
ur: وصول کنندہ کا نام درج کریں.
zh_cn: 输入收件人姓名。

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision}, and the reason was {reason}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
ar: آسف! لم يقبل معالج الدفع لدينا دفعتك. القرار الذي أعادوه كان {قرار} ، والسبب كان {reason}. لم تكن مشحونة. يرجى تجربة طريقة دفع مختلفة. اتصل بنا لطرح الأسئلة المتعلقة بالدفع على {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے آپ کی ادائیگی قبول نہیں کی. وہ واپس آنے کا فیصلہ {فیصلہ} تھا، اور وجہ {وجہ} تھا. آپ کو چارج نہیں کیا گیا تھا. براہ کرم ادائیگی کی ایک مختلف قسم کی کوشش کریں. {ای میل} پر ادائیگی سے متعلق سوالات کے ساتھ ہم سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理器不接受您的付款。他们的决定是{决定}，原因是{reason}。你没有被指控。请尝试不同的付款方式。通过{email}与我们联系并提供与付款相关的问题。

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
ar: الرجاء تقديم مسار واسم صالحين لصورة الفيديو المصغرة (ملاحظة: يدعم تنسيق JPEG أو PNG فقط)
ur: براہ کرم اپنے ویڈیو تھمب نیل کی تصویر پر ایک درست راستہ اور نام فراہم کریں (نوٹ: صرف JPEG یا PNG فارمیٹ کی حمایت کی ہے)
zh_cn: 请为您的视频缩略图提供有效的路径和名称（注意：仅支持JPEG或PNG格式）

source: Date of purchase
ar: تاريخ الشراء
ur: خریداری کی تاریخ
zh_cn: 购买日期

source: To get started, please visit https://{site_name}. The login information for your account follows.
ar: للبدء ، يرجى زيارة https: // {site_name}. فيما يلي معلومات تسجيل الدخول الخاصة بحسابك.
ur: شروع کرنے کے لئے، براہ کرم https: // {site_name} پر جائیں. آپ کے اکاؤنٹ کے لئے لاگ ان کی معلومات مندرجہ ذیل ہے.
zh_cn: 要开始使用，请访问https：// {site_name}。您的帐户的登录信息如下。

source: Upgrade Deadline Has Passed
ar: انتهت المهلة النهائية للترقية
ur: اپ گریڈ کی آخری تاریخ منظور ہے
zh_cn: 升级截止日期已通过

source: {studio_name}'s Many Features
ar: {studio_name} ميزات كثيرة
ur: {سٹوڈیو_ نام} کی بہت سے خصوصیات
zh_cn: {studio_name}的许多功能

source: To start, set a course goal by selecting the option below that best describes your learning plan. {goal_options_container}
ar: للبدء ، قم بتعيين هدف دورة تدريبية عن طريق تحديد الخيار أدناه الذي يصف خطة التعلم الخاصة بك بشكل أفضل. {goal_options_container}
ur: شروع کرنے کے لئے، ذیل میں اس اختیار کا انتخاب کرکے ایک کورس کا مقصد مقرر کریں جو آپ کی سیکھنے کی منصوبہ بندی کا بہترین بیان کرے. {goal_options_container}
zh_cn: 首先，通过选择最能描述学习计划的选项来设定课程目标。 {} goal_options_container

source: Affiliates
ar: التابعون
ur: ملحقہ
zh_cn: 关联公司

source: Add Community TA
ar: أضف مجتمع TA
ur: کمیونٹی ٹی اے شامل کریں
zh_cn: 添加社区TA

source: An image was added: %s
ar: تمت إضافة صورة:٪ s
ur: ایک تصویر شامل کردی گئی:٪ s
zh_cn: 添加了一张图片：％s

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
ar: انتهاك أو انتهاك أو انتهاك أي حق من حقوق النشر أو حقوق العلامات التجارية أو حقوق الخصوصية أو الدعاية أو المعلومات السرية أو أي حق آخر لأي طرف ثالث ؛
ur: کسی بھی کاپی رائٹ کی خلاف ورزی، غلط استعمال یا خلاف ورزی کرنے، ٹریڈ مارک کے حقوق، رازداری یا اشاعت کے حقوق، رازداری کی معلومات یا کسی بھی تیسری پارٹی کا کوئی دوسرا حق؛
zh_cn: 侵犯，侵占或侵犯任何版权，商标权，隐私权或宣传权，机密信息或任何第三方的任何其他权利;

source: Download the Android app on the Google Play Store
ar: قم بتنزيل تطبيق Android على متجر Google Play
ur: Google Play Store پر لوڈ، اتارنا Android ایپ ڈاؤن لوڈ کریں
zh_cn: 在Google Play商店中下载Android应用

source: window open
ar: نافذة مفتوحة
ur: ونڈو کھولیں
zh_cn: 窗户打开

source: Schools
ar: المدارس
ur: اسکولوں
zh_cn: 学校

source: Replace my course with the selected file
ar: استبدل الدورة التدريبية بالملف المحدد
ur: منتخب کردہ فائل کے ساتھ اپنے کورس کو تبدیل کریں
zh_cn: 将我的课程替换为选定的文件

source: Mobile Course Available
ar: بالطبع المحمول المتاحة
ur: موبائل کورس دستیاب ہے
zh_cn: 提供移动课程

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
ar: أضف مكونات إلى مكتبتك لاستخدامها في الدورات التدريبية ، باستخدام إضافة مكون جديد في أسفل هذه الصفحة.
ur: اس صفحہ کے نچلے حصے میں نیا اجزاء شامل کرکے کورسز کے استعمال کے لۓ اپنے لائبریری میں اجزاء شامل کریں.
zh_cn: 使用此页面底部的添加新组件，将组件添加到您的库以用于课程。

source: Log In
ar: تسجيل الدخول
ur: میں لاگ ان کریں
zh_cn: 登录

source: Courses loaded in the modulestore
ar: دورات محملة في modulestore
ur: ماڈیولسٹور میں بھری ہوئی کورسز
zh_cn: 在modulestore中加载的课程

source: Use the {em_start}Web URL{em_end} value to reference the file or image only from outside of your course. {em_start}Note:{em_end} If you lock a file, the Web URL no longer works for external access to a file.
ar: استخدم قيمة {em_start} Web URL {em_end} للإشارة إلى الملف أو الصورة فقط من خارج الدورة التدريبية الخاصة بك. {em_start} ملاحظة: {em_end} إذا تم قفل ملف ، فإن عنوان URL للويب لم يعد يعمل من أجل الوصول الخارجي إلى الملف.
ur: آپ کے کورس کے باہر سے فائل یا تصویر کو حوالہ دینے کیلئے {em_start} ویب URL {em_end} قیمت کا استعمال کریں. {em_start} نوٹ: {em_end} اگر آپ کسی فائل کو تالا لگا دیتے ہیں تو، ویب یو آر ایل کو مزید فائل تک بیرونی رسائی کیلئے کام نہیں کرتا ہے.
zh_cn: 使用{em_start}网址{em_end}值仅可从课程外引用文件或图像。 {em_start}注意：{em_end}如果您锁定了一个文件，则Web URL不再适用于外部访问文件。

source: Found existing group: "{}"
ar: تم العثور على المجموعة الحالية: &quot;{}&quot;
ur: موجودہ گروپ ملا: &quot;{}&quot;
zh_cn: 找到现有群组：“{}”

source: This is a partial list, to view all students download as a csv.
ar: هذه قائمة جزئية ، لمشاهدة جميع الطلاب تنزيل كـ csv.
ur: یہ ایک جزوی فہرست ہے، تاکہ تمام طلبا کو ایک سی ایس وی کے طور پر ڈاؤن لوڈ کریں.
zh_cn: 这是一个部分列表，查看所有学生下载为csv。

source: Level of Education
ar: مستوى التعليم
ur: تعلیم کا معیار
zh_cn: 教育程度

source: Invalid permission option: "{}". Please specify permissions using the format: app_label:model_name:permission_codename.
ar: خيار الإذن غير صالح: &quot;{}&quot;. الرجاء تحديد الأذونات باستخدام التنسيق: app_label: model_name: permission_codename.
ur: غلط اجازت کا اختیار: &quot;{}&quot;. براہ مہربانی فارمیٹ کا استعمال کرتے ہوئے اجازتوں کی وضاحت کریں: app_label: model_name: permission_codename.
zh_cn: 无效的权限选项：“{}”。请使用以下格式指定权限：app_label：model_name：permission_codename。

source: We'll send you a one time SMS with a link to download the app.
ar: سنرسل إليك رسالة SMS لمرة واحدة تحتوي على رابط لتنزيل التطبيق.
ur: ہم آپ کو اے پی پی ڈاؤن لوڈ کرنے کے لئے ایک لنک کے ساتھ ایک بار ایس ایم ایس بھیجیں گے.
zh_cn: 我们会通过链接向您发送一次短信以下载应用程序。

source: Special Exams
ar: الامتحانات الخاصة
ur: خصوصی امتحان
zh_cn: 特别考试

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
ar: يحدد عدد النقاط التي تستحقها كل مشكلة. إذا لم يتم تعيين القيمة ، فإن كل حقل استجابة في المشكلة يستحق نقطة واحدة.
ur: پوائنٹس کی تعداد کو ہر مسئلہ کے قابل ہونے کی وضاحت کرتا ہے. اگر قیمت مقرر نہ ہو تو، مسئلہ میں ہر ردعمل فیلڈ ایک پوائنٹ کے قابل ہے.
zh_cn: 定义每个问题值得的点数。如果未设置该值，则问题中的每个响应字段都值一分。

source: Whether to force the save button to appear on the page
ar: ما إذا كان سيتم فرض زر الحفظ للظهور على الصفحة
ur: صفحہ پر موجود بچاؤ کے بٹن پر مجبور کرنا چاہۓ
zh_cn: 是否强制保存按钮出现在页面上

source: Have {strong_start}general questions about {platform_name}{strong_end}? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
ar: هل لديك {strong_start} أسئلة عامة حول {platform_name} {strong_end}؟ يمكنك العثور على الكثير من المعلومات المفيدة في {platform_name} {link_start} الأسئلة الشائعة {link_end}.
ur: {platform_name} {strong_end} کے بارے میں عمومی سوالات {strong_start} رکھتے ہیں؟ آپ {platform_name} {link_start} سوالات {link_end} میں بہت سارے مددگار معلومات تلاش کرسکتے ہیں.
zh_cn: 对{platform_name} {strong_end}有{strong_start}一般性问题？您可以在{platform_name} {link_start}常见问题{link_end}中找到许多有用的信息。

source: Password cannot be longer than {max} character.
ar: لا يمكن أن تكون كلمة المرور أطول من {max} حرف.
ur: پاس ورڈ {زیادہ سے زیادہ} کردار سے کہیں زیادہ نہیں ہوسکتا ہے.
zh_cn: 密码不能超过{max}字符。

source: Library User Access
ar: الوصول إلى المكتبة
ur: لائبریری صارف تک رسائی
zh_cn: 图书馆用户访问

source: Purchase order number (if any)
ar: رقم طلب الشراء (إن وجد)
ur: خریداری آرڈر نمبر (اگر کوئی ہے)
zh_cn: 采购订单号（如有）

source: granted
ar: منحت
ur: عطا کی
zh_cn: 理所当然

source: Learn more about content visibility settings
ar: تعرف على المزيد حول إعدادات رؤية المحتوى
ur: مواد کی نمائش کی ترتیبات کے بارے میں مزید جانیں
zh_cn: 详细了解内容可见性设置

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
ar: كانت دفعتك ناجحة. سترى الرسوم أدناه في كشف حساب بطاقة الائتمان أو الخصم التالي تحت اسم الشركة {merchant_name}.
ur: آپ کی ادائیگی کامیاب ہوگئی تھی. آپ کمپنی کے نام {merchant_name} کے تحت اپنے اگلے کریڈٹ یا ڈیبٹ کارڈ کے بیان پر ذیل میں چارج دیکھیں گے.
zh_cn: 您的付款已成功。您将在公司名称{merchant_name}下的下一张信用卡或借记卡对帐单中看到以下费用。

source: Additional Resources
ar: موارد إضافية
ur: اضافی وسائل
zh_cn: 其他资源

source: Recipient Email:
ar: البريد الإلكتروني المستلم:
ur: وصول کنندہ کا ای میل:
zh_cn: 收件人电子邮件：

source: View Updated Library
ar: عرض المكتبة المحدثة
ur: تازہ کاری لائبریری دیکھیں
zh_cn: 查看更新的库

source: Access Settings
ar: إعدادات الوصول
ur: رسائی کی ترتیبات
zh_cn: 访问设置

source: %(platform_name)s on Twitter
ar: ٪ (platform_name) s على Twitter
ur: ٪ (پلیٹ فارم_ نام) ٹویٹر پر ہے
zh_cn: ％（平台名称）在Twitter上

source: Operators
ar: العاملين
ur: آپریٹرز
zh_cn: 运营商

source: Company Address
ar: عنوان الشركة
ur: کمپنی ایڈریس
zh_cn: 公司地址

source: No selected price or selected price is too low.
ar: لا يوجد سعر محدد أو سعر محدد منخفض للغاية.
ur: منتخب شدہ قیمت یا منتخب کردہ قیمت بہت کم ہے.
zh_cn: 没有选定的价格或选定的价格太低。

source: Due Date: {date}
ar: تاريخ الاستحقاق: {date}
ur: کی وجہ سے تاریخ: {تاریخ}
zh_cn: 到期日期：{date}

source: Inactive card or card not authorized for card-not-present transactions. Possible fix: retry with another form of payment
ar: بطاقة غير نشطة أو بطاقة غير مصرح بها للمعاملات غير الحالية. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: غیر فعال کارڈ یا کارڈ کارڈ نہیں موجود ٹرانزیکشن کے لئے مجاز نہیں ہے. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 无效卡或卡未经卡授权无法进行交易。可能的解决方法：使用其他付款方式重试

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
ar: إلى الحد الذي ترسل فيه أي محتوى إلى {platform_name} فيما يتعلق باستخدامك لواجهة برمجة التطبيقات أو أي من محتوى واجهة برمجة التطبيقات ، فإنك بذلك تمنح {platform_name} بطاقة عالمية ، غير حصرية وقابلة للنقل وقابلة للتخصيص وبدون ترخيص ، مدفوعة بالكامل حق ورخص دائم وغير قابل للإلغاء وترخيص لاستضافة أو نقل أو عرض أو تنفيذ أو إعادة إنتاج أو تعديل أو توزيع أو إعادة توزيع أو إعادة بيع أو استخدامًا آخر ، وإتاحة هذا المحتوى واستغلاله ، كليًا أو جزئيًا ، في أي في أي شكل من أشكال وسائل الإعلام ومن خلال أي قنوات وسائل الإعلام (المعروفة الآن أو المتقدمة في ما بعد).
ur: اس حد تک کہ آپ APIs یا کسی بھی API کے مواد کے استعمال کے سلسلے میں {platform_name} پر کسی بھی مواد کو جمع کرتے ہیں، آپ اس کے ذریعہ {platform_name} کو ایک عالمی، غیر خصوصی، منتقلی، قابل، قابل لائسنس یافتہ، مکمل طور پر ادا کردہ میزائل، منتقلی، ڈسپلے کرنے، دوبارہ، دوبارہ بنانے، ترمیم، تقسیم، دوبارہ تقسیم، دوبارہ استعمال، اور دوسری صورت میں استعمال کرنے کے لئے، رائلٹی فری، مستقل فارم اور کسی بھی میڈیا فارمیٹس میں اور کسی بھی ذرائع ابلاغ چینلز (اب نام سے جانا جاتا ہے یا بعد میں تیار کیا گیا ہے) کے ذریعہ.
zh_cn: 就您使用API​​或任何API内容而向{platform_name}提交任何内容的范围而言，您特此授予{platform_name}一项全球性，非独占性，可转让，可转让，可分许可，全额付款，免版税，永久的，不可撤销的权利和许可，以全部或部分的方式托管，转让，展示，执行，复制，修改，分发，重新分发，再许可和以其他方式使用，提供和利用此类内容形式和任何媒体格式，并通过任何媒体渠道（现在已知或以后开发）。

source: Other education
ar: تعليم الآخرين
ur: دیگر تعلیم
zh_cn: 其他教育

source: View Live Version
ar: عرض النسخة الحية
ur: لائیو ورژن ملاحظہ کریں
zh_cn: 查看Live版本

source: Verification Upgrade Deadline
ar: الموعد النهائي لترقية التحقق
ur: توثیق آخری تاریخ
zh_cn: 验证升级截止日期

source: Add Unit
ar: إضافة وحدة
ur: یونٹ شامل کریں
zh_cn: 添加单位

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
ar: يحتوي البرنامج الدراسي الجديد على مخطط الدورة التدريبية والمحتوى نفسه كما هو الحال في الدورة التدريبية الأصلية. يتم تكرار جميع المشاكل ومقاطع الفيديو والإعلانات وغيرها من الملفات إلى الدورة التدريبية الجديدة.
ur: نیا کورس ایک ہی کورس کے طور پر اور مواد اصل کورس کے طور پر مواد ہے. تمام مسائل، ویڈیوز، اعلانات، اور دیگر فائلوں کو نئے کورس میں نقل کیا جاتا ہے.
zh_cn: 新课程与原始课程具有相同的课程大纲和内容。所有问题，视频，公告和其他文件都将复制到新课程中。

source: Show all courses in organization:
ar: عرض جميع الدورات التدريبية في المنظمة:
ur: تنظیم میں تمام کورس دکھائیں:
zh_cn: 显示组织中的所有课程：

source: Why do I need to complete this information?
ar: لماذا أحتاج لإكمال هذه المعلومات؟
ur: مجھے اس معلومات کو مکمل کرنے کی ضرورت کیوں ہے؟
zh_cn: 为什么我需要填写这些信息？

source: Size
ar: بحجم
ur: سائز
zh_cn: 尺寸

source: Certificate has already been created.
ar: الشهادة قد تم إنشاؤها بالفعل.
ur: سرٹیفکیٹ پہلے سے ہی پیدا کیا گیا ہے.
zh_cn: 证书已经创建。

source: {platform_name} Support Levels:
ar: {platform_name} مستويات الدعم:
ur: {platform_name} سپورٹ کی سطح:
zh_cn: {platform_name}支持级别：

source: Allow the learner to take the exam again.
ar: السماح للمتعلم بإجراء الامتحان مرة أخرى.
ur: سیکھنے کو دوبارہ امتحان لینے کی اجازت دیں.
zh_cn: 让学习者再次参加考试。

source: Course Outline
ar: بالطبع مخطط
ur: کورس آؤٹ لائن
zh_cn: 课程大纲

source: The course team
ar: فريق الدورة
ur: کورس ٹیم
zh_cn: 课程团队

source: Price per student:
ar: السعر لكل طالب:
ur: فی فی طالب علم:
zh_cn: 每名学生的价格：

source: My Profile
ar: ملفي
ur: میری پروفائل
zh_cn: 我的简历

source: Article unlocked for editing
ar: المادة غير مقفلة للتحرير
ur: ترمیم کے لئے آرٹیکل کھلا
zh_cn: 文章解锁进行编辑

source: Content
ar: يحتوى
ur: مواد
zh_cn: 内容

source: Syllabus
ar: المنهج
ur: نصاب
zh_cn: 教学大纲

source: {platform_name} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
ar: يحتفظ المشاركون {platform_name} و {platform_name} بالحق في أي وقت وفقًا لتقديرهم الخاص في إلغاء أو تأخير أو إعادة جدولة أو تغيير تنسيق أي واجهة برمجة تطبيقات أو محتوى واجهة برمجة التطبيقات المقدم من خلال {platform_name} ، أو التوقف عن تقديم أي جزء أو كل واجهة برمجة التطبيقات أو محتوى واجهة برمجة التطبيقات أو الخدمات ذات الصلة ، وتوافق على عدم تحمل أي من {platform_name} أو أي من المشاركين {platform_name} أي مسؤولية تجاهك عن مثل هذا الإجراء.
ur: {platform_name} اور {platform_name} شرکاء کسی بھی وقت اپنے کسی صوابدید کو منسوخ کرنے، تاخیر کرنے، دوبارہ شیڈول کرنے یا کسی API یا API content {platform_name} کے ذریعہ پیش کردہ شکل میں تبدیل کرنے یا کسی بھی حصے یا کسی کو فراہم کرنے میں روکنے کے حق میں کسی بھی وقت حق محفوظ رکھتا ہے. APIs یا API مواد یا متعلقہ خدمات، اور آپ متفق ہیں کہ نہ ہی {platform_name} اور نہ ہی {platform_name} کے شرکاء اس طرح کے عمل کے لئے آپ کے لئے کوئی ذمہ داری ہوگی.
zh_cn: {platform_name}和{platform_name}参与者保留随时自行决定取消，延迟，重新安排或更改{platform_name}提供的任何API或API内容的格式的权利，或停止提供任何部分或全部API或API内容或相关服务，并且您同意{platform_name}和任何{platform_name}参与者都不会对此类行为承担任何责任。

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
ar: إذا كان هذا الخيار {em_start} محددًا {em_end} ، فسيتلقى المستخدمون إشعارًا عبر البريد الإلكتروني.
ur: اگر یہ اختیار {em_start} کی جانچ پڑتال {em_end} ہے، تو صارفین کو ایک ای میل اطلاع ملے گی.
zh_cn: 如果此选项被{em_start}选中{em_end}，用户将收到电子邮件通知。

source: Entrance Exam Minimum Score (%)
ar: مدخل الحد الأدنى لدرجة الامتحان (٪)
ur: داخلہ امتحان کم از کم اسکور (٪)
zh_cn: 入学考试最低分数（％）

source: On/Off switch.
ar: مفتاح تشغيل / إيقاف.
ur: پر / بند سوئچ.
zh_cn: 开/关。

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us immediately. Contact information is listed at:
ar: هذا لتأكيد أنك قمت بتغيير البريد الإلكتروني المرتبط بـ {platform_name} من {old_email} إلى {new_email}. إذا لم تقدم هذا الطلب ، فالرجاء الاتصال بنا فورًا. معلومات الاتصال مذكورة في:
ur: یہ اس بات کی تصدیق کرنا ہے کہ آپ نے {platform_name} سے {old_email} سے {new_email} پر منسلک ای میل کو تبدیل کردیا. اگر آپ نے یہ درخواست نہیں کی، تو براہ کرم ہم سے رابطہ کریں. رابطہ کی معلومات درج کی گئی ہے:
zh_cn: 这是为了确认您是否已将{platform_name}的电子邮件从{old_email}更改为{new_email}。如果您未提出此要求，请立即与我们联系。联系信息列于：

source: Unsupported Components
ar: مكونات غير مدعومة
ur: غیر معاون اجزاء
zh_cn: 不支持的组件

source: Data {em_start}not exported{em_end} with your course:
ar: لم يتم تصدير البيانات {em_start} {em_end} بالدورة التدريبية الخاصة بك:
ur: ڈیٹا {em_start} اپنے کورس کے ساتھ {em_end} برآمد نہیں کیا:
zh_cn: 数据{em_start}未按照您的课程导出{em_end}：

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
ar: للحصول على معلومات حول الدورة التدريبية ، انتقل إلى {link_start} {analytics_dashboard_name} {link_end}.
ur: اپنے کورس کے بارے میں تجزیات کیلئے، {link_start} {analytics_dashboard_name} {link_end} پر جائیں.
zh_cn: 有关课程的分析，请转至{link_start} {analytics_dashboard_name} {link_end}。

source: Profile
ar: الملف الشخصي
ur: پروفائل
zh_cn: 轮廓

source: Successfully changed due date for student {0} for {1} to {2}
ar: تم تغيير تاريخ الاستحقاق بنجاح للطالب {0} من {1} إلى {2}
ur: طالب علم {0} کے لئے {1} سے {2} تک کامیابی سے تاریخ بدل گیا
zh_cn: 成功将{1}的学生{0}的截止日期更改为{2}

source: Content Library
ar: مكتبة المحتوى
ur: مواد لائبریری
zh_cn: 内容库

source: Complete
ar: اكتمال
ur: مکمل
zh_cn: 完成

source: File {filename} exceeds maximum size of {maximum_size_in_megabytes} MB.
ar: يتجاوز الملف {filename} الحجم الأقصى {maximum_size_in_megabytes} ميغابايت.
ur: فائل {فائل نام} {maximum_size_in_megabytes} MB کے زیادہ سے زیادہ سائز سے زیادہ ہے.
zh_cn: 文件{文件名}超过{maximum_size_in_megabytes} MB的最大大小。

source: © {org_name}. All rights reserved except where noted. EdX, Open edX and their respective logos are trademarks or registered trademarks of edX Inc.
ar: © {org_name}. جميع الحقوق محفوظة باستثناء ما هو مذكور. EdX و Open EDX والشعارات الخاصة بها هي علامات تجارية أو علامات تجارية مسجلة لشركة edX Inc.
ur: © {org_name}. جہاں بھی ذکر کیا جاتا ہے اس کے علاوہ تمام حقوق محفوظ ہیں. ایڈ ایکس، اوپن EDX اور ان کے متعلقہ علامات EDX انکارپوریٹڈ کے ٹریڈ مارک یا رجسٹرڈ ٹریڈ مارک ہیں.
zh_cn: ©{org_name}。保留所有权利，除非另有说明。 EdX，Open edX及其各自的徽标是edX Inc.的商标或注册商标。

source: Status: {action} {succeeded} of {attempted}
ar: الحالة: {action} {succeeded} من {attemptpted}
ur: حیثیت: {کارروائی} {کامیاب} {کوشش کی}
zh_cn: 状态：{尝试} {动作} {成功}

source: LaTeX Source File Name
ar: LaTeX مصدر اسم الملف
ur: لاٹیکس ماخذ فائل کا نام
zh_cn: LaTeX源文件名

source: Article modified: %s
ar: تعديل المادة:٪ s
ur: آرٹیکل نظر ثانی شدہ:٪ s
zh_cn: 文章修改：％s

source: Your gender is required
ar: جنسك مطلوب
ur: آپ کی صنف کی ضرورت ہے
zh_cn: 您的性别是必需的

source: Unable to switch to specified branch. Please check your branch name.
ar: غير قادر على التبديل إلى الفرع المحدد. يرجى التحقق من اسم الفرع الخاص بك.
ur: مخصوص شاخ میں سوئچ کرنے میں قاصر. براہ مہربانی اپنے شاخ کا نام چیک کریں.
zh_cn: 无法切换到指定的分支。请检查你的分行名称。

source: Click to list certificates that are issued for this course:
ar: انقر لقائمة الشهادات الصادرة لهذه الدورة التدريبية:
ur: اس کورس کیلئے جاری کردہ سرٹیفکیٹ کی فہرست پر کلک کریں:
zh_cn: 点击以列出为此课程颁发的证书：

source: Indicates if this schedule is actively used
ar: يشير إلى ما إذا كان هذا الجدول يستخدم بشكل نشط
ur: اگر یہ شیڈول فعال طور پر استعمال کیا جاتا ہے تو اشارہ کرتا ہے
zh_cn: 指示是否正在使用此计划

source: List of urls of children that are references to external modules
ar: قائمة عناوين الأطفال التي تشير إلى الوحدات الخارجية
ur: بیرونی ماڈیولز کا حوالہ دیتے ہوئے بچوں کے یو آر ایل کی فہرست
zh_cn: 引用外部模块的儿童网址列表
