Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
ar: لم يتم إصدار شهادتك نظرًا لعدم وجود هوية تم التحقق منها حاليًا باستخدام {platform_name}.
ur: آپ کا سرٹیفکیٹ جاری نہیں کیا گیا کیونکہ آپ کو {platform_name} کے ساتھ موجودہ تصدیق شدہ شناخت نہیں ہے.
zh_cn: 您的证书未发布，因为您没有{platform_name}的当前验证身份。

source: Company Contact Name
ar: اسم جهة اتصال الشركة
ur: کمپنی کا رابطہ نام
zh_cn: 公司联系人姓名

source: Not Enrolled?
ar: لم يدرج اسمه؟
ur: اندراج نہیں کیا گیا؟
zh_cn: 没有注册？

source: Download All Invoices
ar: تحميل جميع الفواتير
ur: تمام انوائس ڈاؤن لوڈ کریں
zh_cn: 下载所有发票

source: Please wait a few minutes and then try again.
ar: الرجاء الانتظار بضع دقائق ثم حاول مرة أخرى.
ur: براہ کرم کچھ منٹ انتظار کریں اور پھر دوبارہ کوشش کریں.
zh_cn: 请等待几分钟，然后重试。

source: Cover Image
ar: صورة الغلاف
ur: کور تصویر
zh_cn: 封面图片

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
ar: لا يمكننا العثور على شهادة تحمل عنوان URL هذا أو رقم التعريف. إذا كنت تحاول التحقق من صحة شهادة ، فتأكد من صحة عنوان URL أو رقم المعرف. إذا كنت متأكدًا من صحة عنوان URL أو رقم المعرف ، فاتصل بالدعم.
ur: ہم اس URL یا ID نمبر کے ساتھ ایک سرٹیفکیٹ نہیں مل سکتے. اگر آپ ایک سرٹیفکیٹ کی توثیق کرنے کی کوشش کر رہے ہیں، تو یقینی بنائیں کہ URL یا ID نمبر درست ہے. اگر آپ اس بات کو یقینی بناتے ہیں کہ URL یا ID نمبر درست ہے تو، معاون سے رابطہ کریں.
zh_cn: 我们无法找到包含此网址或身份证号码的证书。如果您尝试验证证书，请确保URL或ID号码正确。如果您确定URL或ID号码正确，请联系支持人员。

source: Address Line 1
ar: العنوان الأول
ur: پتہ لائن 1
zh_cn: 地址栏1

source: Address Line 2
ar: سطر العنوان 2
ur: پتہ لائن 2
zh_cn: 地址栏2

source: Address Line 3
ar: سطر العنوان 3
ur: ایڈریس لائن 3
zh_cn: 地址线3

source: Don't forget to add a calendar reminder!
ar: لا تنس إضافة تذكير بالتقويم!
ur: کیلنڈر یاد دہانی شامل کرنے کے لئے مت بھولنا!
zh_cn: 不要忘记添加日历提醒！

source: Video Thumbnail Image
ar: فيديو صورة مصغرة
ur: ویڈیو تھمب نیل تصویر
zh_cn: 视频缩略图

source: Enrollment
ar: تسجيل
ur: اندراج
zh_cn: 注册

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
ar: تحتوي بعض المشكلات على خيارات مثل الحفظ أو إعادة التعيين أو التلميحات أو إظهار الإجابة. هذه الخيارات تتبع زر إرسال.
ur: کچھ مسائل ہیں جیسے اختیارات کو محفوظ، ری سیٹ، اشارہ، یا جواب دیں. یہ اختیارات جمع کرائیں بٹن پر عمل کریں.
zh_cn: 有些问题有诸如保存，重置，提示或显示答案等选项。这些选项按照提交按钮。

source: Time Limit in Minutes
ar: الحد الزمني في دقيقة
ur: منٹ میں وقت کی حد
zh_cn: 分钟的时间限制

source: Week 1
ar: الأسبوع 1
ur: ہفتہ 1
zh_cn: 第1周

source: Sorry! Our payment processor sent us back a message saying that you have cancelled this transaction. The items in your shopping cart will exist for future purchase. If you feel that this is in error, please contact us with payment-specific questions at {email}.
ar: آسف! أرسل إلينا معالج الدفع رسالة تفيد بإلغاء هذه المعاملة. ستكون العناصر الموجودة في سلة التسوق الخاصة بك للشراء في المستقبل. إذا كنت تشعر أن هذا خطأ ، فالرجاء الاتصال بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ہمارے ادائیگی کے پروسیسر نے ہمیں ایک پیغام واپس بھیج دیا ہے کہ آپ نے اس ٹرانزیکشن کو منسوخ کر دیا ہے. آپ کی خریداری کی ٹوکری میں اشیاء مستقبل کی خریداری کے لئے موجود ہیں. اگر آپ محسوس کرتے ہیں کہ یہ غلطی میں ہے، تو براہ مہربانی {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理商向我们发回了一条消息，表示您已取消此交易。购物车中的商品将存在以备将来购买。如果您认为这是错误的，请通过{email}与我们联系并提供特定付款问题。

source: Download CSV Reports
ar: تنزيل تقارير CSV
ur: CSV رپورٹس ڈاؤن لوڈ کریں
zh_cn: 下载CSV报告

source: Successful transaction.
ar: صفقة ناجحة.
ur: کامیاب ٹرانزیکشن.
zh_cn: 交易成功。

source: Enter the ids for the content groups this problem belongs to.
ar: أدخل معرفات مجموعات المحتوى التي تنتمي إليها هذه المشكلة.
ur: مواد گروپوں کے لئے ایڈز درج کریں اس مسئلہ کا تعلق ہے.
zh_cn: 输入此问题所属内容组的ID。

source: The file must be at least {image_min_size} in size.
ar: يجب أن يكون حجم الملف على الأقل {image_min_size}.
ur: فائل میں کم سے کم {image_min_size} سائز ہونا ضروری ہے.
zh_cn: 该文件的大小必须至少为{image_min_size}。

source: Course id is invalid
ar: معرف الدورة التدريبية غير صالح
ur: کورس کی شناخت غلط ہے
zh_cn: 课程编号无效

source: Enter true or false. If true, video caching will be used for HTML5 videos.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فسيتم استخدام التخزين المؤقت للفيديو لمقاطع فيديو HTML5.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، ویڈیو کیچنگ HTML5 ویڈیوز کیلئے استعمال کیا جائے گا.
zh_cn: 输入true或false。如果属实，则视频缓存将用于HTML5视频。

source: Invalid JSON response received from notes api.
ar: تم تلقي استجابة JSON غير صالحة من الملاحظات api.
ur: نوٹ اے پی سے وصول کردہ غلط JSON جواب.
zh_cn: 从笔记api收到无效的JSON响应。

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
ar: أضف التعليمات لمساعدة المتعلمين على فهم كيفية استخدام سحابة الكلمات. تعد الإرشادات الواضحة مهمة ، خاصة للمتعلمين الذين لديهم متطلبات إمكانية الوصول.
ur: سیکھنے والے بادلوں کو لفظ بادل استعمال کرنے کے بارے میں سمجھنے میں مدد کرنے کیلئے ہدایات شامل کریں. واضح ہدایات اہم ہیں، خاص طور پر سیکھنے والوں کے لئے جن کے پاس رسائی کی ضروریات ہیں.
zh_cn: 添加说明以帮助学习者了解如何使用词云。明确的说明非常重要，尤其对于有无障碍要求的学习者而言。

source: {html_start}This account has already been activated.{html_end}
ar: {html_start} تم تنشيط هذا الحساب بالفعل. {html_end}
ur: {html_start} یہ اکاؤنٹ پہلے ہی چالو کر دیا گیا ہے. {html_end}
zh_cn: {html_start}这个帐号已经被激活了{html_end}

source: Don't forget to upgrade to a verified certificate by {localized_date}.
ar: لا تنسَ الترقية إلى شهادة تم التحقق منها عن طريق {localized_date}.
ur: {localized_date} کی طرف سے ایک تصدیق شدہ سرٹیفکیٹ میں اپ گریڈ کرنا مت بھولنا.
zh_cn: 不要忘记通过{localized_date}升级到已验证的证书。

source: Auto Enroll
ar: التسجيل التلقائي
ur: آٹو اندراج
zh_cn: 自动注册

source: Unable to find any students with submissions to be {action}
ar: يتعذر العثور على أي طالب لديه إرسالات ليكون {action}
ur: {action} ہونے کی پیشکش کرنے والے کسی طالب علم کو تلاش کرنے میں قاصر
zh_cn: 无法找到任何提交的学生是{action}

source: Print this certificate
ar: اطبع هذه الشهادة
ur: اس سرٹیفکیٹ پرنٹ کریں
zh_cn: 打印此证书

source: Re-Verify for {course_name}
ar: أعد التحقق من {course_name}
ur: {course_name} کے لئے دوبارہ تصدیق کریں
zh_cn: 重新验证{course_name}

source: Custom Parameters
ar: المعلمات المخصصة
ur: اپنی مرضی کے پیرامیٹرز
zh_cn: 自定义参数

source: Verify My Identity
ar: تحقق من هويتي
ur: میری شناخت کی توثیق کریں
zh_cn: 验证我的身份

source: Course {course_id} not past the refund window.
ar: الدورة التدريبية {course_id} لم يتم تجاوز نافذة رد الأموال.
ur: کورس {course_id} رقم کی واپسی کی ونڈو نہیں ہے.
zh_cn: 课程{course_id}未超过退款窗口。

source: Course Video Thumbnail Image
ar: صورة فيديو المصغرة بالطبع
ur: کورس ویڈیو تھمب نیل تصویر
zh_cn: 课程视频缩略图

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
ar: أثناء تعديلك ، غيّر شخص آخر المراجعة. تم دمج محتوياتك تلقائيًا مع المحتويات الجديدة. يرجى مراجعة النص أدناه.
ur: جب آپ ترمیم کر رہے تھے، کسی اور نے نظر ثانی کی. آپ کے مواد کو نئے مواد کے ساتھ خود کار طریقے سے ضم کر دیا گیا ہے. ذیل میں متن کا جائزہ لیں.
zh_cn: 在您编辑时，其他人更改了修订版。您的内容已自动与新内容合并。请查看下面的文字。

source: Order Status:
ar: حالة الطلب:
ur: آرڈر کی حیثیت:
zh_cn: 订单状态：

source: Terms: Due Upon Receipt
ar: الشروط: المستحقة عند الاستلام
ur: شرائط: کی وجہ سے رسید پر
zh_cn: 条款：收到后付款

source: Unused bulk purchase seats (revenue at risk)
ar: مقاعد الشراء بالجملة غير المستخدمة (الإيرادات معرضة للخطر)
ur: غیر استعمال کردہ بلک خریداری کی نشستیں (خطرے میں آمدنی)
zh_cn: 未使用的批量购买席位（风险收入）

source: External Login Domain
ar: نطاق تسجيل الدخول الخارجي
ur: بیرونی لاگ ان ڈومین
zh_cn: 外部登录域

source: Add CCX Coach
ar: إضافة مدرب CCX
ur: CCX کوچ شامل کریں
zh_cn: 添加CCX教练

source: graded
ar: متدرج
ur: درجہ بندی
zh_cn: 分级

source: Text (.txt) file
ar: نص (.txt) ملف
ur: متن (.txt) فائل
zh_cn: 文本（.txt）文件

source: I just enrolled in {number} {title} through {account}: {url}
ar: لقد سجلت للتو في {number} {title} من خلال {account}: {url}
ur: میں نے صرف {نمبر} {عنوان} کے ذریعے {اکاؤنٹ}: {url} میں داخلا کیا
zh_cn: 我刚刚通过{帐户}注册了{number} {title}：{url}

source: Pending Tasks
ar: المهام العالقة
ur: منتقلی کے کام
zh_cn: 待完成的任务

source: Course Name
ar: اسم الدورة التدريبية
ur: کورس کا نام
zh_cn: 课程名

source: Specify the maximum team size and topics for teams inside the provided set of curly braces. Make sure that you enclose all of the sets of topic values within a set of square brackets, with a comma after the closing curly brace for each topic, and another comma after the closing square brackets. For example, to specify that teams should have a maximum of 5 participants and provide a list of 2 topics, enter the configuration in this format: {example_format}. In "id" values, the only supported special characters are underscore, hyphen, and period.
ar: حدد الحد الأقصى لحجم الفريق والمواضيع الخاصة بالفرق داخل المجموعة المتوفرة من الأقواس المتعرجة. تأكد من وضع جميع مجموعات قيم الموضوع ضمن مجموعة من الأقواس المربعة ، باستخدام فاصلة بعد قوس الإغلاق المجعد لكل موضوع ، وفاصلة أخرى بعد قوسين معقوفين. على سبيل المثال ، لتحديد أنه يجب أن يكون لدى الفريق 5 مشاركين كحد أقصى وأن يقدم قائمة بموضوعين ، أدخل التهيئة بهذا التنسيق: {example_format}. في قيم &quot;id&quot; ، تكون الأحرف الخاصة المعتمدة فقط هي الشرطة السفلية والواصلة والفترة.
ur: گھبراہٹ برعکس کے فراہم شدہ سیٹ کے اندر ٹیموں کے سائز اور موضوعات کو مقرر کریں. اس بات کو یقینی بنائیں کہ آپ موضوع کے تمام خاندانی اقدار کو ایک مربع بریکٹ کے اندر اندر، ہر موضوع کے لئے بند کرنے والی گھوبگھرالی کڑا کے بعد، اور اختتامی مربع بریکٹ کے بعد ایک اور کما کے بعد ایک کوما کے ساتھ منسلک کریں. مثال کے طور پر، اس ٹیموں کی وضاحت کرنے کے لئے زیادہ سے زیادہ 5 شرکاء اور 2 موضوعات کی ایک فہرست فراہم کرنا چاہئے، اس شکل میں ترتیب درج کریں: {example_format}. &quot;شناخت&quot; کے اقدار میں، واحد معاون خصوصی حروف زیر نگہداشت، ہائفن، اور مدت ہیں.
zh_cn: 为所提供的大括号内的团队指定团队的最大团队规模和主题。确保将所有主题值集合放在一组方括号内，每个主题的大括号后面带逗号，并且在方括号后面加上另一个逗号。例如，要指定小组最多应有5个参与者并提供2个主题的列表，请使用以下格式输入配置：{example_format}。在“id”值中，唯一支持的特殊字符是下划线，连字符和句点。

source: Completed by {date}
ar: اكتمل بحلول {date}
ur: {تاریخ} کی طرف سے مکمل
zh_cn: 由{date}完成

source: API Client Secret
ar: سر عميل واجهة برمجة التطبيقات
ur: API کلائنٹ خفیہ
zh_cn: API客户端密钥

source: Sorry! Your payment could not be processed because an unexpected exception occurred. Please contact us at {email} for assistance.
ar: آسف! تعذر معالجة دفعتك بسبب حدوث استثناء غير متوقع. يرجى الاتصال بنا على {email} للحصول على المساعدة.
ur: معاف کریں! آپ کی ادائیگی عملدرآمد نہیں کی جاسکتی ہے کیونکہ غیر متوقع استثنا ہوا. مدد کیلئے برائے مہربانی {ای میل} پر ہم سے رابطہ کریں.
zh_cn: 抱歉!由于发生意外异常，您的付款无法处理。请通过{email}与我们联系以寻求帮助。

source: Not sure yet
ar: لست متأكدا بعد
ur: ابھی تک یقین نہیں ہے
zh_cn: 尚未确定

source: Enter true or false. When true, students can see the calculator in the course.
ar: أدخل صح أو خطأ. عندما يكون ذلك صحيحًا ، يمكن للطلاب رؤية الآلة الحاسبة في الدورة التدريبية.
ur: صحیح یا غلط درج کریں. جب سچ ہو، طالب علم کورس میں کیلکولیٹر دیکھ سکتے ہیں.
zh_cn: 输入true或false。如果属实，学生可以在课程中看到计算器。

source: Enrollment Code Status
ar: حالة رمز التسجيل
ur: اندراج کوڈ کی حیثیت
zh_cn: 注册码状态

source: Collapse Instructions
ar: انهيار التعليمات
ur: بند کریں ہدایات
zh_cn: 折叠说明

source: Per Student
ar: لكل طالب
ur: فی طالب علم
zh_cn: 每名学生

source: cohorted
ur: حوصلہ افزائی

source: You save ${discount_value} {currency}
ar: يمكنك توفير $ {discount_value} {currency}
ur: آپ $ {ڈسکاؤنٹ_value} {کرنسی} محفوظ کریں
zh_cn: 您节省$ {discount_value} {currency}

source: Change or Leave Session
ar: تغيير أو مغادرة الجلسة
ur: سیشن تبدیل یا چھوڑ دیں
zh_cn: 更改或离开会话

source: previous
ar: سابق
ur: پچھلا
zh_cn: 以前

source: Print Certificate
ar: شهادة الطباعة
ur: پرنٹ سرٹیفکیٹ
zh_cn: 打印证书

source: Organization and Library Settings
ar: إعدادات المؤسسة والمكتبة
ur: تنظیم اور لائبریری کی ترتیبات
zh_cn: 组织和库设置

source: Credit requirement statuses
ar: حالات متطلبات الائتمان
ur: کریڈٹ کی ضروریات کی حیثیت
zh_cn: 信贷要求状态

source: Download Exported Library
ar: تحميل المكتبة المصدرة
ur: برآمد شدہ لائبریری ڈاؤن لوڈ کریں
zh_cn: 下载导出的库

source: This content group is in use and cannot be deleted.
ar: مجموعة المحتوى هذه قيد الاستخدام ولا يمكن حذفها.
ur: یہ مواد گروپ استعمال میں ہے اور خارج نہیں کیا جاسکتا ہے.
zh_cn: 此内容组正在使用中，无法删除。

source: Image Revsion: %d
ar: Revsion الصورة:٪ d
ur: تصویری Revsion:٪ d
zh_cn: 图像修改：％d

source: Individual Problems
ar: مشاكل فردية
ur: انفرادی مسائل
zh_cn: 个人问题

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
ar: خذ الدورة المحددة وحاول تصديرها إلى مستودع git. يجب أن يكون دليل الدورة بالفعل مستودع git. الاستخدام: git_export <course_loc><git_url>
ur: مخصوص کورس کو لے لو اور اسے گیٹ ذخیرہ میں برآمد کرنے کی کوشش کریں. کورس ڈائریکٹری پہلے سے ہی ایک گیٹ ذخیرہ ہونا ضروری ہے. استعمال: git_export <course_loc><git_url>
zh_cn: 采取指定的课程，并尝试将其导出到git存储库。课程目录必须已经是git存储库。用法：git_export <course_loc><git_url>

source: If you would like to regenerate your API client information, please use the form below.
ar: إذا كنت ترغب في إعادة إنشاء معلومات عميل واجهة برمجة التطبيقات ، فيرجى استخدام النموذج أدناه.
ur: اگر آپ اپنی API کلائنٹ کی معلومات کو دوبارہ حاصل کرنا چاہتے ہیں، تو براہ کرم ذیل میں فارم استعمال کریں.
zh_cn: 如果您想重新生成您的API客户端信息，请使用下面的表格。

source: Add tags that automatically highlight in a certain color using the comma-separated form, i.e. imagery:red,parallelism:blue
ar: أضف العلامات التي يتم تمييزها تلقائيًا بلون معين باستخدام النموذج المفصول بفواصل ، أي الصور: اللون الأحمر والتوازي: الأزرق
ur: ٹیگ شامل کریں جو خود بخود کوما الگ الگ شکل کا استعمال کرتے ہوئے کسی خاص رنگ میں نمایاں کریں، یعنی مثالی: سرخ، متوازی: نیلے رنگ
zh_cn: 添加使用逗号分隔形式（即图像：红色，平行度：蓝色）自动突出显示某种颜色的标签

source: Preparing
ar: خطة
ur: تیاری
zh_cn: 准备

source: Enrollment End Time
ar: وقت نهاية التسجيل
ur: اندراج ختم ہونے کا وقت
zh_cn: 注册结束时间

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
ar: لا يتم تقييد الوصول إلى هذا المكون ، ولكن قد تتأثر الرؤية بالإعدادات الموروثة.
ur: اس اجزاء تک رسائی محدود نہیں ہے، لیکن وراثت کی ترتیبات کی طرف سے اثر انداز ہوسکتا ہے.
zh_cn: 对此组件的访问不受限制，但可见性可能会受到继承设置的影响。

source: News
ar: أخبار
ur: خبریں
zh_cn: 新闻

source: Report a Problem
ar: الإبلاغ عن مشكلة
ur: مسئلے کے بارے میں بتائیے
zh_cn: 报告一个问题

source: You are already registered in course {course_id}.
ar: أنت مسجل بالفعل في الدورة التدريبية {course_id}.
ur: آپ پہلے سے کورس {کورس_ڈ} میں رجسٹرڈ ہیں.
zh_cn: 您已在课程{course_id}中注册。

source: Like {platform_name} on Facebook
ar: مثل {platform_name} على Facebook
ur: فیس بک پر {platform_name} کی طرح
zh_cn: 像Facebook上的{platform_name}一样

source: You have completed this course and are eligible to purchase course credit. Select <strong>Get Credit</strong> to get started.
ar: لقد أكملت هذه الدورة التدريبية وكنت مؤهلاً لشراء رصيد الدورة. حدد <strong>الحصول على الائتمان</strong> للبدء.
ur: آپ نے یہ کورس مکمل کیا ہے اور کورس کریڈٹ خریدنے کے اہل ہیں. شروع کرنے کیلئے <strong>کریڈٹ حاصل کریں</strong> .
zh_cn: 您已完成本课程并有资格购买课程学分。选择<strong>获取积分</strong>开始。

source: Bookmark this page
ar: ضع علامة على هذه الصفحة
ur: اس صفحہ پر نشانی لگائیں
zh_cn: 收藏此页

source: Reset
ar: إعادة تعيين
ur: ری سیٹ کریں
zh_cn: 重启

source: Force publishing course is not supported with old mongo courses.
ar: لا يتم دعم الدورة التدريبية عبر النشر باستخدام دورات mongo القديمة.
ur: پرانے منگو کورسوں کے ساتھ پبلک پبلشنگ کورس کی حمایت نہیں کی جاتی ہے.
zh_cn: 老芒戈课程不支持部队发布课程。

source: You have signed out.
ar: لقد خرجت.
ur: آپ نے دستخط کیا ہے.
zh_cn: 你已经退出。

source: There was an error processing your redeem code.
ar: حدث خطأ أثناء معالجة رمز الاسترداد.
ur: آپ کے موصول ہونے والے کوڈ پر عملدرآمد میں ایک خرابی تھی.
zh_cn: 处理您的兑换码时出错。

source: Executive Summary for {display_name}
ar: الملخص التنفيذي لـ {display_name}
ur: {display_name} کے لئے ایگزیکٹو خلاصہ
zh_cn: {display_name}的执行摘要

source: unenrolled
ar: تم إلغاء التسجيل
ur: نام نہاد
zh_cn: 未登记

source: Error:
ar: خطأ:
ur: غلطی:
zh_cn: 错误：

source: Page Actions
ar: إجراءات الصفحة
ur: صفحہ اعمال
zh_cn: 页面操作

source: Course options for
ar: خيارات الدورة التدريبية لـ
ur: کورس کے اختیارات کے لئے
zh_cn: 课程选项

source: (Prerequisite required)
ar: (المتطلب السابق مطلوب)
ur: (لازمی شرط)
zh_cn: （需要先决条件）

source: Error uploading file. Please contact the site administrator. Thank you.
ar: خطأ في تحميل الملف. يرجى الاتصال بمدير الموقع. شكرا لكم.
ur: فائل اپ لوڈ کرنے میں خرابی براہ کرم سائٹ ایڈمنسٹریشن سے رابطہ کریں. شکریہ
zh_cn: 上传文件时出错。请联系网站管理员。谢谢。

source: CCX Coach
ar: مدرب CCX
ur: CCX کوچ
zh_cn: CCX教练

source: {student_name}, you are no longer eligible for credit in this course.
ar: {student_name} ، لم تعد مؤهلاً للحصول على رصيد في هذه الدورة التدريبية.
ur: {student_name}، آپ اب اس کورس میں کریڈٹ کے اہل نہیں ہیں.
zh_cn: {student_name}，您不再有资格在本课程中获得学分。

source: No end date set
ar: لا يوجد تاريخ انتهاء محدد
ur: کوئی اختتامی تاریخ مقرر نہیں ہے
zh_cn: 没有结束日期集

source: Learning is More than Just Lectures
ar: التعلم أكثر من مجرد محاضرات
ur: سیکھنا بس لکچر سے زیادہ ہے
zh_cn: 学习不仅仅是讲座

source: Specify what student can learn from the course.
ar: حدد ما يمكن للطالب تعلمه من الدورة التدريبية.
ur: اس بات کا تعین کریں کہ طالب علم کورس سے سیکھ سکتے ہیں.
zh_cn: 指定学生可以从课程中学到什么。

source: Static Asset Path
ar: مسار الأصول الثابتة
ur: جامد اثاثہ راہ
zh_cn: 静态资产路径

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
ar: إذا تم تعيين هذا الخيار ، فسيقتصر وقت تسجيل المستخدمين الذين يستخدمون موفر خدمة الدخول الموحد هذا على مدة أطول من هذه القيمة. إذا تم الضبط على 0 (صفر) ، فستنتهي الجلسة عند قيام المستخدم بإغلاق المتصفح الخاص به. إذا تم تركه فارغًا ، فسيتم استخدام الطول الافتراضي لجلسة Django.
ur: اگر یہ اختیار سیٹ کیا جاتا ہے تو، اس ایس ایس او کے فراہم کنندہ کو استعمال کرتے ہوئے لاگ ان کرنے والوں کو ان کا سیشن کی لمبائی اس قدر سے کہیں زیادہ محدود نہیں ہوگی. اگر سیٹ 0 (صفر) ہو تو، سیشن ان براؤزر کو بند کرنے والے صارف پر ختم ہوجائے گا. اگر خالی چھوڑ دیا جائے تو، Django پلیٹ فارم سیشن ڈیفالٹ لمبائی استعمال کیا جائے گا.
zh_cn: 如果设置了此选项，则使用此SSO提供程序登录的用户将其会话长度限制为不超过此值。如果设置为0（零），则会话将在用户关闭浏览器时过期。如果留空，则将使用Django平台会话默认长度。

source: Your E-mail Address
ar: عنوان بريدك الإلكتروني
ur: آپ کا ای میل ایڈریس
zh_cn: 您的电子邮件地址

source: Get Credit
ar: الحصول على الائتمان
ur: کریڈٹ حاصل کریں
zh_cn: 获得信用

source: Graded
ar: متدرج
ur: درجہ بندی
zh_cn: 分级

source: E-mail change successful!
ar: تغيير البريد الإلكتروني بنجاح!
ur: ای میل تبدیل کامیاب!
zh_cn: 电子邮件变更成功！

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
ar: لقد تم رفض طلبك الخاص بتأليف الدورات التدريبية في {studio_name}. يرجى {link_start} الاتصال بـ {platform_name} Staff with additional questions {link_end}.
ur: {studio_name} میں مصنف کورسز کی درخواست رد کردی گئی ہے. براہ مہربانی {link_start} رابطہ {platform_name} اسٹاف مزید سوالات {link_end} کے ساتھ کریں.
zh_cn: 您在{studio_name}中创作课程的请求已被拒绝。请{link_start}联系{platform_name}工作人员，其他问题{link_end}。

source: An error occurred when signing you in to {platform_name}.
ar: حدث خطأ عند تسجيل دخولك إلى {platform_name}.
ur: {platform_name} میں سائن ان کرتے وقت ایک خرابی واقع ہوئی.
zh_cn: 登录到{platform_name}时发生错误。

source: Have a {strong_start}question about something specific{strong_end}? You can contact the {platform_name} general support team directly:
ar: هل لديك سؤال {strong_start} حول شيء محدد {strong_end}؟ يمكنك الاتصال بفريق الدعم العام {platform_name} مباشرةً:
ur: کچھ مخصوص {strong_end} کے بارے میں {strong_start} سوال پوچھیں؟ آپ براہ راست {platform_name} عام سپورٹ ٹیم سے رابطہ کر سکتے ہیں:
zh_cn: 对特定的{strong_end}有一个{strong_start}问题？您可以直接联系{platform_name}一般支持团队：

source: List of Courses
ar: قائمة الدورات
ur: کورسز کی فہرست
zh_cn: 课程列表

source: The {platform_name} team
ar: فريق {platform_name}
ur: {platform_name} ٹیم
zh_cn: {platform_name}团队

source: Default Video URL
ar: عنوان URL الافتراضي للفيديو
ur: پہلے سے طے شدہ ویڈیو یو آر ایل
zh_cn: 默认视频网址

source: %s discussion started
ar: بدأ النقاش٪ s
ur: ٪ s بحث شروع ہوگئی ہے
zh_cn: ％s的讨论开始了

source: LMS Administration
ar: إدارة LMS
ur: LMS انتظامیہ
zh_cn: LMS管理

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
ar: حدث خطأ في النظام أثناء معالجة الدورة التدريبية. الرجاء الانتقال إلى الدورة التدريبية الأصلية لتجربة إعادة التشغيل مرة أخرى ، أو الاتصال بمسؤولك للحصول على المساعدة.
ur: آپ کے کورس پر عملدرآمد کے دوران ایک نظام کی خرابی واقع ہوئی. براہ کرم دوبارہ دوبارہ دوبارہ کوشش کرنے کے لئے اصل کورس پر جائیں، یا مدد کے لئے اپنے PM سے رابطہ کریں.
zh_cn: 正在处理课程时发生系统错误。请转到原始课程再次尝试再次运行，或联系您的PM以寻求帮助。

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible fix: retry with another form of payment
ar: بطاقة منتهية الصلاحية. قد تتلقى أيضًا هذا إذا كان تاريخ انتهاء الصلاحية الذي قدمته لا يتطابق مع تاريخ وجود المصرف المُصدر في الملف. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: متوقع کارڈ. آپ یہ بھی وصول کرسکتے ہیں اگر آپ کی مدت ختم ہونے والی تاریخ آپ جاری کردہ بینک سے فائل سے متفق نہیں ہے تو فائل پر ہے. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 过期的卡。如果您提供的到期日与开证银行存档的日期不符，您也可能会收到此信息。可能的解决方法：使用其他付款方式重试

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
ar: يوجد حساب بالبريد الإلكتروني {email} ولكن اسم المستخدم المتوفر {username} مختلف. التسجيل على أي حال باستخدام {email}.
ur: ای میل کے ساتھ ایک اکاؤنٹ {ای میل} موجود ہے لیکن فراہم کردہ صارف نام {صارف کا نام} مختلف ہے. ویسے بھی {ای میل} کے ساتھ داخلہ.
zh_cn: 存在包含电子邮件{email}的帐户，但提供的用户名{username}不同。无论如何都使用{email}注册。

source: Powered by Open edX
ar: مدعوم من Open EDX
ur: کھولیں edX کے ذریعہ
zh_cn: 技术支持Open edX

source: YouTube Video
ar: فيديو يوتيوب
ur: YouTube ویڈیو
zh_cn: YouTube视频

source: Entrance Exam
ar: امتحان القبول
ur: داخلے کا امتحان
zh_cn: 入学考试

source: New Assignment Type
ar: نوع الواجب الجديد
ur: نیا تفویض کی قسم
zh_cn: 新分配类型

source: Count of Students
ar: عدد الطلاب
ur: طلباء کا شمار
zh_cn: 学生数量

source: New Page
ar: صفحة جديدة
ur: نیا صفحہ
zh_cn: 新一页

source: Basic Course Information
ar: معلومات الدورة الأساسية
ur: بنیادی کورس کی معلومات
zh_cn: 基本课程信息

source: The specified remote branch is not available.
ar: الفرع البعيد المحدد غير متوفر.
ur: مخصوص ریموٹ شاخ دستیاب نہیں ہے.
zh_cn: 指定的远程分支不可用。

source: You can restrict access to this component to learners in specific content groups.
ar: يمكنك تقييد الوصول إلى هذا المكون للمتعلمين في مجموعات محتوى محددة.
ur: آپ مخصوص مواد کے گروپوں میں سیکھنے والوں کو اس جزو تک رسائی محدود کر سکتے ہیں.
zh_cn: 您可以限制特定内容组中的学习者访问此组件。

source: Dear [[Name]]:
ar: عزيزي [[الاسم]]:
ur: عزیز [[نام]]:
zh_cn: 亲爱的[[姓名]]：

source: Disable User Account
ar: تعطيل حساب المستخدم
ur: صارف کا اکاؤنٹ غیر فعال کریں
zh_cn: 禁用用户帐户

source: Pre-Course Survey
ar: مسح ما قبل الدورة
ur: پری کورس سروے
zh_cn: 课前调查

source: Custom Evaluated Script
ar: سيناريو مخصص مقيم
ur: اپنی مرضی کے اندازہ شدہ سکرپٹ
zh_cn: 自定义评估脚本
