Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: e.g. UniversityX or OrganizationX
ar: على سبيل المثال UniversityX أو OrganizationX
ur: مثال کے طور پر یونیورسٹی ایکس یا تنظیم ایکس
zh_cn: 例如UniversityX或OrganizationX

source: LTI URL
ar: عنوان LTI
ur: LTI یو آر ایل

source: All Learners and Staff
ar: جميع المتعلمين والموظفين
ur: تمام سیکھنے اور اسٹاف
zh_cn: 所有学习者和工作人员

source: Learn more about component containers
ar: تعرف على المزيد حول حاويات المكونات
ur: اجزاء کنٹینرز کے بارے میں مزید جانیں
zh_cn: 详细了解组件容器

source: Customer Reference Number: {reference_number}
ar: الرقم المرجعي للعميل: {reference_number}
ur: کسٹمر حوالہ نمبر: {حوالہ نمبر}
zh_cn: 客户参考号码：{reference_number}

source: Disclaimer of Warranty / Limitation of Liabilities
ar: إخلاء المسؤولية عن الضمان / تحديد المسؤولية
ur: وارنٹی / ذمہ داریوں کی حد کا اعلان
zh_cn: 免责声明/责任限制

source: Insert a dropdown response
ar: أدخل استجابة منسدلة
ur: ڈراپ ڈاؤن جواب داخل کریں
zh_cn: 插入下拉式回复

source: Regenerate Certificates
ar: إعادة توليد الشهادات
ur: سرٹیفکیٹ دوبارہ بنائیں
zh_cn: 重新生成证书

source: processing
ar: معالجة
ur: پروسیسنگ
zh_cn: 处理

source: Your {cert_name_short} is Generating
ar: تم إنشاء {cert_name_short} لديك
ur: آپ {cert_name_short} پیدا کر رہا ہے
zh_cn: 您的{cert_name_short}正在生成

source: Custom pages
ar: صفحات مخصصة
ur: اپنی مرضی کے صفحات
zh_cn: 自定义页面

source: Enter one or more email addresses or usernames separated by new lines or commas.
ar: أدخل عنوان بريد إلكتروني واحدًا أو أكثر أو أسماء مستخدمين مفصولة بخطوط أو فواصل جديدة.
ur: ایک یا زیادہ ای میل پتوں یا نئی لائنوں یا کمانڈ کی طرف سے علیحدہ صارف نام درج کریں.
zh_cn: 输入一个或多个电子邮件地址或以新行或逗号分隔的用户名。

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
ar: يحدد متى تظهر إجابة المشكلة. يمكن ضبط القيمة الافتراضية في الإعدادات المتقدمة.
ur: جب اس مسئلے کے جواب کو ظاہر کرنے کی وضاحت کرتا ہے. ایک ڈیفالٹ قدر اعلی درجے کی ترتیبات میں مقرر کیا جا سکتا ہے.
zh_cn: 定义何时显示问题的答案。可以在高级设置中设置默认值。

source: ACE Common
ar: ايس المشترك
ur: ای سی ای کامن
zh_cn: ACE通用

source: Policies
ar: سياسات
ur: پالیسییں
zh_cn: 政策

source: There was an error saving changes.
ar: حدث خطأ في حفظ التغييرات.
ur: تبدیلیاں بچانے میں ایک خرابی تھی.
zh_cn: 保存更改时发生错误。

source: The default speed for the video.
ar: السرعة الافتراضية للفيديو.
ur: ویڈیو کیلئے ڈیفالٹ رفتار.
zh_cn: 视频的默认速度。

source: No user with that username
ar: لا يوجد مستخدم بهذا الاسم
ur: اس صارف کے ساتھ کوئی صارف نہیں
zh_cn: 没有该用户名的用户

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
ar: تتجاوز أي سياسات تقوم بتعديلها هنا جميع المعلومات الأخرى التي قمت بتعريفها في مكان آخر في {studio_name}. لا تعدّل السياسات ما لم تكن معتادًا على كلٍّ من الغرض والصياغة.
ur: آپ کی کوئی بھی پالیسی جس میں آپ ترمیم کرتے ہیں وہ دوسری دوسری معلومات جنہیں آپ نے {سٹوڈیو_ نام} میں کہیں اور بیان کیا ہے. پالیسیوں میں ترمیم نہ کریں جب تک آپ ان کے مقصد اور نحو دونوں سے واقف نہیں ہیں.
zh_cn: 您在此处修改的任何政策都会覆盖您在{studio_name}中其他地方定义的所有其他信息。除非您熟悉目的和语法，否则不要编辑策略。

source: Long Term Cache Time To Live
ar: وقت طويل للذاكرة المؤقتة للعيش
ur: طویل مدتی کیش وقت رہنے کا وقت ہے
zh_cn: 长期缓存时间

source: Enter and confirm your new password.
ar: أدخل وتأكيد كلمة المرور الجديدة.
ur: درج کریں اور اپنے نئے پاس ورڈ کی تصدیق کریں.
zh_cn: 输入并确认您的新密码。

source: Invalid card verification number (CVN). Possible action: retry with another form of payment.
ar: رقم التحقق من البطاقة غير صالح (CVN). الإجراء المحتمل: إعادة المحاولة باستخدام طريقة دفع أخرى.
ur: غلط کارڈ کی توثیق نمبر (CVN). ممنوعہ عمل: ادائیگی کے کسی دوسرے قسم کے ساتھ دوبارہ کوشش کریں.
zh_cn: 无效的卡验证号码（CVN）。可能的行动：以另一种形式的付款重试。

source: New score for problem, out of the total points available for the problem
ar: درجة جديدة للمشكلة ، من إجمالي النقاط المتاحة للمشكلة
ur: مسئلہ کے لئے دستیاب تمام پوائنٹس سے باہر، مسئلہ کے لئے نیا سکور
zh_cn: 问题的新分数，可用于问题的总分数

source: While you tried to delete this article, it was modified. TAKE CARE!
ar: أثناء محاولة حذف هذه المقالة ، تم تعديلها. اعتن بنفسك!
ur: جب آپ نے اس مضمون کو حذف کرنے کی کوشش کی، تو اسے نظر ثانی کی گئی. اپنا خیال رکھنا!
zh_cn: 当您尝试删除这篇文章时，它已被修改。保重！

source: New Team Member Information
ar: معلومات أعضاء الفريق الجديد
ur: نئی ٹیم کے رکن کی معلومات
zh_cn: 新的团队成员信息

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
ar: انقر على رمز {strong_start} تعديل {strong_end} في أحد المكونات لتحرير محتواه.
ur: اس مواد کو ترمیم کرنے کیلئے ایک مضبوط حصے میں {strong_start} ترمیم کریں {strong_end} آئکن پر کلک کریں.
zh_cn: 点击组件中的{strong_start}编辑{strong_end}图标以编辑其内容。

source: Specify the extension due date and time (in UTC; please specify {format_string}).
ar: حدد تاريخ ووقت تمديد الإضافة (بالتوقيت العالمي المنسق ، يرجى تحديد {format_string}).
ur: توسیع کی وجہ سے تاریخ اور وقت کی وضاحت کریں (UTC میں؛ براہ کرم {format_string} کی وضاحت کریں).
zh_cn: 指定延期截止日期和时间（以UTC表示;请指定{format_string}）。

source: {open_enroll_link}Enroll now{close_enroll_link} to access the full course.
ar: {open_enroll_link} التسجيل الآن {close_enroll_link} للوصول إلى الدورة التدريبية الكاملة.
ur: {open_enroll_link} مکمل کورس تک رسائی حاصل کرنے کیلئے {close_enroll_link} درج کریں.
zh_cn: {open_enroll_link}立即注册{close_enroll_link}以访问完整课程。

source: Search the course
ar: البحث في الدورة
ur: کورس تلاش کریں
zh_cn: 搜索课程

source: Download Video
ar: تحميل الفيديو
ur: ویڈیو ڈاؤن لوڈ کریں
zh_cn: 下载视频

source: Username created for Video Pipeline Integration, e.g. veda_service_user.
ar: اسم المستخدم الذي تم إنشاؤه لتكامل خط أنابيب الفيديو ، على سبيل المثال veda_service_user.
ur: صارف پائپ لائن انٹیگریشن کے لئے پیدا کردہ صارف کا نام، مثال کے طور پر veda_service_user.
zh_cn: 视频管道集成创建的用户名，例如veda_service_user。

source: Register for {platform_name}
ar: التسجيل في {platform_name}
ur: {platform_name} کے لئے رجسٹر کریں
zh_cn: 注册{platform_name}

source: Certificate unavailable
ar: الشهادة غير متاحة
ur: سرٹیفکیٹ دستیاب نہیں ہے
zh_cn: 证书不可用

source: This revision has been deleted.
ar: تم حذف هذه المراجعة.
ur: یہ نظر ثانی ختم ہوگئی ہے.
zh_cn: 此修订已被删除。

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فسيتم النظر في إرسالات الردود على وحدات المشكلة في خوارزمية تسجيل / اختبار اجتياز اختبار الدخول.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، مسئلے کے ماڈیولز کے لئے جمع کرانے کے لئے جمع کرائیں گے انٹری امتحان کے اسکور / گیٹنگ الگورتھم میں.
zh_cn: 输入true或false。如果属实，则在考试评分/门控算法中将考虑提交问题模块。

source: Your answers have been saved.
ar: تم حفظ إجاباتك.
ur: آپ کے جوابات محفوظ کیے گئے ہیں.
zh_cn: 您的答案已保存。

source: About to refund this order:
ar: بصدد استرداد هذا الطلب:
ur: اس حکم کی واپسی کے بارے میں:
zh_cn: 关于退还此订单：

source: Why export a library?
ar: لماذا تصدير مكتبة؟
ur: کیوں ایک لائبریری برآمد؟
zh_cn: 为什么要出口图书馆？

source: View Details
ar: عرض التفاصيل
ur: تفصیلات دیکھیں
zh_cn: 查看详情

source: Enter your full name.
ar: أدخل اسمك الكامل.
ur: اپنا پورا نام درج کریں.
zh_cn: 输入您的全名。

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
ar: تقدم {platform_name} الآن مساعدة مالية للمتعلمين الذين يرغبون في الحصول على شهادات تم التحقق منها ولكنهم قد لا يتمكنون من دفع رسوم شهادة التحقق. قد يتلقى المتدربون المؤهلون ما يصل إلى 90 {percent_sign} من رسوم شهادة التحقق لدورة تدريبية. لتقديم طلب للحصول على مساعدة مالية ، قم بالتسجيل في مسار التدقيق لدورة تقدم شهادات تم التحقق منها ، ثم أكمل هذا التطبيق. لاحظ أنه يجب عليك إكمال طلب منفصل لكل دورة دراسية تتخذها. نحن نخطط لاستخدام هذه المعلومات لتقييم طلبك للحصول على المساعدة المالية ومواصلة تطوير برنامج المساعدات المالية لدينا.
ur: {platform_name} اب سیکھنے والوں کے لئے مالی مدد فراہم کرتا ہے جو تصدیق شدہ سرٹیفکیٹ حاصل کرنا چاہتے ہیں لیکن جو تصدیق شدہ سرٹیفکیٹ فیس ادا نہیں کرسکتے ہیں. مستحکم سیکھنے والے کورس کیلئے تصدیق شدہ سرٹیفکیٹ فیس سے 90 {percent_sign} وصول کرسکتے ہیں. مالی امداد کے لئے درخواست دینے کے لئے، اس کورس کے لئے آڈٹ ٹریک میں داخلہ درج کریں جو تصدیق شدہ سرٹیفکیٹ پیش کرتا ہے، اور پھر اس درخواست کو مکمل کریں. نوٹ کریں کہ آپ ہر کورس کے لۓ الگ الگ درخواست مکمل کریں. ہم اس معلومات کو استعمال کرتے ہیں کہ آپ کی مالی امداد کے لئے آپ کی درخواست کا جائزہ لینے اور اپنے مالی مدد کے پروگرام کو مزید فروغ دینے کے لۓ.
zh_cn: {platform_name}现在为希望获得认证证书但无法支付认证证书费用的学习者提供经济援助。符合条件的学员可以从课程的验证证书费用中获得高达90％的{percent_sign}。要申请经济援助，请登录提供已验证证书的课程的审核跟踪，然后填写此申请。请注意，您必须为每门课程分别填写一份申请表。我们计划使用这些信息来评估您的财务援助申请，并进一步发展我们的财务援助计划。

source: Certificates Display Behavior
ar: سلوك عرض الشهادات
ur: سرٹیفیکیٹ ڈسپلے رویے
zh_cn: 证书显示行为

source: You do not have permission to view this page.
ar: ليس لديك إذن لعرض هذه الصفحة.
ur: آپ کو اس صفحہ کو دیکھنے کی اجازت نہیں ہے.
zh_cn: 您无权查看此页面。

source: %(platform_name)s on LinkedIn
ar: ٪ (platform_name) s على LinkedIn
ur: ٪ (پلیٹ فارم_ نام) لنکڈ ان پر ہے
zh_cn: ％（platform_name）在LinkedIn上

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
ar: عملية الاستيراد لديها خمس مراحل. خلال المرحلتين الأوليتين ، يجب عليك البقاء على هذه الصفحة. يمكنك ترك هذه الصفحة بعد اكتمال مرحلة تفريغ الأمتعة. ومع ذلك ، نوصي بعدم إجراء تغييرات مهمة على مكتبتك حتى تكتمل عملية الاستيراد.
ur: درآمد کے عمل میں پانچ مراحل ہیں. پہلے دو مراحل کے دوران آپ کو اس صفحہ پر رہنا ہوگا. آپ اس صفحہ کو چھوڑ کر انفارمیشن مرحلے کو مکمل کر سکتے ہیں. تاہم، ہم سفارش کرتے ہیں کہ آپ اپنے لائبریری میں اہم تبدیلیاں نہ کریں جب تک کہ درآمدی کارروائی مکمل ہوجائے.
zh_cn: 进口过程分为五个阶段。在前两个阶段，你必须留在这个页面上。您可以在拆箱阶段完成后离开此页面。但是，我们建议您在导入操作完成之前不要对库进行重要更改。

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
ar: يتيح لك التسجيل مع {platform_name} الوصول إلى جميع دوراتنا المجانية الحالية والمستقبلية. غير مستعد لأخذ دورة تدريبية بعد؟ يسجلك التسجيل في قائمتنا البريدية - سنقوم بتحديثك مع إضافة الدورات التدريبية.
ur: {platform_name} کے ساتھ رجسٹریشن آپ کو ہمارے موجودہ اور مستقبل کے مفت کورسز تک رسائی فراہم کرتا ہے. کورس ابھی تک لینے کے لئے تیار نہیں ہے؟ رجسٹریشن آپ کو ہماری میلنگ کی فہرست پر رکھتا ہے - ہم آپ کو اپ ڈیٹ کریں گے جیسے کورسز شامل ہیں.
zh_cn: 通过{platform_name}注册，您可以访问我们当前和未来的所有免费课程。还没准备好参加课程？注册将您置于我们的邮件列表中 - 我们将在添加课程时更新您的信息。

source: I agree to the {link_start}Honor Code{link_end}
ar: أوافق على {link_start} قانون الشرف {link_end}
ur: میں {link_start} اعزاز کوڈ {link_end} سے متفق ہوں
zh_cn: 我同意{link_start}荣誉代码{link_end}

source: Increase
ar: زيادة
ur: اضافہ
zh_cn: 增加

source: content type
ar: نوع المحتوى
ur: مواد کی قسم
zh_cn: 内容类型

source: Unable to create course '{name}'. {err}
ar: يتعذر إنشاء الدورة التدريبية &quot;{name}&quot;. {يخطئ}
ur: کورس &#39;{نام}&#39; بنانے میں ناکام. {غلط}
zh_cn: 无法创建课程“{name}”。 {呃}

source: ID Verification
ar: التحقق من الهوية
ur: ID کی توثیق
zh_cn: 身份验证

source: Partially correct ({progress} point)
ar: صحيح جزئيا (نقطة التقدم)
ur: جزوی طور پر صحیح ({ترقی} نقطہ)
zh_cn: 部分正确（{progress}点）

source: {num_emails} sent
ar: تم إرسال {num_emails}
ur: {num_emails} بھیجا گیا
zh_cn: {num_emails}发送

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
ar: أدخل رقم الدورة التدريبية الذي تريده أن يظهر في الدورة التدريبية. يتجاوز هذا الإعداد رقم الدورة التدريبية الذي قمت بإدخاله عند إنشاء الدورة التدريبية. لاستخدام رقم الدورة التدريبية الذي قمت بإدخاله عند إنشاء الدورة التدريبية ، أدخل null.
ur: کورس نمبر درج کریں جسے آپ کورس میں پیش کرنا چاہتے ہیں. یہ ترتیب آپ کورس کا آغاز کرتے وقت کورس نمبر پر اترتا ہے. جب آپ کورس تیار کرتے وقت کورس نمبر نمبر کا استعمال کرنے کے لئے، نوک درج کریں.
zh_cn: 输入您想要在课程中出现的课程编号。此设置会覆盖您创建课程时输入的课程编号。要使用创建课程时输入的课程编号，请输入null。

source: Delete article
ar: حذف المادة
ur: مضمون حذف کریں
zh_cn: 删除文章

source: Secondary/high school
ar: المدرسة الثانوية
ur: ثانوی / ہائی اسکول
zh_cn: 中学/高中

source: Export Succeeded
ar: نجح التصدير
ur: برآمد کامیاب ہوگیا
zh_cn: 导出成功

source: Order History
ar: تاريخ الطلب
ur: آرڈر کی تاریخ
zh_cn: 订单历史

source: You're almost there!
ar: أنت على وشك الانتهاء
ur: آپ تقریبا وہاں ہیں!
zh_cn: 你快到了！

source: You must be signed in to {platform_name} to create a certificate.
ar: يجب تسجيل الدخول إلى {platform_name} لإنشاء شهادة.
ur: ایک سرٹیفکیٹ بنانے کیلئے آپ کو {platform_name} میں سائن ان ہونا ضروری ہے.
zh_cn: 您必须登录{platform_name}才能创建证书。

source: Start Grading!
ar: بدء الدرجات!
ur: گریڈنگ شروع کرو!
zh_cn: 开始评分！

source: Enrollment in {course_name} was not complete.
ar: لم يكتمل التسجيل في {course_name}.
ur: {course_name} میں داخلہ مکمل نہیں ہوا.
zh_cn: {course_name}中的注册未完成。

source: Dropdown
ar: اسقاط
ur: نیچے گرجانا
zh_cn: 落下

source: Don't enroll
ar: لا تسجل
ur: اندراج نہ کریں
zh_cn: 不要报名

source: This field is not editable
ar: هذا الحقل غير قابل للتحرير
ur: یہ فیلڈ قابل تدوین نہیں ہے
zh_cn: 该字段不可编辑

source: question
ar: سؤال
ur: سوال
zh_cn: 题

source: Random seed for this student
ar: البذور العشوائية لهذا الطالب
ur: اس طالب علم کے لئے بے ترتیب بیج
zh_cn: 这个学生的随机种子

source: If you have billing questions, please contact {billing_email}.
ar: إذا كانت لديك أسئلة حول الفوترة ، فيرجى الاتصال بـ {billing_email}.
ur: اگر آپ کے بلنگ کے سوالات ہیں تو، براہ کرم {بلنگ میل} سے رابطہ کریں.
zh_cn: 如果您有帐单问题，请联系{billing_email}。

source: {platform_name} Verified Certificate
ar: {platform_name} شهادة تم التحقق منها
ur: {platform_name} تصدیق شدہ سرٹیفکیٹ
zh_cn: {platform_name}验证证书

source: Enrollment Codes
ar: رموز التسجيل
ur: اندراج کوڈ
zh_cn: 注册码

source: EdX, Open edX, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
ar: تعد EdX و Open edX وشعارات edX و Open EDX علامات تجارية أو علامات تجارية مسجلة لشركة {link_start} edX Inc. {link_end}
ur: ایڈی ایکس، اوپن ایکس ایکس، اور edX اور اوپن edX علامات {link_start} edX انکارپوریٹڈ {link_end} کے رجسٹرڈ ٹریڈ مارک یا ٹریڈ مارک ہیں.
zh_cn: EdX，Open edX以及edX和Open edX徽标是{link_start} edX Inc. {link_end}的注册商标或商标。

source: Transcription in Progress
ar: النسخ قيد التقدم
ur: پیش رفت میں ٹرانسمیشن
zh_cn: 转录正在进行中

source: Course ID
ar: معرف بالطبع
ur: کورس کی شناخت
zh_cn: 课程编号

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
ar: يحدد أذونات الوصول لعرض الدورة في كتالوج الدورة التدريبية. يمكن ضبط هذا على واحدة من ثلاث قيم: &quot;كليهما&quot; (تظهر في الكتالوج والسماح بالوصول إلى صفحة حول) ، &quot;حول&quot; (فقط السماح بالوصول إلى الصفحة) ، &quot;لا شيء&quot; (لا تظهر في الكتالوج ولا تسمح الوصول إلى صفحة حول).
ur: کورس کی فہرست میں کورس کو ظاہر کرنے کے لئے رسائی کی اجازتوں کی وضاحت کرتا ہے. یہ تین اقدار میں سے ایک کو مقرر کیا جاسکتا ہے: &#39;دونوں&#39; (فہرست میں دکھائیں اور اس کے بارے میں رسائی کی اجازت دیں)، &#39;بارے میں&#39; (صرف صفحے تک رسائی کی اجازت دیں)، &#39;کوئی&#39; (فہرست میں ظاہر نہ کریں اور اجازت نہ دیں صفحہ کے بارے میں رسائی).
zh_cn: 定义在课程目录中显示课程的访问权限。这可以设置为以下三个值之一：&#39;both&#39;（在目录中显示并允许访问关于页面），&#39;about&#39;（仅允许访问关于页面），&#39;none&#39;（不在目录中显示并且不允许访问关于页面）。

source: Section
ar: الجزء
ur: سیکشن
zh_cn: 部分

source: The specified library is configured to fetch {count} problem,
ar: تمت تهيئة المكتبة المحددة لجلب مشكلة {count} ،
ur: مخصوص لائبریری {شمار} مسئلے کو حاصل کرنے کے لئے ترتیب دیا گیا ہے،
zh_cn: 指定的库配置为获取{count}问题，

source: Students will not be able to access this component. Re-edit your component to fix the error.
ar: لن يتمكن الطلاب من الوصول إلى هذا المكون. أعد تعديل المكون لإصلاح الخطأ.
ur: طلباء اس اجزاء تک رسائی حاصل نہیں کر سکیں گے. غلطی کو ٹھیک کرنے کے لئے اپنے اجزاء کو دوبارہ ترمیم کریں.
zh_cn: 学生将无法访问此组件。重新编辑组件来修复错误。

source: Error: The request was received, but a service did not finish running in time Possible fix: retry the payment after some time.
ar: خطأ: تم تلقي الطلب ، ولكن لم يتم الانتهاء من تشغيل الخدمة في الوقت المناسب إصلاح محتمل: أعد محاولة الدفع بعد مرور بعض الوقت.
ur: خرابی: درخواست موصول ہوئی تھی، لیکن ایک سروس وقت میں چل رہا ہے ختم نہیں کیا ممکنہ طے: کچھ وقت کے بعد ادائیگی دوبارہ کریں.
zh_cn: 错误：请求已收到，但服务没有及时完成可能的解决方法：在一段时间后重试付款。

source: Invalid Password Reset Link
ar: رابط إعادة تعيين كلمة المرور غير صحيح
ur: غلط پاسورڈ ری سیٹ
zh_cn: 密码重置链接无效

source: You're enrolled as an honor code student
ar: أنت مسجل كطالبة شرف شرف
ur: آپ کو اعزاز کوڈ طالب علم کے طور پر داخلہ دیا گیا ہے
zh_cn: 你被注册为荣誉代码的学生

source: Course Announcement Date
ar: تاريخ الإعلان عن الدورة
ur: کورس کا اعلان تاریخ
zh_cn: 课程公告日期

source: Student answer.
ar: إجابة الطالب.
ur: طالب علم کا جواب
zh_cn: 学生回答。

source: Manage student accounts
ar: إدارة حسابات الطلاب
ur: طالب علم کے اکاؤنٹس کا نظم کریں
zh_cn: 管理学生帐户

source: {platform_name} - Shopping Cart
ar: {platform_name} - سلة التسوق
ur: {platform_name} - خریداری کی ٹوکری
zh_cn: {platform_name} - 购物车

source: Upgrade now
ar: تحديث الآن
ur: اب اپ گریڈ کریں
zh_cn: 现在升级

source: Filter
ar: منقي
ur: فلٹر
zh_cn: 过滤

source: View Live
ar: عرض لايف
ur: لائیو دیکھیں
zh_cn: 观看直播

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
ar: لن تتلقى بعد الآن رسائل إلكترونية للإشعارات في المنتدى من {platform_name}. يمكنك {dashboard_link_start} الرجوع إلى لوحة المعلومات {link_end}. إذا لم تكن تقصد إجراء ذلك ، {undo_link_start} يمكنك إعادة الاشتراك {link_end}.
ur: آپ کو {platform_name} سے فورم نوٹیفیکیشن ای میلز مزید نہیں ملیں گے. آپ {dashboard_link_start} اپنے ڈیش بورڈ {link_end} پر واپس جائیں گے. اگر آپ نے ایسا نہیں کیا تو، {undo_link_start} آپ دوبارہ {link_end} دوبارہ سبسکرائب کرسکتے ہیں.
zh_cn: 您将不会再收到来自{platform_name}的论坛通知电子邮件。您可以{dashboard_link_start}返回您的信息中心{link_end}。如果您不打算这么做，可以{undo_link_start}重新订阅{link_end}。

source: Entrance Exam ID
ar: معرف اختبار المدخل
ur: داخلہ امتحان کی شناخت
zh_cn: 入学考试ID

source: A plugin was changed
ar: تم تغيير المكون الإضافي
ur: ایک پلگ ان بدل گیا
zh_cn: 插件已更改

source: No endpoint was provided for EdxNotes.
ar: لم يتم توفير نقطة نهاية لـ EdxNotes.
ur: ایڈیکس اینٹس کے لئے کوئی اختتام پوائنٹ فراہم نہیں کی گئی تھی.
zh_cn: 没有端点提供给EdxNotes。

source: [{username}] is not eligible for credit for [{course_key}].
ar: [{اسم المستخدم}] غير مؤهل للحصول على رصيد لـ [{course_key}].
ur: [{صارف کا نام}] [{course_key}] کیلئے کریڈٹ کے اہل نہیں ہے.
zh_cn: [{用户名}]不符合[{course_key}]的信用条件。

source: Promoting Your Course with {platform_name}
ar: ترويج الدورة التدريبية الخاصة بك مع {platform_name}
ur: {platform_name} کے ساتھ اپنے کورس کو فروغ دینا
zh_cn: 使用{platform_name}推广您的课程

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
ar: لبدء إصدار شهادات الدورة التدريبية ، يختار عضو في فريق الدورة التدريبية مع دور الموظفين أو المشرف {em_start} تنشيط {em_end}. يمكن لأعضاء فريق الدورة فقط الذين لديهم هذه الأدوار تعديل أو حذف شهادة منشّطة.
ur: کورس کے سرٹیفکیٹ جاری کرنے کے لئے، اسٹاف یا ایڈمن کردار کے ساتھ ایک کورس ٹیم کے رکن {em_start} کو چالو کریں {em_end} کو منتخب کرتا ہے. صرف اس کورس کے ساتھ کورس ٹیم کے ارکان کو ایک فعال سرٹیفکیٹ میں ترمیم یا حذف کر سکتے ہیں.
zh_cn: 要开始颁发课程证书，具有“职员”或“管理员”角色的课程团队成员选择{em_start}激活{em_end}。只有拥有这些角色的课程团队成员才能编辑或删除激活的证书。

source: Unpacking
ar: تفريغ
ur: غیر پیکنگ
zh_cn: 开箱

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
ar: ملاحظة: الصفحات مرئية للجميع. إذا كان المستخدمون يعرفون عنوان URL الخاص بصفحة ما ، يمكنهم عرض الصفحة حتى إذا لم يكونوا مسجلين أو مسجلين في الدورة التدريبية الخاصة بك.
ur: نوٹ: صفحات عام طور پر نظر آتے ہیں. اگر صارف کسی صفحہ کے URL کو جانتا ہے، تو وہ صفحہ دیکھ سکتے ہیں یہاں تک کہ اگر وہ آپ کے کورس میں رجسٹرڈ یا لاگ ان نہیں ہوتے ہیں.
zh_cn: 注意：页面是公开可见的。如果用户知道页面的URL，即使他们没有注册或登录到课程，他们也可以查看该页面。

source: {strong_start}Note{strong_end}: To help protect learner data, links to these reports that you save outside of this page or that you send or receive in email expire after five minutes.
ar: {strong_start} ملاحظة {strong_end}: للمساعدة في حماية بيانات المتعلمين ، تنتهي صلاحية روابط هذه التقارير التي تحفظها خارج هذه الصفحة أو التي ترسلها أو تتلقاها بالبريد الإلكتروني بعد خمس دقائق.
ur: {strong_start} نوٹ {strong_end}: سیکھنے کے اعداد و شمار کی حفاظت کرنے کے لئے، ان رپورٹس سے منسلک کرنے کے لئے جو آپ اس صفحے سے باہر بچاتے ہیں یا آپ کو پانچ منٹ کے بعد ای میل میں بھیجنے یا وصول کرنے میں مدد ملے گی.
zh_cn: {strong_start}请注意{strong_end}：为帮助保护学习者数据，您在此页以外保存的这些报告的链接或您在电子邮件中发送或接收的报告的链接在五分钟后过期。

source: View History
ar: عرض السجل
ur: تاریخ دیکھیں
zh_cn: 查看历史

source: Mailing Address
ar: العنوان البريدي
ur: ڈاک کا پتہ
zh_cn: 邮寄地址

source: Trigonometric functions
ar: الدوال المثلثية
ur: ٹریگونومیٹک کام کرتا ہے
zh_cn: 三角函数

source: Twitter
ar: تغريد
ur: ٹویٹر
zh_cn: 推特

source: Credit Card Number
ar: رقم بطاقة الائتمان
ur: کریڈٹ کارڈ نمبر
zh_cn: 信用卡号

source: Rescore All Problems
ar: Rescore جميع المشاكل
ur: ریسرچ تمام مسائل
zh_cn: 重设所有问题

source: Download staff and instructor list (csv file)
ar: تنزيل قائمة الموظفين والمدربين (ملف csv)
ur: اسٹاف اور انسٹرکٹر کی فہرست ڈاؤن لوڈ کریں (سی ایس وی فائل)
zh_cn: 下载教职员名单（csv文件）

source: The date when state was last updated
ar: تاريخ آخر تحديث للولاية
ur: تاریخ جب آخری آخری اپ ڈیٹ کی گئی تھی
zh_cn: 状态最后更新的日期

source: **strong** or __strong__
ar: ** قوي ** أو __strong__
ur: ** مضبوط ** یا __strong__
zh_cn: **强**或__strong__

source: The institution's logo.
ar: شعار المؤسسة.
ur: ادارے کی علامت
zh_cn: 该机构的标志。

source: current location
ar: الموقع الحالي
ur: موجودہ مقام
zh_cn: 当前位置

source: Discount or activation code
ar: الخصم أو رمز التفعيل
ur: ڈسکاؤنٹ یا چالو کرنے کا کوڈ
zh_cn: 折扣或激活码

source: Adding components
ar: إضافة المكونات
ur: اجزاء کو شامل کرنا
zh_cn: 添加组件

source: Your legal name, used for any certificates you earn.
ar: اسمك القانوني ، يُستخدم لأي شهادات تربحها.
ur: آپ کے قانونی نام، جو آپ کسی بھی سرٹیفکیٹ کے لئے استعمال کرتے ہیں.
zh_cn: 您的法定名称，用于您获得的任何证书。

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
ar: إطلاقا. لقد أنشأنا دورة عبر الإنترنت ، edX101 ، والتي تصف بعض أفضل الممارسات: من تصوير الفيديو ، وإنشاء التمارين ، إلى أساسيات تشغيل دورة تدريبية عبر الإنترنت. بالإضافة إلى ذلك ، نحن هنا دائمًا لمساعدتك ، ما عليك سوى إرسال ملاحظة إلينا.
ur: بالکل. ہم نے ایک آن لائن کورس، edX101، جس میں کچھ بہترین طریقوں کی وضاحت کی ہے: ویڈیو فلمنگ سے، مشق تخلیق، آن لائن کورس چلانے کی بنیادی باتوں سے. اس کے علاوہ، ہم یہاں ہمیشہ مدد کے لئے ہیں، صرف ہمیں ایک نوٹ چھوڑ دیں.
zh_cn: 绝对。我们创建了一个在线课程edX101，它描述了一些最佳实践：从拍摄视频，制作练习到运行在线课程的基础知识。此外，我们随时乐意帮助，只需给我们留言即可。

source: Course Video Settings
ar: إعدادات دورة الفيديو
ur: کورس ویڈیو کی ترتیبات
zh_cn: 课程视频设置
