Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: The capture or credit is not voidable because the capture or credit information has already been submitted to your processor. Or, you requested a void for a type of transaction that cannot be voided.
ar: لا يكون الالتقاط أو الائتمان قابلاً للإبطال لأن معلومات الالتقاط أو الائتمان قد تم إرسالها بالفعل إلى المعالج الخاص بك. أو طلبت فراغًا لنوع من المعاملات لا يمكن تفريقه.
ur: گرفتاری یا کریڈٹ ناقابل اعتماد نہیں ہے کیونکہ قبضہ یا کریڈٹ کی معلومات پہلے سے ہی آپ کے پروسیسر میں پیش کی گئی ہے. یا، آپ نے ایک قسم کے ٹرانزیکشن کے لئے ایک باطل کی درخواست کی ہے جو آواز نہیں دی جا سکتی.
zh_cn: 由于捕获或信用信息已经提交给您的处理器，捕获或信用不可撤销。或者，您要求对无法无效的交易进行无效处理。

source: View Archived Course
ar: اعرض الدورة التدريبية
ur: آرکائیوڈ کورس دیکھیں
zh_cn: 查看存档课程

source: Some Rights Reserved
ar: بعض الحقوق محفوظة
ur: کچھ حقوق محفوظ ہیں
zh_cn: 保留部分权利

source: previous page
ar: الصفحة السابقة
ur: سابقہ ​​صفحہ
zh_cn: 上一页

source: Library Export
ar: تصدير المكتبة
ur: لائبریری برآمد
zh_cn: 图书馆出口

source: Read your user ID
ar: قراءة معرف المستخدم الخاص بك
ur: اپنے صارف کی شناخت پڑھیں
zh_cn: 阅读您的用户ID

source: yyyy-mm-dd
ur: yyy mm mm dd

source: This email message was automatically sent by {lms_url} because someone attempted to create an account on {platform_name} using this email address.
ar: تم إرسال هذه الرسالة الإلكترونية تلقائيًا بواسطة {lms_url} لأن شخصًا ما حاول إنشاء حساب على {platform_name} باستخدام عنوان البريد الإلكتروني هذا.
ur: یہ ای میل پیغام خود بخود {lms_url} کے ذریعے بھیج دیا گیا تھا کیونکہ کسی نے {ای میل پلیٹ فارم] نام پر اس ای میل ایڈریس کا استعمال کرنے کی کوشش کی ہے.
zh_cn: 此电子邮件由{lms_url}自动发送，因为有人试图使用此电子邮件地址在{platform_name}上创建帐户。

source: The reason an error occurred during certificate generation.
ar: السبب حدث خطأ أثناء إنشاء الشهادة.
ur: سرٹیفیکیشن نسل کے دوران ایک خرابی واقع ہوئی.
zh_cn: 证书生成期间发生错误的原因。

source: Sailthru send template to use on purchasing a course seat. Deprecated
ar: إرسال Sailthru قالب لاستخدامه في شراء مقعد بالطبع. إهمال
ur: سیلیلیو خریداری کورس سیٹ پر استعمال کرنے کے لئے ٹیمپلیٹ بھیجتا ہے. ناپسندی
zh_cn: Sailthru发送模板用于购买课程座位。弃用

source: Quantity
ar: كمية
ur: مقدار
zh_cn: 数量

source: Yes, I am sure
ar: نعم أنا متأكد
ur: ہاں مجھے یقین ہے
zh_cn: 是的，我敢肯定

source: Search Results
ar: نتائج البحث
ur: تلاش کے نتائج
zh_cn: 搜索结果

source: Course Description
ar: وصف المساقات
ur: کورس کی تفصیل
zh_cn: 课程描述

source: This invoice is already active.
ar: هذه الفاتورة نشطة بالفعل.
ur: یہ انوائس پہلے ہی فعال ہے.
zh_cn: 此发票已处于活动状态。

source: This article was last modified:
ar: آخر تعديل لهذه المادة:
ur: یہ مضمون آخری ترمیم شدہ تھا:
zh_cn: 这篇文章是最后修改的：

source: Noted by
ar: لوحظ بواسطه
ur: کی طرف سے نوٹ نہیں
zh_cn: 注意

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
ar: يحدد عدد المرات التي يمكن للطالب أن يحاول فيها الإجابة عن هذه المشكلة. إذا لم يتم تعيين القيمة ، فسيتم السماح بالمحاولات غير المحدودة.
ur: اس طالب علم کو اس مسئلے کا جواب دینے کی کوشش کر سکتا ہے. اگر قیمت مقرر نہ ہو تو، لامحدود کوششوں کی اجازت دی جاتی ہے.
zh_cn: 定义学生可以尝试回答此问题的次数。如果该值未设置，则允许无限次尝试。

source: An image file is required.
ar: ملف الصورة مطلوب.
ur: ایک تصویر فائل کی ضرورت ہے.
zh_cn: 一个图像文件是必需的。

source: Year of Birth
ar: سنة الميلاد
ur: پیدائش کا سال
zh_cn: 出生年份

source: problem grade
ar: درجة المشكلة
ur: مسئلہ گریڈ
zh_cn: 问题等级

source: Insert a numerical response
ar: إدراج استجابة رقمية
ur: عددی جواب داخل کریں
zh_cn: 插入一个数字响应

source: XML data for the annotation
ar: بيانات XML للتعليق التوضيحي
ur: تشریح کے لئے XML ڈیٹا
zh_cn: 用于注释的XML数据

source: Invalid grader reply. Please contact the course staff.
ar: رد غير صحيح للصف. يرجى الاتصال بموظفي الدورة.
ur: غلط گرڈر جواب براہ کرم کورس کے عملے سے رابطہ کریں.
zh_cn: 无效的分级回复。请联系课程人员。

source: There was an error processing your order!
ar: حدث خطأ في معالجة طلبك!
ur: آپ کا آرڈر پروسیسنگ میں ایک خرابی تھی!
zh_cn: 处理您的订单时发生错误！

source: error grading {image_input_id} (input={user_input})
ar: تقدير الخطأ {image_input_id} (input = {user_input})
ur: غلطی کی درجہ بندی {image_input_id} (ان پٹ = {user_input})
zh_cn: 错误分级{image_input_id}（input = {user_input}）

source: Unsubscribe Successful!
ar: تم الغاء الاشتراك بنجاح!
ur: سبسکرائب کریں کامیاب!
zh_cn: 取消订阅成功！

source: Regenerate for learners with audit not passing state. ({count})
ar: تجديد للمتعلمين مع التدقيق لا يمر ولاية. ({} الاعتماد)
ur: سیکھنے والوں کے لئے دوبارہ تفتیش کے ساتھ ریاست سے گزر نہیں آتے ہیں. ({شمار})
zh_cn: 对审计未通过状态的学习者进行再生。 （{计数}）

source: Create Catalog
ar: إنشاء كتالوج
ur: فہرست بنائیں
zh_cn: 创建目录

source: You must be logged-in to add to a shopping cart
ar: يجب تسجيل الدخول لإضافته إلى عربة التسوق
ur: خریداری کی ٹوکری میں شامل کرنے کیلئے آپ کو لاگ ان ہونا ضروری ہے
zh_cn: 您必须登录才能添加到购物车

source: You must be enrolled in the course to see course content.
ar: يجب أن تكون مسجلاً في الدورة التدريبية لمشاهدة محتوى الدورة التدريبية.
ur: کورس کے مواد کو دیکھنے کے لئے آپ کو کورس میں داخل کیا جانا چاہئے.
zh_cn: 你必须参加课程才能看到课程内容。

source: Number of Successful Refunds
ar: عدد المبالغ المستردة الناجحة
ur: کامیاب رقم کی تعداد
zh_cn: 成功退款的数量

source: Your edX verification has been approved. Your verification is effective for one year after submission.
ar: لقد تمت الموافقة على التحقق من edX الخاص بك. التحقق الخاص بك هو فعال لمدة سنة واحدة بعد تقديمها.
ur: آپ کے EDX کی تصدیق منظور کی گئی ہے. جمع کرانے کے بعد ایک سال کے لئے آپ کی توثیق مؤثر ہے.
zh_cn: 您的edX验证已获批准。您的验证在提交后一年生效。

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
ar: نحتفظ بسجل لرسائل البريد الإلكتروني القديمة ، لذلك إذا كان هذا الطلب غير مقصود ، يمكننا التحقيق.
ur: ہم ایک پرانے ای میل رکھو، لہذا اگر یہ درخواست غیر معمولی تھی تو ہم تحقیق کر سکتے ہیں.
zh_cn: 我们保留旧电子邮件的日志，因此如果此请求是无意的，我们可以进行调查。

source: No answer provided.
ar: لا إجابة المقدمة.
ur: جواب نہیں دیا گیا.
zh_cn: 没有提供答案。

source: {span_start}current section{span_end}
ar: {span_start} القسم الحالي {span_end}
ur: {span_start} موجودہ سیکشن {span_st}
zh_cn: {span_start}当前部分{span_end}

source: Completed {completion_date_html}
ar: اكتمل {completion_date_html}
ur: مکمل {complete_date_html}
zh_cn: 已完成{completion_date_html}

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
ar: محدد في ثوان. تمكين التخزين المؤقت لاستجابات واجهة برمجة التطبيقات عن طريق تعيين هذا إلى قيمة أكبر من 0.
ur: سیکنڈ میں مقرر کردہ 0 جوابات سے زائد قیمت پر قائم کرکے API کے جوابات کی کیشنگ کو فعال کریں.
zh_cn: 以秒为单位指定。通过将其设置为大于0的值来启用API响应缓存。

source: You have been un-enrolled in {course_name} at {site_name} by a member of the course staff. The course will no longer appear on your {site_name} dashboard.
ar: لقد تم إلغاء تسجيلك في {course_name} في {site_name} بواسطة أحد أعضاء فريق الدورة التدريبية. لن تظهر الدورة التدريبية على لوحة بيانات {site_name}.
ur: آپ کورسز کے عملے کے ایک رکن کے ذریعہ {course_name} میں {site_name} میں غیر اندراج کیا گیا ہے. کورس آپ {site_name} ڈیشبورڈ پر مزید نہیں ہوگا.
zh_cn: 您已被课程人员的成员注册到{site_name}的{course_name}。该课程不会再显示在您的{site_name}信息中心内。

source: Purchase Time
ar: وقت الشراء
ur: خریداری کا وقت
zh_cn: 购买时间

source: The public display name for the new course. (This name is often the same as the original course name.)
ar: اسم العرض العام للدورة التدريبية الجديدة. (غالباً ما يكون هذا الاسم هو نفس اسم الدورة التدريبية الأصلية.)
ur: نیا کورس کے لئے عوامی ڈسپلے کا نام. (یہ نام اصل کورس کا نام اکثر ہی ہے.)
zh_cn: 新课程的公开显示名称。 （该名称通常与原始课程名称相同。）

source: Certificate Invalidation does not exist, Please refresh the page and try again.
ar: شهادة عدم الصلاحية غير موجودة ، يرجى تحديث الصفحة والمحاولة مرة أخرى.
ur: سرٹیفکیٹ کی توثیق موجود نہیں ہے، براہ مہربانی صفحہ کو تازہ کریں اور دوبارہ کوشش کریں.
zh_cn: 证书失效不存在，请刷新页面并重试。

source: Course Credit Requirements
ar: متطلبات الائتمان بالطبع
ur: کورس کریڈٹ کی ضروریات
zh_cn: 课程学分要求

source: Student Support
ar: دعم الطلاب
ur: طالب علم کی حمایت
zh_cn: 学生支持

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
ar: {b_start} التحفيز: {b_end} امنح نفسك حافزًا إضافيًا لإكمال الدورة التدريبية
ur: {b_start} تعظیم: {b_end} کورس مکمل کرنے کے لئے اپنے آپ کو اضافی حوصلہ افزائی دیں
zh_cn: {b_start}激励：{b_end}给予自己额外的激励来完成课程

source: Usable
ar: صالح للإستعمال
ur: قابل استعمال
zh_cn: 可用

source: No git import logs have been recorded for this course.
ar: لم يتم تسجيل سجلات استيراد git لهذه الدورة التدريبية.
ur: اس کورس کے لئے کوئی گیٹ درآمد کی لاگت نہیں کی گئی ہے.
zh_cn: 本课程没有记录git导入日志。

source: Related Programs
ar: البرامج ذات الصلة
ur: متعلقہ پروگرام
zh_cn: 相关程序

source: {course.display_number_with_default} Course Info
ar: {course.display_number_with_default} معلومات الدورة التدريبية
ur: {کورس.display_number_with_default} کورس کی معلومات
zh_cn: {course.display_number_with_default}课程信息

source: Take photo
ar: تصوير
ur: تصویر لو
zh_cn: 拍照

source: Usernames can only contain letters (A-Z, a-z), numerals (0-9), underscores (_), and hyphens (-).
ar: لا يمكن أن تحتوي أسماء المستخدمين إلا على أحرف (AZ، az) وأرقام (0-9) وشرطات سفلية (_) وواصلات (-).
ur: صارف ناموں میں صرف خط (AZ، az)، پوائنٹس (0-9)، اندراج (_)، اور ہائفینس (-) پر مشتمل ہوسکتا ہے.
zh_cn: 用户名只能包含字母（AZ，az），数字（0-9），下划线（_）和连字符（ - ）。

source: Balance
ar: توازن
ur: بقیہ
zh_cn: 平衡

source: Unable to find any recipients to be {action}
ar: يتعذر العثور على أي مستلم ليكون {action}
ur: کسی بھی وصول کنندگان کو تلاش کرنے میں ناکام {کارروائی}
zh_cn: 无法找到任何收件人为{action}

source: 0 sent
ar: ارسل 0
ur: 0 بھیجے گئے
zh_cn: 0发送

source: (Learners not explicitly assigned to a cohort)
ar: (لا يتم تعيين المتعلمين بشكل صريح لفوج)
ur: (اساتذہ واضح طور پر ایک کوہٹ میں تفویض نہیں کیا)
zh_cn: （未明确分配到队列的学习者）

source: Question {index}
ar: السؤال {الفهرس}
ur: سوال {انڈیکس}
zh_cn: 问题{index}

source: Open the courseware in the LMS
ar: افتح البرامج التعليمية في LMS
ur: LMS میں کورس کھولیں
zh_cn: 在LMS中打开课件

source: Deny all users access to edit this article.
ar: رفض جميع المستخدمين الوصول إلى تحرير هذه المقالة.
ur: اس مضمون کو ترمیم کرنے کے لئے تمام صارفین کو مسترد کریں.
zh_cn: 拒绝所有用户访问以编辑本文。

source: Learn more about certificates
ar: معرفة المزيد عن الشهادات
ur: سرٹیفکیٹس کے بارے میں مزید جانیں
zh_cn: 详细了解证书

source: You must verify your identity before the assessment closes on {due_date}.
ar: يجب عليك إثبات هويتك قبل إغلاق التقييم في {due_date}.
ur: {due_date} پر تشخیص سے پہلے آپ کو اپنی شناخت کی توثیق کرنا ضروری ہے.
zh_cn: 您必须在{due_date}关闭评估前验证您的身份。

source: Easily shareable certificate
ar: شهادة سهلة المشاركة
ur: آسانی سے قابل حصول سرٹیفکیٹ
zh_cn: 轻松共享证书

source: Whether the student has answered the problem
ar: ما إذا كان الطالب قد أجاب عن المشكلة
ur: چاہے طالب علم نے اس مسئلے کا جواب دیا ہے
zh_cn: 学生是否回答了这个问题

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
ar: قم بتحرير اسم ملف صورة الدورة التدريبية. يجب عليك تحميل هذا الملف على صفحة الملفات والتحميلات. يمكنك أيضًا تعيين صورة الدورة التدريبية على صفحة الإعدادات والتفاصيل.
ur: کورس تصویر فائل کے نام میں ترمیم کریں. آپ کو فائل کو فائلوں اور اپ لوڈس صفحہ پر اپ لوڈ کرنا ضروری ہے. آپ کورس تصویر اور ترتیبات کے صفحے پر بھی مقرر کرسکتے ہیں.
zh_cn: 编辑课程图像文件的名称。您必须在“文件和上传”页面上上传此文件。您还可以在设置和详细信息页面上设置课程图像。

source: Problem scores are hidden.
ar: يتم إخفاء نقاط المشكلة.
ur: مسئلہ اسکور چھپے ہوئے ہیں.
zh_cn: 问题分数隐藏。

source: Namespace of enrollment attribute
ar: مساحة اسم خاصية التسجيل
ur: اندراج کی خاصیت کا نام اسپیس
zh_cn: 注册属性的名称空间

source: all_students and unique_student_identifier are mutually exclusive.
ar: all_students و unique_student_identifier تبادليان.
ur: all_students اور unique_student_identifier متعدد خصوصی ہیں.
zh_cn: all_students和unique_student_identifier是互斥的。

source: Upgrade to earn a verified certificate on %(platform_name)s
ar: الترقية للحصول على شهادة تم التحقق منها على٪ (platform_name) s
ur: ٪ (platform_name) s پر تصدیق شدہ سرٹیفکیٹ حاصل کرنے کے لئے اپ گریڈ کریں
zh_cn: 升级以在％（platform_name）上获得经过验证的证书

source: Registration for Course: {course_name}
ar: التسجيل للدورة التدريبية: {course_name}
ur: کورس کے لئے رجسٹریشن: {course_name}
zh_cn: 课程注册：{course_name}

source: Use your {platform_name} username and password to log into {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard.
ar: استخدم اسم المستخدم وكلمة المرور {platform_name} لتسجيل الدخول إلى {platform_name} أدناه ، ثم اربط حساب {platform_name} باستخدام {provider_name} من لوحة التحكم.
ur: ذیل میں {platform_name} لاگ ان کرنے کیلئے اپنے {platform_name} صارف کا نام اور پاسورڈ استعمال کریں، اور پھر آپ کے {platform_name} کے اکاؤنٹ سے {provider_name} اپنے ڈیش بورڈ سے لنک کریں.
zh_cn: 使用您的{platform_name}用户名和密码登录到下面的{platform_name}，然后将您的{platform_name}帐户与仪表板中的{provider_name}关联起来。

source: Blank
ar: فراغ
ur: غلط
zh_cn: 空白

source: List
ar: قائمة
ur: فہرست
zh_cn: 名单

source: cannot be changed later
ar: لا يمكن تغييره لاحقا
ur: بعد میں تبدیل نہیں کیا جا سکتا
zh_cn: 以后不能更改

source: The badge image file size must be less than 250KB.
ar: يجب أن يكون حجم ملف صورة الشارة أقل من 250 كيلوبايت.
ur: بیج تصویر فائل کا سائز 250KB سے کم ہونا ضروری ہے.
zh_cn: 徽章图像文件大小必须小于250KB。

source: The deadline to upgrade to a verified certificate for this course has passed.
ar: لقد انقضى الموعد النهائي للترقية إلى شهادة تم التحقق منها لهذه الدورة التدريبية.
ur: اس کورس کے لئے تصدیق شدہ سرٹیفکیٹ میں اپ گریڈ کرنے کی آخری تاریخ منظور ہو گئی ہے.
zh_cn: 升级到此课程的验证证书的截止日期已过。

source: Invalid course id
ar: معرف دورة غير صالح
ur: غلط کورس id
zh_cn: 无效的课程ID

source: Your Platform Insights
ar: منصة المنصورات الخاصة بك
ur: آپ کے پلیٹ فارم انسپائٹس
zh_cn: 您的平台见解

source: Select an option
ar: حدد اختيارا
ur: ایک اختیار منتخب کریں
zh_cn: 选择一个选项

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
ar: قد ترغب في تشغيل إصدار جديد من الدورة التدريبية الحالية ، أو استبدال دورة تدريبية موجودة تمامًا. أو ربما تكون قد وضعت دورة تدريبية خارج {studio_name}.
ur: آپ موجودہ کورس کا ایک نیا ورژن چلانا چاہتے ہیں یا مکمل طور پر موجودہ کورس کی جگہ لے سکتے ہیں. یا، آپ {studio_name} کے باہر کورس تیار کر سکتے ہیں.
zh_cn: 您可能想要运行现有课程的新版本，或者完全替换现有课程。或者，您可能在{studio_name}之外开发了一门课程。

source: {course_number} Courseware
ar: {course_number} البرامج التعليمية
ur: {کورس_نمبر} کورسز
zh_cn: {course_number}课件

source: Number of Refunds
ar: عدد المبالغ المستردة
ur: رقم کی واپسی کی تعداد
zh_cn: 退款数量

source: Keep learning today
ar: استمر في التعلم اليوم
ur: آج سیکھنا
zh_cn: 今天继续学习

source: Enrollment is Closed
ar: التسجيل مغلق
ur: اندراج بند ہے
zh_cn: 注册已关闭

source: Bookmarks
ar: إرسال
ur: بک مارک
zh_cn: 书签

source: Disclaimer
ar: تنصل
ur: ڈس کلیمر
zh_cn: 放弃

source: Wiki
ar: ويكي
ur: ویکیپیڈیا
zh_cn: 维基

source: Total Certificates Issued
ar: مجموع الشهادات الصادرة
ur: کل سرٹیفکیٹ جاری
zh_cn: 颁发的总证书

source: Email for 'Instructor' Annotations
ar: البريد الإلكتروني للتعليقات التوضيحية &quot;المعلم&quot;
ur: &#39;انسٹرکٹر&#39; تشریح کے لئے ای میل
zh_cn: &#39;教师&#39;注释电子邮件

source: Already registered?
ar: مسجل بالفعل؟
ur: پہلے ہی رجسٹرڈ ہے؟
zh_cn: 已经注册？

source: register
ar: تسجيل
ur: رجسٹر کریں
zh_cn: 寄存器

source: Tracking Log
ar: سجل التتبع
ur: ٹریکنگ لاگ ان
zh_cn: 跟踪日志

source: You can not move {source_type} into {target_parent_type}.
ar: لا يمكنك نقل {source_type} إلى {target_parent_type}.
ur: آپ {source_type} کو {target_parent_type} میں منتقل نہیں کر سکتے ہیں.
zh_cn: 您无法将{source_type}移动到{target_parent_type}。

source: © 2012–{year} edX Inc. All rights reserved except where noted. EdX, Open edX and the edX and Open edX logos are registered trademarks or trademarks of edX Inc.
ar: حقوق الطبع والنشر © 2012-2012 (سنة) لشركة EDX. جميع الحقوق محفوظة باستثناء ما تم ذكره. تعد EdX و Open edX وشعارات edX و Open EDX علامات تجارية مسجلة أو علامات تجارية لشركة EDX Inc.
ur: © 2012- {سال} edX انکارپوریٹڈ تمام حق محفوظ ہیں جہاں کہیں بھی ذکر کیا گیا ہے. ایڈ ایکس، اوپن EDX اور edX اور اوپن EDX علامات EDX انکارپوریٹڈ کے رجسٹرڈ ٹریڈ مارک یا ٹریڈ مارک ہیں.
zh_cn: ©2012- {year} edX Inc.保留所有权利，除非另有说明。 EdX，Open edX以及edX和Open edX徽标是edX Inc.的注册商标或商标。

source: coupon with the coupon code ({code}) already exists for this course
ar: الكوبون مع رمز القسيمة ({code}) موجود بالفعل لهذه الدورة
ur: کوپن کوڈ ({کوڈ}) کے ساتھ کوپن پہلے ہی اس کورس کے لئے موجود ہے
zh_cn: 优惠券代码（{code}）已经存在于本课程中

source: a course of study offered by {partner_short_name}.
ar: دورة دراسية تقدمها {partner_short_name}.
ur: {partner_short_name} کی طرف سے پیش کردہ مطالعہ کا ایک کورس.
zh_cn: 由{partner_short_name}提供的一门课程。

source: Enter the names of the advanced components to use in your library.
ar: أدخل أسماء المكونات المتقدمة لاستخدامها في مكتبتك.
ur: اپنی لائبریری میں استعمال کرنے کے لئے اعلی درجے کی اجزاء کے نام درج کریں.
zh_cn: 输入要在库中使用的高级组件的名称。

source: Start learning now
ar: ابدأ التعلم الآن
ur: اب سیکھنا شروع کریں
zh_cn: 现在开始学习

source: Merge selected with current...
ar: دمج المحدد مع الحالي ...
ur: موجودہ کے ساتھ منتخب کریں ...
zh_cn: 合并选择与当前...

source: You are not enrolled yet
ar: أنت غير مسجل حتى الآن
ur: آپ ابھی تک اندراج نہیں ہوئے ہیں
zh_cn: 您尚未注册

source: Switch to selected version
ar: قم بالتبديل إلى الإصدار المحدد
ur: منتخب کردہ ورژن میں سوئچ کریں
zh_cn: 切换到选定的版本

source: Insert a heading
ar: أدخل العنوان
ur: سرخی ڈالیں
zh_cn: 插入一个标题

source: (reload your page to refresh)
ar: (قم بإعادة تحميل صفحتك لتحديث)
ur: (تازہ کاری کرنے کے لئے اپنے صفحے کو دوبارہ لوڈ کریں)
zh_cn: （重新加载你的页面刷新）

source: Imported
ar: مستورد
ur: درآمد
zh_cn: 进口

source: Enable video caching system
ar: تمكين نظام التخزين المؤقت الفيديو
ur: ویڈیو کیشنگ کے نظام کو فعال کریں
zh_cn: 启用视频缓存系统

source: Enter a valid email address.
ar: أدخل عنوان بريد إلكتروني صالح.
ur: درست ای میل کا اندراج کریں.
zh_cn: 输入一个有效的电子邮件地址。

source: %(user)s subscribing to %(article)s (%(type)s)
ur: ٪ (آرٹیکل) کے٪ (صارف) کی سبسکرائب کرنا (٪ (قسم) s
zh_cn: ％（用户）订阅％（文章）s（％（类型）s）

source: The cardholder is enrolled for payer authentication
ar: يتم تسجيل حامل البطاقة لمصادقة الدافع
ur: کارڈ ہولڈر دائر کی تصدیق کے لئے اندراج کیا جاتا ہے
zh_cn: 持卡人已注册进行付款人身份验证

source: Your current verification will expire soon.
ar: ستنتهي صلاحية التحقق الحالي قريبًا.
ur: آپ کی موجودہ تصدیق جلد ہی ختم ہوگی.
zh_cn: 您目前的验证即将过期。

source: Due Time format two digit hours colon two digit minutes
ar: وقت الاستحقاق شكل رقمين من الساعات القولون رقمين من الدقائق
ur: وقت کی شکل دو بار دو ہندسوں کا حساب دو پوائنٹ منٹ
zh_cn: 到期时间格式两位数小时冒号两位数分钟

source: Course git url:
ar: عنوان url git:
ur: کورس گیٹ یو آر ایل:
zh_cn: 课程git网址：

source: This enrollment code has been canceled. It can no longer be used.
ar: تم إلغاء رمز التسجيل هذا. لم يعد من الممكن استخدامها.
ur: اس اندراج کا کوڈ منسوخ کردیا گیا ہے. یہ اب استعمال نہیں کیا جا سکتا.
zh_cn: 此注册码已被取消。它不能再使用。

source: Oct
ar: أكتوبر
ur: اکتوبر
zh_cn: 十月

source: Explore New Courses
ar: اكتشف دورات جديدة
ur: نئے کورسز کا مطالعہ کریں
zh_cn: 探索新课程

source: Your current verification will expire soon!
ar: ستنتهي صلاحية التحقق الحالي قريبًا!
ur: آپ کی موجودہ تصدیق جلد ہی ختم ہوگی!
zh_cn: 您目前的验证即将过期！

source: Manage content groups
ar: إدارة مجموعات المحتوى
ur: مواد گروپوں کا نظم کریں
zh_cn: 管理内容组

source: March
ar: مارس
ur: مارچ
zh_cn: 游行

source: New article '%s' created.
ar: تم إنشاء مقالة جديدة &quot;٪ s&quot;.
ur: نئے آرٹیکل &#39;٪ s&#39; بنائے گئے ہیں.
zh_cn: 新文章&#39;％s&#39;已创建。

source: Enter the text on the button used to launch the third party application.
ar: أدخل النص على الزر المستخدم لإطلاق تطبيق الجهة الخارجية.
ur: تیسری پارٹی کی درخواست کو شروع کرنے کے لئے استعمال کردہ بٹن پر متن درج کریں.
zh_cn: 在用于启动第三方应用程序的按钮上输入文字。

source: Do not use shuffle and answer-pool at the same time
ar: لا تستخدم المراوغة والإجابة على المسبح في نفس الوقت
ur: ایک ہی وقت میں شفل اور جواب پول استعمال نہ کریں
zh_cn: 不要同时使用洗牌和回答池

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
ar: تم إثبات ملكية {cert_name_long} التي تم التحقق منها في انتظار التأكيد على أن إصدار {cert_name_short} الخاص بك يتوافق مع عمليات الحظر الصارمة التي تفرضها الولايات المتحدة على إيران وكوبا وسوريا والسودان. إذا كنت تعتقد أن نظامنا قد عرّفك عن طريق الخطأ على أنك متصل بأحد هذه البلدان ، فيرجى إخبارنا عن طريق الاتصال بـ {email}. إذا كنت تريد استرداد الأموال على حسابك على {cert_name_long} ، فيرجى الاتصال بعنوان الفوترة {billing_email}
ur: آپ کی تصدیق {cert_name_long} کی زیر التواء تصدیق کی جا رہی ہے کہ آپ {cert_name_short} جاری کرتے ہیں، ایران، کیوبا، شام اور سوڈان پر سخت امریکی پابندیوں کے مطابق ہے. اگر آپ سوچتے ہیں کہ ہمارے سسٹم نے غلطی سے آپ کو ان ممالک میں سے کسی کے ساتھ منسلک ہونے کی شناخت کی ہے، تو براہ مہربانی {ای میل} سے رابطہ کرکے ہمیں بتائیں. اگر آپ {cert_name_long} پر رقم کی واپسی چاہتے ہیں تو، براہ کرم ہمارے بلنگ کا پتہ {بلنگ میل} سے رابطہ کریں.
zh_cn: 您的已验证{cert_name_long}正在等待确认发布您的{cert_name_short}符合严格的美国对伊朗，古巴，叙利亚和苏丹的禁运。如果您认为我们的系统错误地将您标识为与其中一个国家/地区有关联，请通过联系{email}告知我们。如果您希望{cert_name_long}退款，请与我们的帐单地址{billing_email}联系

source: Starts: {date}
ar: يبدأ: {date}
ur: شروع ہوتا ہے: {تاریخ}
zh_cn: 开始时间：{date}

source: Specialty
ar: تخصص
ur: خاصیت
zh_cn: 专业

source: Unit Location
ar: موقع الوحدة
ur: یونٹ مقام
zh_cn: 单位位置

source: Report Creation Date
ar: تاريخ إنشاء التقرير
ur: رپورٹ تخلیق کی تاریخ
zh_cn: 报告创建日期

source: Open in New Page
ar: فتح في صفحة جديدة
ur: نیا صفحہ کھولیں
zh_cn: 在新页面中打开

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
ar: تم تحميل صورة جديدة٪ s بنجاح. يمكنك استخدامه عن طريق تحديده من قائمة الصور المتاحة.
ur: نئی تصویر٪ s کامیابی سے اپ لوڈ کردی گئی. آپ اسے دستیاب تصاویر کی فہرست سے منتخب کرکے اسے استعمال کرسکتے ہیں.
zh_cn: 新图片％s已成功上传。您可以通过从可用图像列表中选择它来使用它。

source: Generate API client credentials
ar: إنشاء بيانات اعتماد عميل واجهة برمجة التطبيقات
ur: API کلائنٹ کی اسناد بنائیں
zh_cn: 生成API客户端凭据

source: This unit's access settings refer to deleted or invalid groups.
ar: تشير إعدادات الوصول لهذه الوحدة إلى مجموعات محذوفة أو غير صالحة.
ur: یہ یونٹ کی رسائی کی ترتیبات حذف اور غلط گروپوں کا حوالہ دیتے ہیں.
zh_cn: 本机的访问设置涉及已删除或无效的组。

source: Topic doesn't exist
ar: الموضوع غير موجود
ur: موضوع موجود نہیں ہے
zh_cn: 主题不存在

source: The status for any active tasks appears in a table below.
ar: تظهر حالة أي مهام نشطة في جدول أدناه.
ur: کسی بھی فعال کاموں کی حیثیت ذیل میں ایک میز میں ظاہر ہوتا ہے.
zh_cn: 任何活动任务的状态显示在下表中。

source: End Date:
ar: تاريخ الانتهاء:
ur: آخری تاریخ:
zh_cn: 结束日期：

source: Course Start Date
ar: تاريخ بدء الدورة
ur: کورس کی تاریخ شروع
zh_cn: 课程开始日期

source: Fri
ar: حر
ur: مفت
zh_cn: 免费

source: Thank you for your purchase!
ar: شكرا لك على الشراء!
ur: آپ کی خریداری کے لئے آپ کا شکریہ!
zh_cn: 感谢您的购买！

source: Instructor Dashboard
ar: لوحة معلومات المعلم
ur: ڈائریکٹر ڈیش بورڈ
zh_cn: 讲师仪表板

source: An error occurred with SymbolicResponse. The error was: {error_msg}
ar: حدث خطأ في SymbolicResponse. كان الخطأ: {error_msg}
ur: SymbolicResponse کے ساتھ ایک غلطی واقع ہوئی. غلطی تھی: {error_msg}
zh_cn: SymbolicResponse发生错误。错误是：{error_msg}

source: Regenerate for learners with audit passing state. ({count})
ar: التجديد للمتعلمين مع حالة التمرير التدقيق. ({} الاعتماد)
ur: آڈیٹر گزرنے والے ریاست کے ساتھ سیکھنے کے لئے دوبارہ بنائیں. ({شمار})
zh_cn: 为审核通过状态的学习者重新生成。 （{计数}）
