Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Cart item quantity should not be greater than 1 when applying activation code
ar: يجب ألا تكون كمية عنصر سلة التسوق أكبر من 1 عند تطبيق رمز التنشيط
ur: چالو کرنے کے کوڈ کو لاگو کرتے وقت ٹوکری شے مقدار 1 سے زیادہ نہیں ہونا چاہئے
zh_cn: 购买激活码时，购物车项目数量不应大于1

source: Your video thumbnail image URL
ar: عنوان URL لصورة الفيديو المصغّرة
ur: آپ کا ویڈیو تھمب نیل تصویر URL
zh_cn: 您的视频缩略图图片网址

source: Entrance Exam History
ar: تاريخ الامتحان
ur: داخلہ امتحان کی تاریخ
zh_cn: 入学考试历史

source: Sign in
ar: تسجيل الدخول
ur: داخلہ
zh_cn: 签到

source: Click to open the courseware in the LMS in a new tab
ar: انقر لفتح المناهج التعليمية في LMS في علامة تبويب جديدة
ur: نئے ٹیب میں LMS میں محکمہ کھولنے کے لئے کلک کریں
zh_cn: 单击以在新选项卡中打开LMS中的课件

source: Steps required to earn course credit
ar: الخطوات اللازمة لكسب الائتمان بالطبع
ur: کورس کریڈٹ حاصل کرنے کے لئے ضروری اقدامات
zh_cn: 获得课程学分所需的步骤

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THESE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
ar: إلى أقصى حد يسمح به القانون المعمول به ، فأنت توافق على عدم وجود أي {Platform_name} لأي من {platform_name} المشاركون مسئولون تجاهك عن أي خسائر أو أضرار ، سواء كانت فعلية أو تبعية ، تنشأ عن أو تتعلق بهذه الشروط ، أو (أو أي طرف ثالث) استخدام أو عدم القدرة على استخدام APIS أو أي محتوى API ، أو الاعتماد الخاص بك المعلومات التي تم الحصول عليها من أو من خلال APIS ، سواء كانت الدعوى الخاصة بك في العقد أو الضرر أو القانون الأساسي أو أي قانون آخر.
ur: قابل اطلاق قانون کی طرف سے مقرر کردہ مکمل اخراجات پر، آپ کو {platform_name} کے بغیر {platform_name} کسی بھی {platform_name} کے بغیر شراکت داروں کو کسی بھی نقصانات یا خطرات، یا غیر قانونی یا غیر قانونی طور پر، آپ کو ان شرائط سے متعلق یا ان سے متعلق معلوم ہوسکتا ہے. اے پی آئی یا کسی API کے مواد کا استعمال کرنے کے لئے یا آپ کے معاوضے کے بارے میں معلومات کا استعمال کرنے کے لئے یا آپ کے کسی بھی تیسری پارٹی کا استعمال یا آپ کی یا کسی بھی تیسری پارٹی کا استعمال نہیں ہے، جب آپ کی کلائنٹ معاہدہ، ٹارٹ، اسٹیٹیٹری یا دیگر حقوق میں موجود ہے.
zh_cn: 在适用法律允许的最大范围内，您同意{平台名称}或任何{platform_name}参与者对由于本条款引起的或与本条款有关的任何损失或损害（无论是实际损失还是相应损失）均不承担任何责任您（或任何第三方）使用或无法使用API​​S或任何API内容，或您对从或通过AP获得的信息的依赖性，无论您的索赔是基于合同，侵权，法定或其他法律。

source: The datetime after which users are no longer allowed to submit photos for verification.
ar: التاريخ والوقت الذي لا يُسمح بعده للمستخدمين بإرسال الصور للتحقق منهم.
ur: اس وقت کے بعد صارفین کو مزید اجازت نہیں دی جاتی ہے کہ تصاویر کو تصدیق کے لۓ جمع کرائیں.
zh_cn: 用户不再允许提交照片进行验证的日期时间。

source: General decline by the processor. Possible fix: retry with another form of payment
ar: الانخفاض العام من قبل المعالج. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: پروسیسر کی طرف سے عام کمی. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 处理器普遍下降。可能的解决方法：使用其他付款方式重试

source: About Exporting Courses
ar: حول دورات تصدير
ur: ایکسپورٹ کورسز کے بارے میں
zh_cn: 关于导出课程

source: Must provide username
ar: يجب تقديم اسم المستخدم
ur: صارف نام فراہم کرنا ضروری ہے
zh_cn: 必须提供用户名

source: Account
ar: الحساب
ur: اکاؤنٹ
zh_cn: 帐户

source: Blank Advanced Problem
ar: مشكلة متقدمة فارغة
ur: اعلی درجے کی مسئلہ
zh_cn: 空白的高级问题

source: YouTube ID for 1.25x speed
ar: معرف YouTube بسرعة 1.25x
ur: 1.25x کی رفتار کیلئے یو ٹیوب ID
zh_cn: YouTube ID为1.25倍速

source: Connected Accounts
ar: الحسابات المرتبطة
ur: منسلک اکاؤنٹس
zh_cn: 关联账户

source: Library Name
ar: اسم المكتبة
ur: لائبریری کا نام
zh_cn: 库名称

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
ar: عنوان Content-Type لهذا الملف لا يتطابق مع بيانات الملف. قد يكون الملف تالفًا.
ur: اس فائل کے لئے مواد کی قسم ہیڈر فائل کے اعداد و شمار سے متفق نہیں ہے. فائل خراب ہوسکتی ہے.
zh_cn: 此文件的Content-Type标头与文件数据不匹配。该文件可能已损坏。

source: The course key for the restricted course.
ar: مفتاح الدورة التدريبية للطبق المقيد.
ur: محدود کورس کے لئے کورس کی کلید.
zh_cn: 限制课程的课程重点。

source: Sailthru list name to add new users to.
ar: Sailthru اسم القائمة لإضافة مستخدمين جدد ل.
ur: سیلیلورس فہرست کا نام نئے صارفین کو شامل کرنے کے لئے.
zh_cn: Sailthru列表名称添加新用户。

source: Organization
ar: منظمة
ur: تنظیم
zh_cn: 组织

source: Terms of Service for {platform_name} APIs
ar: شروط الخدمة لـ {platform_name} واجهات برمجة التطبيقات
ur: {platform_name} APIs کے لئے سروس کی شرائط
zh_cn: {platform_name} API的服务条款

source: must contain {0} or more uppercase characters
ar: يجب أن يحتوي على {0} أو أكثر من الأحرف الكبيرة
ur: {0} یا زیادہ سے زیادہ حروف حروف پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多大写字符

source: Wiki notifications
ar: إشعارات ويكي
ur: ویکیپیڈیا اطلاعات
zh_cn: Wiki通知

source: Whether the credit provider is currently enabled.
ar: ما إذا كان مزود الائتمان ممكّن حاليًا أم لا.
ur: چاہے کریڈٹ فراہم کنندہ فی الحال فعال ہو.
zh_cn: 信贷提供者目前是否启用。

source: SubRip (.srt) file
ar: SubRip (.srt) ملف
ur: ذیلی ریپ (. ایس آر آر) فائل
zh_cn: SubRip（.srt）文件

source: This cannot be changed.
ar: هذا لا يمكن تغييره.
ur: یہ تبدیل نہیں کیا جا سکتا.
zh_cn: 这不能改变。

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
ar: يمكن وضع علامة على XBlocks المدرجة في قائمة الوحدات النمطية المتقدمة للدورة على أنها متوقفة. تذكر لتحديث حالة دعم XBlockStudioConfiguration وفقًا لذلك ، حيث لا يؤثر الإهمال على إمكانية إنشاء مثيلات XBlock الجديدة في Studio.
ur: کورس کے اعلی درجے کی ماڈیول لسٹ میں درج کردہ XBlocks صرف بدنام کے طور پر پرچم لگایا جا سکتا ہے. اس کے مطابق XBlockStudioConfiguration کی حمایت کی حیثیت کو اپ ڈیٹ کرنے کے لئے یاد رکھیں، جیسا کہ بدعنوانی پر اثر انداز نہیں ہوتا ہے کہ نیا سٹوڈیو میں XBlock مثال بنائے جاتے ہیں یا نہیں.
zh_cn: 只有课程的高级模块列表中列出的XBlock才可以被标记为已弃用。请记住相应地更新XBlockStudioConfiguration支持状态，因为不推荐使用不会影响Studio中是否可以创建新的XBlock实例。

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
ar: تم تلف حالة المشكلة عن طريق إرسال غير صحيح. يتكون التقديم من:
ur: مسئلہ کا ریاست غلط طور پر جمع کرانے میں خراب تھا. جمع کرانے پر مشتمل ہے:
zh_cn: 问题的状态被无效的提交所破坏。提交内容包括：

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
ar: {studio_name} هو حل مستضاف لشركائنا في xConsortium والضيوف المحددين. تظهر الدورات التي أنت عضو في فريق لك أعلاه لتعديلها ، بينما تمنح امتيازات منشئي الدورة التدريبية من خلال {platform_name}. سيقيّم فريقنا طلبك ويقدم لك التعليقات في غضون 24 ساعة خلال أسبوع العمل.
ur: {سٹوڈیو_ نام} ہمارے XConsortium شراکت داروں اور منتخب مہمانوں کے لئے ایک میزبان حل ہے. کورسز جن کے لئے آپ ٹیم ٹیم کا رکن آپ کے پاس ترمیم کرنے کے لئے مندرجہ بالا ظاہر ہوتا ہے، جبکہ کورس تخلیقی استحقاق {platform_name} کی طرف سے دی جاتی ہیں. ہماری ٹیم آپ کی درخواست کا جائزہ لے گی اور کام کے ہفتے کے دوران 24 گھنٹوں کے اندر اندر آپ کی رائے فراہم کرے گی.
zh_cn: {studio_name}是我们的xConsortium合作伙伴和选定访客的托管解决方案。您作为团队成员的课程出现在上面供您编辑，而课程创建者权限由{platform_name}授予。我们的团队将在工作周内的24小时内评估您的请求并提供反馈。

source: Bookmark with usage_id: {usage_id} does not exist.
ar: الإشارة المرجعية باستخدام usage_id: {usage_id} غير موجود.
ur: use_id کے ساتھ بک مارک: {use_id} موجود نہیں ہے.
zh_cn: 使用usage_id的书签：{usage_id}不存在。

source: Describe what your application does.
ar: صف ما يفعله طلبك.
ur: بیان کریں کہ آپ کی درخواست کیا ہے.
zh_cn: 描述你的应用程序的功能。

source: View our FAQs for answers to commonly asked questions.
ar: اعرض الأسئلة الشائعة الخاصة بنا للحصول على إجابات للأسئلة الشائعة.
ur: عام پوچھے گئے سوالات کے جواب کے لئے ہمارے سوالات دیکھیں.
zh_cn: 查看我们的常见问题解答常见问题解答。

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
ar: نحن نستخدم المعلومات التي تقدمها لتحسين دراستنا للطلاب الحاليين والمستقبليين. كلما عرفنا أكثر عن احتياجاتك الخاصة ، كان من الأفضل أن نجعل تجربة الدورة التدريبية الخاصة بك.
ur: ہم موجودہ اور مستقبل کے طالب علموں کے لئے ہمارے کورس کو بہتر بنانے کے لئے فراہم کردہ معلومات کا استعمال کرتے ہیں. ہم آپ کی مخصوص ضروریات کے بارے میں زیادہ جانتے ہیں، بہتر ہم آپ کے کورس کا تجربہ بنا سکتے ہیں.
zh_cn: 我们使用您提供的信息来改进我们当前和未来学生的课程。我们对您的具体需求了解得越多，我们就越能够提供您的课程体验。

source: Unknown User ID: {0}
ar: معرف المستخدم غير معروف: {0}
ur: نامعلوم صارف کی شناخت: {0}
zh_cn: 未知用户ID：{0}

source: Certificate dict {0} missing value key '{1}'
ar: شهادة dict {0} مفتاح القيمة المفقودة &#39;{1}&#39;
ur: سرٹیفیکیٹ ڈیم {0} قیمت کی قیمت لاپتہ &#39;{1}&#39;
zh_cn: 证书字典{0}缺少值键“{1}”

source: Looking for help signing in or with your {platform_name} account?
ar: هل تبحث عن مساعدة في تسجيل الدخول أو باستخدام حساب {platform_name}؟
ur: آپ {platform_name} اکاؤنٹ میں سائن ان کرنے یا اس کے ساتھ سائن ان کرنے کی مدد کر رہے ہیں؟
zh_cn: 寻找登录或使用您的{platform_name}帐户的帮助？

source: Keep learning
ar: حافظ على التعلم
ur: سیکھنا
zh_cn: 保持学习

source: Show Task Status
ar: إظهار حالة المهمة
ur: ٹاسک اسٹیٹ دکھائیں
zh_cn: 显示任务状态

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
ar: {link_start} انقر هنا للحصول على مزيد من المعلومات حول الرصيد على {platform_name} {link_end}.
ur: {link_start} {platform_name} {link_end} پر کریڈٹ پر مزید معلومات کیلئے یہاں کلک کریں.
zh_cn: {link_start}点击此处查看{platform_name} {link_end}上的更多信用信息。

source: Description of the asset.
ar: وصف الأصل.
ur: اثاثہ کی تفصیل.
zh_cn: 资产的描述。

source: Article properties last modified
ar: آخر تعديل للمادة
ur: آرٹیکل خصوصیات آخری ترمیم
zh_cn: 文章属性上次修改

source: Learn more about Course Re-runs
ar: تعرف على المزيد حول إعادة تشغيل الدورة التدريبية
ur: کورس دوبارہ رن کے بارے میں مزید جانیں
zh_cn: 了解有关课程重新运行的更多信息

source: Download Subsection Data for all Subsections as a CSV
ar: تنزيل بيانات Subsection لجميع الأقسام الفرعية باعتبارها CSV
ur: CSV کے تمام سبھی حصوں کے لئے سبسکرائب ڈیٹا ڈاؤن لوڈ کریں
zh_cn: 将所有子部分的子部分数据下载为CSV

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
ar: عملية الاستيراد لديها خمس مراحل. خلال المرحلتين الأوليتين ، يجب عليك البقاء على هذه الصفحة. يمكنك ترك هذه الصفحة بعد اكتمال مرحلة تفريغ الأمتعة. ومع ذلك ، نوصي بعدم إجراء تغييرات مهمة على الدورة التدريبية حتى تكتمل عملية الاستيراد.
ur: درآمد کے عمل میں پانچ مراحل ہیں. پہلے دو مراحل کے دوران آپ کو اس صفحہ پر رہنا ہوگا. آپ اس صفحہ کو چھوڑ کر انفارمیشن مرحلے کو مکمل کر سکتے ہیں. تاہم، ہم سفارش کرتے ہیں کہ درآمدی کارروائی مکمل ہوجائے جب تک آپ اپنے کورس میں اہم تبدیلیاں نہیں کریں گے.
zh_cn: 进口过程分为五个阶段。在前两个阶段，你必须留在这个页面上。您可以在拆箱阶段完成后离开此页面。但是，我们建议您在导入操作完成之前不要对您的课程进行重要更改。

source: Usernames can only contain letters, numerals, and @/./+/-/_ characters.
ar: لا يمكن أن تحتوي أسماء المستخدمين إلا على أحرف وأرقام و @ /. / + / - / _ characters.
ur: صارف ناموں میں صرف خط، پوائنٹس، اور @ /. / + / - / _ حروف شامل ہیں.
zh_cn: 用户名只能包含字母，数字和@ /。/ + / - / _字符。

source: A system error occurred while processing your payment. You have not been charged.
ar: حدث خطأ في النظام أثناء معالجة دفعتك. لم يتم تحصيل رسوم منك.
ur: آپ کی ادائیگی کے دوران ایک نظام کی خرابی واقع ہوئی. آپ کو چارج نہیں کیا گیا ہے.
zh_cn: 处理付款时发生系统错误。你没有被指控。

source: Markdown source of this module
ar: مصدر انخفاض السعر لهذه الوحدة
ur: اس ماڈیول کے مارکڈڈ ذریعہ
zh_cn: 这个模块的Markdown源

source: Unable to send reactivation email
ar: غير قادر على إرسال البريد الإلكتروني إعادة التنشيط
ur: دوبارہ ای میل بھیجنے میں ناکام
zh_cn: 无法发送重新激活电子邮件

source: Specify whether YouTube is available for the user.
ar: حدد ما إذا كان YouTube متاحًا للمستخدم.
ur: YouTube کو صارف کے لئے دستیاب ہے اس بات کی وضاحت کریں.
zh_cn: 指定YouTube是否可供用户使用。

source: {section_type} {index} Unreleased - 0% (?/?)
ur: {سیکشن_ٹائپ} {انڈیکس} غیر منحصر - 0٪ (؟ /؟)
zh_cn: {section_type} {index}未发布 - 0％（？/？）

source: Adding user "{username}" to groups {group_names}
ar: إضافة مستخدم &quot;{username}&quot; إلى مجموعات {group_names}
ur: گروپ {group_names} پر صارف کو &quot;{صارف کا نام}&quot; شامل کرنا
zh_cn: 将用户“{用户名}”添加到组{group_names}

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فسيتم إرسال الرسائل المميزة المرتبطة بالمحتوى في الدورة إلى المتعلمين في الوقت المحدد لهم.
ur: صحیح یا غلط درج کریں. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال رپورٹ نہیں کیا جا سکا. ایک یا زیادہ ایرر آ گئے ہیں. براہ مہربانی ایرر پیغام سے نشان زدہ فیلڈز کو ٹھیک کریں.
zh_cn: 输入true或false。如果属实，与课程内容相关的所有亮点都会在预定时间发送给学习者。

source: Looking for help with {studio_name}?
ar: هل تبحث عن مساعدة بشأن {studio_name}؟
ur: {studio_name} کے ساتھ مدد کی تلاش کر رہے ہیں؟
zh_cn: 寻找{studio_name}的帮助？

source: Text Annotation
ar: نص التعليق
ur: متن تشریح
zh_cn: 文本注释

source: Please check the syntax of your entry.
ar: يرجى التحقق من بناء الجملة من دخولك.
ur: براہ مہربانی اپنے اندراج کے نحوط کو چیک کریں.
zh_cn: 请检查您的条目的语法。

source: Average Length
ar: متوسط ​​الطول
ur: اوسط لمبائی
zh_cn: 平均长度

source: %(platform_name)s on Reddit
ar: ٪ (platform_name) s على Reddit
ur: ٪ (platform_name) s Reddit پر
zh_cn: ％（platform_name）在Reddit上

source: Add {course_name} to Cart <span>({price} USD)</span>
ar: إضافة {course_name} إلى السلة <span>({price} دولار أمريكي)</span>
ur: ٹوکری میں {course_name} شامل کریں <span>({قیمت} USD)</span>
zh_cn: 将{course_name}添加到购物车<span>（{price} USD）</span>

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
ar: سيتم إرسال اسم المستخدم والبريد الإلكتروني واسمك بالكامل إلى {الوجهة} ، حيث ستخضع عملية جمع هذه المعلومات واستخدامها لبنود الخدمة وسياسة الخصوصية.
ur: آپ کا صارف نام، ای میل، اور مکمل نام {منزل} میں بھیج دیا جائے گا، جہاں اس معلومات کا مجموعہ اور استعمال کیا جائے گا ان کی خدمت اور رازداری کی پالیسی کے لحاظ سے.
zh_cn: 您的用户名，电子邮件和全名将被发送到{目的地}，在那里收集和使用这些信息将受其服务条款和隐私政策的约束。

source: Cancel Invoice
ar: إلغاء الفاتورة
ur: انوائس کو منسوخ کریں
zh_cn: 取消发票

source: 1e and the exponent
ar: 1e والأس
ur: 1e اور متوقع
zh_cn: 1e和指数

source: If all of the information is correct and the problem persists, contact technical support.
ar: إذا كانت جميع المعلومات صحيحة واستمرت المشكلة ، فاتصل بالدعم الفني.
ur: اگر تمام معلومات درست ہے اور مسئلہ جاری ہے تو تکنیکی مدد سے رابطہ کریں.
zh_cn: 如果所有信息都正确且问题仍然存在，请联系技术支持。

source: Cohort:
ar: جماعة:
ur: کوہوٹر:
zh_cn: 人群：

source: The code ({code}) that you have tried to define is already in use as a registration code
ar: الشفرة ({code}) التي حاولت تحديدها قيد الاستخدام بالفعل كرمز تسجيل
ur: کوڈ ({کوڈ}) جس نے آپ کو وضاحت کرنے کی کوشش کی ہے پہلے سے ہی رجسٹریشن کوڈ کے طور پر استعمال میں ہے
zh_cn: 您试图定义的代码（{code}）已被用作注册码

source: Your new course is just a click away!
ar: مسارك الجديد هو مجرد نقرة واحدة!
ur: آپ کا نیا کورس صرف ایک کلک دور ہے!
zh_cn: 您的新课程只需点击一下！

source: User not found
ar: المستخدم ليس موجود
ur: صارف نہیں ملا
zh_cn: 未找到用户

source: Send me a text with the link
ar: أرسل لي نصًا يحتوي على الرابط
ur: لنک کے ساتھ مجھے ایک متن بھیجیں
zh_cn: 发送给我一个链接文本

source: Days Early for Beta Users
ar: الأيام المبكرة لمستخدمي بيتا
ur: بیٹا صارفین کیلئے ابتدائی دنوں
zh_cn: Beta用户的早期时间

source: Course Organization Display String
ar: بالطبع عرض المنظمة سلسلة
ur: کورس تنظیم ڈسپلے سٹرنگ
zh_cn: 课程组织显示字符串

source: Upload Handout
ar: تحميل المنشور
ur: ہینڈ آؤٹ اپ لوڈ کریں
zh_cn: 上传讲义

source: The course you are looking for does not start until {date}.
ar: لا تبدأ الدورة التي تبحث عنها حتى {date}.
ur: کورس آپ جو تلاش کر رہے ہیں {تاریخ} تک شروع نہیں ہوتا ہے.
zh_cn: 您要查找的课程直到{date}才开始。

source: Manually Enrolled
ar: مسجل يدويًا
ur: دستی طور پر اندراج
zh_cn: 手动注册

source: Customer's purchase order or other reference information
ar: طلب الشراء الخاص بالعميل أو أي معلومات مرجعية أخرى
ur: کسٹمر کی خریداری کی آرڈر یا دیگر حوالہ جات کی معلومات
zh_cn: 客户的采购订单或其他参考信息

source: PDF Textbooks
ar: كتب PDF
ur: پی ڈی ایف ٹیک بکس کتابیں
zh_cn: PDF教科书

source: Last modified:
ar: آخر تعديل:
ur: آخری نظر ثانی شدہ:
zh_cn: 上一次更改：

source: Advanced
ar: المتقدمة
ur: اعلی درجے کی
zh_cn: 高级

source: An account with the Public Username '{username}' already exists.
ar: يوجد بالفعل حساب باسم المستخدم العام &quot;{username}&quot;.
ur: عوامی صارف نام &#39;{صارف کا نام}&#39; کے ساتھ ایک اکاؤنٹ پہلے ہی موجود ہے.
zh_cn: 公共用户名“{用户名}”的帐户已存在。

source: must contain {0} or more lowercase characters
ar: يجب أن يحتوي على {0} أو أكثر من الأحرف الصغيرة
ur: {0} یا اس سے زیادہ کم حروف حروف پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多小写字符

source: Settings
ar: إعدادات
ur: ترتیبات
zh_cn: 设置

source: What content is exported?
ar: ما المحتوى الذي يتم تصديره؟
ur: کیا مواد برآمد کی جاتی ہے؟
zh_cn: 导出哪些内容？

source: {start_strong}{application_name}{end_strong} would like to access your data with the following permissions:
ar: يريد {start_strong} {application_name} {end_strong} الوصول إلى بياناتك باستخدام الأذونات التالية:
ur: {start_strong} {application_name} {end_strong} درج ذیل اجازتوں کے ساتھ اپنے ڈیٹا تک رسائی حاصل کرنا چاہیں گے:
zh_cn: {start_strong} {application_name} {end_strong}想要使用以下权限访问您的数据：

source: Invitation Only
ar: المدعوون فقط
ur: دعوت نامہ صرف
zh_cn: 只有邀请

source: Make sure your information is correct, or try again with a different card or another form of payment.
ar: تأكد من صحة معلوماتك ، أو حاول مرة أخرى باستخدام بطاقة أخرى أو طريقة أخرى للدفع.
ur: اس بات کو یقینی بنائیں کہ آپ کی معلومات درست ہے، یا ایک مختلف کارڈ یا کسی دوسرے ادائیگی کے ساتھ دوبارہ کوشش کریں.
zh_cn: 确保您的信息是正确的，或者使用其他卡或其他付款方式再次尝试。

source: Categories and labels for any exercises that are gradable
ar: الفئات والتسميات لأي تمارين قابلة للتقدير
ur: کسی بھی مشقوں کے لئے زمرہ جات اور لیبلز جو سایڈست ہوتے ہیں
zh_cn: 可分级练习的类别和标签

source: Thank you for your purchase of
ar: شكرا لشرائك
ur: آپ کی خریداری کے لئے شکریہ
zh_cn: 感谢您购买

source: Request user's email
ar: طلب البريد الإلكتروني للمستخدم
ur: درخواست صارف کا ای میل
zh_cn: 请求用户的电子邮件

source: Default Annotations Tab
ar: علامة تبويب التعليقات التوضيحية الافتراضية
ur: پہلے سے طے شدہ تشریحات ٹیب
zh_cn: 默认注释选项卡

source: The term in which the new course will run. (This value is often different than the original course run value.)
ar: المصطلح الذي سيتم تشغيل الدورة التدريبية الجديدة. (غالبًا ما تختلف هذه القيمة عن قيمة تشغيل الدورة التدريبية الأصلية.)
ur: جس اصطلاح میں نیا کورس چلایا جائے گا. (یہ قیمت اکثر اصل کورس چلانے کی قیمت سے مختلف ہے.)
zh_cn: 新课程将运行的期限。 （该值通常与原始路线运行值不同。）

source: The course material was too easy
ar: كانت المادة الدراسية سهلة للغاية
ur: کورس کا سامان بہت آسان تھا
zh_cn: 课程材料太简单了

source: Restoring article
ar: استعادة المادة
ur: آرٹیکل بحال
zh_cn: 恢复文章

source: Course End Date:
ar: تاريخ نهاية الدورة التدريبية:
ur: کورس کے اختتام کی تاریخ:
zh_cn: 课程结束日期：

source: Status:
ar: الحالة:
ur: حالت:
zh_cn: 状态：

source: Authorize
ar: يأذن
ur: اختیار
zh_cn: 授权

source: Reset your answer
ar: إعادة ضبط إجابتك
ur: اپنا جواب دوبارہ ترتیب دیں
zh_cn: 重置您的答案

source: Username is required.
ar: اسم المستخدم مطلوب.
ur: صارف نام کی ضرورت ہے.
zh_cn: 用户名是必需的。

source: Start learning to grade
ar: البدء في تعلم الصف
ur: گریڈ کو سیکھنا شروع کریں
zh_cn: 开始学习评分

source: Wiki Syntax Help
ar: ويكي بناء الجملة تعليمات
ur: ویکیپیڈیا سنٹیکس مدد
zh_cn: Wiki语法帮助

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
ar: يتم تقديم APIS وأي معلومات أو محتوى API أو الخدمات التي يتم توفيرها على أو من خلال APIS &quot;كما هي&quot; و &quot;كما هي متوفرة&quot; دون أي ضمان من أي نوع (صريحة أو ضمنية أو غير ذلك) ، بما في ذلك ، دون حصر ، أي ضمانات ضمنية الرواج والصلاحية لغرض معين وعدم الانتهاك ، باستثناء ما قد لا يتم التنازل عن أي ضمانات مماثلة بموجب القانون المعمول به.
ur: APIS اور کسی بھی معلومات، اے پی آئی کے مطابق یا دستیاب کردہ API کنٹینر یا سروسز دستیاب ہیں اور &quot;کے طور پر دستیاب&quot; کے طور پر &quot;کسی بھی لنڈ (اضافی، منسلک یا دیگر اثرات) کے بغیر&quot; کے طور پر فراہم کی جاتی ہے، جس کے علاوہ، محدود حد تک، کسی بھی ممکنہ جنگجوؤں کسی بھی ممکنہ وارثیوں کے طور پر کسی خاص طور پر استعمال اور غیر تشخیص کے لئے معاوضہ، فٹنس، لازمی طور پر مناسب قانون کے تحت رد عمل نہیں کیا جائے گا.
zh_cn: APIS以及通过AP提供的或通过AP提供的任何信息，API内容或服务均“按现状”和“可用”提供，不提供任何形式（明示，暗示或其他）的担保，包括但不限于任何暗示的担保适销性，针对特定用途的适用性和非侵权性的担保，但INSOFAR除外，因此任何此类暗示担保均不得在适用法律下予以免责。

source: (Optional)
ar: (اختياري)
ur: (اختیاری)
zh_cn: （可选的）
