Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/djangojs.po
Languages: ur

source: Preview of uploaded image
ur: اپ لوڈ کردہ تصویر کا پیش نظارہ

source: Your request could not be processed. Refresh the page and try again.
ur: آپ کی درخواست پر عملدرآمد نہیں کی جا سکتی. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Tips on taking a successful photo
ur: کامیاب تصویر لینے پر تجاویز

source: Make this subsection available as a prerequisite to other content
ur: اس مواد کو دیگر مواد تک شرط کے طور پر دستیاب کریں

source: You have not created any certificates yet.
ur: آپ نے ابھی تک کوئی سرٹیفکیٹ نہیں بنائے ہیں.

source: Release Date:
ur: تاریخ رہائی:

source: You've made some changes
ur: آپ نے کچھ تبدیلیاں کردی ہیں

source: Custom...
ur: اپنی مرضی کے مطابق...

source: Practice Proctored
ur: پروکیکٹ پریکٹس

source: You must select a session to access the course.
ur: کورس تک رسائی کیلئے آپ کو سیشن کا انتخاب کرنا ہوگا.

source: Explanation
ur: وضاحت

source: Font Family
ur: فونٹ خاندان

source: Header cell
ur: ہیڈر سیل

source: If you make significant changes, make sure you notify members of the team before making these changes.
ur: اگر آپ اہم تبدیلیاں کرتے ہیں، تو یقینی بنائیں کہ آپ ان تبدیلیوں سے قبل ٹیم کے ارکان کو مطلع کریں.

source: There must be at least one group.
ur: کم سے کم ایک گروپ ہونا لازمی ہے.

source: Your question or idea (required)
ur: آپ کا سوال یا خیال (ضروری ہے)

source: Start
ur: شروع کریں

source: Use your webcam to take a photo of your ID. We will match this photo with the photo of your face and the name on your account.
ur: اپنی شناخت کی تصویر لینے کے لۓ اپنے ویب کیم کا استعمال کریں. ہم اس تصویر کو آپ کے چہرے کی تصویر اور آپ کے اکاؤنٹ پر نام سے ملیں گے.

source: Provisionally Supported
ur: فراہم کی جاتی ہے

source: learners are successfully added to exception list
ur: سیکھنے والے کو استثناء کی فہرست میں کامیابی سے شامل کیا گیا ہے

source: Show notes
ur: نوٹ دکھائیں

source: An error has occurred. Make sure that you are connected to the Internet, and then try refreshing the page.
ur: ایک خرابی آگئی ہے. اس بات کو یقینی بنائیں کہ آپ انٹرنیٹ سے منسلک ہیں، اور پھر صفحہ کو تازہ کرنے کی کوشش کریں.

source: Content-Specific Discussion Topics
ur: مواد - مخصوص بحث موضوعات

source: Enrolling you in the selected course
ur: منتخب کردہ کورس میں آپ کو اندراج کر رہا ہے

source: Press close to hide course video settings
ur: کورس ویڈیو ترتیبات کو چھپانے کے قریب دبائیں

source: Date
ur: تاریخ

source: Post
ur: پوسٹ

source: Show Comment (%(num_comments)s)
ur: تبصرہ دکھائیں (٪ (num_comments) s

source: %(num_points)s point possible (graded)
ur: ٪ (num_points) کے نقطہ ممکن (درجہ بندی)

source: Enabled
ur: فعال

source: The grading process is still running. Refresh the page to see updates.
ur: گریڈنگ عمل اب بھی چل رہا ہے. اپ ڈیٹس دیکھنے کیلئے صفحہ تازہ کریں.

source: Are you sure you want to delete this comment?
ur: کیا آپ واقعی یہ تبصرہ حذف کرنا چاہتے ہیں؟

source: Add a clear and descriptive title to encourage participation. (Required)
ur: شرکت کی حوصلہ افزائی کے لئے ایک واضح اور وضاحتی عنوان شامل کریں. (ضروری ہے)

source: %(value)s hour
ur: ٪ (قیمت) ے گھنٹے

source: Yes, delete this {xblock_type}
ur: ہاں، اس {xblock_type} کو حذف کریں

source: Successfully deleted student state for user {user}
ur: صارف {صارف} کیلئے کامیابی سے طالب علم ریاست کو خارج کر دیا

source: Choose mode
ur: موڈ کا انتخاب کریں

source: Send to:
ur: کے لئے بھیج:

source: Please add at least one chapter
ur: براہ کرم کم سے کم ایک باب شامل کریں

source: Bookmarked
ur: بک مارک

source: Spellcheck
ur: املا کی جانچ

source: Upload your video thumbnail image.
ur: اپنا ویڈیو تھمب نیل تصویر اپ لوڈ کریں.

source: Row group
ur: صف گروپ

source: Submit
ur: جمع

source: Student Removed from certificate white list successfully.
ur: طالب علم کامیابی سے سرٹیفکیٹ سفید فہرست سے ہٹا دیا.

source: Username or Email
ur: اسم رکنیت یا ای میل

source: Use as a Prerequisite
ur: شرط کے طور پر استعمال کریں

source: For grading to work, you must change all {oldName} subsections to {newName}.
ur: کام پر گریڈنگ کے لئے، آپ {newName} کو سب {oldName} سبسکرائب تبدیل کرنا ضروری ہے.

source: There was an error updating your goal.
ur: اپنے مقصد کو اپ ڈیٹ کرنے میں ایک خرابی تھی.

source: Video image upload completed
ur: ویڈیو تصویر اپ لوڈ مکمل ہوگئی

source: Add Country
ur: ملک شامل کریں

source: Left to right
ur: بائیں سے دائیں

source: Due date cannot be before start date.
ur: تاریخ کی تاریخ شروع ہونے سے پہلے نہیں ہوسکتی ہے.

source: You are not enrolled in any programs yet.
ur: آپ ابھی تک کسی بھی پروگرام میں داخل نہیں ہوئے ہیں.

source: Show assessment results when subsection is past due
ur: سبسکرائب ماضی کی وجہ سے تشخیص کے نتائج دکھائیں

source: Click OK to have your e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ur: اپنے ای میل پتہ کو تیسری پارٹی کی درخواست پر بھیجنے کے لئے ٹھیک پر کلک کریں. اپنی معلومات کو بھیجنے کے بغیر اس صفحے پر واپس آنے کیلئے منسوخ کریں پر کلک کریں.

source: Name
ur: نام

source: Common Problem Types
ur: عام مسئلہ کی اقسام

source: price
ur: قیمت

source: Insert date/time
ur: تاریخ / وقت داخل کریں

source: Caption
ur: کیپشن

source: Enrollment Date
ur: اندراج کی تاریخ

source: %(programName)s Home Page.
ur: ٪ (پروگرام نام) کے ہوم پیج.

source: Does the name on your ID match your account name: %(fullName)s?
ur: کیا آپ کی شناخت کا نام آپ کا اکاؤنٹ نام ہے:٪ (fullName) s؟

source: Sent By
ur: کی طرف سے بھیجا

source: Published and Live
ur: شائع اور لائیو

source: An error occurred when signing you in to %s.
ur: ٪ s میں سائن ان کرتے وقت ایک خرابی واقع ہوئی.

source: Create an Account.
ur: کھاتا کھولیں.

source: Please enter valid start date and time.
ur: براہ کرم درست آغاز تاریخ اور وقت درج کریں.

source: There was an error, try searching again.
ur: ایک خرابی تھی، دوبارہ تلاش کرنے کی کوشش کریں.

source: View Course
ur: کورس دیکھیں

source: Team capacity
ur: ٹیم کی صلاحیت

source: Unable to submit application
ur: درخواست جمع کرنے میں ناکام

source: Error: Uploading failed.
ur: خرابی: اپ لوڈ کرنے میں ناکامی

source: This group controls access to:
ur: یہ گروپ تک رسائی کا کنٹرول ہے:

source: What does this mean?
ur: اس کا کیا مطلب ہے؟

source: Please add the instructor's name
ur: براہ کرم انسٹریکٹر کا نام شامل کریں

source: Not in Use
ur: استعمال میں نہیں

source: delete chapter
ur: باب کو خارج کردیں

source: Width
ur: چوڑائی

source: Organization
ur: تنظیم

source: Team member profiles
ur: ٹیم کے رکن پروفائلز

source: Display Name
ur: ڈسپلے کا نام

source: Source code
ur: سورس کوڈ

source: Attribution
ur: انتباہ

source: Section
ur: سیکشن

source: Upload New .srt Transcript
ur: نیا. ایس آر ٹرانسپٹسٹ اپ لوڈ کریں

source: Please enter a valid email address
ur: برائے مہربانی قابل قبول ای میل ایڈریس لکھیں

source: Vote for good posts and responses
ur: اچھے خطوط اور جوابات کے لئے ووٹ دیں

source: Identity Verification In Progress
ur: ترقی میں شناخت کی توثیق

source: Table properties
ur: ٹیبل کی خصوصیات

source: There was an error when trying to add learners:
ur: سیکھنے میں شامل ہونے کی کوشش کرتے وقت ایک غلطی تھی:

source: Showing {firstIndex} out of {numItems} total
ur: {numItems} کل سے {firstIndex} دکھا رہا ہے

source: endorsed %(time_ago)s by %(user)s
ur: ٪ (صارف) کے ذریعہ٪ (time_ago) کی حمایت کی

source: Removing a video from this list does not affect course content. Any content that uses a previously uploaded video ID continues to display in the course.
ur: اس فہرست سے ایک ویڈیو ہٹانے کورس کے مواد کو متاثر نہیں کرتا. کوئی بھی مواد جو پہلے ہی اپ لوڈ شدہ ویڈیو ID استعمال کرتا ہے کورس میں ظاہر ہوتا ہے.

source: Team Search
ur: ٹیم کی تلاش

source: Error generating grades. Please try again.
ur: پیدا ہونے والی گریڈ. دوبارہ کوشش کریں.

source: Editing comment
ur: تبصرہ ترمیم کریں

source: Large
ur: بڑے

source: Use bookmarks to help you easily return to courseware pages. To bookmark a page, click "Bookmark this page" under the page title.
ur: آپ آسانی سے محکمہ صفحات پر واپس لوٹنے میں مدد کرنے کیلئے بک مارک استعمال کریں. ایک صفحہ بک مارک کرنے کے لئے، صفحے کے عنوان کے تحت &quot;اس صفحہ کو بک مارک کریں&quot; پر کلک کریں.

source: Social Media Links
ur: سوشل میڈیا روابط

source: Are you sure you want to revert to the last published version of the unit? You cannot undo this action.
ur: کیا آپ واقعی اس یونٹ کے آخری شائع شدہ ورژن میں واپس آنا چاہتے ہیں؟ آپ اس کارروائی کو رد نہیں کر سکتے ہیں.

source: Create an account using
ur: استعمال کرتے ہوئے ایک اکاؤنٹ بنائیں

source: Time Sent:
ur: وقت بھیج دیا گیا:

source: Take me to the main course page
ur: مجھے مرکزی کورس کے صفحے پر لے لو

source: Remove from List
ur: فہرست سے خارج کریں

source: Grace period must be specified in HH:MM format.
ur: ایم ایچ کی شکل میں فضل کا دور ہونا ضروری ہے.

source: Right
ur: ٹھیک ہے

source: Unfollow
ur: ناکام

source: Delete Team
ur: ٹیم حذف کریں

source: Sign in here using your email address and password, or use one of the providers listed below.
ur: یہاں آپ کے ای میل ایڈریس اور پاس ورڈ کا استعمال کرتے ہوئے سائن ان کریں، یا مندرجہ ذیل فراہم کردہ فراہم کنندہ میں سے ایک کا استعمال کریں.

source: Sign in to continue learning
ur: سیکھنے جاری رکھنے کیلئے سائن ان کریں

source: Enter 3-5 highlights to include in the email message that learners receive for this section (250 character limit).
ur: ای میل پیغام میں شامل ہونے کے لئے 3-5 پر روشنی ڈالتا ہے جس میں سیکھنے والوں کو اس سیکشن کے لئے موصول ہوتا ہے (250 کردار کی حد).

source: Current tab
ur: موجودہ ٹیب

source: Enter email addresses and/or usernames, separated by new lines or commas, for the learners you want to add. *
ur: ای میل ایڈریس اور / یا صارف ناموں کو درج کریں، نئی لائنوں یا کمانڈوں کے ذریعہ الگ ہوجائیں، سیکھنے والوں کے لئے آپ شامل کرنا چاہتے ہیں. *

source: Emoticons
ur: ای میل

source: These users will be enrolled once they register:
ur: ان صارفین کو رجسٹر ہونے کے بعد اندراج کیا جائے گا:

source: Video Capture Error
ur: ویڈیو کی گرفتاری کی خرابی

source: Receive updates
ur: اپ ڈیٹس وصول کریں

source: Cohort Assignment Method
ur: کوورٹ تفویض کا طریقہ

source: Publish
ur: شائع کریں

source: Error while regenerating certificates. Please try again.
ur: سرٹیفکیٹ کی تخلیق کرتے وقت خرابی. دوبارہ کوشش کریں.

source: Location
ur: مقام

source: The URL you entered seems to be an external link. Do you want to add the required http:// prefix?
ur: آپ کا درج کردہ URL ایک بیرونی لنک ہونے لگتا ہے. کیا آپ کو مطلوبہ http: // prefix شامل کرنا چاہتے ہیں؟

source: This short name for the assignment type (for example, HW or Midterm) appears next to assignments on a learner's Progress page.
ur: تفویض کی قسم کے لئے یہ مختصر نام (مثال کے طور پر، HW یا Midterm) سیکھنے کے پیش رفت کے صفحے پر تفویض کے بعد ظاہر ہوتا ہے.

source: The published branch version, {published}, was reset to the draft branch version, {draft}.
ur: شائع شدہ برانچ ورژن، {شائع شدہ}، مسودہ شاخ کا ورژن، {مسودہ} پر ری سیٹ کیا گیا تھا.

source: ORDER PLACED
ur: استعمال کیا جاتا ہے

source: Files must be in JPEG or PNG format.
ur: فائل JPEG یا PNG کی شکل میں ہونا ضروری ہے.

source: Generate Exception Certificates
ur: استثنا سرٹیفکیٹ بنائیں

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
ur: درج ذیل صارفین کو اندراج کے ای میلز کو کامیابی سے بھیج دیا. وہ رجسٹر ہونے کے بعد انھیں نامزد کیا جائے گا:

source: The general category for this type of assignment, for example, Homework or Midterm Exam. This name is visible to learners.
ur: اس قسم کے تفویض کے لئے عام قسم، مثال کے طور پر، ہوم ورک یا مڈٹرم امتحان. یہ نام سیکھنے والوں کے لئے نظر آتا ہے.

source: Ensure that you can see your photo and read your name
ur: یقینی بنائیں کہ آپ اپنی تصویر دیکھ سکتے ہیں اور اپنے نام کو پڑھ سکتے ہیں

source: Chapter name is required
ur: باب کا نام ضروری ہے

source: Instructor
ur: انسٹرکٹر

source: Error starting a task to rescore problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
ur: &lt;٪ - student_id٪&gt; &#39;طالب علم کے لئے مسئلہ دوبارہ شروع کرنے کے لئے کام شروع کرنے میں خرابی ہے. &lt;٪ - problem_id٪&gt;&#39;. اس بات کو یقینی بنائیں کہ مسئلہ اور طالب علم کی شناخت مکمل اور درست ہیں.

source: Draft (Unpublished changes)
ur: ڈرافٹ (غیر شائع کردہ تبدیلیاں)

source: Start of transcript. Skip to the end.
ur: نقل کا آغاز اختتام پر جائیں.

source: Target
ur: ہدف

source: Use Current Transcript
ur: موجودہ ٹرانسمیشن کا استعمال کریں

source: Edit %(display_name)s (required)
ur: ترمیم کریں٪ (display_name) s (ضروری ہے)

source: Sign In
ur: داخلہ

source: Instructor tools
ur: انسٹریکٹر ٹولز

source: Add Thumbnail - {videoName}
ur: تھمب نیل شامل کریں - {videoName}

source: Chapter information
ur: باب کی معلومات

source: Download Transcript for Editing
ur: ترمیم کیلئے ٹرانسپٹ ڈاؤن لوڈ کریں

source: Reset Password
ur: پاس ورڈ ری سیٹ

source: Professional Education Verified Certificate
ur: پروفیشنل تعلیم کی تصدیق شدہ سند

source: Your unenrollment request could not be processed. Please try again later.
ur: آپ کا اندراج کی درخواست پر عملدرآمد نہیں کیا جاسکتا. براہ کرم کچھ دیر بعد کوشش کریں.

source: Image description
ur: تصویری وضاحت

source: Additional Time (minutes)
ur: اضافی وقت (منٹ)

source: To receive a certificate, you must also verify your identity.
ur: ایک سرٹیفکیٹ حاصل کرنے کے لئے، آپ کو اپنی شناخت کی بھی تصدیق کرنا ضروری ہے.

source: You will not be refunded the amount you paid.
ur: آپ رقم کی ادائیگی نہیں کی جائے گی.

source: Note
ur: نوٹ

source: Exam Types
ur: امتحان کی اقسام

source: This response could not be unmarked as an answer. Refresh the page and try again.
ur: یہ جواب جواب کے طور پر نشان لگا دیا جا سکتا ہے. صفحہ تازہ کریں اور دوبارہ کوشش کریں.

source: Register through edX
ur: EDX کے ذریعے رجسٹر کریں

source: Review your info
ur: اپنی معلومات کا جائزہ لیں

source: Full Profile
ur: مکمل پروفائل

source: This course uses automatic cohorting for verified track learners. You cannot disable cohorts, and you cannot rename the manual cohort named '{verifiedCohortName}'. To change the configuration for verified track cohorts, contact your edX partner manager.
ur: یہ کورس تصدیق شدہ ٹریک سیکھنے کے لئے خود کار طریقے سے ہم آہنگی کا استعمال کرتا ہے. آپ کوہ کو غیر فعال نہیں کر سکتے ہیں، اور آپ کو &#39;VerifiedCohortName}&#39; نامی دستی کوڈ نام تبدیل نہیں کر سکتے ہیں. تصدیق شدہ ٹریک کوز کیلئے ترتیب کو تبدیل کرنے کے لئے، اپنے EDX پارٹنر مینیجر سے رابطہ کریں.

source: Submission aborted! Sorry, your browser does not support file uploads. If you can, please use Chrome or Safari which have been verified to support file uploads.
ur: جمع کردی گئی! معذرت، آپ کے براؤزر فائل اپ لوڈز کی حمایت نہیں کرتا. اگر آپ کر سکتے ہیں، تو براہ کرم Chrome یا سفاری کا استعمال کریں جو فائل اپ لوڈز کی حمایت کیلئے تصدیق کی گئی ہے.

source: Your video uploads are not complete.
ur: آپ کے ویڈیو اپ لوڈ مکمل نہیں ہیں.

source: Only the parent course staff of a CCX can create content groups.
ur: سی سی ایکس کے صرف والدین کورس کے عملے کو مواد کے گروہوں کو تشکیل دے سکتا ہے.

source: This post will be visible only to %(group_name)s.
ur: یہ اشاعت صرف٪ (group_name) کے لئے نظر آئے گا.

source: Custom color
ur: اپنی مرضی کے مطابق رنگ

source: Date Placed
ur: تاریخ طے شدہ

source: Transcript Fidelity
ur: ٹرانسمیشن کی مخلص

source: Used in {count} location
ur: {شمار} مقام میں استعمال کیا جاتا ہے

source: Vertical space
ur: عمودی خلا

source: Course title
ur: کورس کا عنوان

source: Send notification to mobile apps
ur: موبائل اطلاقات میں نوٹیفیکیشن بھیجیں

source: Group Configuration information
ur: گروپ ترتیب کی معلومات

source: Reason for change:
ur: تبدیلی کا سبب:

source: Action
ur: عمل

source: COURSES IN PROGRESS
ur: پیش رفت میں کورس

source: Allowance Type
ur: الاؤنس کی قسم

source: Follow or unfollow posts
ur: فالو کریں یا ناپسندیدہ مراسلہ

source: Delete this {xblock_type}?
ur: یہ {xblock_type} حذف کریں؟

source: dragging out of slider
ur: سلائیڈر سے باہر گھسیٹنا

source: Component Location ID
ur: اجزاء کی جگہ کی شناخت

source: Open
ur: کھولیں

source: Collapse/Expand this %(xblock_type)s
ur: کھولیں / کھولیں اس٪ (xblock_type) s

source: Edit Membership
ur: رکنیت میں ترمیم کریں

source: Your {program} Certificate
ur: آپ {پروگرام} سرٹیفکیٹ

source: Cannot drop more <%= types %> assignments than are assigned.
ur: زیادہ سے زیادہ &lt;٪ = اقسام٪&gt; تفویض نہیں کیا جا سکتا تفویض نہیں کر سکتے ہیں.

source: Course Outline
ur: کورس آؤٹ لائن

source: Add {role} Access
ur: رسائی {کردار} تک رسائی حاصل کریں

source: Your file '{file}' has been uploaded. Allow a few minutes for processing.
ur: آپ کی فائل &#39;{فائل}&#39; کو اپ لوڈ کردی گئی ہے. پروسیسنگ کے لئے چند منٹ کی اجازت دیں.

source: Sign in with %(providerName)s
ur: ٪ (providerName) کے ساتھ سائن ان کریں

source: Professional Certificate for {courseName}
ur: {courseName} کے لئے پروفیشنل سرٹیفکیٹ

source: You need a driver's license, passport, or other government-issued ID that has your name and photo.
ur: آپ کو ایک ڈرائیور کا لائسنس، پاسپورٹ، یا دیگر حکومت سے جاری کردہ شناخت کی ضرورت ہے جو آپ کا نام اور تصویر ہے.

source: Row type
ur: صف کی قسم

source: Create account using %(providerName)s.
ur: ٪ (فراہم کنندہ نام) کے ذریعے اکاؤنٹ بنائیں.

source: Prev
ur: پچھلا

source: Profile
ur: پروفائل

source: dragging
ur: گھسیٹنا

source: Create a content group
ur: ایک مواد گروپ بنائیں

source: V Align
ur: وی سیدھ

source: If you select an option other than "%(hide_label)s", published units in this subsection become available to learners unless they are explicitly hidden.
ur: اگر آپ &quot;٪ (hide_label) s&quot; کے علاوہ کسی اختیار کا انتخاب کرتے ہیں تو، اس سبسکرائب میں شائع یونٹس سیکھنے والوں کے لئے دستیاب ہو جاتے ہیں جب تک کہ وہ واضح طور پر پوشیدہ نہ ہوں.

source: An error occurred.
ur: ایک خرابی آگئی.

source: Legal name
ur: قانونی نام

source: Your team could not be updated.
ur: آپ کی ٹیم کو اپ ڈیٹ نہیں کیا جا سکا.

source: %d year
ur: ٪ d سال

source: Submit enrollment change
ur: داخلہ تبدیلی جمع کریں

source: Why does %(platformName)s need my photo?
ur: ٪ (پلیٹ فارم نام) میری تصویر کی ضرورت کیوں ہے؟

source: Find a course
ur: ایک کورس تلاش کریں

source: If the unit was previously published and released to learners, any changes you made to the unit when it was hidden will now be visible to learners.
ur: اگر یونٹ پہلے ہی شائع کیا گیا تھا اور سیکھنے والوں کو جاری کیا گیا تھا تو، آپ کو اس یونٹ میں جو کسی بھی تبدیلی سے پوشیدہ تھی وہ سیکھنے والوں کو نظر انداز کریں گے.

source: Show All
ur: سارے دکھاو

source: Clear
ur: واضح کریں

source: Why activate?
ur: چالو کیوں

source: Enter Due Date and Time
ur: کی وجہ سے تاریخ اور وقت درج کریں

source: You must select a session by {expiration_date} to access the course.
ur: کورس تک رسائی کیلئے آپ کو {expiration_date} کے ذریعہ سیشن کا انتخاب کرنا ہوگا.

source: Show transcripts ({totalTranscripts})
ur: ٹرانزیکٹس دکھائیں ({totalTranscripts})

source: Queued
ur: قطار

source: Image (Ctrl+G)
ur: تصویر (Ctrl + G)

source: Hide content after course end date
ur: کورس کے آخر کی تاریخ کے بعد مواد چھپائیں

source: Your file {filename} is too large (max size: {maxSize}MB).
ur: آپ کی فائل {فائل نام} بہت بڑا ہے (زیادہ سے زیادہ سائز: {maxSize} MB).

source: Add Learners
ur: قارئین کو شامل کریں

source: Could not parse certificate JSON. %(message)s
ur: سرٹیفکیٹ JSON کو پارس نہیں مل سکا. ٪ (پیغام) s

source: Leave Team
ur: ٹیم چھوڑ دو

source: Please add a photo of the instructor (Note: only JPEG or PNG format supported)
ur: برائے مہربانی اس تصویر کا ایک تصویر شامل کریں (نوٹ: صرف JPEG یا PNG فارمیٹ کی حمایت کی ہے)

source: As part of the verification process, you take a photo of both your face and a government-issued photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
ur: توثیق کے عمل کے حصے کے طور پر، آپ کو آپ کے چہرے اور ایک سرکاری طور پر جاری کردہ تصویر کی شناخت کی تصویر لگتی ہے. ہماری اجازت کی خدمت آپ کی شناخت کی تصویر کے ساتھ لے جانے والے تصویر کی موازنہ کرکے اپنی شناخت کی تصدیق کرتا ہے.

source: Loading
ur: لوڈ کر رہا ہے

source: Very loud
ur: بہت اونچی آواز میں

source: Is Visible To:
ur: دیکھنے کے لئے ہے:

source: Released:
ur: جاری

source: Tags:
ur: ٹیگز:

source: Scope
ur: دائرہ کار

source: No Flash Detected
ur: فلیش کا پتہ چلا نہیں

source: There has been an error while exporting.
ur: برآمد کرنے میں ایک خرابی ہوئی ہے.

source: Completed
ur: مکمل

source: Special Exam
ur: خصوصی امتحان

source: You changed a video URL, but did not change the timed transcript file. Do you want to use the current timed transcript or upload a new .srt transcript file?
ur: آپ نے ایک ویڈیو URL کو تبدیل کر دیا، لیکن ٹائم شدہ ٹرانسپٹ فائل کو تبدیل نہیں کیا. کیا آپ موجودہ ٹائم ٹرانزیکشن استعمال کرنا چاہتے ہیں یا نئی ایس ایس آر ٹرانسپٹ فائل کو اپ لوڈ کرنا چاہتے ہیں؟

source: Annotation
ur: تشریح

source: Change
ur: تبدیل کریں

source: Your course could not be exported to XML. There is not enough information to identify the failed component. Inspect your course to identify any problematic components and try again.
ur: آپ کا کورس XML پر برآمد نہیں کیا جاسکتا. ناکام جزو کی شناخت کے لئے کافی معلومات نہیں ہے. کسی بھی دشواری اجزاء کی شناخت کے لئے اپنے کورس کا معائنہ کریں اور دوبارہ کوشش کریں.

source: Task Type
ur: ٹاسک کی قسم

source: Completed At
ur: مکمل پر

source: Starts
ur: شروع ہوتا ہے

source: Unlink your {accountName} account
ur: اپنے {اکاؤنٹ نام} اکاؤنٹ کو غیر مقفل کریں

source: All professional education courses are fee-based, and require payment to complete the enrollment process.
ur: تمام پیشہ ورانہ تعلیم کے کورس فیس بنیاد پر ہیں، اور اندراج کے عمل کو مکمل کرنے کے لئے ادائیگی کی ضرورت ہوتی ہے.

source: Delete Page Confirmation
ur: صفحہ کی توثیق حذف کریں

source: post anonymously to classmates
ur: گمنامہ کو ہمسایہ طور پر پوسٹ کریں

source: Transcripts
ur: ٹرانسمیشن

source: dropped on target
ur: ہدف پر گرا دیا

source: This is the Description of the Group Configuration
ur: یہ گروپ ترتیب کی تفصیل ہے

source: This post is visible to everyone.
ur: یہ اشاعت ہر کسی کو نظر آتا ہے.

source: Pin
ur: پن

source: Server Error, Please refresh the page and try again.
ur: سرور کی خرابی، صفحہ کو تازہ کریں اور دوبارہ کوشش کریں.

source: Subsection is hidden after due date
ur: متوقع تاریخ کے بعد سبسکرائب ہے

source: Your changes have been saved. {details}
ur: آپ کی تبدیلیاں محفوظ ہوگئی ہیں. {تفصیلات}

source: Yourself
ur: آپ خود

source: Increase indent
ur: انڈنٹ بڑھو

source: Your upload of '{file}' succeeded.
ur: &#39;{فائل}&#39; کا اپ لوڈ کامیاب ہوگیا.

source: Are you sure you want to change to a different session?
ur: کیا آپ واقعی مختلف سیشن میں تبدیل کرنا چاہتے ہیں؟

source: Error enrolling/unenrolling users.
ur: صارفین کو اندراج / ناکام کرنے میں ناکامی

source: Creative Commons
ur: تخلیق مشترک

source: The certificate available date must be later than the course end date.
ur: سرٹیفکیٹ دستیاب تاریخ کورس کے اختتامی تاریخ کے بعد بعد میں ہونا ضروری ہے.

source: Show me other ways to sign in or register
ur: مجھے سائن ان یا رجسٹر کرنے کے دوسرے طریقے دکھائیں

source: Verified Certificate
ur: تصدیق شدہ سرٹیفکیٹ

source: Add notes about this learner
ur: اس سیکھنے کے بارے میں نوٹ شامل کریں

source: Hyperlink (Ctrl+L)
ur: ہائپر لنکس (Ctrl + L)

source: No results found for "%(query_string)s". Please try searching again.
ur: &quot;٪ (query_string) کے لئے کوئی نتیجہ نہیں ملا.&quot; براہ کرم دوبارہ تلاش کرنے کی کوشش کریں.

source: Italic (Ctrl+I)
ur: اٹلی (Ctrl + I)

source: Noted in:
ur: میں نوٹ:

source: Group B
ur: گروپ بی

source: Visibility
ur: نمائش

source: Group A
ur: گروپ اے

source: Contains {count} group
ur: {شمار} گروپ پر مشتمل ہے

source: Visible to
ur: دیکھنے کے لئے

source: To invalidate a certificate for a particular learner, add the username or email address below.
ur: ایک خاص سیکرٹری کے لئے ایک سرٹیفکیٹ کو باطل کرنے کے لئے، ذیل میں صارف کا نام یا ای میل پتہ شامل کریں.

source: Choose a location to move your component to
ur: اپنا جزو منتقل کرنے کے لئے ایک جگہ کا انتخاب کریں

source: Please do not use any spaces or special characters in this field.
ur: برائے مہربانی اس فیلڈ میں کسی جگہ یا خاص حروف استعمال نہ کریں.
