Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Too similar to a restricted dictionary word.
ar: تشبه إلى حد كبير كلمة القاموس المقيدة.
ur: بہت محدود ڈکشنری لفظ کے ساتھ.
zh_cn: 与受限词典词类似。

source: The user {username} is already a member of a team in this course.
ar: المستخدم {اسم المستخدم} هو بالفعل عضو في فريق في هذه الدورة التدريبية.
ur: صارف {صارف کا نام} پہلے سے ہی اس کورس میں ایک ٹیم کا ایک رکن ہے.
zh_cn: 用户{username}在本课程中已经是团队的成员。

source: The due date for this assignment has passed.
ar: لقد انتهى تاريخ الاستحقاق لهذه المهمة.
ur: اس تفویض کے لئے تاریخ کی تاریخ منظور ہو گئی ہے.
zh_cn: 此作业的截止日期已过。

source: original article
ar: المقالة الأصلية
ur: اصل آرٹیکل
zh_cn: 来源文章

source: After this purchase is complete, a receipt is generated with relative billing details and registration codes for students.
ar: بعد اكتمال عملية الشراء هذه ، يتم إنشاء إيصال بتفاصيل الفوترة النسبية ورموز التسجيل للطلاب.
ur: اس خریداری کے بعد، طالب علموں کے لئے رشتہ دار بلنگ کی تفصیلات اور رجسٹریشن کوڈوں کے ساتھ رسید پیدا ہوئی ہے.
zh_cn: 购买完成后，将生成一张收据，其中包含相对计费详情和学生注册码。

source: Course Number:
ar: رقم الدورة:
ur: کورس نمبر:
zh_cn: 课程编号：

source: {earned} of {total} possible points
ar: {المكتسبة} من {total} من النقاط المحتملة
ur: {مجموعی} {مجموعی} ممکنہ پوائنٹس کے
zh_cn: {总}可能得分

source: Remote Gradebook
ar: دفتر التقديرات عن بعد
ur: ریموٹ گریڈ بک
zh_cn: 远程成绩簿

source: (Unnamed)
ar: (لم يذكر اسمه)
ur: (ناممکن)
zh_cn: （未命名）

source: Message successfully {action} for {attempted} recipients
ar: تم بنجاح إرسال الرسالة {action} إلى {recippted} المستلمين
ur: {کوشش شدہ} وصول کنندہ کیلئے {کامیابی} پیغام کامیابی سے پیغام
zh_cn: {尝试}收件人已成功发送{action}消息

source: Please complete the following fields to register for an account.
ar: الرجاء إكمال الحقول التالية للتسجيل للحصول على حساب.
ur: ایک اکاؤنٹ کے لئے رجسٹر کرنے کیلئے براہ کرم درج ذیل شعبوں کو مکمل کریں.
zh_cn: 请填写以下字段以注册帐户。

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
ar: يشير هذا الإعداد إلى ما إذا كان لدى الطلاب وقتًا محدودًا لعرض مكون البرنامج التعليمي هذا أو التفاعل معه.
ur: یہ ترتیب یہ بتاتی ہے کہ آیا اس طالب علم کو اس مجسمے کے اجزاء کے ساتھ دیکھنے یا اس سے نمٹنے کے لئے محدود وقت ہے.
zh_cn: 此设置表示学生是否有时间查看或与此课件组件交互。

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
ar: لإنشاء مقال wiki جديد ، قم بإنشاء ارتباط إليه. النقر على الرابط يمنحك صفحة الإنشاء.
ur: نیا ویکی آرٹیکل بنانے کے لئے، اسے ایک لنک بنائیں. لنک پر کلک کرنے سے آپ کو تخلیقی صفحہ فراہم ہوتا ہے.
zh_cn: 要创建新的wiki文章，请创建一个链接。点击链接会为您提供创建页面。

source: Description for the credit provider displayed to users.
ar: وصف لمزود الائتمان المعروضة للمستخدمين.
ur: صارفین کو ظاہر کردہ کریڈٹ فراہم کنندہ کے لئے تفصیل.
zh_cn: 向用户显示信用额度提供者的说明。

source: Redirect URLs
ar: إعادة توجيه عناوين المواقع
ur: یو آر ایل کو ریورس کریں
zh_cn: 重定向网址

source: Tar file not found
ar: ملف القطران غير موجود
ur: ٹار فائل نہیں ملا
zh_cn: 未找到Tar文件

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
ar: {tos_link_start} بنود الخدمة {tos_link_end} و {honor_link_start} قانون الشرف {honor_link_end}
ur: {tos_link_start} سروس کی شرائط {tos_link_end} اور {honor_link_start} عزت کا کوڈ {honor_link_end}
zh_cn: {tos_link_start}服务条款{tos_link_end}和{honor_link_start}荣誉代码{honor_link_end}

source: Type in some contents
ar: اكتب في بعض المحتويات
ur: کچھ مواد میں لکھیں
zh_cn: 输入一些内容

source: Start Date
ar: تاريخ البدء
ur: شروع کرنے کی تاریخ
zh_cn: 开始日期

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
ar: لدى المصرف المصدر أسئلة حول الطلب. إصلاح محتمل: أعد المحاولة باستخدام طريقة دفع أخرى
ur: جاری بینک کے پاس درخواست کے بارے میں سوالات ہیں. ممکنہ فکس: ادائیگی کی ایک اور قسم کے ساتھ دوبارہ کوشش کریں
zh_cn: 开证行对请求有疑问。可能的解决方法：使用其他付款方式重试

source: Course has not started
ar: بالطبع لم تبدأ
ur: کورس شروع نہیں ہوا ہے
zh_cn: 课程还没开始

source: slug
ar: سبيكة
ur: سلگ
zh_cn: 金属块

source: How {platform_name} Validates Student Certificates
ar: كيف يقوم {platform_name} بالتحقق من صحة شهادات الطلاب
ur: کس طرح {platform_name} طالب علم سرٹیفکیٹ کی توثیق کرتا ہے
zh_cn: {platform_name}如何验证学生证书

source: Confidentiality
ar: سرية
ur: رازداری
zh_cn: 保密

source: Found existing user: "{}"
ar: العثور على مستخدم حالي: &quot;{}&quot;
ur: موجودہ صارف ملا: &quot;{}&quot;
zh_cn: 找到现有用户：“{}”

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
ar: إذا لم يتم تحديد هذا الخيار ، فلن يتم عرض المستخدمين على المزود كخيار للمصادقة في شاشة تسجيل الدخول ، ولكن المصادقة اليدوية باستخدام الارتباط الصحيح لا تزال ممكنة.
ur: اگر یہ اختیار منتخب نہیں کیا جاتا ہے تو، صارف کو فراہم کنندہ کے ساتھ لاگ ان اسکرین پر معطل کرنے کا اختیار نہیں ہے، لیکن درست لنک کا استعمال کرتے ہوئے دستی تصدیق اب بھی ممکن ہے.
zh_cn: 如果未选择此选项，用户将不会被提供给提供者作为在登录屏幕上进行身份验证的选项，但仍可以使用正确的链接进行手动身份验证。

source: Course Instructor
ar: مدرس المقرر
ur: کورس انسٹرکٹر
zh_cn: 课程导师

source: Receipt For {course_name}
ar: إيصال لـ {course_name}
ur: {course_name} کے لئے رسید
zh_cn: {course_name}的收据

source: Cost in cents to report to Sailthru for enrolls.
ar: التكلفة في السنتات للإبلاغ إلى Sailthru للتسجيل.
ur: اندراج کے لئے سیلیلیو کو رپورٹ کرنے کے لئے سینٹ میں لاگت
zh_cn: 以美分为单位向Sailthru报名。

source: Enter true or false. If true, students can use the Student Notes feature.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكن للطلاب استخدام ميزة ملاحظات الطلاب.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، طالب علموں کو طالب علم نوٹس کی خصوصیت کا استعمال کر سکتا ہے.
zh_cn: 输入true或false。如果属实，学生可以使用学生笔记功能。

source: Choose a File to Import
ar: اختر ملفًا لاستيراده
ur: درآمد کرنے کیلئے فائل منتخب کریں
zh_cn: 选择一个要导入的文件

source: All Discussions
ar: كل المناقشات
ur: تمام بحث
zh_cn: 所有讨论

source: Date of Original Transaction
ar: تاريخ المعاملة الأصلية
ur: اصل ٹرانزیکشن کی تاریخ
zh_cn: 原始交易日期

source: Has the course started?
ar: هل بدأت الدورة؟
ur: کیا کورس شروع ہوا ہے؟
zh_cn: 课程开始了吗？

source: Launch Latex Source Compiler
ar: إطلاق اللثي المصدر مترجم
ur: لیٹیکس ماخذ کمپائلر شروع کریں
zh_cn: 启动Latex源代码编译器

source: Make a suggestion
ar: قدم اقتراح
ur: ایک تجویز بنائیں
zh_cn: 提个建议

source: Empty Cart
ar: عربة فارغة
ur: خالی ٹوکری
zh_cn: 空购物车

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
ar: تستخدم التجربة تكوين مجموعة غير معتمد للتجارب. حدد تكوين مجموعة صحيح أو احذف هذه التجربة.
ur: تجربے کو ایک گروپ کی تشکیل کا استعمال کرتا ہے جو تجربات کے لئے معاون نہیں ہے. ایک درست گروہ ترتیب کو منتخب کریں یا اس تجربے کو حذف کریں.
zh_cn: 该实验使用实验不支持的组配置。选择一个有效的组配置或删除这个实验。

source: Sorry, couldn't parse formula
ar: عذرا ، لا يمكن تحليل الصيغة
ur: افسوس، فارمولا کو پار نہیں کر سکا
zh_cn: 对不起，无法解析公式

source: Required Information
ar: معلومات مطلوبة
ur: ضروری معلومات
zh_cn: 要求（提供）的信息

source: (UTC)
ar: (التوقيت العالمي)
ur: (یو این سی)
zh_cn: （世界标准时间）

source: Loading
ar: جار التحميل
ur: لوڈ کر رہا ہے
zh_cn: 载入中

source: {platform_name} offers interactive online classes and MOOCs.
ar: تقدم {platform_name} دروسًا عبر الإنترنت و MOOCs تفاعلية.
ur: {platform_name} انٹرایکٹو آن لائن کلاسز اور MOOCs پیش کرتا ہے.
zh_cn: {platform_name}提供交互式在线课程和MOOC。

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
ar: تتم معالجة طلبك للوصول إلى {platform_name} واجهة برمجة تطبيقات Course Catalog. ستتلقى رسالة على عنوان البريد الإلكتروني في ملفك الشخصي عند اكتمال المعالجة. يمكنك أيضًا الرجوع إلى هذه الصفحة للاطلاع على حالة طلب الوصول إلى واجهة برمجة التطبيقات.
ur: {platform_name} کورس کیٹلوگ API تک رسائی حاصل کرنے کی آپ کی درخواست پر عملدرآمد کیا جارہا ہے. پروسیسنگ مکمل ہونے پر آپ کو اپنے پروفائل میں ای میل پتہ پر ایک پیغام ملے گا. آپ اپنے API تک رسائی کی درخواست کی حیثیت کو دیکھنے کے لئے بھی اس صفحہ پر واپس جا سکتے ہیں.
zh_cn: 正在处理您访问{platform_name}课程目录API的请求。处理完成后，您将在配置文件的电子邮件地址收到一条消息。您也可以返回到此页面查看您的API访问请求的状态。

source: Markdown tag
ar: يوم تخفيض السعر
ur: مارک ڈائون دن
zh_cn: 减价日

source: Registration using {provider} has timed out.
ar: انتهى التسجيل باستخدام {provider}.
ur: {فراہم کنندہ} کا استعمال کرتے وقت رجسٹریشن کا وقت ختم ہوگیا ہے.
zh_cn: 使用{provider}注册已超时。

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
ar: لعرض نموذج شهادة ، اختر وضع دورة تدريبية وحدد {em_start} شهادة المعاينة {em_end}.
ur: نمونہ سرٹیفکیٹ دیکھنے کے لئے، کورس موڈ کا انتخاب کریں اور {em_start} پیش نظارہ سرٹیفیکیٹ {em_end} منتخب کریں.
zh_cn: 要查看示例证书，请选择课程模式，然后选择{em_start}预览证书{em_end}。

source: Set Course Mode Price
ar: تعيين سعر وضع الدورة التدريبية
ur: کورس موڈ قیمت مقرر کریں
zh_cn: 设置课程模式价格

source: Public Display Name
ar: اسم العرض العام
ur: عوامی ڈسپلے کا نام
zh_cn: 公共显示名称

source: Has the course ended?
ar: هل انتهت الدورة؟
ur: کیا کورس ختم ہو گیا ہے؟
zh_cn: 课程结束了吗？

source: {platform_name} reserves the right, in its discretion, to impose restrictions and limitations on the number and frequency of calls made by you or your Application to the APIs. You must not attempt to circumvent any restrictions or limitations that we impose.
ar: تحتفظ {platform_name} بالحق ، وفقًا لتقديرها ، في فرض قيود وقيود على عدد وتكرار المكالمات التي تجريها أنت أو تطبيقك على واجهات برمجة التطبيقات. يجب ألا تحاول الالتفاف حول أي قيود أو قيود تفرضها.
ur: {platform_name} اپنے اختیار میں، حق کو محفوظ رکھتا ہے، آپ کے ذریعہ کردہ کالوں کی تعداد اور تعدد پر پابندیاں اور حدود کو نافذ کرنے کے لئے یا آپ کے ایپلیکیشنز پر آپ کی درخواست. آپ کو کسی پابندی یا حدود کو ختم کرنے کی کوشش نہیں کرنا چاہئے جو ہم نافذ کرتے ہیں.
zh_cn: {平台名称}保留自行决定对您或您的应用程序对API进行调用的次数和频率施加限制和限制的权利。您不得企图规避我们施加的任何限制或限制。

source: URL for Annotation Storage
ar: عنوان URL للتخزين التوضيحي
ur: تشریح اسٹوریج کیلئے یو آر ایل
zh_cn: 注释存储的URL

source: Enroll in {course_name}
ar: التسجيل في {course_name}
ur: {course_name} میں اندراج کریں
zh_cn: 注册{course_name}

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
ar: تتم مراجعة طلبك حاليًا من قِبل {platform_name} من الموظفين وينبغي تحديثه بعد قليل.
ur: آپ کی درخواست فی الحال {platform_name} کے عملے کی طرف سے جائزہ لیا جا رہا ہے اور جلد ہی اپ ڈیٹ کیا جانا چاہئے.
zh_cn: 您的请求目前正在由{platform_name}工作人员审核，并且应该很快更新。

source: Therefore, please give enough detail to account for this action.
ar: لذلك ، يُرجى تقديم تفاصيل كافية لحساب هذا الإجراء.
ur: لہذا، برائے مہربانی اس عمل کے اکاؤنٹ میں کافی تفصیل درج کرو.
zh_cn: 因此，请详细说明这一行动。

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
ar: لا تسمح قوانين دولة معينة بالقيود المفروضة على الضمانات الضمنية أو استبعاد أو تقييد بعض الأضرار. في حالة تطبيق هذه القوانين عليك ، فإن بعض أو أي من عمليات التنصل أو الاستثناءات أو القيود أعلاه قد لا تنطبق عليك ، وقد تحصل على حقوق إضافية.
ur: سرٹیفکیٹ کے الزامات سے متاثرہ وارثیات یا محدود ترین بیماریوں کے اخراجات محدود نہیں ہوتے. اگر آپ کو ان الزامات کا اطلاق ہوتا ہے تو کچھ یا غیر قانونی مباحثوں، اخراجات یا محدود خطوں میں سے کوئی آپ کو درخواست نہیں دے سکتا، اور آپ کو صحیح حقائق موجود ہیں.
zh_cn: 某些州法律不允许限制暗示担保或排除或限制某些损害赔偿。如果这些法律适用于您，一些或所有上述免责声明，排除事项或限制可能不适用于您，并且您可能享有其他权利。

source: Scored
ar: يحرز هدف
ur: گولڈ
zh_cn: 进球

source: Invoice No: {invoice_number}
ar: رقم الفاتورة: {invoice_number}
ur: انوائس نمبر: {invoice_number}
zh_cn: 发票号码：{invoice_number}

source: Jobs
ar: وظائف
ur: نوکریاں
zh_cn: 工作

source: You cannot select Reset for a problem that is closed.
ar: لا يمكنك تحديد إعادة تعيين على مشكلة مغلقة.
ur: آپ کو کسی مسئلہ کے لئے ری سیٹ مقرر نہیں کر سکتے ہیں جو بند ہے.
zh_cn: 对于已关闭的问题，您无法选择重置。

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
ar: تم بدء مهمة تجديد الشهادة. يمكنك عرض حالة مهمة التوليد في قسم &quot;المهام المعلقة&quot;.
ur: سرٹیفکیٹ کی تخلیق کا کام شروع کر دیا گیا ہے. آپ &quot;موصول شدہ ٹاسکس&quot; سیکشن میں نسل کے کام کی حیثیت کو دیکھ سکتے ہیں.
zh_cn: 证书再生任务已经开始。您可以在“待处理任务”部分查看生成任务的状态。

source: Maintenance Dashboard
ar: لوحة الصيانة
ur: بحالی ڈیش بورڈ
zh_cn: 维护仪表板

source: rescored
ar: إعادة تسجيله
ur: بچایا
zh_cn: 重新评分

source: {platform_name} Home
ar: {platform_name} الرئيسية
ur: {platform_name} ہوم
zh_cn: {platform_name}主页

source: You need to log in or sign up to use this function.
ar: تحتاج إلى تسجيل الدخول أو التسجيل لاستخدام هذه الوظيفة.
ur: آپ کو اس فنکشن کا استعمال کرنے کے لئے لاگ ان یا سائن اپ کرنے کی ضرورت ہے.
zh_cn: 您需要登录或注册以使用此功能。

source: Successfully reset due date for student {0} for {1} to {2}
ar: تم بنجاح إعادة تعيين تاريخ الاستحقاق للطالب {0} من {1} إلى {2}
ur: {1} کے لئے {2} طالب علم کیلئے {2} کے لئے مناسب تاریخ کو کامیابی سے ری سیٹ کریں
zh_cn: 成功将{1}的学生{0}的截止日期重置为{2}

source: Browse recently launched courses and see what's new in your favorite subjects.
ar: استعرض الدورات التي تم إطلاقها مؤخرًا واعرف ما هو الجديد في مواضيعك المفضلة.
ur: حال ہی میں شروع شدہ کورس براؤز کریں اور دیکھیں کہ آپ کے پسندیدہ مضامین میں نیا کیا ہے.
zh_cn: 浏览最近推出的课程，并查看您最喜爱的科目有哪些新内容。

source: You're enrolled as a professional education student
ar: أنت مسجل كطالب تعليم محترف
ur: آپ پیشہ ورانہ تعلیم کے طالب علم کے طور پر داخلہ کر رہے ہیں
zh_cn: 你被录取为专业教育学生

source: Your file could not be saved, probably because of a permission error on the web server.
ar: تعذر حفظ ملفك ، ربما بسبب خطأ في الإذن على خادم الويب.
ur: شاید آپ کے فائل کو سرور سرور پر اجازت کی وجہ سے محفوظ نہیں کیا جاسکتا.
zh_cn: 您的文件无法保存，可能是因为Web服务器上存在权限错误。

source: Your year of birth is required
ar: مطلوب سنة ميلادك
ur: آپ کا پیدائش کی ضرورت ہے
zh_cn: 您的出生年份是必需的

source: Change
ar: يتغيرون
ur: تبدیل کریں
zh_cn: 更改

source: Pay the Verified Certificate upgrade fee
ar: دفع رسوم ترقية شهادة التحقق
ur: تصدیق شدہ سرٹیفیکیٹ اپ گریڈ فیس ادا کریں
zh_cn: 支付验证证书升级费用

source: Deadlines, requirements, and logistics around grading student work
ar: المواعيد النهائية والمتطلبات واللوجستيات حول تصنيف عمل الطلاب
ur: گریڈنگ طالب علم کے کام کے ارد گرد ڈیڈ لائنز، ضروریات، اور لاجسٹکس
zh_cn: 学生工作分级的最后期限，要求和后勤

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
ar: يمكن إنشاء CCX فقط في هذه الدورة التدريبية من خلال خدمة خارجية. اتصل بمسؤول الدورة التدريبية لمنحك حق الوصول.
ur: ایک سی سی ایکس صرف بیرونی کورس کے ذریعہ اس کورس پر بنا سکتا ہے. آپ کو رسائی دینے کے لئے ایک کورس ایڈمن سے رابطہ کریں.
zh_cn: 只能通过外部服务在此课程上创建CCX。请联系课程管理员以授予您访问权限。

source: The Site that this provider configuration belongs to.
ar: الموقع الذي ينتمي إليه هذا الموفر.
ur: اس سائٹ کو جو اس فراہم کنندہ ترتیب سے تعلق رکھتا ہے.
zh_cn: 此提供商配置所属的网站。

source: Delete this component
ar: حذف هذا المكون
ur: اس جزو کو حذف کریں
zh_cn: 删除此组件

source: Ownership
ar: ملكية
ur: مالکیت
zh_cn: 所有权

source: {choice}
ar: {خيار}
ur: {انتخاب}
zh_cn: {选择}

source: Course Search
ar: بحث بالطبع
ur: کورس تلاش
zh_cn: 课程搜索

source: Starts
ar: يبدأ
ur: شروع ہوتا ہے
zh_cn: 启动

source: Can't find item by locator.
ar: لا يمكن العثور على العنصر حسب الموقع.
ur: لوکٹر کے ذریعے شے کو تلاش نہیں کر سکتا.
zh_cn: 无法通过定位器查找项目。

source: The course is full: the limit is {max_student_enrollments_allowed}
ar: الدورة ممتلئة: الحد الأقصى هو {max_student_enrollments_allowed}
ur: کورس مکمل ہے: حد {max_student_enrollments_allowed} ہے
zh_cn: 课程已满：限额为{max_student_enrollments_allowed}

source: To go to the courseware, select the following link:
ar: للانتقال إلى البرامج التعليمية ، حدد الرابط التالي:
ur: courseware پر جانے کے لئے، مندرجہ ذیل لنک منتخب کریں:
zh_cn: 要进入课件，请选择以下链接：

source: Reset Learner's Attempts to Zero
ar: إعادة تعيين محاولات المتعلم إلى صفر
ur: سیکھنے والے کو زیرو کی کوششیں دوبارہ ترتیب دیں
zh_cn: 重置学习者的尝试零

source: You've earned a certificate for this course.
ar: لقد حصلت على شهادة لهذه الدورة التدريبية.
ur: آپ نے اس کورس کے لئے ایک سرٹیفکیٹ حاصل کیا ہے.
zh_cn: 你已经获得了这门课程的证书。

source: Honor Code
ar: قانون الشرف
ur: عزت کا کوڈ
zh_cn: 荣誉代码

source: Register/Enroll Students
ar: تسجيل / تسجيل الطلاب
ur: رجسٹر / طلباء داخل کریں
zh_cn: 注册/注册学生

source: Earn a certificate
ar: كسب شهادة
ur: ایک سرٹیفکیٹ حاصل کریں
zh_cn: 赚取证书

source: invalid JSON
ar: غير صالح JSON
ur: غلط JSON
zh_cn: 无效的JSON

source: Public Service URL
ar: عنوان URL للخدمة العامة
ur: پبلک سروس یو آر ایل
zh_cn: 公共服务URL

source: Take free online courses at edX.org
ar: خذ دورات مجانية على الإنترنت على edX.org
ur: edX.org پر مفت آن لائن کورسز لے لو
zh_cn: 在edX.org上免费上网课程

source: Verify your identity now.
ar: تحقق من هويتك الآن.
ur: اب آپ کی شناخت کی توثیق کریں.
zh_cn: 现在验证你的身份。

source: Ask a question
ar: طرح سؤال
ur: ایک سوال پوچھنا
zh_cn: 问一个问题

source: Text Me The App
ar: نص لي التطبيق
ur: متن مجھے اپلی کیشن
zh_cn: 文本我的应用程序

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
ar: يعمل {studio_name} مثل تطبيقات الويب التي تعرفها بالفعل ، ولكنه يفهم كيفية بناء المنهج. النشر الفوري للويب عند الحاجة إليه ، والإفراج المتزايد عندما يكون ذلك مناسبًا. ومع المؤلفين المشاركين ، يمكنك إنشاء فريق كامل لدورة تدريبية معًا.
ur: {سٹوڈیو_ نام} آپ پہلے سے ہی جانتے ہیں ویب ایپلی کیشنز کی طرح کام کرتا ہے، ابھی تک سمجھتا ہے کہ آپ نصاب کیسے بناتے ہیں. جب آپ اسے چاہتے ہیں تو ویب پر فوری طور پر پبلک پبلشنگ، جب یہ سمجھتا ہے تو اضافی رہائی. اور شریک مصنفین کے ساتھ، آپ کو ایک پوری ٹیم ایک کورس کی تعمیر، ایک ساتھ مل سکتا ہے.
zh_cn: {studio_name}像您已经了解的Web应用程序一样工作，但您理解您如何构建课程。即时发布到网上，当你想要时，增量发布时，它是有道理的。并且与合着者一起，你可以让整个团队建立一个课程。

source: {learner_name}, edX Learner
ur: {learner_name}، edX لیڈر
zh_cn: {learner_name}，edX学习者

source: Show
ar: تبين
ur: دکھائیں
zh_cn: 显示

source: Date that enrollment for this class is opened
ar: التاريخ الذي يتم فيه فتح التسجيل لهذه الفئة
ur: اس کلاس کے لئے اندراج کی تاریخ کھول دی گئی ہے
zh_cn: 此课程的注册日期已打开

source: You are creating a re-run from:
ar: أنت بصدد إعادة التشغيل من:
ur: آپ دوبارہ دوبارہ چل رہے ہیں:
zh_cn: 您正在创建一个重新运行：

source: Pages
ar: صفحات
ur: صفحات
zh_cn: 网页

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
ar: يشير نظامنا إلى أنك تحاول التسجيل في هذه الدورة التدريبية {platform_name} من بلد أو منطقة لا تتوفر فيها حاليًا.
ur: ہمارے نظام سے پتہ چلتا ہے کہ آپ کسی ایسے ملک یا علاقے سے اس {platform_name} کورس میں داخلہ لینے کی کوشش کر رہے ہیں جس میں اس وقت دستیاب نہیں ہے.
zh_cn: 我们的系统表明您正在尝试从目前尚不可用的国家或地区注册此{platform_name}课程。

source: The number of items sold.
ar: عدد العناصر المباعة.
ur: فروخت کردہ اشیاء کی تعداد.
zh_cn: 销售的物品数量。

source: Invalid group name: "{group_name}". {messages}
ar: اسم مجموعة غير صالح: &quot;{group_name}&quot;. {الرسائل}
ur: غلط گروپ کا نام: &quot;{group_name}&quot;. {پیغامات}
zh_cn: 无效的组名称：“{group_name}”。 {消息}

source: We were unable to send a confirmation email to {email}
ar: لم نتمكن من إرسال رسالة تأكيد بالبريد الإلكتروني إلى {email}
ur: ہم ایک ای میل کو بھیجنے میں قاصر تھے {ای میل}
zh_cn: 我们无法发送确认电子邮件至{email}

source: If this change is not correct, contact {link_start}{platform_name} Support{link_end} or your administrator.
ar: إذا لم يكن هذا التغيير صحيحًا ، فاتصل بـ {link_start} {platform_name} الدعم {link_end} أو المسؤول.
ur: اگر یہ تبدیلی صحیح نہیں ہے تو {link_start} {platform_name} سپورٹ {link_end} یا آپ کے منتظم سے رابطہ کریں.
zh_cn: 如果此更改不正确，请联系{link_start} {platform_name}支持{link_end}或您的管理员。

source: Learner photo is blurry
ar: صورة المتعلم ضبابية
ur: سیکھنے والی تصویر دھندلا ہے
zh_cn: 学习者照片模糊

source: Password is not long enough.
ar: كلمة المرور ليست طويلة بما فيه الكفاية.
ur: پاس ورڈ کافی نہیں ہے.
zh_cn: 密码不够长。

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
ar: إذا كنت لا تزال تواجه مشكلات ، فاتصل بـ {platform_name} الدعم. في هذه الأثناء ، يمكنك أيضًا الرجوع إلى {link_start} الصفحة الرئيسية لـ {studio_name}. {link_end}
ur: اگر آپ اب بھی مسائل ہیں تو {platform_name} سپورٹ سے رابطہ کریں. اس دوران، آپ {link_start} {studio_name} ہوم پیج پر بھی واپس جا سکتے ہیں. {link_end}
zh_cn: 如果仍有问题，请联系{platform_name}支持。同时，您还可以返回到{link_start} {studio_name}主页。{link_end}

source: Password Reset Complete
ar: استعادة كلمة المرور كاملة
ur: پاس ورڈ ری سیٹ مکمل
zh_cn: 密码重置完成

source: %s uploaded and replaces old attachment.
ar: ٪ s تم تحميلها وتحل محل المرفق القديم.
ur: ٪ s پرانے منسلک اپ لوڈ اور تبدیل.
zh_cn: 上传％s并取代旧附件。

source: However, there is currently no user account associated with your email address: %(email_address)s.
ar: ومع ذلك ، لا يوجد حاليًا حساب مستخدم مرتبط بعنوان بريدك الإلكتروني:٪ (email_address) s.
ur: تاہم، فی الحال آپ کے ای میل ایڈریس کے ساتھ کوئی صارف کا اکاؤنٹ نہیں ہے:٪ (email_address) s.
zh_cn: 但是，目前没有用户帐户与您的电子邮件地址相关联：％（email_address）。

source: The ordering {ordering} is not supported
ar: لا يتم دعم الطلب {ordering}
ur: حکم {آرڈر} کی حمایت نہیں کی جاتی ہے
zh_cn: 订购{排序}不受支持

source: Verified Enrollment
ar: انتساب التحقق
ur: تصدیق شدہ اندراج
zh_cn: 验证的注册

source: Goals in signing up for {platform_name}
ar: الأهداف في الاشتراك في {platform_name}
ur: {platform_name} کے لئے سائن اپ کرنے کے مقاصد
zh_cn: 注册{platform_name}的目标

source: manually enrolled by username: {username}
ar: مسجل يدويًا باسم المستخدم: {اسم المستخدم}
ur: دستی طور پر صارف کا نام درج کیا گیا: {صارف کا نام}
zh_cn: 通过用户名手动注册：{用户名}

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
ar: يجب أن تكون المكتبة التي تقوم باستيرادها في ملف .tar.gz (أي ، ملف .tar مضغوط باستخدام GNU Zip). يجب أن يحتوي ملف .tar.gz هذا على ملف library.xml. قد تحتوي أيضًا على ملفات أخرى.
ur: جو لائبریری آپ درآمد کرتے ہیں، اسے ایک .tt.gz فائل میں ہونا ضروری ہے (یہ، جی این یو زپ کے ساتھ ایک .تر فائل کمپیکٹ ہے). یہ .tar.gz فائل میں لائبریری. xml فائل پر مشتمل ہونا ضروری ہے. اس میں دیگر فائلیں بھی شامل ہوسکتی ہیں.
zh_cn: 您导入的库必须位于.tar.gz文件中（即，使用GNU Zip压缩的.tar文件）。这个.tar.gz文件必须包含一个library.xml文件。它也可能包含其他文件。

source: {course_mode} certificate
ar: {course_mode} شهادة
ur: {course_mode} سرٹیفکیٹ
zh_cn: {course_mode}证书

source: Removed group: "{}"
ar: المجموعة التي تمت إزالتها: &quot;{}&quot;
ur: ہٹا دیا گروپ: &quot;{}&quot;
zh_cn: 已移除群组：“{}”

source: Delete this catalog
ar: حذف هذا الكتالوج
ur: اس فہرست کو حذف کریں
zh_cn: 删除此目录

source: Uploaded
ar: تم تحميلها
ur: اپ لوڈ کردہ
zh_cn: 上传

source: User {username} is not enrolled in the course {course_key}
ar: المستخدم {اسم المستخدم} غير مسجل في الدورة التدريبية {course_key}
ur: صارف {صارف کا نام} کورس {کورس_key} میں داخلہ نہیں ہے
zh_cn: 用户{用户名}未登记课程{course_key}

source: Why export a course?
ar: لماذا تصدير دورة؟
ur: کورس کیوں برآمد کرتے ہیں؟
zh_cn: 为什么要出口课程？

source: Error '{error}' while sending email to new user (user email={email}). Without the email student would not be able to login. Please contact support for further information.
ar: خطأ &#39;{error}&#39; أثناء إرسال البريد الإلكتروني إلى مستخدم جديد (بريد المستخدم الإلكتروني = {email}). بدون البريد الإلكتروني لن يكون الطالب قادرًا على تسجيل الدخول. يرجى الاتصال بالدعم للحصول على مزيد من المعلومات.
ur: نئے صارف (ای میل ای میل = {ای میل}) کو ای میل بھیجنے کے دوران &#39;خرابی&#39; {غلطی}. ای میل کے طالب علم کے بغیر لاگ ان نہیں ہو گا. مزید معلومات کے لئے براہ کرم تعاون سے رابطہ کریں.
zh_cn: 向新用户发送电子邮件时发生错误“{error}”（用户电子邮件= {email}）。没有电子邮件的学生将无法登录。请联系支持以获取更多信息。
