Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others. {platform_name} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these sites. If you decide to access linked third-party websites, you do so at your own risk.
ar: قد تتضمن واجهات برمجة التطبيقات (APIs) ومحتوى واجهة برمجة التطبيقات (API) ارتباطات تشعبية لمواقع تحتفظ بها أو يتحكم بها الآخرون. {platform_name} و {platform_name} لا يتحمل المشاركون المسؤولية عن محتويات أو استخدام أي من المنتجات أو الخدمات التي قد يتم تقديمها على هذه المواقع ، ولا يقومون بشكل روتيني بفحص أو الموافقة أو مراجعة أو اعتماد محتويات أو استخدام أي من المنتجات أو الخدمات. إذا قررت الوصول إلى مواقع أطراف ثالثة مرتبطة ، فإنك تقوم بذلك على مسؤوليتك الخاصة.
ur: APIs اور API کے مواد میں دوسروں کو برقرار رکھنے یا کنٹرول کرنے والے سائٹس پر ہائپر لنکس شامل ہوسکتے ہیں. {platform_name} اور {platform_name} شرکاء ذمہ دار نہیں ہیں اور ان سائٹس پر پیش کیے جانے والے کسی بھی مصنوعات یا خدمات کے مواد یا استعمال کے اسکرین کو باقاعدہ طور پر اسکرین، منظوری دینے، جائزہ لینے یا ان پر پابندی نہیں دیتے ہیں. اگر آپ کو منسلک تیسری پارٹی کی ویب سائٹس تک رسائی حاصل کرنے کا فیصلہ ہوتا ہے، تو آپ اپنے خطرے سے بھی ایسا کرتے ہیں.
zh_cn: API和API内容可能包含超链接到其他人维护或控制的网站。 {platform_name}和{platform_name}参与者不负责也不经常屏蔽，批准，审核或认可可能在这些网站上提供的任何产品或服务的内容或使用。如果您决定访问链接的第三方网站，则需自担风险。

source: Value of the enrollment attribute
ar: قيمة سمة التسجيل
ur: اندراج کی خاصیت کا قدر
zh_cn: 注册属性的值

source: This course run is currently being created.
ar: يتم حاليًا إنشاء هذا البرنامج التدريبي.
ur: یہ کورس اب چل رہا ہے.
zh_cn: 目前正在创建该课程。

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
ar: أدخل صح أو خطأ. إذا كانت هذه القيمة صحيحة ، يمكن للمتعلمين اختيار إجراء اختبارات مراقَبَة بدون تراكب. إذا كانت هذه القيمة خاطئة ، فيجب على جميع المتعلمين إجراء الامتحان باستخدام المراقبة. ينطبق هذا الإعداد فقط في حالة تمكين الاختبارات المقتطعة للدورة التدريبية.
ur: صحیح یا غلط درج کریں. اگر یہ قیمت سچ ہے تو، سیکھنے والے پرویکٹرنگ کے بغیر پروکارڈ امتحان لینے کا انتخاب کرسکتے ہیں. اگر یہ قیمت غلط ہے تو، تمام سیکھنے والے کو پروکیکٹنگ کے ساتھ امتحان لے جانا چاہئے. یہ ترتیب صرف لاگو ہوتا ہے اگر کورس کے لئے امتحان کی جانچ پڑتال کی جاتی ہے.
zh_cn: 输入true或false。如果这个值是真的，那么学习者可以选择无监督地进行监考。如果这个值是错误的，所有的学习者必须通过考试来进行考试。此设置仅适用于为课程启用了监考考试的情况。

source: Percentage Discount
ar: نسبة الخصم
ur: فی صد ڈسکاؤنٹ
zh_cn: 百分比折扣

source: username
ar: اسم المستخدم
ur: صارف کا نام
zh_cn: 用户名

source: certificates generated
ar: شهادات ولدت
ur: سرٹیفکیٹس پیدا
zh_cn: 生成的证书

source: Your password has expired due to password policy on this account. You must reset your password before you can log in again. Please click the "Forgot Password" link on this page to reset your password before logging in again.
ar: انتهت صلاحية كلمة المرور الخاصة بك بسبب سياسة كلمة المرور الخاصة بهذا الحساب. يجب عليك إعادة تعيين كلمة المرور الخاصة بك قبل أن تتمكن من تسجيل الدخول مرة أخرى. الرجاء النقر فوق الارتباط &quot;نسيت كلمة المرور&quot; في هذه الصفحة لإعادة تعيين كلمة المرور الخاصة بك قبل تسجيل الدخول مرة أخرى.
ur: اس اکاؤنٹ پر پاس ورڈ کی پالیسی کی وجہ سے آپ کا پاس ورڈ ختم ہوگیا ہے. دوبارہ لاگ ان کر سکتے ہیں اس سے پہلے کہ آپ اپنا پاس ورڈ دوبارہ ترتیب دینا ضروری ہے. دوبارہ لاگ ان کرنے سے پہلے اپنا پاس ورڈ دوبارہ ترتیب دینے کیلئے اس صفحے پر &quot;بھول گئے پاس ورڈ&quot; کا لنک کلک کریں.
zh_cn: 由于此帐户的密码政策，您的密码已过期。您必须重新设置密码才能重新登录。在重新登录之前，请点击此页面上的“忘记密码”链接重置您的密码。

source: No Derivatives
ar: لا مشتقات
ur: کوئی مشترک نہیں
zh_cn: 没有派生物

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
ar: لمعرفة المزيد حول {platform_name} واجهة برمجة تطبيقات Course Catalog ، تفضل بزيارة {link_start} صفحة وثائق واجهة برمجة التطبيقات {link_end}. لطرح أسئلة حول استخدام واجهة برمجة التطبيقات هذه ، اتصل بـ {api_support_email_link}.
ur: {platform_name} کورس کیٹلوگ API کے بارے میں مزید جاننے کیلئے، {link_start} ہمارے API دستاویزی صفحہ {link_end} پر جائیں. اس API کو استعمال کرنے کے بارے میں سوالات کے لئے {api_support_email_link} سے رابطہ کریں.
zh_cn: 要详细了解{platform_name}课程目录API，请访问{link_start}我们的API文档页面{link_end}。有关使用此API的问题，请联系{api_support_email_link}。

source: Invalid data ({details})
ar: بيانات غير صالحة ({التفاصيل})
ur: غلط ڈیٹا ({تفصیلات})
zh_cn: 无效的数据（{details}）

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
ar: لتجنب الأخطاء ، يوصي {platform_name} بشدة بإزالة الميزات غير المدعومة من إعدادات الدورة التدريبية المتقدمة. للقيام بذلك ، انتقل إلى {link_start} صفحة الإعدادات المتقدمة {link_end} ، وحدد موقع إعداد &quot;قائمة الوحدات النمطية المتقدمة&quot; ، ثم احذف الوحدات النمطية التالية من القائمة.
ur: غلطیوں سے بچنے کے لئے، {platform_name} کو سختی سے مشورہ دیا جاتا ہے کہ آپ کورس کی اعلی درجے کی ترتیبات سے غیر فعال کردہ خصوصیات کو ہٹا دیں. ایسا کرنے کے لئے، {link_start} اعلی درجے کی ترتیبات کا صفحہ {link_end} پر جائیں، &quot;اعلی درجے کی ماڈیول کی فہرست&quot; کی ترتیب کو تلاش کریں، اور پھر درج ذیل ماڈیول کو حذف کریں.
zh_cn: 为避免错误，{platform_name}强烈建议您从课程高级设置中移除不支持的功能。为此，请转到{link_start}高级设置页{link_end}，找到“高级模块列表”设置，然后从列表中删除以下模块。

source: Language Code
ar: رمز اللغة
ur: زبان کا کوڈ
zh_cn: 语言代码

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
ar: نحن آسفون. حدث خطأ ما في التنشيط. تحقق للتأكد من صحة عنوان URL الذي ذهبت إليه ، حيث تقوم برامج البريد الإلكتروني أحيانًا بتقسيمه إلى سطرين.
ur: ہم معذرت خواہ ہیں. آپ کی سرگرمی کے ساتھ کچھ غلط ہوا. اس بات کا یقین کرنے کے لئے چیک کریں کہ آپ جو URL چلا گیا تھا درست تھا، کیونکہ ای میل پروگرام کبھی کبھی اسے دو لائنوں میں تقسیم کرے گی.
zh_cn: 我们很抱歉。您的激活出现问题。请检查以确保您访问的URL是正确的，因为电子邮件程序有时会将其分成两行。

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
ar: هناك بالفعل دورة محددة مع نفس المنظمة ورقم الدورة التدريبية. يرجى تغيير إما رقم المنظمة أو الدورة ليكون فريدًا.
ur: اسی تنظیم اور کورس نمبر کے ساتھ پہلے سے ہی ایک کورس موجود ہے. براہ کرم کسی بھی تنظیم یا کورس نمبر کو منفرد بنانا تبدیل کریں.
zh_cn: 已经有一个课程定义了相同的组织和课程编号。请更改组织或课程号码以保持独特。

source: We couldn't log you in.
ar: لم نتمكن من تسجيل دخولك.
ur: ہم آپ کو لاگ ان نہیں کرسکتے.
zh_cn: 我们无法登录你。

source: Courses
ar: الدورات
ur: کورسز
zh_cn: 培训班

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
ar: تظهر الصفحات في شريط التنقل العلوي في الدورة التدريبية. وتتبع الصفحات الافتراضية (الصفحة الرئيسية والدورة التدريبية والمناقشة والويكي والتقدم) الكتب المدرسية والصفحات المخصصة.
ur: صفحات آپ کے کورس کے سب سے اوپر نیویگیشن بار میں ظاہر ہوتے ہیں. پہلے سے طے شدہ صفحات (ہوم، کورس، بحث، وکیپیڈیا اور پیش رفت) کے بعد درسی کتابوں اور اپنی مرضی کے مطابق صفحات ہیں.
zh_cn: 页面出现在课程的顶部导航栏中。默认页面（主页，课程，讨论，Wiki和进度）后面跟着教科书和自定义页面。

source: by {date}
ar: حسب التاريخ}
ur: {تاریخ}
zh_cn: 按{日期}

source: LinkedIn
ar: ينكدين
ur: لنکڈینٹ

source: Professional
ar: المحترفين
ur: پروفیشنل
zh_cn: 专业的

source: Enter a numeric value for the price per course seat. Do not include currency symbols.
ar: أدخل قيمة رقمية للسعر لكل مقعد. لا تقم بتضمين رموز العملات.
ur: قیمت فی کورس نشست کے لئے عددی قدر درج کریں. کرنسی علامات شامل نہ کریں.
zh_cn: 为每个课程座位的价格输入一个数字值。不要包含货币符号。

source: A description of your goals is required
ar: مطلوب وصف لأهدافك
ur: آپ کے مقاصد کی وضاحت کی ضرورت ہے
zh_cn: 您的目标描述是必需的

source: This exam is hidden from the learner.
ar: هذا الامتحان مخفي عن المتعلم.
ur: یہ امتحان سیکھنے سے پوشیدہ ہے.
zh_cn: 这门考试对学习者是隐藏的。

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {platform_name} web site.
ar: إذا لم تطلب هذا ، فلن تحتاج إلى القيام بأي شيء ؛ لن تتلقى أي بريد إلكتروني منا. رجاءا لا ترد على هذا الأيميل؛ إذا كنت بحاجة إلى مساعدة ، فتحقق من قسم المساعدة على موقع الويب {platform_name}.
ur: اگر آپ نے اس کی درخواست نہیں کی، تو آپ کو کچھ کرنے کی ضرورت نہیں ہے. آپ ہمارے پاس مزید ای میل نہیں ملیں گے. براہ مہربانی اس ای میل کا جواب نہ دیں؛ اگر آپ کو مدد کی ضرورت ہوتی ہے تو {platform_name} ویب سائٹ کی مدد کے حصے کو چیک کریں.
zh_cn: 如果你没有要求，你不需要做任何事情;你将不会再收到我们的电子邮件。请不要回复这封邮件;如果您需要帮助，请查看{platform_name}网站的帮助部分。

source: Gating milestone for {usage_key}
ar: مرحلة التذييل لـ {use_key}
ur: {usage_key} کے لئے سنگ میل کا سنگ میل
zh_cn: {usage_key}的门控里程碑

source: Deleted Group
ar: مجموعة محذوفة
ur: حذف کردہ گروپ
zh_cn: 已删除组

source: The provided access_token is already associated with another user.
ar: يرتبط بالفعل access_token المقدمة مع مستخدم آخر.
ur: فراہم کردہ access_token پہلے ہی دوسرے صارف کے ساتھ منسلک ہے.
zh_cn: 提供的access_token已经与另一个用户相关联。

source: Toggle Cheatsheet
ar: تبديل Cheatsheet
ur: دھوکہ / فشنگ
zh_cn: 切换Cheatsheet

source: Guided Discussion
ar: مناقشة إرشادية
ur: ہدایت کی بحث
zh_cn: 指导性讨论

source: Your policy changes have been saved.
ar: تم حفظ تغييرات السياسة الخاصة بك.
ur: آپ کی پالیسی میں تبدیلیوں کو بچایا گیا ہے.
zh_cn: 您的政策更改已保存。

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
ar: (2) بمجرد التسجيل ، قم بنسخ عنوان URL الخاص بالاسترداد وقم بلصقه في مستعرض الويب الخاص بك.
ur: (2) رجسٹر ہونے کے بعد، موصول شدہ URL کاپی کریں اور اسے اپنے ویب براؤزر میں پیسٹ کریں.
zh_cn: （2）注册后，复制兑换网址并将其粘贴到您的网络浏览器中。

source: Download a .csv file for all credit card purchases or for all invoices, regardless of status.
ar: يمكنك تنزيل ملف csv لجميع عمليات شراء بطاقات الائتمان أو لجميع الفواتير ، بصرف النظر عن حالتها.
ur: تمام کریڈٹ کارڈ کی خریداری کے لئے یا تمام انوائس کے لئے ایک .csv فائل ڈاؤن لوڈ کریں، قطع نظر حیثیت سے.
zh_cn: 为所有信用卡购买或所有发票下载.csv文件，无论其状态如何。

source: General
ar: جنرال لواء
ur: جنرل
zh_cn: 一般

source: Course Team Internal Reference
ar: مرجع فريق الدورة الداخلية
ur: کورس ٹیم داخلی حوالہ
zh_cn: 课程团队内部参考

source: Language set to {preview_language}
ar: تم ضبط اللغة على {preview_language}
ur: زبان کی ترتیب {preview_language}
zh_cn: 语言设置为{preview_language}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
ar: لقد تم منح طلبك للحصول على حقوق إنشاء الدورة التدريبية لـ {studio_name}. لإنشاء الدورة التدريبية الأولى ، تفضل بزيارة {url}
ur: {سٹوڈیو_ نام} کے کورس تخلیق کے حقوق کے لئے آپ کی درخواست دی گئی ہے. اپنا پہلا کورس تخلیق کرنے کیلئے {url} ملاحظہ کریں
zh_cn: 您授予{studio_name}课程创建权限的请求已被授予。要创建您的第一课程，请访问{url}

source: YouTube ID for 1.5x speed
ar: معرف YouTube بسرعة 1.5x
ur: یو ٹیوب ID 1.5x کی رفتار کے لئے
zh_cn: 1.5倍速度的YouTube ID

source: others read access
ar: الآخرين قراءة الوصول
ur: دوسروں تک رسائی پڑھتے ہیں
zh_cn: 其他人阅读权限

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
ar: لا يوجد محتوى للدورة مرئي حاليًا ، ولا يتم تسجيل أي متعلمين. تأكد من مراجعة جميع التواريخ وإعادة تعيينها ، بما في ذلك تاريخ بدء الدورة التدريبية ؛ انشاء فريق الدورة مراجعة تحديثات الدورة التدريبية والأصول الأخرى للمواد المؤرّخة ؛ والبذور المناقشات وويكي.
ur: کوئی کورس کا مواد فی الحال نظر آتا ہے، اور سیکھنے والوں کو اندراج نہیں کیا جاتا ہے. کورس کے آغاز کی تاریخ بشمول تمام تاریخوں کا جائزہ لیں اور ری سیٹ کریں. کورس ٹیم قائم جائیداد کی تازہ ترین معلومات اور دیگر اثاثوں سے متعلق مواد کے لئے؛ اور بات چیت اور ویک بیج.
zh_cn: 目前没有任何课程内容可见，也没有学员注册。请务必查看并重置所有日期，包括课程开始日期;设立课程团队;查看有关过期材料的课程更新和其他资产;并开展讨论和维基。

source: An error has occurred. Please try again.
ar: حدث خطأ. حاول مرة اخرى.
ur: ایک خرابی آگئی ہے. دوبارہ کوشش کریں.
zh_cn: 发生了错误。请再试一次。

source: Get started by making a note in something you just read, like {section_link}.
ar: ابدأ بتدوين ملاحظة في شيء قرأته للتو ، مثل {section_link}.
ur: کسی چیز میں ایک نوٹ بنانے سے شروع کریں جو آپ صرف پڑھتے ہیں، جیسے {section_link}.
zh_cn: 通过在刚刚阅读的内容中记下一个注释开始，如{section_link}。

source: Parameter usage_id not provided.
ar: المعلمة use_id غير متوفرة.
ur: پیرامیٹر استعمال نہیں فراہم کی گئی.
zh_cn: 未提供参数usage_id。

source: Amount of time after the due date that submissions will be accepted
ar: مقدار الوقت بعد تاريخ استحقاق التقديمات
ur: اس تاریخ کے بعد وقت کی رقم جمع کردی جائے گی جس کی منظوری قبول ہوگی
zh_cn: 截止日期之后提交的内容将被接受

source: If we do not receive payment, the learner enrollments that use these codes will be canceled and learners will not be able to access course materials. All purchases are final. For more information, see the {site_name} cancellation policy.
ar: إذا لم نتلق دفعة ، فسيتم إلغاء تسجيلات المتعلم التي تستخدم هذه الرموز ولن يتمكن المتعلمون من الوصول إلى مواد الدورة التدريبية. جميع المشتريات نهائية. لمزيد من المعلومات ، راجع سياسة إلغاء {site_name}.
ur: اگر ہم ادائیگی نہیں پاتے ہیں، سیکھنے والے اندراجات جو ان کوڈز کو استعمال کرتے ہیں منسوخ ہوجائے گی اور سیکھنے والے کورس کورس کے مواد تک رسائی حاصل نہیں کرسکیں گے. تمام خریداری حتمی ہیں. مزید معلومات کے لئے، {site_name} منسوخی کی پالیسی دیکھیں.
zh_cn: 如果我们没有收到付款，那么使用这些代码的学习者注册将被取消，学习者将无法访问课程材料。所有采购都是最终的。有关更多信息，请参阅{site_name}取消政策。

source: article contents
ar: محتويات المقالة
ur: مضمون کے مواد
zh_cn: 文章内容

source: Number Redeemed
ar: رقم مسترد
ur: نمبر چھوڑا
zh_cn: 号码已兑换

source: Tweet this Accomplishment. Pop up window.
ar: سقسقة هذا الإنجاز. نافذة منبثقة.
ur: یہ تسلیم کریں. پاپ اپ ونڈو.
zh_cn: 鸣叫这个成就。弹出窗口。

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
ar: أدخل صح أو خطأ. إذا كان هذا صحيحًا ، فيمكنك إضافة مشكلات وأدوات غير مدعومة للدورة التدريبية في Studio. لا يوصى باستخدام المشاكل والأدوات غير المدعومة للاستخدام في الدورات الدراسية بسبب عدم الامتثال لواحد أو أكثر من المتطلبات الأساسية ، مثل الاختبار وإمكانية الوصول والتدويل والتوثيق.
ur: صحیح یا غلط درج کریں. اگر سچ ہے تو، آپ سٹوڈیو میں اپنے کورس میں غیر معاون مسائل اور اوزار شامل کرسکتے ہیں. ایک یا زیادہ بیس بیس ضروریات جیسے ٹیسٹ، رسائی، بین الاقوامییزیشن، اور دستاویزات کے بغیر غیر تعمیل کی وجہ سے غیر مستحکم مسائل اور ٹولز کورسز میں استعمال کے لئے سفارش کی جاتی ہیں.
zh_cn: 输入true或false。如果属实，您可以在Studio中向您的课程添加不受支持的问题和工具。由于不符合一个或多个基本要求（如测试，可访问性，国际化和文档），不建议在课程中使用不支持的问题和工具。

source: The payment processor returned a badly-typed value {0} for param {1}.
ar: قام معالج الدفع بإرجاع قيمة تكتب بشكل سيئ {0} للمعلمة {1}.
ur: ادائیگی پروسیسر پیر {1} کے لئے خرابی سے ٹائپ کردہ قدر (0) کی واپسی کی.
zh_cn: 付款处理器为参数{1}返回了严重类型的值{0}。

source: Full Name *
ar: الاسم الكامل *
ur: پورا نام *
zh_cn: 全名 *

source: Enrolled as:
ar: مسجل باسم:
ur: کے طور پر داخلا:
zh_cn: 注册为：

source: Click to generate a CSV grade report for all currently enrolled students.
ar: انقر لإنشاء تقرير درجة CSV لجميع الطلاب المسجلين حاليًا.
ur: تمام حالیہ اندراج شدہ طالب علموں کے لئے CSV گریڈ کی رپورٹ پیدا کرنے کے لئے کلک کریں.
zh_cn: 点击即可为当前所有已注册的学生生成CSV等级报告。

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
ar: يتم إنشاء تقرير توزيع الإجابات الموضح أدناه بشكل دوري من خلال عملية خلفية تلقائية. التقرير تراكمي ، لذا يتم تضمين الإجابات المقدمة بعد بدء العملية في تقرير لاحق. يتم إنشاء التقرير عدة مرات في اليوم.
ur: ذیل میں درج جواب تقسیم کی رپورٹ کو خود کار طریقے سے خود بخود پس منظر کے عمل سے پیدا کیا جاتا ہے. رپورٹ مجموعی طور پر ہے، لہذا اس عمل کو شروع ہونے کے بعد پیش کئے گئے جوابات اگلے رپورٹ میں شامل ہیں. رپورٹ فی دن کئی بار پیدا کی جاتی ہے.
zh_cn: 下面列出的答案分发报告由自动化后台进程定期生成。报告是累积性的，因此在过程开始后提交的答案将包含在随后的报告中。该报告每天生成数次。

source: Write a brief message for the article's history log.
ar: اكتب رسالة مختصرة لسجل سجل المقالات.
ur: آرٹیکل کی تاریخ لاگ ان کیلئے ایک مختصر پیغام لکھیں.
zh_cn: 为文章的历史日志写一个简短的消息。

source: Important Course Dates
ar: مهم تواريخ التمور
ur: اہم ریس کے تاریخ
zh_cn: 重要比赛日期

source: You have submitted your verification information.
ar: لقد أرسلت معلومات التحقق الخاصة بك.
ur: آپ نے اپنی تصدیق کی معلومات جمع کردی ہے.
zh_cn: 您已提交验证信息。

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
ar: انقر لإنشاء ملف CSV يسرد المتعلمين الذين يمكنهم التسجيل في الدورة التدريبية لكن لم يفعلوا ذلك بعد.
ur: ایک CSV فائل پیدا کرنے کے لئے کلک کریں جس میں سیکھنے والوں کو فہرست میں درج کیا جا سکتا ہے لیکن اس نے ابھی تک ایسا نہیں کیا ہے.
zh_cn: 点击以生成一个CSV文件，列出可以注册课程但尚未注册的学员。

source: Is Practice Exam
ar: هو امتحان الممارسة
ur: پریکٹس کی امتحان ہے
zh_cn: 是练习考试

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
ar: تعذّر تحليل المعلمة المخصصة: {custom_parameter}. يجب أن تكون سلسلة &quot;x = y&quot;.
ur: اپنی مرضی کے مطابق پیرامیٹر کو پار نہیں کر سکا: {custom_parameter}. &quot;x = y&quot; string ہونا چاہئے.
zh_cn: 无法解析自定义参数：{custom_parameter}。应该是“x = y”字符串。

source: You do not have any notes.
ar: ليس لديك أي ملاحظات.
ur: آپ کے پاس کوئی نوٹ نہیں ہے.
zh_cn: 你没有任何笔记。

source: Enter your specialty.
ar: أدخل تخصصك.
ur: اپنی خاصیت درج کریں
zh_cn: 输入你的专业。

source: in {relative} - {absolute}
ar: في {النسبي} - {مطلقًا}
ur: {رشتہ دار} میں - {مطلق}
zh_cn: 在{相对} - {绝对}

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
ar: إذا كان هذا الخيار {em_start} محددًا {em_end} ، فسيتم تسجيل المستخدمين الذين لم يسجلوا بعد في {platform_name} تلقائيًا.
ur: اگر یہ اختیار {em_start} کی جانچ پڑتال {em_end} ہے تو، جو صارفین ابھی تک {platform_name} کے لئے رجسٹر نہیں ہوئے ہیں وہ خود بخود اندراج کریں گے.
zh_cn: 如果此选项被{em_start}选中{em_end}，那么尚未注册{platform_name}的用户将被自动注册。

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
ar: بالنسبة للدورات التدريبية الكبيرة ، قد يستغرق إنشاء بعض التقارير عدة ساعات. عند اكتمال إنشاء التقرير ، يظهر رابط يتضمن تاريخ ووقت الإنشاء في الجدول أدناه. يتم إنشاء هذه التقارير في الخلفية ، مما يعني أنه لا بأس من الانتقال بعيدًا عن هذه الصفحة أثناء إنشاء تقريرك.
ur: بڑے کورسز کے لئے، کچھ رپورٹیں پیدا کر سکتے ہیں کئی گھنٹے. جب نسل مکمل ہو جاتی ہے تو، جس کا لنک نسل کی تاریخ اور وقت میں درج ذیل میں درج ذیل جدول میں ظاہر ہوتا ہے. یہ رپورٹ پس منظر میں پیدا کی جاتی ہیں، مطلب یہ ہے کہ اس صفحے سے دور کرنے کے لئے ٹھیک ہے جبکہ آپ کی رپورٹ پیدا ہو رہی ہے.
zh_cn: 对于大型课程，生成一些报告可能需要几个小时。报告生成完成后，包含生成日期和时间的链接将显示在下表中。这些报告是在后台生成的，这意味着您可以在生成报告时从此页面导航离开。

source: If true, certificate Web/HTML views are enabled for the course.
ar: إذا كان هذا صحيحًا ، فسيتم تمكين طريقة عرض شهادة الويب / HTML الخاصة بالدورة التدريبية.
ur: اگر سچ ہے تو، کورس کے لئے سرٹیفکیٹ ویب / ایچ ٹی ایم ایل کے خیالات فعال ہیں.
zh_cn: 如果为true，则为课程启用证书Web / HTML视图。

source: Outlining Your Course
ar: تحديد دورتك
ur: آپ کا کورس ختم کرنا
zh_cn: 概述您的课程

source: Please change either the organization or course number so that it is unique.
ar: الرجاء تغيير رقم المؤسسة أو الدورة التدريبية بحيث تكون فريدة.
ur: برائے مہربانی تنظیم یا کورس نمبر یا تو تبدیل کریں تاکہ یہ منفرد ہو.
zh_cn: 请更改组织或课程编号，以便它是唯一的。

source: ID photo is blurry
ar: صورة الهوية ضبابية
ur: ID کی تصویر دھندلا ہے
zh_cn: 身份证照片模糊

source: Your verification submission was not accepted. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
ar: لم يتم قبول إرسال التحقق. للحصول على شهادة تم التحقق منها ، يجب عليك إرسال صورة جديدة لنفسك ومعرّف الهوية الصادر عن جهة حكومية قبل الموعد النهائي للتحقق للدورة التدريبية.
ur: آپ کی توثیق جمع کرانے کے لئے قبول نہیں کیا گیا تھا. ایک تصدیق شدہ سرٹیفکیٹ حاصل کرنے کے لئے، آپ کو اپنے کورس کے لئے توثیق کی حد سے پہلے اپنے آپ کی نئی تصویر اور آپ کی حکومت سے جاری کردہ تصویر کی شناخت پیش کرنا ضروری ہے.
zh_cn: 您的验证提交未被接受。要获得经过验证的证书，您必须在课程的验证截止日期前提交自己的新照片和政府颁发的带照片的身份证件。

source: Additional Info:
ar: معلومات اضافية:
ur: اضافی معلومات:
zh_cn: 附加信息：

source: Enrollment End Date
ar: تاريخ انتهاء التسجيل
ur: اندراج ختم ہونے کی تاریخ
zh_cn: 注册结束日期

source: Detach
ar: فصل
ur: تشخیص کریں
zh_cn: 分离

source: This Course Unavailable In Your Country
ar: هذه الدورة غير متوفرة في بلدك
ur: یہ کورس آپ کے ملک میں دستیاب نہیں ہے
zh_cn: 此课程在您的国家不可用

source: Duplicate of '{0}'
ar: نسخة مكررة من &#39;{0}&#39;
ur: &#39;{0}&#39; کا نقل
zh_cn: 重复的“{0}”

source: The due date has passed, and peer grading is closed at this time.
ar: لقد مر تاريخ الاستحقاق ، وتم إغلاق تصنيف الزملاء في هذا الوقت.
ur: متوقع تاریخ منظور ہو چکا ہے، اور اس وقت ہم مرتبہ گریڈنگ بند کردیے گئے ہیں.
zh_cn: 截止日期已过，目前同业评分已关闭。

source: New Textbook
ar: كتاب جديد
ur: نیا متن کتاب
zh_cn: 新教科书

source: Regenerate for learners who have already received certificates. ({count})
ar: التجديد للمتعلمين الذين حصلوا بالفعل على شهادات. ({} الاعتماد)
ur: پہلے ہی سرٹیفکیٹ حاصل کرنے والے سیکھنے والوں کے لئے دوبارہ تخلیق کریں. ({شمار})
zh_cn: 为已经获得证书的学员重新生成。 （{计数}）

source: Share on LinkedIn
ar: المشاركة على LinkedIn
ur: لنکڈ ان پر اشتراک کریں
zh_cn: 分享到LinkedIn

source: Learn more about exporting a library
ar: تعرف على المزيد حول تصدير مكتبة
ur: ایک لائبریری برآمد کرنے کے بارے میں مزید جانیں
zh_cn: 了解有关导出图书馆的更多信息

source: Reset Your {platform_name} Password
ar: إعادة تعيين كلمة المرور الخاصة بك {platform_name}
ur: اپنا {platform_name} پاس ورڈ دوبارہ ترتیب دیں
zh_cn: 重置您的{platform_name}密码

source: Purchase credit by going to your {link_start}{platform_name} dashboard{link_end} and clicking the {bold_start}Get Credit{bold_end} button below the course title.
ar: يمكنك شراء رصيد من خلال الانتقال إلى {link_start} {platform_name} لوحة التحكم {link_end} والنقر على الزر {bold_start} الحصول على رصيد {bold_end} أسفل عنوان الدورة التدريبية.
ur: اپنے {link_start} {platform_name} ڈیش بورڈ {link_end} پر جانے اور کریڈٹ عنوان کے نیچے {bold_start} کریڈٹ {bold_end} بٹن پر کلک کرکے کریڈٹ خریدیں.
zh_cn: 通过转到您的{link_start} {platform_name}信息中心{link_end}并点击课程标题下方的{bold_start}获取信用额度{bold_end}按钮来获得学分。

source: Unsupported Advance Modules
ar: وحدات متقدمة غير مدعومة
ur: غیر معاون ایڈوانس ماڈیولز
zh_cn: 不支持的高级模块

source: Add Coupon Code
ar: أضف رمز القسيمة
ur: کوپن کوڈ شامل کریں
zh_cn: 添加优惠券代码

source: [Refund] User-Requested Refund
ar: [رد] طلب استرداد الأموال من المستخدم
ur: [رقم کی واپسی] صارف کی درخواست کی واپسی
zh_cn: [退款]用户要求的退款

source: Completed Course Entrance Exam
ar: اكتمل اختبار مدخل الدورة التدريبية
ur: مکمل کورس داخلہ امتحان
zh_cn: 完成课程入学考试

source: Stand-alone credits are not allowed.
ar: لا يُسمح بالاعتمادات المستقلة.
ur: اسٹینڈ اکیلے کریڈٹس کی اجازت نہیں ہے.
zh_cn: 独立的学分是不允许的。

source: Add Admin
ar: أضف المسؤول
ur: ایڈمن شامل کریں
zh_cn: 添加管理员

source: Permission denied
ar: طلب الاذن مرفوض
ur: اجازت نہیں دی گئی
zh_cn: 没有权限

source: Create new merged version
ar: قم بإنشاء نسخة مدمجة جديدة
ur: نئے ضم شدہ ورژن تخلیق کریں
zh_cn: 创建新的合并版本
