Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
ar: ستتم إعادة تسمية ملفك الجديد تلقائيًا ليطابق الملف الموجود بالفعل. الملفات ذات الامتدادات المختلفة غير مسموح بها.
ur: آپ کی نئی فائل خود بخود فائل سے پہلے ہی موجود ہو گی. مختلف توسیع کے ساتھ فائلوں کی اجازت نہیں ہے.
zh_cn: 您的新文件将自动重命名以匹配已存在的文件。不允许使用不同扩展名的文件。

source: Discussions
ar: مناقشات
ur: بحث
zh_cn: 讨论

source: Permissions are inherited from this article
ar: يتم توريث الأذونات من هذه المقالة
ur: اجازت اس آرٹیکل سے وراثت کی ہے
zh_cn: 权限是从这篇文章继承的

source: problem
ar: مشكلة
ur: مسئلہ
zh_cn: 问题

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
ar: لا يمكن للموظفين تعديل هذه القوائم. لإدارة عضوية فريق الدورة التدريبية ، يجب أن يعطيك المشرف دور المشرف لإضافة موظفين أو مختبرين بيتا ، أو دور مسؤول المناقشة لإضافة مشرفين للمناقشة و TAs.
ur: اسٹاف ان فہرستوں میں ترمیم نہیں کر سکتے ہیں. کورس ٹیم کی رکنیت کو منظم کرنے کے لئے، ایڈمنسٹریٹر اور ٹی اےز کو شامل کرنے کے لئے ایڈمنسٹریٹر رول شامل کرنے کے لئے ایڈمن ایڈمن کو اسٹاف یا بیتا ٹیسٹرز شامل کرنے کے لئے ایڈمن رول دینا ضروری ہے.
zh_cn: 工作人员不能修改这些列表。要管理课程团队成员，课程管理员必须为您添加管理员角色以添加员工或测试人员，或讨论管理员角色以添加讨论管理员和助教。

source: Wiki Preview
ar: ويكي معاينة
ur: ویکیپیڈیا پیش نظارہ
zh_cn: Wiki预览

source: Select a .tar.gz File to Replace Your Library Content
ar: حدد ملفًا .tar.gz لاستبدال محتوى مكتبتك
ur: اپنے لائبریری مواد کو تبدیل کرنے کے لئے ایک .tt.gz فائل منتخب کریں
zh_cn: 选择一个.tar.gz文件来替换您的库内容

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
ar: يرجى قراءة {a_start} الأسئلة الشائعة الخاصة بنا لعرض الأسئلة الشائعة حول شهاداتنا {a_end}.
ur: {a_start} ہمارے سرٹیفکیٹ {a_end} کے بارے میں عام سوالات دیکھنے کے لئے براہ کرم ہمارے سوالات پڑھیں.
zh_cn: 请阅读{a_start}我们的常见问题，查看关于我们的证书{a_end}的常见问题。

source: Customer's reference code for this invoice.
ar: رمز مرجع العميل لهذه الفاتورة.
ur: اس رسید کیلئے کسٹمر کا ریفرنس کوڈ.
zh_cn: 客户的此发票的参考代码。

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
ar: يمكنك الآن عرض وتأليف امتحان القبول الخاص بالدورة التدريبية من {link_start} Course Outline {link_end}.
ur: اب آپ {link_start} کورس آؤٹ لائن {link_end} سے اپنا کورس داخلہ امتحان دیکھ سکتے ہیں اور مصنف کرسکتے ہیں.
zh_cn: 您现在可以从{link_start}课程大纲{link_end}查看和编写您的课程入学考试。

source: Location ID
ar: معرف الموقع
ur: مقام کی شناخت
zh_cn: 位置ID

source: The URL of the website associated with this API user.
ar: عنوان URL لموقع الويب المرتبط بمستخدم واجهة برمجة التطبيقات هذا.
ur: اس API صارف کے ساتھ منسلک ویب سائٹ کا یو آر ایل.
zh_cn: 与此API用户关联的网站的网址。

source: No parsable status information available
ar: لا تتوفر معلومات الحالة parsable
ur: کوئی قابل اطلاق حیثیت کی معلومات دستیاب نہیں ہے
zh_cn: 没有可用的可分析状态信息

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: لقد أرسلت معلومات إعادة التحقق الخاصة بك. سترى رسالة على لوحة المعلومات عندما تكتمل عملية التحقق (عادةً في غضون يوم أو يومين).
ur: آپ نے اپنی تصدیق کی معلومات جمع کردی ہے. جب آپ تصدیق شدہ عمل مکمل ہوجاتا ہے تو آپ اپنے ڈیش بورڈ پر ایک پیغام دیکھیں گے (عام طور پر 1-2 دن کے اندر اندر).
zh_cn: 您已提交您的重新验证信息。验证过程完成后（通常在1-2天内），您将在仪表板上看到一条消息。

source: Correct ({progress} point)
ar: الصحيح ({التقدم} نقطة)
ur: درست ({ترقی} پوائنٹ
zh_cn: 正确（{进度}点）

source: Deprecated Component
ar: مكون موقوف
ur: ناپسندیدہ اجزاء
zh_cn: 已弃用的组件

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
ar: يشير إلى ما إذا كانت ملاحظات الطلاب مرئية في الدورة التدريبية. يمكن للطلاب أيضًا إظهار أو إخفاء ملاحظاتهم في البرامج التعليمية.
ur: اشارہ کرتا ہے کہ آیا طالب علم کے نوٹ کورس میں نظر آتے ہیں یا نہیں. طالب علموں کو اپنے نوٹوں کو بھی courseware میں چھپ سکتا ہے یا چھپ سکتا ہے.
zh_cn: 指示学生笔记在课程中是否可见。学生还可以在课件中显示或隐藏笔记。

source: Click to generate a CSV file of survey results for this course.
ar: انقر لإنشاء ملف CSV لنتائج الاستطلاع لهذه الدورة التدريبية.
ur: اس کورس کیلئے سروے کے نتائج کا ایک CSV فائل پیدا کرنے کے لئے کلک کریں.
zh_cn: 点击即可生成本课程调查结果的CSV文件。

source: About edX Certificates
ar: حول شهادات EDX
ur: EDX سرٹیفکیٹ کے بارے میں
zh_cn: 关于edX证书

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
ar: استخدم محتوى المكتبة في الدورات التدريبية عن طريق إضافة مفتاح سياسة {em_start} library_content {em_end} إلى قائمة الوحدات النمطية المتقدمة في الإعدادات المتقدمة للدورة التدريبية ، ثم إضافة كتلة محتوى عشوائية إلى البرامج التعليمية الخاصة بك. في إعدادات كل كتلة محتوى عشوائية ، حدد هذه المكتبة كمكتبة مصدر ، وحدد عدد المشاكل التي يتم اختيارها عشوائيًا وعرضها لكل طالب.
ur: کورس کے اعلی درجے کی ترتیبات میں اعلی درجے کی ماڈیول فہرست میں {em_start} library_content {em_end} کی پالیسی کی کلید کو شامل کرکے کورسز میں لائبریری مواد کا استعمال کریں، پھر اپنے آپ کو ایک بے ترتیب مواد بلاک کریں. ہر بے ترتیب شدہ مواد بلاک کے لئے ترتیبات میں، یہ لائبریری ذریعہ لائبریری کے طور پر منتخب کریں، اور ہر طالب علم کو بے ترتیب طور پر منتخب اور ظاہر کرنے کے لئے مسائل کی تعداد کی وضاحت کریں.
zh_cn: 通过在课程的高级设置中将{em_start} library_content {em_end}策略键添加到高级模块列表中，然后将随机内容块添加到课件中来使用课程中的库内容。在每个随机化内容块的设置中，选择此库作为源库，并指定要随机选择并显示给每个学生的问题数量。

source: Verification Deadline Has Passed
ar: انتهت مهلة التحقق
ur: توثیق آخری وقت گزر گیا ہے
zh_cn: 验证截止日期已通过

source: The message to show when a user is blocked from accessing a course.
ar: الرسالة التي يتم عرضها عندما يتم حظر المستخدم من الوصول إلى الدورة التدريبية.
ur: کسی صارف کو کورس تک رسائی سے روکنے کے لئے ظاہر کرنے کا پیغام.
zh_cn: 当用户被阻止访问课程时显示的消息。

source: Video Start Time
ar: وقت بدء الفيديو
ur: ویڈیو شروع وقت
zh_cn: 视频开始时间

source: Enable issuance of credentials via Credential Service.
ar: تمكين إصدار بيانات الاعتماد عبر خدمة الاعتماد.
ur: کریڈٹٹیول سروس کے ذریعے اسناد کی جاری کرنے میں فعال کریں.
zh_cn: 通过凭证服务启用证书颁发。

source: Lock article
ar: قفل المادة
ur: مضمون مقفل کریں
zh_cn: 锁定文章

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
ar: لإنشاء ملف CSV يسرد كل إجابات الطلاب لمشكلة معينة ، أدخل موقع المشكلة (من معلومات تصحيح أخطاء الموظفين).
ur: ایک CSV فائل پیدا کرنے کے لئے جو تمام طالب علموں کو کسی مخصوص مسئلہ کے جواب میں درج کرتا ہے، مسئلے کا مقام درج کریں (اس کے اسٹاف ڈیبگ معلومات سے).
zh_cn: 要生成列出给定问题的所有学生答案的CSV文件，请输入问题的位置（从其“人员调试信息”中输入）。

source: Request Credit
ar: طلب الائتمان
ur: درخواست کریڈٹ
zh_cn: 请求信用

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
ar: لقد قمت بإعادة تمكين رسائل البريد الإلكتروني الخاصة بإشعارات المنتدى من {platform_name}. يمكنك {dashboard_link_start} الرجوع إلى لوحة المعلومات {link_end}.
ur: آپ نے {platform_name} سے فورم نوٹیفیکیشن ای میلز کو دوبارہ فعال کردیا ہے. آپ {dashboard_link_start} اپنے ڈیش بورڈ {link_end} پر واپس جائیں گے.
zh_cn: {platform_name}已重新启用论坛通知电子邮件。您可以{dashboard_link_start}返回您的信息中心{link_end}。

source: Payment Status
ar: حالة السداد
ur: ادائیگی کی حیثیت
zh_cn: 支付状态

source: Who can I contact if I have questions?
ar: من الذي يمكنني الاتصال به إذا كان لدي أسئلة؟
ur: میرے سوالات کون سے رابطہ کرسکتے ہیں؟
zh_cn: 如果我有问题，我可以联系谁？

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
ar: اختياري ، للمتصفحات القديمة: معرف YouTube لمقطع الفيديو بسرعة 1.25x.
ur: اختلاط، پرانے براؤزرز کیلئے: 1.25x رفتار ویڈیو کیلئے YouTube ID.
zh_cn: 可选，适用于旧版浏览器：1.25x速度视频的YouTube ID。

source: Add Certificate to LinkedIn Profile
ar: إضافة شهادة إلى ملف تعريف LinkedIn
ur: لنکڈ ان پروفائل میں سرٹیفکیٹ شامل کریں
zh_cn: 向LinkedIn个人资料添加证书

source: A non-root note must always have a slug.
ar: يجب أن تحتوي الملاحظة غير الجذرية دائمًا على سبيكة.
ur: ایک غیر جڑ نوٹ ہمیشہ ایک سلگ ہونا ضروری ہے.
zh_cn: 非根音必须始终有一个slu。。

source: Never
ar: أبدا
ur: کبھی نہیں
zh_cn: 决不

source: Create a Course Rerun of:
ar: قم بإنشاء دورة تدريبية لإعادة:
ur: ایک کورس بنائیں Runun کے:
zh_cn: 创建课程重新运行：

source: No `role` specified.
ar: لا &quot;دور&quot; محدد.
ur: کوئی `رول` متعین نہیں ہے.
zh_cn: 没有指定`角色`。

source: must contain {0} or more punctuation characters
ar: يجب أن يحتوي على {0} أو أكثر من علامات الترقيم
ur: {0} یا زیادہ تنازعہ حروف پر مشتمل ہونا لازمی ہے
zh_cn: 必须包含{0}或更多标点符号

source: Noncommercial
ar: غير تجاري
ur: غیر تجارتی
zh_cn: 非商业性

source: {platform_name} API Access Request
ar: {platform_name} طلب الوصول إلى واجهة برمجة التطبيقات
ur: {platform_name} API رسائی کی درخواست
zh_cn: {platform_name} API访问请求

source: <i>Welcome</i> {name}
ar: <i>مرحبًا</i> {name}
ur: <i>خوش آمدید</i> {نام}
zh_cn: <i>欢迎</i> {name}

source: Successful Proctored Exam
ar: الامتحان الناجح
ur: کامیاب پروکیکڈ امتحان
zh_cn: 成功的监考考试

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
ar: الوصول إلى فريق دعم الموظفين على بوابة الشريك لتقديم أو مراجعة تذاكر الدعم
ur: سپورٹ ٹکٹوں کو جمع یا جائزہ لینے کے لئے پارٹنر پورٹل پر رسائی کورس اسٹاف سپورٹ
zh_cn: 访问合作伙伴门户上的课程员工支持部门以提交或查看支持门票

source: About {platform_name}
ar: حول {platform_name}
ur: {platform_name} کے بارے میں
zh_cn: 关于{platform_name}

source: Discounted Price
ar: سعر مخفض
ur: ڈسکاؤنٹ قیمت
zh_cn: 打折后价格

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
ar: أدخل صح أو خطأ. إذا كانت هذه القيمة صحيحة ، سيتم إنشاء تذكرة Zendesk للمحاولات المشبوهة.
ur: صحیح یا غلط درج کریں. اگر یہ قیمت سچ ہے تو، زینڈسکی ٹکٹ کو مشکوک کوششوں کے لئے تیار کیا جائے گا.
zh_cn: 输入true或false。如果此值为真，则会为可疑尝试创建Zendesk票证。

source: February
ar: شهر فبراير
ur: فروری
zh_cn: 二月

source: (no log message)
ar: (لا توجد رسالة سجل)
ur: (کوئی لاگ ان پیغام نہیں)
zh_cn: （没有日志消息）

source: Secret Token String for Annotation
ar: سلسلة الرموز السرية للتعليقات التوضيحية
ur: تشریح کے لئے خفیہ ٹوکن سٹرنگ
zh_cn: 用于注释的秘密令牌字符串

source: The company name cannot be a number.
ar: لا يمكن أن يكون اسم الشركة رقمًا.
ur: کمپنی نام نمبر نہیں ہوسکتا ہے.
zh_cn: 公司名称不能是数字。

source: This component's access settings refer to deleted or invalid group configurations.
ar: تشير إعدادات الوصول الخاصة بهذا المكون إلى تكوينات المجموعة المحذوفة أو غير الصالحة.
ur: یہ اجزاء کی رسائی کی ترتیبات حذف شدہ یا غلط گروہ کی ترتیبات کا حوالہ دیتے ہیں.
zh_cn: 该组件的访问设置是指已删除或无效的组配置。

source: + - * / (add, subtract, multiply, divide)
ar: + - * / (الإضافة ، الطرح ، الضرب ، القسمة)
ur: + - * / (شامل کریں، ذرا، ضرب، ضرب، تقسیم)
zh_cn: + - * /（加，减，乘，除）

source: Source code for LaTeX and Word problems. This feature is not well-supported.
ar: شفرة المصدر لمشاكل LaTeX و Word. هذه الميزة غير مدعومة بشكل جيد.
ur: لاٹیکس اور ورڈ کے مسائل کے لئے ماخذ کوڈ. یہ خصوصیت اچھی سہولت نہیں ہے.
zh_cn: LaTeX和Word问题的源代码。这个功能没有得到很好的支持。

source: You must select a session to access the course.
ar: يجب عليك تحديد جلسة للوصول إلى الدورة التدريبية.
ur: کورس تک رسائی کیلئے آپ کو سیشن کا انتخاب کرنا ہوگا.
zh_cn: 您必须选择一个会话才能访问该课程。

source: XML attributes
ar: سمات XML
ur: XML صفات
zh_cn: XML属性

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
ar: GIT_REPO_EXPORT_DIR لم يتم التعيين أو المسار {0} غير موجود ، يرجى إنشائه ، أو تكوين مسار مختلف باستخدام GIT_REPO_EXPORT_DIR
ur: GIT_REPO_EXPORT_DIR مقرر نہیں یا راستہ {0} موجود نہیں ہے، براہ کرم اسے تخلیق کریں یا GIT_REPO_EXPORT_DIR کے ساتھ مختلف راستے کو ترتیب دیں.
zh_cn: 未设置GIT_REPO_EXPORT_DIR或路径{0}不存在，请创建它，或者使用GIT_REPO_EXPORT_DIR配置其他路径

source: No playable video sources found.
ar: لم يتم العثور على مصادر فيديو قابلة للتشغيل.
ur: کوئی playable ویڈیو ذرائع نہیں ملے.
zh_cn: 找不到可播放的视频来源。

source: April
ar: أبريل
ur: اپریل
zh_cn: 四月

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
ar: استخدم الأقواس () لجعل التعبيرات واضحة. يمكنك استخدام الأقواس داخل أقواس أخرى.
ur: اظہار اظہار واضح کرنے کے لئے قارئینس () کا استعمال کریں. آپ دوسرے پیرس کے اندر اندر قزاقوں کا استعمال کرسکتے ہیں.
zh_cn: 使用括号（）使表达式变得清晰。您可以在其他圆括号内使用圆括号。

source: Topic:
ar: موضوع:
ur: موضوع:
zh_cn: 话题：

source: Enable Learner Issuance
ar: تمكين إصدار المتعلم
ur: سیکھنے کے قابلیت کو فعال کریں
zh_cn: 启用学习者发放

source: No order found for {user} in course {course_id}
ar: لم يتم العثور على أي طلب لـ {user} في الدورة التدريبية {course_id}
ur: {صارف} کورس کے {کورس_ڈ} کے لئے کوئی حکم نہیں مل سکا
zh_cn: 在课程中找不到{user}的订单{course_id}

source: Is Proctoring Enabled
ar: هو تمكين بروكتورنج
ur: کیا پرویکٹرنگ فعال ہے
zh_cn: 是否启用Proctoring

source: Delete Current Video
ar: حذف الفيديو الحالي
ur: موجودہ ویڈیو حذف کریں
zh_cn: 删除当前视频

source: Page
ar: صفحة
ur: صفحہ
zh_cn: 页

source: Subscribe to the {platform_name} subreddit
ar: اشترك في {platform_name} subreddit
ur: {platform_name} کو سبسکرائب کریں کے سبسکرائب کریں
zh_cn: 订阅{platform_name}子订阅

source: Staff Debug Info
ar: الموظفين تصحيح المعلومات
ur: اسٹاف ڈیبگ کی معلومات
zh_cn: 员工调试信息

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
ar: قم بإعادة تسجيل أي ردود تم تقديمها. يقوم خيار &quot;Rescore All Problems Only If Score Improves&quot; بتحديث نتائج المتعلم فقط إذا كان يحسن في صالح المتعلم.
ur: کسی بھی ردعمل کو ریورس کریں جو جمع کردیے گئے ہیں. &#39;ریسرچ تمام مسائل صرف اگر اسکور بہتر ہوجاتا ہے تو اختیار کے اپ ڈیٹس اپ ڈیٹس کو صرف اس صورت میں اپ ڈیٹ کرتا ہے جب وہ سیکھنے والے کے حق میں بہتر ہوجاتا ہے.
zh_cn: 重新提交已提交的任何回复。只有改善了学习者的情绪，&#39;如果分数提高&#39;，&#39;重新解决所有问题&#39;选项可以更新学习者的分数。

source: Library Display Name
ar: اسم عرض المكتبة
ur: لائبریری ڈسپلے کا نام
zh_cn: 图书馆显示名称

source: The course key for the course we would like to be auto-cohorted.
ar: مفتاح الدورة التدريبية للدورة التدريبية التي نرغب في أن تكون مشتركًا فيها.
ur: کورس کے لئے کورس کی کلید ہم خود کار طریقے سے بننا چاہتے ہیں.
zh_cn: 该课程的课程关键我们希望自动进行。

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
ar: أدخل النص الذي تريد استخدامه كإطار زمني للبدء المعلن للدورة ، مثل &quot;Winter 2018&quot;. إذا قمت بإدخال قيمة خالية لهذه القيمة ، فسيتم استخدام تاريخ البدء الذي قمت بتعيينه لهذه الدورة التدريبية.
ur: وہ متن درج کریں جو آپ کورس کے لئے مشترکہ شروع ہونے والے فریم کے طور پر استعمال کرنا چاہتے ہیں، جیسے &quot;سرمائی 2018&quot;. اگر آپ اس قیمت کے لئے نچلے درجے میں داخل ہوتے ہیں تو، اس کورس کے لئے آپ نے شروع کی تاریخ شروع کی ہے.
zh_cn: 输入您想要用作课程广告的开始时间段的文本，例如“冬季2018”。如果您为此值输入null，则使用您为此课程设置的开始日期。

source: Send an email to {email}
ar: إرسال بريد إلكتروني إلى {email}
ur: ای میل بھیجیں {ای میل}
zh_cn: 发送电子邮件至{email}

source: Access documentation on http://docs.edx.org
ar: وثائق الوصول على http://docs.edx.org
ur: http://docs.edx.org پر رسائی دستاویزات
zh_cn: 访问http://docs.edx.org上的文档

source: Language not provided
ar: اللغة غير متوفرة
ur: زبان فراہم نہیں کی گئی
zh_cn: 未提供语言

source: The contact address of your company.
ar: عنوان الاتصال لشركتك.
ur: آپ کی کمپنی کا رابطہ پتہ.
zh_cn: 您公司的联系地址。

source: Manual Refund
ar: استرداد يدوي
ur: دستی رقم کی واپسی
zh_cn: 手动退款

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
ar: تعمل إجراءات البريد الإلكتروني في الخلفية. تظهر حالة أي مهام نشطة - بما في ذلك مهام البريد الإلكتروني - في جدول أدناه.
ur: پس منظر میں ای میل کے اعمال چلاتے ہیں. کسی بھی فعال کاموں کی حیثیت - بشمول ای میل کاموں - ذیل میں ایک میز میں ظاہر ہوتا ہے.
zh_cn: 电子邮件操作在后台运行。任何活动任务（包括电子邮件任务）的状态均显示在下表中。

source: username or team_id must be specified.
ar: يجب تحديد اسم المستخدم أو team_id.
ur: صارف کا نام یا ٹیم_ڈ مخصوص ہونا ضروری ہے.
zh_cn: 用户名或team_id必须指定。

source: The customer matched an entry on the processors negative file.
ar: قام العميل بمطابقة إدخال في الملف السلبي للمعالجات.
ur: کسٹمر نے پروسیسروں کو منفی فائل پر ایک داخلہ ملائی.
zh_cn: 客户匹配处理器负面文件中的条目。

source: The requested transaction amount must match the previous transaction amount.
ar: يجب أن يتطابق مبلغ المعاملة المطلوب مع مبلغ المعاملة السابق.
ur: درخواست شدہ ٹرانزیکشن کی رقم کو پچھلے ٹرانزیکشن کی رقم سے نمٹنے کے لئے ضروری ہے.
zh_cn: 请求的交易金额必须与先前的交易金额相匹配。

source: Search notes for...
ar: ملاحظات البحث عن ...
ur: کے لئے نوٹ تلاش کریں ...
zh_cn: 搜索笔记...

source: You cannot create two cohorts with the same name
ar: لا يمكنك إنشاء مجموعتين نموذجيتين بنفس الاسم
ur: آپ کو ایک ہی نام کے ساتھ دو مل کر بنا نہیں سکتے
zh_cn: 您不能创建两个具有相同名称的同龄人

source: Select one or more groups:
ar: حدد واحدة أو أكثر من المجموعات:
ur: ایک یا زیادہ گروپ منتخب کریں:
zh_cn: 选择一个或多个组：

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
ar: إذا تم تمكين هذا الخيار ، فسيتم توجيه المستخدمين الذين يزورون عنوان URL &quot;تلميح TPA&quot; لهذا الموفر (على سبيل المثال ، عنوان URL ينتهي بـ `؟ tpa_hint = [provider_name]`) مباشرةً إلى عنوان URL الخاص بتسجيل الدخول الخاص بالموفر بدلاً من المطالبة أولاً مربع حوار تسجيل الدخول.
ur: اگر یہ اختیار فعال ہے تو، صارفین کو اس فراہم کنندہ کے لئے &quot;TPA اشارہ&quot; URL ملاحظہ کیا جاتا ہے (مثال کے طور پر `tpa_hint = [provider_name]`) کے ساتھ ختم ہونے والے یو آر ایل کو براہ راست پہلے فراہم کرنے والے کے لاگ ان یو آر ایل میں بھیج دیا جائے گا. لاگ ان ڈائیلاگ
zh_cn: 如果启用此选项，那么访问此提供商的“TPA提示”URL的用户（例如，以？？tpa_hint = [provider_name]）结尾的URL）将直接转发到提供商的登录URL，而不是首先提示一个登录对话框。

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
ar: للحصول على إحصاءات حول التحاق الطلاب بالمشاركة والمشاركة {link_start} ، تفضل بزيارة {analytics_dashboard_name} ، منتج التحليلات الدراسي الجديد {link_end}.
ur: طالب علم داخلہ اور شرکت {link_start} پر جائیں {تجزیات_ ڈیش بورڈ_ نام}، ہمارے نئے کورس کے تجزیاتی مصنوعات {link_end}.
zh_cn: 要深入了解学生注册和参与情况{link_start}，请访问我们的新课程分析产品{link_end} {analytics_dashboard_name}。

source: I agree to the {link_start}Terms of Service{link_end}
ar: أوافق على {link_start} بنود الخدمة {link_end}
ur: میں {link_start} سروس کی شرائط {link_end} سے متفق ہوں
zh_cn: 我同意{link_start}服务条款{link_end}

source: Cannot connect to the queue
ar: لا يمكن الاتصال بقائمة الانتظار
ur: قطار سے منسلک نہیں ہوسکتا
zh_cn: 无法连接到队列

source: AM
ar: صباحا
zh_cn: 上午

source: PM
ar: مساء
zh_cn: 下午

source: LTI ID
ar: معرف LTI

source: Google+
ar: في + Google
zh_cn: Google+的

source: Tumblr
ar: نعرفكم

source: Reddit
ar: رديت
zh_cn: 书签交易

source: Constants
ar: الثوابت
zh_cn: 常量

source: display_name
ar: اسم العرض
zh_cn: 显示名称

source: INVOICE
ar: فاتورة
zh_cn: 发票

source: {course_name}
ar: {اسم الدورة التدريبية}
zh_cn: {课程名}

source: TOTAL:
ar: مجموع:
zh_cn: 总：

source: Slug
ar: سبيكة
zh_cn: 金属块

source: {profile_name} URL
zh_cn: {profile_name}网址

source: Usermenu
zh_cn: userMenu的

source: URL:
zh_cn: 网址：
