Repository: amir-qayyum-khan/django_po_translator
Catalog: dest/*/LC_MESSAGES/django.po
Languages: ar, ur, zh_cn

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: المصطلح الذي سيتم فيه تشغيل الدورة التدريبية الخاصة بك. {strong_start} ملاحظة: هذا جزء من عنوان URL للدورة التدريبية ، لذلك لا يُسمح باستخدام أي مسافات أو أحرف خاصة ولا يمكن تغييره. {strong_end}
ur: جس اصطلاح میں آپ کا کورس چل جائے گا. {strong_start} نوٹ: یہ آپ کے کورس کے یو آر ایل کا حصہ ہے، لہذا کوئی جگہ یا خاص حروف کی اجازت نہیں ہے اور اسے تبدیل نہیں کیا جا سکتا. {strong_end}
zh_cn: 您的课程将运行的期限。 {strong_start}注意：这是您的课程网址的一部分，因此不允许使用空格或特殊字符，并且无法更改。{strong_end}

source: Unexpected account status
ar: حالة غير متوقعة للحساب
ur: غیر متوقع اکاؤنٹ کی حیثیت
zh_cn: 意外的帐户状态

source: If this option is selected, users will be directed to the registration page immediately after authenticating with the third party instead of the login page.
ar: إذا تم تحديد هذا الخيار ، فسيتم توجيه المستخدمين إلى صفحة التسجيل مباشرة بعد المصادقة مع الجهة الخارجية بدلاً من صفحة تسجيل الدخول.
ur: اگر یہ اختیار منتخب کیا جاتا ہے تو، صارف لاگ ان کے بجائے تیسرے فریق کے بجائے مستند ہونے کے بعد فوری طور پر رجسٹریشن پیج پر ہدایت کی جائے گی.
zh_cn: 如果选择此选项，用户将在与第三方进行身份验证后立即转到注册页面，而不是登录页面。

source: Example Certificates
ar: شهادات سبيل المثال
ur: مثال کے طور پر سرٹیفکیٹ
zh_cn: 示例证书

source: Error in evaluating SchematicResponse. The error was: {error_msg}
ar: خطأ في تقييم SchematicResponse. كان الخطأ: {error_msg}
ur: SchematicResponse کا اندازہ کرنے میں خرابی. غلطی تھی: {error_msg}
zh_cn: 评估SchematicResponse时出错。错误是：{error_msg}

source: Inherit permissions
ar: وراثة الأذونات
ur: ابتدائی اجازت
zh_cn: 继承权限

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
ar: هذه فقط المحتويات الأولية لمقالتك. بعد إنشائه ، يمكنك استخدام ميزات أكثر تعقيدًا مثل إضافة مكونات إضافية وبيانات وصفية ومقالات ذات صلة وما إلى ذلك ...
ur: یہ صرف آپ کے مضمون کی ابتدائی مواد ہے. اس کے بعد، آپ پلگ ان، میٹا ڈیٹا، متعلقہ مضامین وغیرہ وغیرہ جیسے مزید پیچیدہ خصوصیات استعمال کرسکتے ہیں.
zh_cn: 这只是您文章的初始内容。创建后，您可以使用更复杂的功能，如添加插件，元数据，相关文章等...

source: Account Navigation
ar: التنقل في الحساب
ur: اکاؤنٹ نیویگیشن
zh_cn: 帐户导航

source: Django template HTML.
ar: دجانجو قالب HTML.
ur: Django ٹیمپلیٹ ایچ ٹی ایم ایل.
zh_cn: Django模板HTML。

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
ar: اختياري: بعد هذا التاريخ / الوقت ، لن يتمكن المستخدمون من التسجيل في هذا الوضع. اترك هذا الحقل فارغًا إذا كان يمكن للمستخدمين التسجيل في هذا الوضع حتى يتم إغلاق التسجيل للدورة التدريبية.
ur: اختیاری: اس تاریخ / وقت کے بعد، صارف اس موڈ میں اندراج کرنے کے قابل نہیں ہوں گے. اگر یہ ایرر برقرار رہے تو ہمارے ہیلپ ڈیسک سے رابطہ کریں. غلط استعمال رپورٹ نہیں کیا جا سکا. ایک یا زیادہ ایرر آ گئے ہیں. براہ مہربانی ایرر پیغام سے نشان زدہ فیلڈز کو ٹھیک کریں.
zh_cn: 可选：在此日期/时间之后，用户将不能再注册此模式。如果用户可以注册此模式，则请留空，直到课程的注册结束。

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
ar: خطأ في مواصفات المشكلة! لا يمكن تحليل المستطيل في {sr_coords}
ur: مسئلہ کی وضاحت میں خرابی! {sr_coords} میں آئتاکار کو پار نہیں کر سکتا
zh_cn: 问题说明错误！无法分析{sr_coords}中的矩形

source: Verification Deadline
ar: الموعد النهائي للتحقق
ur: توثیق آخری وقت
zh_cn: 验证截止日期

source: Thank You!
ar: شكرا!
ur: آپ کا شکریہ!
zh_cn: 谢谢！

source: Source code for LaTeX documents. This feature is not well-supported.
ar: شفرة المصدر لوثائق LaTeX. هذه الميزة غير مدعومة بشكل جيد.
ur: لاٹیکس دستاویزات کے لئے ماخذ کوڈ. یہ خصوصیت اچھی سہولت نہیں ہے.
zh_cn: LaTeX文档的源代码。这个功能没有得到很好的支持。

source: Course Short Description
ar: وصف مختصر الدورة
ur: کورس مختصر تفصیل
zh_cn: 课程简短说明

source: You are not enrolled in any courses yet.
ar: أنت غير مسجل في أي دورات حتى الآن.
ur: آپ ابھی تک کسی بھی کورس میں داخل نہیں ہوئے ہیں.
zh_cn: 你还没有参加任何课程。

source: Donation for {platform_name}
ar: التبرع لـ {platform_name}
ur: {platform_name} کے لئے عطیہ
zh_cn: 捐赠{platform_name}

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
ar: يرجى الانتظار بضع ثوانٍ ثم إعادة تحميل الصفحة. إذا استمرت المشكلة ، فيُرجى مراسلتنا عبر البريد الإلكتروني على {email}.
ur: براہ کرم کچھ سیکنڈ انتظار کرو اور پھر صفحہ دوبارہ لوڈ کریں. اگر مسئلہ جاری ہے تو، براہ مہربانی ہمیں {ای میل} پر ای میل کریں.
zh_cn: 请等待几秒钟，然后重新加载页面。如果问题仍然存在，请发送电子邮件至{email}。

source: Discount Percentage
ar: نسبة الخصم
ur: ڈسکاؤنٹ فی صد
zh_cn: 折扣百分比

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
ar: لتعطيل XBlock ومنع التقديم في LMS ، اترك &quot;ممكّن&quot; غير محدد ؛ من أجل الوضوح ، قم بتحديث حالة دعم XBlockStudioConfiguration وفقًا لذلك.
ur: XBlock کو غیر فعال کرنے اور LMS میں رینجرز کو روکنے کے لئے، &quot;فعال&quot; چالو چھوڑ دیں؛ وضاحت کے لۓ، XBlockStudioConfiguration کی حمایت ریاست کے مطابق اپ ڈیٹ کریں.
zh_cn: 要禁用XBlock并防止在LMS中渲染，请取消选择“已启用”;为了清楚起见，请相应地更新XBlockStudioConfiguration支持状态。

source: Review
ar: إعادة النظر
ur: جائزہ لیں
zh_cn: 评论

source: Invalid Library
ar: مكتبة غير صالحة
ur: غلط لائبریری
zh_cn: 无效的库

source: Email someone to say you've enrolled in this course
ar: أرسل شخصًا ما ليقول أنك قمت بالتسجيل في هذه الدورة التدريبية
ur: کسی ایسے شخص کو ای میل کریں جو آپ نے اس کورس میں داخلہ دی ہے
zh_cn: 给某人发邮件说你已经参加了这门课程

source: The email address you used to register with {platform_name}
ar: عنوان البريد الإلكتروني الذي استخدمته للتسجيل في {platform_name}
ur: آپ {{platform_name} کے ساتھ رجسٹر کرنے کے لئے استعمال کردہ ای میل ایڈریس
zh_cn: 您用来向{platform_name}注册的电子邮件地址

source: Current Verification Status: Approved
ar: حالة التحقق الحالية: مقبول
ur: موجودہ توثیق کی حیثیت: منظور شدہ
zh_cn: 当前验证状态：已批准

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
ar: كشط أو تقنيات مشابهة لتجميع أو إنشاء نسخ دائمة من محتوى واجهة برمجة التطبيقات ؛
ur: سکریپنگ یا اسی طرح کی تراکیب کو مجموعی طور پر یا دوسری صورت میں API کے مواد کی مستقل کاپیاں بنائیں؛
zh_cn: 刮取或类似技术来聚合或以其他方式创建API内容的永久副本;

source: Whether this student has voted on the poll
ar: ما إذا كان هذا الطالب قد صوت على الاستطلاع
ur: چاہے اس طالب علم نے سروے پر ووٹ دیا ہے
zh_cn: 这位学生是否投票投票

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
ar: لا يمكن تلقي نسخ من Youtube على {youtube_id}. رمز الحالة: {status_code}.
ur: {youtube_id} کیلئے یو ٹیوب سے ٹرانسمیشن نہیں مل سکی. حیثیت کا کوڈ: {status_code}.
zh_cn: {youtube_id}无法从Youtube收到成绩单。状态码：{status_code}。

source: owner
ar: صاحب
ur: مالک
zh_cn: 所有者

source: You may not remove the last Admin. Add another Admin first.
ar: لا يجوز لك إزالة المشرف الأخير. أضف مسؤولاً آخر أولاً.
ur: آپ آخری منتظم نہیں ہٹ سکتے ہیں. پہلے ایک اور ایڈمن شامل کریں.
zh_cn: 您不能删除最后一个管理员。先添加另一个管理员。

source: An unexpected error occurred while regenerating certificates.
ar: حدث خطأ غير متوقع أثناء إعادة إنشاء الشهادات.
ur: سرٹیفکیٹ کی تخلیق کرنے کے دوران ایک غیر متوقع غلطی واقع ہوئی.
zh_cn: 重新生成证书时发生意外错误。

source: Add a Post
ar: إضافة وظيفة
ur: ایک پوسٹ شامل کریں
zh_cn: 添加帖子

source: Careers
ar: وظائف
ur: کیریئرز
zh_cn: 招聘

source: What if my book isn't divided into chapters?
ar: ماذا لو لم يتم تقسيم كتابي إلى فصول؟
ur: کیا ہوگا اگر میری کتاب بابوں میں تقسیم نہ ہو؟
zh_cn: 如果我的书没有分成几章呢？

source: Add expiration date
ar: إضافة تاريخ انتهاء الصلاحية
ur: ختم ہونے کی تاریخ شامل کریں
zh_cn: 添加到期日期

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
ar: إذا تم تمكين المجموعات الخاصة بك في الدورة التدريبية الخاصة بك ، فيمكنك استخدام مجموعات المحتوى لإنشاء مناهج دراسية خاصة بالمجموعات النموذجية. بمعنى آخر ، يمكنك تخصيص المحتوى الذي تراه الأفواج في الدورة التدريبية الخاصة بك.
ur: اگر آپ کے کورس میں آپ کو سہولت ملتی ہے تو، آپ کو مواد مخصوص گروہوں کو کوسٹ مخصوص مخصوص بنانے کے لئے استعمال کرسکتے ہیں. دوسرے الفاظ میں، آپ ان مواد کو اپنی مرضی کے مطابق کرسکتے ہیں جو آپ کے کورس میں دیکھتے ہیں.
zh_cn: 如果您在课程中启用了群组，则可以使用内容组创建群组特定的课件。换句话说，您可以自定义特定群组在课程中看到的内容。

source: Already have a {studio_name} Account? Sign In
ar: هل لديك بالفعل حساب في {studio_name}؟ تسجيل الدخول
ur: پہلے سے ہی {studio_name} اکاؤنٹ ہے؟ داخلہ
zh_cn: 已经有{studio_name}帐户？签到

source: Preference '{preference_key}' cannot be set to an empty value.
ar: لا يمكن تعيين التفضيل &quot;{preference_key}&quot; على قيمة فارغة.
ur: ترجیح &#39;{ترجیح_key}&#39; خالی قیمت پر سیٹ نہیں کیا جا سکتا.
zh_cn: 首选项“{preference_key}”不能设置为空值。

source: Course Import
ar: استيراد بالطبع
ur: کورس درآمد
zh_cn: 课程导入

source: Company Contact Name:
ar: اسم جهة اتصال الشركة:
ur: کمپنی سے رابطہ کا نام:
zh_cn: 公司联系人姓名：

source: Benefits of a Verified Certificate
ar: فوائد شهادة التحقق
ur: ایک تصدیق شدہ سرٹیفکیٹ کے فوائد
zh_cn: 验证证书的好处

source: You're about to activate an enrollment code for {course_name} by {site_name}. This code can only be used one time, so you should only activate this code if you're its intended recipient.
ar: أنت على وشك تنشيط رمز التسجيل لـ {course_name} بواسطة {site_name}. لا يمكن استخدام هذا الرمز إلا مرة واحدة ، لذلك يجب عليك تنشيط هذا الرمز فقط إذا كنت من المتلقين المقصودين.
ur: آپ {کورس_ نام} کے ذریعہ {site_name} کے لئے داخلہ کوڈ کو فعال کرنے کے بارے میں ہیں. یہ کوڈ صرف ایک بار استعمال کیا جاسکتا ہے، لہذا آپ کو صرف اس کوڈ کو چالو کرنا چاہئے اگر آپ اس کا مطلوب وصول کنندہ ہیں.
zh_cn: 您即将通过{site_name}激活{course_name}的注册码。此代码只能使用一次，因此如果您是其预期收件人，则只应激活此代码。

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: اسم فئة للمناقشة. يظهر هذا الاسم في الجزء الأيمن من منتدى المناقشة للدورة التدريبية.
ur: بحث کے لئے ایک قسم کا نام. یہ نام کورس کے بحث کے فورم کے بائیں جانب میں ظاہر ہوتا ہے.
zh_cn: 讨论的类别名称。此名称显示在课程讨论论坛的左侧窗格中。

source: Affixes
ar: اللاحقات
ur: افریقی
zh_cn: 词缀

source: Course Name:
ar: اسم الدورة التدريبية:
ur: کورس کا نام:
zh_cn: 课程名：

source: CertificateItem Status:
ar: حالة CertificateItem:
ur: سرٹیفکیٹ کی حیثیت:
zh_cn: CertificateItem状态：

source: Accessibility Policy
ar: سياسة الوصول
ur: رسائی کی پالیسی
zh_cn: 无障碍政策

source: There are 2 steps to getting course credit.
ar: هناك خطوتان للحصول على رصيد الدورة الدراسية.
ur: کورس کریڈٹ حاصل کرنے کے لئے 2 اقدامات ہیں.
zh_cn: 有2个步骤获得课程学分。

source: Terms of Service and Honor Code
ar: شروط الخدمة و قانون الشرف
ur: سروس کی شرائط اور اعزاز کوڈ
zh_cn: 服务条款和荣誉代码

source: Congratulations! You are now eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ar: تهانينا! أنت الآن مؤهل لتلقي رصيد الدورة التدريبية لإكمال دورة {platform_name} بنجاح! {link_start} شراء رصيد الآن. {link_end}
ur: مبارک ہو! آپ اب اپنے {platform_name} کورس کو مکمل طور پر مکمل کرنے کیلئے کریڈٹ کریڈٹ حاصل کرنے کے اہل ہیں! {link_start} ابھی کریڈٹ خریدیں. {link_end}
zh_cn: 恭喜！您现在有资格获得成功完成{platform_name}课程的课程学分！ {link_start}立即购买功劳。{link_end}

source: Remember when you enrolled in %(course_name)s on edX.org? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر عندما قمت بالتسجيل في٪ (course_name) s على edX.org؟ نحن نفعل ، ونحن سعداء بك! تعال وانظر ماذا يتعلم الجميع.
ur: یاد رکھیں جب آپ٪ (course_name) s edX.org پر اندراج کرتے ہیں تو؟ ہم کرتے ہیں، اور ہم آپ کو خوش کرنے کے لئے خوش ہیں! آو دیکھیں کہ سب کچھ سیکھ رہا ہے.
zh_cn: 还记得你在edX.org上注册％（course_name）吗？我们这样做，我们很高兴有你！来看看每个人都在学习什么。

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, suit or action.
ar: إلى الحد الأقصى المسموح به بموجب القانون المعمول به ، فإنك توافق على الدفاع عن {platform_name} والمشاركين {platform_name} ، والشركات التابعة لها ، والمسؤولين ، وأعضاء هيئة التدريس ، والطلاب ، والزملاء ، وأعضاء مجلس الإدارة ، والوكلاء والموظفين ، وتعويضهم وتعويضهم. من أو ضد أي مطالبات أو إجراءات أو مطالب خارجية ناشئة عن ، أو ناتجة عن أو بأي شكل من الأشكال عن استخدامك لواجهة برمجة التطبيقات وأي محتوى من واجهات برمجة التطبيقات ، بما في ذلك أي مسؤولية أو مصروفات ناشئة عن أي وجميع المطالبات والخسائر والأضرار ( الفعلية واللاحقة) ، الدعاوى القضائية ، الأحكام ، تكاليف التقاضي وأتعاب المحاماة ، من كل نوع وطبيعتها. في هذه الحالة ، سيقدم لك {platform_name} أو واحد من {platform_name} المشاركون إشعارًا كتابيًا بمثل هذه المطالبة أو الدعوى أو الإجراء.
ur: قابل اطلاق قانون کی اجازت سے زیادہ حد تک، آپ کو دفاعی، معاوضہ اور معاوضہ {platform_name} اور {platform_name} شرکاء، اور ان کے متعلقہ ماتحت اداروں، ملحقہ، افسران، فیکلٹی، طالب علموں، ساتھیوں، انتظامیہ کے بورڈ کے ارکان، ایجنٹوں اور ملازمین کو منعقد کریں. کسی بھی تیسرے فریق کے دعوے سے اور کسی بھی اور تمام دعوے، نقصانات، نقصانات سے پیدا ہونے والے کسی بھی ذمہ داری یا اخراجات سمیت، اس کے نتیجے میں یا APIs اور کسی بھی API کے مواد کے استعمال سے متعلق کسی بھی طرح کے اقدامات یا مطالبات پیدا ہوتے ہیں. اصل اور نتیجے میں)، سوٹ، فیصلے، مقدمے کی سماعت کے اخراجات اور وکلاء کی فیس، ہر نوع اور فطرت کی. ایسی صورت میں، {platform_name} یا {platform_name} میں سے ایک حصہ لینے والے آپ کو ایسے دعوی، سوٹ یا کارروائی کے تحریری نوٹس فراہم کرے گا.
zh_cn: 在适用法律允许的最大范围内，您同意捍卫{platform_name}和{platform_name}参与者及其各自的子公司，附属机构，官员，教师，学生，研究员，理事会成员，代理和员工反对任何由您使用API​​和任何API内容引起或与之相关的任何第三方索赔，行动或要求，包括由于任何和所有索赔，损失，损害而引起的任何责任或费用（实际和相应的），诉讼，判决，诉讼费用和律师费，各种性质和性质。在这种情况下，{platform_name}或{platform_name}参与者之一将向您提供此类索赔，诉讼或行为的书面通知。

source: Invite your students
ar: ادع طلابك
ur: اپنے طلباء کو مدعو کریں
zh_cn: 邀请你的学生

source: EdX, Open edX, Studio, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
ar: تعد EdX و Open edX و Studio وشعارات edX و Open EDX علامات تجارية أو علامات تجارية مسجلة لشركة {link_start} edX Inc. {link_end}
ur: ایڈ ایکس، اوپن EDX، سٹوڈیو، اور edX اور اوپن edX لوگوز {link_start} edX انکارپوریٹڈ {link_end} کے رجسٹرڈ ٹریڈ مارک یا ٹریڈ مارک ہیں.
zh_cn: EdX，Open edX，Studio以及edX和Open edX徽标是{link_start} edX Inc. {link_end}的注册商标或商标。

source: Play video
ar: شغل الفيديو
ur: ویڈیو کھیلیں
zh_cn: 播放视频

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
ar: نص عادي أو محتوى html لعرض مزيد من الخطوات في صفحة الإيصال * بعد * الدفع للحصول على الائتمان للحصول على الائتمان لدورة الائتمان مقابل مقدم الائتمان.
ur: کریڈٹ فراہم کرنے والے کے خلاف ایک کریڈٹ کورس کے لئے کریڈٹ حاصل کرنے کے لئے کریڈٹ کے لئے ادائیگی کے بعد * رسید کے صفحے پر مزید مراحل ظاہر کرنے کے لئے سادہ متن یا HTML مواد.
zh_cn: 纯文本或html内容，用于在收到信用证之后在收据页上显示进一步的步骤*以获得信贷提供商的信用课程的学分。

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
ar: <p style=";text-align:right;direction:rtl"> بإخلاص، </p><p style=";text-align:right;direction:rtl"> [[توقيعك]] </p>
ur: <p style=";text-align:right;direction:rtl"> مخلص، </p><p style=";text-align:right;direction:rtl"> [[آپ کے دستخط]] </p>
zh_cn: <p>此致</p><p> [[你的签名]] </p>

source: edX Partner Portal
ar: بوابة شريك EDX
ur: edX پارٹنر پورٹل
zh_cn: edX合作伙伴门户

source: Currently the {platform_name} servers are down
ar: في الوقت الحالي ، أصبحت الخوادم {platform_name} معطلة
ur: فی الحال {platform_name} سرورز نیچے ہیں
zh_cn: 目前{platform_name}服务器已关闭

source: Set the pacing for this course
ar: ضبط السرعة لهذه الدورة
ur: اس کورس کے لئے پینٹنگ مقرر کریں
zh_cn: 设置此课程的步调

source: Change Preferred Language
ar: تغيير اللغة المفضلة
ur: پسندیدہ زبان کو تبدیل کریں
zh_cn: 更改首选语言

source: Enter equation
ar: أدخل المعادلة
ur: مساوات درج کریں
zh_cn: 输入方程式

source: Is Entrance Exam
ar: هو امتحان القبول
ur: داخلہ امتحان ہے
zh_cn: 入学考试

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data!We apologize that we cannot verify whether the charge went through and take further action on your order.The specific error message is: {error_message}. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: آسف! أرسل لنا معالج الدفع رسالة تأكيد الدفع التي كانت تحتوي على بيانات غير متناسقة! نعتذر لعدم تمكننا من التحقق من ما إذا كان قد تم تحصيل الرسوم واتخاذ إجراءات أخرى بشأن طلبك. رسالة الخطأ المحددة هي: {error_message}. ربما تم تحصيل رسوم من بطاقتك الائتمانية. اتصل بنا للحصول على أسئلة خاصة بالدفع في {email}.
ur: معاف کریں! ہمارا ادائیگی پروسیسر ہمیں ایک ادائیگی کی توثیق واپس بھیجتا ہے جس میں متعدد اعداد و شمار تھے! ہم معافی دیتے ہیں کہ ہم اس بات کی تصدیق نہیں کرسکتے ہیں کہ آیا آپ کو چارج جاری ہے اور آپ کے حکم پر مزید کارروائی کریں. مخصوص غلطی کا پیغام ہے: {error_message}. ممکنہ طور پر آپ کا کریڈٹ کارڈ چارج کیا جاسکتا ہے. {ای میل} پر ادائیگی کے مخصوص سوالات سے رابطہ کریں.
zh_cn: 抱歉!我们的付款处理员向我们发回了一份有不一致数据的付款确认信息！很抱歉，我们无法验证收费是否已通过并对您的订单采取进一步措施。具体的错误消息是：{error_message}。您的信用卡可能已经收费。请通过{email}与我们联系并提供特定付款问题。

source: No profile found for user
ar: لم يتم العثور على ملف تعريف للمستخدم
ur: صارف کیلئے کوئی پروفائل نہیں ملی
zh_cn: 没有找到用户的配置文件

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
ar: يحدد متى يتم اختيار المتغيرات المحددة في نص Python النصي. بالنسبة للمشكلات التي لا تعشش القيم ، حدد &quot;أبدًا&quot;.
ur: جب متعین پائیڈ اسکرپٹ میں بیان کردہ متغیرات کو بے ترتیب کرنے کی وضاحت کرتا ہے. مشکلات کے لۓ اقدار کو بے ترتیب نہیں کرتے، &quot;کبھی نہیں&quot; کی وضاحت کریں.
zh_cn: 定义何时随机化相关Python脚本中指定的变量。对于不随机化值的问题，请指定“从不”。

source: You can proceed to payment at any point in time. Any additional information you provide will be included in your receipt.
ar: يمكنك متابعة الدفع في أي وقت. سيتم تضمين أي معلومات إضافية تقدمها في إيصالك.
ur: آپ کسی بھی وقت ادائیگی پر آگے بڑھ سکتے ہیں. آپ کی فراہم کردہ کسی بھی اضافی معلومات کو آپ کی رسید میں شامل کیا جائے گا.
zh_cn: 您可以随时继续付款。您提供的任何附加信息都将包含在收据中。

source: Download Transcript Allowed
ar: تنزيل نسخة مسموح بها
ur: ٹرانکرپٹ اجازت دیں ڈاؤن لوڈ کریں
zh_cn: 允许下载抄本

source: To add files to use in your course, click {em_start}Upload New File{em_end}. Then follow the prompts to upload a file from your computer.
ar: لإضافة ملفات لاستخدامها في الدورة التدريبية الخاصة بك ، انقر فوق {em_start} تحميل ملف جديد {em_end}. ثم اتبع المطالبات لتحميل ملف من جهاز الكمبيوتر الخاص بك.
ur: اپنے کورس میں استعمال کرنے کیلئے فائلیں شامل کرنے کیلئے، {em_start} نئی فائل اپ لوڈ کریں {em_end} پر کلک کریں. اس کے بعد آپ کے کمپیوٹر سے ایک فائل اپ لوڈ کرنے کیلئے اشارے پر عمل کریں.
zh_cn: 要添加要在课程中使用的文件，请点击{em_start}上传新文件{em_end}。然后按照提示从计算机上传文件。

source: %(comment_username)s replied to <b>%(thread_title)s</b>:
ar: ٪ (comment_username) s رد على <b>٪ (thread_title) s</b> :
ur: ٪ (comment_username) نے جواب دیا <b>٪ (thread_title) s</b> :
zh_cn: ％（comment_username）回复<b>％（thread_title）s</b> ：

source: Please log in
ar: الرجاء تسجيل الدخول
ur: برائے مہربانی لاگ ان کریں
zh_cn: 请登录

source: Please visit your {link_start}dashboard{link_end} to see your new course.
ar: يرجى زيارة {link_start} لوحة المعلومات {link_end} للاطلاع على الدورة التدريبية الجديدة.
ur: اپنے نئے کورس کو دیکھنے کے لئے براہ کرم اپنے {link_start} ڈیش بورڈ {link_end} پر جائیں.
zh_cn: 请访问您的{link_start}信息中心{link_end}，查看您的新课程。

source: The file must be smaller than {image_max_size} in size.
ar: يجب أن يكون حجم الملف أصغر من الحجم {image_max_size}.
ur: فائل میں {image_max_size} کے سائز سے چھوٹا ہونا ضروری ہے.
zh_cn: 该文件的大小必须小于{image_max_size}。

source: submitted
ar: قدمت
ur: پیش کی گئی
zh_cn: 提交

source: Helpful Information
ar: معلومات مفيدة
ur: مددگار معلومات
zh_cn: 有用的信息

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
ar: لم نتمكن من التحقق من هويتك من أجل تقييم {assessment} في الدورة التدريبية {course_name}. لقد استخدمت {used_attempts} من {allowed_attempts} محاولات التحقق من هويتك.
ur: ہم {course_name} کورس میں {تشخیص} تشخیص کے لئے آپ کی شناخت کی توثیق نہیں کر سکے. آپ نے اپنی شناخت کی توثیق کرنے کے لئے {allowed_attempts} کی کوششوں میں سے {استعمال شدہ نام} استعمال کیا ہے.
zh_cn: 我们无法验证您在{course_name}课程中的{assessment}评估的身份。您尝试使用{used_attempts} {allowed_attempts}来验证您的身份。

source: This email was automatically sent from {site_name} to {email_address}
ar: تم إرسال هذا البريد الإلكتروني تلقائيًا من {site_name} إلى {email_address}
ur: یہ ای میل خود بخود {site_name} سے {email_address} پر بھیجا گیا تھا.
zh_cn: 此电子邮件已自{site_name}自动发送至{email_address}

source: Article locked for editing
ar: مقفل مقفل للتحرير
ur: ترمیم کے لئے آرٹیکل بند کر دیا گیا
zh_cn: 文章被锁定进行编辑

source: "{course_title}" Course Staff
ar: &quot;{course_title}&quot; دورة الموظفين
ur: &quot;کورس&quot; عنوان &quot;کورس اسٹاف
zh_cn: “{course_title}”课程人员

source: Number of Enrollments
ar: عدد التسجيلات
ur: اندراج کی تعداد
zh_cn: 注册人数

source: Allow Skip
ar: السماح بالتخطي
ur: چھوڑ دیں
zh_cn: 允许跳过

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم المنظمة الراعية للدورة. {strong_start} ملاحظة: اسم المؤسسة جزء من عنوان URL للدورة التدريبية. {strong_end} لا يمكن تغيير هذا ، ولكن يمكنك تعيين اسم عرض مختلف في &quot;الإعدادات المتقدمة&quot; لاحقًا.
ur: تنظیم کا نام کورس اسپانسر. {strong_start} نوٹ: تنظیم کا نام کورس URL کا حصہ ہے. {strong_end} یہ تبدیل نہیں کیا جاسکتا، لیکن آپ بعد میں اعلی درجے کی ترتیبات میں مختلف ڈسپلے کا نام مقرر کرسکتے ہیں.
zh_cn: 赞助课程的组织的名称。 {strong_start}注意：组织名称是课程网址的一部分。{strong_end}这不能更改，但您可以稍后在“高级设置”中设置不同的显示名称。

source: No progress status information available
ar: لا تتوفر معلومات حالة التقدم
ur: کوئی پیش رفت کی حیثیت کی معلومات دستیاب نہیں ہے
zh_cn: 没有可用的进度状态信息

source: Raw data:
ar: مسودة بيانات:
ur: خام ڈیٹا:
zh_cn: 原始数据：

source: EdX, Open edX, and MicroMasters are registered trademarks of edX Inc. 粤ICP备17044299号-2.
ar: تعد EdX و Open edX و MicroMasters علامتين تجاريتين مسجلتين لشركة edX Inc. 粤 ICP 备 17044299 号 -2.
ur: ایڈی ایکس، اوپن ایڈی ایکس، اور مائکرممسٹرز EDX انکارپوریٹڈ کے رجسٹرڈ ٹریڈ مارک ہیں 粤 ICP 备 17044299 号 -2.
zh_cn: EdX，Open edX和MicroMasters是edX Inc.的注册商标。粤ICP备17044299号-2。

source: Certificate Name (Long)
ar: اسم الشهادة (طويل)
ur: سرٹیفکیٹ کا نام (لانگ)
zh_cn: 证书名称（长）

source: regenerated
ar: مجدد
ur: دوبارہ شروع
zh_cn: 再生

source: You have been un-enrolled from {course_name}
ar: لقد تم إلغاء تسجيلك من {course_name}
ur: آپ {کورس_ نام} سے غیر اندراج شدہ ہیں
zh_cn: 您已从{course_name}取消注册

source: Course Home Sidebar Name
ar: اسم الشريط الجانبي للصفحة الرئيسية
ur: کورس ہوم سائڈبار نام
zh_cn: 课程主页侧栏名称

source: Other
ar: آخر
ur: دیگر
zh_cn: 其他

source: example: New York
ar: مثال: نيويورك
ur: مثال: نیویارک
zh_cn: 例如：纽约

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
ar: كان الموعد النهائي للتحقق {course_name} هو {{date}}. التحقق لم يعد متاحًا.
ur: {course_name} کے لئے توثیق کی آخری تاریخ {{تاریخ}} تھا. توثیق اب دستیاب نہیں ہے.
zh_cn: {course_name}的验证截止日期是{{date}}。验证不再可用。
